{
    "numMessagesInTopic": 5, 
    "nextInTime": 10108, 
    "senderId": "mioynnl8CrUH0fI3RMiSEbJUapvAmY5Hr4xcJFwfSPPUg9ARcTce-bA0xYyJtg7OC1KntN3fEJb_wWUlVviIqUJHMzARCVhFtuI", 
    "systemMessage": false, 
    "subject": "Re: [junit] newbie - how to test clases persisting to DB, mock objects in .net", 
    "from": "Kevin Klinemeier &lt;zipwow@...&gt;", 
    "authorName": "Kevin Klinemeier", 
    "msgSnippet": "I ve been using the mock object approach to testing with a good amount of success.  I ve used both the SQL mock objects from http://www.mockobjecst.com, and a", 
    "msgId": 10107, 
    "rawEmail": "Return-Path: &lt;zipwow@...&gt;\r\nReceived: (qmail 21194 invoked by uid 7800); 17 Dec 2003 19:49:17 -0000\r\nX-Sender: zipwow@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 53503 invoked from network); 17 Dec 2003 19:29:19 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m3.grp.scd.yahoo.com with QMQP; 17 Dec 2003 19:29:19 -0000\r\nReceived: from unknown (HELO web60306.mail.yahoo.com) (216.109.118.117)\n  by mta2.grp.scd.yahoo.com with SMTP; 17 Dec 2003 19:29:19 -0000\r\nMessage-ID: &lt;20031217192916.9511.qmail@...&gt;\r\nReceived: from [207.14.29.3] by web60306.mail.yahoo.com via HTTP; Wed, 17 Dec 2003 11:29:16 PST\r\nDate: Wed, 17 Dec 2003 11:29:16 -0800 (PST)\r\nTo: junit@yahoogroups.com\r\nIn-Reply-To: &lt;3FDF62DA.60509@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=us-ascii\r\nX-eGroups-Remote-IP: 216.109.118.117\r\nFrom: Kevin Klinemeier &lt;zipwow@...&gt;\r\nSubject: Re: [junit] newbie - how to test clases persisting to DB, mock objects in .net\r\nX-Yahoo-Group-Post: member; u=82914509\r\nX-Yahoo-Profile: zipwow\r\nX-eGroups-Approved-By: nails762 &lt;jbrains@...&gt; via email; 17 Dec 2003 19:49:17 -0000\r\n\r\nI&#39;ve been using the mock object approach to testing with a good amount\nof success.  I&#39;ve used both the SQL mock objects from \nhttp://www.mockobjecst.com, and a mock implementation of our own\npersistence level.  \n\nThe main criticism of this approach is that you&#39;re not really testing\nwriting to the database.  Performance, configuration, db behavior, and\nselect statement correctness is not tested.  I don&#39;t think that\nconfiguration and performance are things that are appropriate for\ntesting in unit tests, so I ignore those points.  To the database\nbehavior question (aka &quot;actually writing to the database&quot;), I respond\nwith, &quot;I didn&#39;t write the database layer, I don&#39;t need to test it.&quot;  It\nis true that you can have unresolved bugs with problems in your SQL\nstatement (or QBE examples, in my case).  That&#39;s an admitted weakness,\nand not a small one.  If there are suggestions on that front, they&#39;re\nwelcome (see below).\n\n\nJust to clarify, (almost) all my tests run without actually accessing\nthe database.  I think this approach has these key advantages:\n\n1:  Test independence - I don&#39;t have to worry about stepping on other\ndevelopers.  (If my non-mock test creates a value, then deletes it,\nwhat happens if someone else&#39;s test it re-creates it after I&#39;ve deleted\nit, but before I&#39;ve checked for it being missing?  Trouble and\nconfusion).\n\n2:  Test speed - This sounds minor, but its a bigger deal than you\nmight think.  No database startup or connection times makes for much\nfaster execution of unit tests.  This makes me much more likely to add\na unit test, or to run old ones.\n\n3:  Test failure cases - This is a big one.  The mock object approach\ncan test the way your code behaves when the database fails.  I can have\nmy mock object accept the Person query, but when it asks for Salary, it\nthrows an exception.  This can&#39;t be done with the database-connected\napproach.\n\n4:  Test completeness - This is more true of the SQL tools, but only\nbecause they&#39;ve taken the time to write all the things I needed.  I can\ntell the SQL tools to look for the following select statements, and if\nthere is deviation, complain.  The not-so-obvious case that this caught\nfor me was multiple queries.  I had a logic problem that was causing my\ncode to ask ten times for a particular case that I only intended for it\nto ask once.\n\n4:  Test completeness - I want to say this again with another example. \nIf you have code that deletes things, you can be sure that it only\ndeletes the things you expect.  With the database-connected approach,\nyou&#39;re typically only testing that it deletes the things you expect to\nbe gone, not whether there were things that existed before that are now\nalso deleted by some side effect (like in another table you weren&#39;t\nexpecting, for example).\n\n5:  Test size unchanged - When I set out to use the mock objects, I\nexpected this to increase the size of my test code vs the\ndatabase-connected approach.  I was suprised to find that this wasn&#39;t\nthe case.  Consider the following pseudocode:\n\nsetupInitialState();\nexecuteMethodUnderTest();\nassertTrue(&quot;State not right&quot;,checkState());\ncleanupState();\n\nThis is the same type of code whether your initial state is inserting\nrecords in the database, or if it is setting up mock objects.  The only\nplace I had more code than before was in cases #3 and #4, where I was\ntesting things I was previously unable to test.\n\n-Kevin\n\n--- &quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt; wrote:\n&gt; Google &quot;Dalloway unit test database&quot; and read the article. It&#39;s a\n&gt; very \n&gt; good one.\n\nJust FYI for the original poster, its &quot;Dallaway&quot; with all a&#39;s.\n\n\n\n__________________________________\nDo you Yahoo!?\nProtect your identity with Yahoo! Mail AddressGuard\nhttp://antispam.yahoo.com/whatsnewfree\n\n", 
    "profile": "zipwow", 
    "topicId": 10094, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 82914509, 
    "prevInTime": 10106, 
    "contentTrasformed": false, 
    "postDate": "1071689356", 
    "canDelete": false, 
    "nextInTopic": 10109, 
    "prevInTopic": 10097, 
    "headers": {
        "inReplyToHeader": "PDNGREY2MkRBLjYwNTA5QHJvZ2Vycy5jb20+", 
        "messageIdInHeader": "PDIwMDMxMjE3MTkyOTE2Ljk1MTEucW1haWxAd2ViNjAzMDYubWFpbC55YWhvby5jb20+"
    }
}