{
    "numMessagesInTopic": 4, 
    "nextInTime": 10172, 
    "senderId": "27ag0tRwg96jTjLZxctDuLKaooAQzjCrxVoORa26yUodBscWHg25ZDnfP33goJHajEjC-5Fqi5Blwp6ZZ_aiAK-0", 
    "systemMessage": false, 
    "subject": "Re:Re: My First mail", 
    "from": "steffen.gemkow@...", 
    "authorName": "steffen.gemkow@objectfab.de", 
    "msgSnippet": "... As author of JUnitDoclet (the tool, Rick was kind enough to suggest) I d like offer my two cents. IMHO we should not depend on a generator to tell us how", 
    "msgId": 10171, 
    "profile": "s_gemkow", 
    "topicId": 10161, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127226929, 
    "messageBody": "<div id=\"ygrps-yiv-1679097050\"><blockquote><span title=\"ireply\">&gt;    From: Ron Jeffries &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ronjeffries@...\">ronjeffries@...</a>&gt;<br/>\n&gt; Subject: Re: My First mail<br/>\n&gt; <br/>\n&gt; &gt; 2. Can we generate the test cases automatically using JUnit. I think at least for the first time we are<br/>\n&gt; &gt; supposed to write the first set of test cases manually. I know to write the test cases manually but how<br/>\n&gt; &gt; can we generate the test cases automatically from the first set of manual ones?<br/>\n&gt; <br/>\n&gt; Please give an example of some tests that you would want to generate<br/>\n&gt; automatically and tell us what you would get if you could do that.<br/>\n <br/>\n </span></blockquote>As author of JUnitDoclet (the tool, Rick was kind enough to suggest) I&#39;d like offer my two cents.<br/>\n<br/>\nIMHO we should not depend on a generator to tell us how to test. After all, we test to understand what we are developing, right? If generating ALL the tests would be <br/>\npossible, how about generating the application in the first place?<br/>\n<br/>\nBut a generator can do things for us to make writing tests easy: it can generate a skeleton for the tests (test methods, TestCases, TestSuites) and keep it up to date as <br/>\nrefactoring is changing our application. That&#39;s what JUnitDoclet does. Writing the assert* statements (the meat) is up to us developers. We know, what the program should <br/>\ndo / or we learn just that by thinking about tests. And we should be able to extend generated test by manually written ones.<br/>\n<br/>\nWould we tests accessor methods? Probably not. But didn&#39;t we all had copy/paste/errors with accessors (like a method getFirstName returning surName)? JUnitDoclet is <br/>\nlooking for accessor pairs (with set/get/is) and is generating type depending tests for them. The developer doesn&#39;t have to do anything here, but now tests can find those <br/>\nstupid errors right away.<br/>\n<br/>\nAn example can be found here (click on step 1 to 6):<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.junitdoclet.org/demo.html\">http://www.junitdoclet.org/demo.html</a><br/>\n<br/>\n <br/>\nKind Regards,<br/>\n<br/>\nSteffen Gemkow<br/>\n--<br/>\nObjectFab GmbH<br/>\nwww.objectfab.de</div>", 
    "prevInTime": 10170, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1073659216", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 10166, 
    "headers": {
        "inReplyToHeader": "PDEwNzM2NDE5NjUuMTU2Ny43NzUzNS5tMTJAeWFob29ncm91cHMuY29tPg==", 
        "messageIdInHeader": "PDNGRkVDQjYwLjE3MTYzLkNBRUQwOEBsb2NhbGhvc3Q+"
    }
}