{
    "numMessagesInTopic": 10, 
    "nextInTime": 10239, 
    "senderId": "E7GGTOgfcVAH8awhPWZaNNQ6PpqCYIcWg5MXPo8R59PXsD9DBMakCQEvoKim_7Oemri1IIfI_JQ_fDq3wl8OoWA", 
    "systemMessage": false, 
    "subject": "the good ol&#39; what-to-test question", 
    "from": "Ben Munat &lt;bent@...&gt;", 
    "authorName": "Ben Munat", 
    "msgSnippet": "Hello; new to the list, new to junit, and still fairly new to java (have had two terms of java in college). I ve read several articles, tutorials, and faqs", 
    "msgId": 10238, 
    "profile": "djyukus", 
    "topicId": 10238, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 84011180, 
    "messageBody": "<div id=\"ygrps-yiv-1502926285\">Hello; new to the list, new to junit, and still fairly new to java (have <br/>\nhad two terms of java in college). I&#39;ve read several articles, <br/>\ntutorials, and faqs about junit, and I feel that I grasp what they&#39;re <br/>\nsaying... the examples they use make sense. But, then I turn and look at <br/>\nsome code I&#39;ve written and I don&#39;t see how to write tests for it.<br/>\n<br/>\nFor example, I&#39;m working on a system that will generate dynamic web <br/>\npages. One of my classes is called Site and it simply holds the domain <br/>\nname of the site as a string and has a HashMap to hold references to <br/>\nPage objects using the path to the page as the key. It looks like this:<br/>\n<br/>\npublic class Site {<br/>\n\tprivate String domainName;<br/>\n\tprivate HashMap pages;<br/>\n\t<br/>\n\tpublic Site(String dn){<br/>\n\t\tdomainName = dn;<br/>\n\t\tpages = new HashMap();<br/>\n\t}<br/>\n<br/>\n\tpublic String getDomainName() { return domainName; }<br/>\n<br/>\n\tpublic void setDomainName(String dn) { domainName = dn; }<br/>\n\t<br/>\n\tpublic void addPage(String path, Page p){<br/>\n\t\tpages.put(path, p);<br/>\n\t}<br/>\n\t<br/>\n\tpublic Document getPage(String path){<br/>\n\t\tPage p = (Page) pages.get(path);<br/>\n\t\treturn p.makePage();<br/>\n\t}<br/>\n}<br/>\n<br/>\n(the &quot;Document&quot; returned by getPage is an XML document that will be <br/>\nprinted to the servlet&#39;s output stream)<br/>\n<br/>\nSo, does this class need a junit test? It seems pretty straight <br/>\nforward... I&#39;ve actually written a simple test program that makes a Site <br/>\nobject and a Page object with some simple xhtml, puts the reference to <br/>\nthe Page object into the Site object&#39;s HashMap and then invoke&#39;s the <br/>\ngetPage method and prints the results to the console. It all works fine.<br/>\n<br/>\nShould I redo this test program in junit? And what would I assert? That <br/>\nthe Page object in Site&#39;s HashMap is the same one I put in? That seems <br/>\nmind-numbingly obvious. Or, maybe I just haven&#39;t done anything <br/>\ncomplicated enough yet? But then, a lot of stuff I&#39;ve read says I should <br/>\nwrite the test cases first and then write the class... this, even though <br/>\nI&#39;ve also read that I shouldn&#39;t bother writing asserts for simple <br/>\nmethods... what if that&#39;s all the class has?<br/>\n<br/>\nI&#39;d really like to write test cases for everything I write, but at this <br/>\npoint I don&#39;t see the use of writing them for the classes I have so far. <br/>\nPlease set me straight.<br/>\n<br/>\nBen</div>", 
    "prevInTime": 10237, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1074560993", 
    "canDelete": false, 
    "nextInTopic": 10246, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDQwMEM3RkUxLjcwMDA0MDdAbXVuYXQuY29tPg=="
    }
}