{
    "numMessagesInTopic": 9, 
    "nextInTime": 1036, 
    "senderId": "0ihcuBoQkGG1OVjlqHkLNANyYlX1q6fjmmOVdgVgBgm37bqriPNZXhw42oETrbWCtai82uR_aFmH7BjKVU9XN_g3Br1artn7", 
    "systemMessage": false, 
    "subject": "Re: [junit] Is coverage important?  RE: Test Coverage Analysis To ol For Junit", 
    "from": "&quot;Steve Freeman&quot; &lt;steve@...&gt;", 
    "authorName": "Steve Freeman", 
    "msgSnippet": "RE: [junit] RE: Test Coverage Analysis Tool For JunitIf you re really writing code test-first you should find that you hit 98-99% coverage without breaking", 
    "msgId": 1035, 
    "topicId": 1031, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1643013584\">RE: [junit] RE: Test Coverage Analysis Tool For JunitIf you&#39;re really writing code test-first you should find that you hit 98-99% coverage without breaking into a sweat. A couple of projects ago we hit this number the first time we ran a coverage tool 3 months into the project. The remaining fraction was missed exception handling and admin code.\r<br/>\n\r<br/>\nSteve\r<br/>\n\r<br/>\n\r<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- \r<br/>\nFrom: Houston, Greg (ISSAtlanta) \r<br/>\nTo: &#39;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>&#39; \r<br/>\nSent: Tuesday, April 24, 2001 9:56 PM\r<br/>\nSubject: RE: [junit] Is coverage important? RE: Test Coverage Analysis To ol For Junit\r<br/>\n\r<br/>\n\r<br/>\nIs coverage really that important?  The directive is to &quot;Test everything that could possibly break&quot;, not &quot;Test everything&quot;.\r<br/>\n\r<br/>\nUnit Tests give you great benefits in productivity and quality.  I have worked on XP teams that measured both quality and productivity.  Unit Testing and XP does improve both!  However, there comes a point where more Unit Tests only marginally increases quality while not increasing productivity (even negatively impacting productivity).  Developers should question the value of creating more Unit Tests.  If you are not careful, you can get into a &quot;Test everything&quot; mode and kill productivity.\r<br/>\n\r<br/>\nSince Coverage metrics can lead the team to focus on &quot;Test Everything&quot;, it isn&#39;t a great measurement.  Instead, focus on &quot;things that could break&quot; and you will continue to gain both increased productivity and quality.   Only use Coverage tools to reveal something that could break.  Using coverage as a metric is a poor practice.  I suggest using quality metrics instead (i.e. number of Unit Tests and number of passing Functional Tests)\r<br/>\n\r<br/>\n- Greg Houston\r<br/>\nwww.ISS.net </span></blockquote></div>", 
    "prevInTime": 1034, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "988155108", 
    "canDelete": false, 
    "nextInTopic": 1036, 
    "prevInTopic": 1034, 
    "headers": {
        "messageIdInHeader": "PDAwYTIwMWMwY2QxNyQyZTQ1Mjg0MCQ1N2U0N2JkNUBnYXRld2F5Pg==", 
        "referencesHeader": "PDc3ODNBMTQxQzc5NEQ0MTE4QUFBMDAzMDZFMDBCMEIxQ0MwNjI0QG1zZ2F0bDA2Lmlzcy5uZXQ+"
    }
}