{
    "numMessagesInTopic": 4, 
    "nextInTime": 10389, 
    "senderId": "b0gAfhYLt9xHPc9AS0imu1bAfIY4qvnkutBLS1TxYenswVIkrZJi_sVTmU26hB2atv8u__xrjMut6Y2NEVMSBNRSYkqd5mHDn91D-JRKKf_nyMMUXnL8", 
    "systemMessage": false, 
    "subject": "RE: [junit] Unit testing philosophy", 
    "from": "&quot;Stirling, Scott&quot; &lt;scott.stirling@...&gt;", 
    "authorName": "Stirling, Scott", 
    "msgSnippet": "... Was your colleague a software developer or tester?  If so, in which industry?  Sounds academic.  How did the quality of her code reflect her theory?  Just", 
    "msgId": 10388, 
    "profile": "stirlingdev", 
    "topicId": 10381, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 150177187, 
    "messageBody": "<div id=\"ygrps-yiv-1466217077\"><blockquote><span title=\"ireply\">&gt; From: obi300 [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:obi300@...\">obi300@...</a>]<br/>\n&gt; <br/>\n&gt; Hi all,<br/>\n&gt; <br/>\n&gt; a colleague of mine once told me that she never did unit testing. <br/>\n<br/>\n </span></blockquote>Was your colleague a software developer or tester?  If so, in which industry?  Sounds academic.  How did the quality of her code reflect her theory?  Just wondering.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Her <br/>\n&gt; argument was that unit tests, as performed today, are able to check <br/>\n&gt; only a specific path on the code, the path stablished by initial <br/>\n&gt; conditions.<br/>\n<br/>\n </span></blockquote>She was right.  But the persuasion that follows (i.e., &quot;therefore don&#39;t bother with unit tests&quot;), is like saying &quot;We all die someday, so we might as well live like there&#39;s no tomorrow.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Instead, she performed specificacion checking using <br/>\n&gt; theorem provers and other advanced tools.<br/>\n<br/>\n </span></blockquote>I laughed when I saw &quot;theorem provers.&quot;  I&#39;ve never met a hands-on professional in the software industry (and maybe your colleague was just in a different industry, even if she developed software) who would even think of theorem prover as a solution for a QA problem at work (unless maybe the problem had to do with testing theorems, which isn&#39;t often in the business world).<br/>\n<br/>\nAdvanced tools (by which I project you mean source metrics, UI automation, coverage analysis) are great, but they usually cost money and most people, even so-called professionals, are too stupid, overworked, cheap or lazy to use them effectively, if at all.  Those who do know these tools are hard to find and expensive to hire.  By all means, use them whenever you can, though.  A rare individual will use these kinds of tools effectively and drive major changes through an engineering and/or QA team.  But even then, that person and the effectiveness of the tools are like the center of rippling circles in a pond -- they diminish as they move out from center.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This has made me think <br/>\n&gt; about the utility of unit testing and the level of code reliability <br/>\n&gt; that unit testing can provide.<br/>\n&gt; <br/>\n&gt; What do you have to say about this? Could it have an impact on unit <br/>\n&gt; testing and, specifically, on JUnit?<br/>\n<br/>\n </span></blockquote>No, not a bit.  There&#39;s been plenty of research and writing on the effectiveness of different tools, metrics and test techniques.  See anything by Boris Beizer, Glenford Myers, or Robert Binder (anyone can get books by these guys on Amazon).  Unit testing is one of many techniques, and is generally regarded as a sine qua non of quality code and development methodology.  But it&#39;s no silver bullet.<br/>\n<br/>\nBasically, you tossed up a real softball question.  I wouldn&#39;t mind discussing it, but would rather hear some more specific, detailed arguments, ideally supported by literature rather than just an anecdote.<br/>\n<br/>\nBest,<br/>\nScott Stirling<br/>\nWorkscape, Inc.<br/>\n<br/>\n***********************************************************************<br/>\nThis message is intended only for the use of the intended recipient and<br/>\nmay contain information that is PRIVILEGED and/or CONFIDENTIAL.  If you<br/>\nare not the intended recipient, you are hereby notified that any use,<br/>\ndissemination, disclosure or copying of this communication is strictly<br/>\nprohibited.  If you have received this communication in error, please<br/>\ndestroy all copies of this message and its attachments and notify us<br/>\nimmediately.<br/>\n***********************************************************************</div>", 
    "prevInTime": 10387, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1075823758", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 10386, 
    "headers": {
        "messageIdInHeader": "PDcyMDY4Mjk4Q0Q5OTEwNEFBRURFMkZERjg5QUMxNjBENEM0QzU0QGF2YW50aS5jb3JwLndvcmtzY2FwZS5uZXQ+"
    }
}