{
    "numMessagesInTopic": 9, 
    "nextInTime": 1039, 
    "senderId": "DLWrAOD7YzidKTrKjHYudo-307CXeQoXCCNq_9QeYzIygH53UKLh80sPvEHRfdkIkwjBcUB0r-7aX5zFdwTF2TWwUfwPQdo4", 
    "systemMessage": false, 
    "subject": "Re: [junit] Is coverage important?  RE: Test Coverage Analysis To ol For Junit", 
    "from": "&quot;Steve Freeman&quot; &lt;steve@...&gt;", 
    "authorName": "Steve Freeman", 
    "msgSnippet": "From:  ... I think we ve misunderstood something here. I was not proposing full coverage as a requirement or anything like that.", 
    "msgId": 1038, 
    "topicId": 1031, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1857073478\">From: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:carlos.manzanares@...\">carlos.manzanares@...</a>&gt;\r<br/>\n<blockquote><span title=\"ireply\"> &gt; I think what we are all afraid is of Steve&#39;s statement: &quot;If you&#39;re really\r<br/>\n&gt; writing code test-first you should find that you hit 98-99% coverage without\r<br/>\n&gt; breaking into a sweat.&quot; I have never liked imposed coverage percentages\r<br/>\n&gt; because not all the applications can be covered in the same way (some\r<br/>\n&gt; applications are very easy to be covered and some others are impossible),\r<br/>\n&gt; and because usually the developers start to trick with the tests just to get\r<br/>\n&gt; that percentages (and usually that tricks are not very &quot;quality-oriented&quot;\r<br/>\n&gt; and at the end they are a waste of time)\r<br/>\n\r<br/>\n </span></blockquote>I think we&#39;ve misunderstood something here. I was not proposing full coverage as a requirement or anything like that. My point was that one of the effects of writing code test-first (where you shouldn&#39;t write code without a test to drive it) is that you get full coverage &quot;for free&quot;. Just run the tool from time to time to look for occasional slip-ups and stop worrying about it.\r<br/>\nWe all know that coverage, in itself, does not prove that you&#39;ve executed every possible path, just as unit tests do not _prove_ that your code has no errors, but it gets you a lot of the way there.\r<br/>\n\r<br/>\nSteve</div>", 
    "prevInTime": 1037, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "988185666", 
    "canDelete": false, 
    "nextInTopic": 1045, 
    "prevInTopic": 1037, 
    "headers": {
        "messageIdInHeader": "PDAwMzIwMWMwY2Q1ZSQ4YTZhMGUwMCRmNmUzN2JkNUBnYXRld2F5Pg==", 
        "referencesHeader": "PDI1Qjc5RTk0NzZCQUQyMTE4MTFCMDAwOEM3ODk0Q0RDMDUzQTQ4NjBAdHJlaXMwNG5vaz4="
    }
}