{
    "numMessagesInTopic": 2, 
    "nextInTime": 10459, 
    "senderId": "ojRh8Grz3uhGobiO2EVGnE3vGGdkS3-0xFKe0bHioEIlCaK6fGkHUhm7fuAszAG-ce0u4ewh6dFkQ4BiDxPnWmD84i17qiFj", 
    "systemMessage": false, 
    "subject": "JAM*Tester--tool for teachers", 
    "from": "&quot;xcare87x&quot; &lt;depoll@...&gt;", 
    "authorName": "xcare87x", 
    "msgSnippet": "Well, this is kind of a work in progress.  I guess I had better start with the story behind it.  My AP Computer Science teacher uses JUnit along with BlueJ to", 
    "msgId": 10458, 
    "profile": "xcare87x", 
    "topicId": 10458, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 175646221, 
    "messageBody": "<div id=\"ygrps-yiv-969370117\">Well, this is kind of a work in progress.  I guess I had better <br/>\nstart with the story behind it.  My AP Computer Science teacher uses <br/>\nJUnit along with BlueJ to help him grade our labs.  It makes it easy <br/>\nfor him to test all of the methods that each student has written for <br/>\nthe assignment.  The problem, however, is that this was very time <br/>\nconsuming, as he has many students, and he had to compile and run <br/>\nthe tests on each student&#39;s code.  Thus, he asked me to help him by <br/>\nwriting a program that would do it for him.  Which is how JAM*Tester <br/>\ncame about.  I&#39;m still working on it, but it would be nice if a <br/>\ncouple of people could try it and let me know if it works.<br/>\n<br/>\nThe website is <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.depoll.com\">http://www.depoll.com</a>  Right now it only works on <br/>\nWindows machines, but I&#39;m working on it!  Thanks for the interest!  <br/>\nPlease e-mail me any suggestions you may have (check the contact <br/>\npage on the website).<br/>\n<br/>\nP.S.  I guess I should say a little about myself.  I&#39;m a 16 year old <br/>\nJunior at Troy High School (Class of &#39;05).  I love programming.  <br/>\nIt&#39;s a lot of fun.  This project gave me an opportunity to <br/>\nexperiment with some unfamiliar concepts.  I hope you like it.</div>", 
    "prevInTime": 10457, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1076480671", 
    "canDelete": false, 
    "nextInTopic": 10459, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGMwY2hxditmMHNkQGVHcm91cHMuY29tPg=="
    }
}