{
    "numMessagesInTopic": 1, 
    "nextInTime": 10458, 
    "senderId": "lBEQT4bXBuMA_ivw_mz_5Er_zK7-fM6CiS2oa3IM28WX9R1fwzyH8E1VDWdSQWVCd3HrMwThGmHc_2u5W5J_Z36qcWr7sYbeoU0", 
    "systemMessage": false, 
    "subject": "fighting the anti-test-infection", 
    "from": "Thomas L Roche &lt;tlroche@...&gt;", 
    "authorName": "Thomas L Roche", 
    "msgSnippet": "I believe many in the xUnit community should now take advantage of the opportunity to unwash brains WRT UI testing. What I mean: The following came to me from", 
    "msgId": 10457, 
    "profile": "tlroche", 
    "topicId": 10457, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 112010592, 
    "messageBody": "<div id=\"ygrps-yiv-2134697020\">I believe many in the xUnit community should now take advantage of<br/>\nthe opportunity to unwash brains WRT UI testing. What I mean:<br/>\n<br/>\nThe following came to me from a coder (in another company, though my<br/>\nown probably has many similar instances of the following) who shall<br/>\nremain nameless (unless he wants to paint a target on his back :-)<br/>\n<br/>\nanonymous coder 02/08/2004 01:02 PM<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m on this project that is writing using a very-buggy,<br/>\n&gt; very-ready-any-day-now customized Swing-based UI. We have no tests,<br/>\n&gt; and no test framework or harness in place.<br/>\n<br/>\n&gt; Since I consider this a serious issue, (the project will easily<br/>\n&gt; exceed the 500,000 lines of code when it&#39;s done) I set about to make<br/>\n&gt; a useable test harness for unit testing the UI. What we&#39;d like to do<br/>\n&gt; is (Test First) assert that each UI widget on each screen behaves<br/>\n&gt; according to our spec for all kinds of data going into the widget.<br/>\n&gt; Pretty standard TDD, wouldn&#39;t you think?<br/>\n<br/>\n&gt; Turns out the seriousness of this issue is not wholly shared by my<br/>\n&gt; peers, some of whom think testing is optional. Here&#39;s a quote from<br/>\n&gt; one of the core developers of the oh-so-not-ready-for-primetime<br/>\n&gt; customized Swing framework:<br/>\n<br/>\n&gt;     You can build quality UI code without writing tests...<br/>\n<br/>\n </span></blockquote>How did we get here? Here&#39;s my etiology, YMMV:<br/>\n<br/>\nOnce, not so long ago, some Big Brains cogitated, and sent forth the<br/>\nidea (or perhaps this meme spoke through them): <br/>\n<br/>\n&quot;Code-time testing is Good. Cover completely, and enforce it with<br/>\nbuild-time verification.&quot;<br/>\n<br/>\nBut from the trenches came the response, &quot;The vast majority of us code<br/>\nUIs--how can we test _those_ with xUnit tools?&quot; Big heads scratched.<br/>\nThere were no UI automation tools short of monsters like WinRunner,<br/>\nand manual testing is painful; both integrate with development<br/>\nenvironments like fish ride bicycles. So the Big Brains said:<br/>\n<br/>\n&quot;Make your UIs thin, and test everything underneath them. That should<br/>\nBe Good Enough.&quot;<br/>\n<br/>\nAnd they were, and are, right: if you are very disciplined, and keep<br/>\nlogic and state in your UIs to absolute minima, and test everything<br/>\nelse, you can usually get by. But<br/>\n<br/>\n- almost no one&#39;s that disciplined. Bosses want a fix NOW, or you<br/>\n  hafta work with UI code that&#39;s already thick, or there&#39;s some other<br/>\n  reason to just stick a _little_ bit of logic in there ... and you&#39;ve<br/>\n  got a bigger hole in your coverage.<br/>\n<br/>\n- the Doctrine of Incomplete Testing spreads by induction.<br/>\n  Coders, in our laziness, impatience, and hubris, tend to think:<br/>\n<br/>\n· thin == !(required to test)<br/>\n<br/>\n· my Foo is a thin extension of Bar!<br/>\n<br/>\n· therefore I need not test it<br/>\n<br/>\n  Unfortunately, those thin layers tend to gather together into<br/>\n  big piles of buggy crap. This is the &quot;anti-test-infection.&quot;<br/>\n<br/>\n- over time, the big brains were UNDERSTOOD to have said,<br/>\n<br/>\n&quot;Make your UIs thin, and test everything underneath them. That is<br/>\nEnough.&quot;<br/>\n<br/>\n  Meanwhile, thanks to tools built on, e.g., java.awt.Robot, now you<br/>\n  CAN &quot;go the last mile&quot;: you can automate and test your UIs just as<br/>\n  you test the rest of your code, and at the same time, and using your<br/>\n  fave xUnit tooling. As the capability arose, so did the myth of its<br/>\n  expendability :-(<br/>\n<br/>\nIMHO the word needs to go out: test your @#$^%&* UIs, too! A thin UI<br/>\nis still good ... because it&#39;s easier to test. But a well-designed,<br/>\nuntested UI is just another hole in your coverage. &lt;/vent&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 10456, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1076478406", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "inReplyToHeader": "PDEwNzY0MDIxNzcuMTM0MC40NTIzOC5tMTJAeWFob29ncm91cHMuY29tPg==", 
        "messageIdInHeader": "PE9GNzA0NzZBNUEuQTA5RTcwMTgtT044NTI1NkUzNy4wMDEwMkYwOS04NTI1NkUzNy4wMDFGQkY5QUB1cy5pYm0uY29tPg=="
    }
}