{
    "numMessagesInTopic": 11, 
    "nextInTime": 10497, 
    "senderId": "qsKshAXOqXZXrmvSIeTscsjxPgkRWDFnpagjqvQ8aX400IaaIGxJkzEcYlAtJamY_ikoWxTywJsD2At5bY4TmZEsO9FNYlu4qfO4og", 
    "systemMessage": false, 
    "subject": "Re: Problems testing an InputStream", 
    "from": "&quot;Craig Duncan&quot; &lt;leftymiata@...&gt;", 
    "authorName": "Craig Duncan", 
    "msgSnippet": "Thanks for all the great responses. I did get my unit test to work in ANT by playing around with the getResourceAsStream call. The new code is: InputStream is", 
    "msgId": 10496, 
    "rawEmail": "Return-Path: &lt;leftymiata@...&gt;\r\nX-Sender: leftymiata@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 71755 invoked from network); 18 Feb 2004 14:17:27 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m9.grp.scd.yahoo.com with QMQP; 18 Feb 2004 14:17:27 -0000\r\nReceived: from unknown (HELO n39.grp.scd.yahoo.com) (66.218.66.107)\n  by mta2.grp.scd.yahoo.com with SMTP; 18 Feb 2004 14:17:30 -0000\r\nReceived: from [66.218.67.176] by n39.grp.scd.yahoo.com with NNFMP; 18 Feb 2004 14:17:28 -0000\r\nDate: Wed, 18 Feb 2004 14:17:28 -0000\r\nTo: junit@yahoogroups.com\r\nMessage-ID: &lt;c0vs5o+7pmn@...&gt;\r\nIn-Reply-To: &lt;72068298CD99104AAEDE2FDF89AC160D4C4C8C@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 5319\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-eGroups-Remote-IP: 66.218.66.107\r\nFrom: &quot;Craig Duncan&quot; &lt;leftymiata@...&gt;\r\nSubject: Re: Problems testing an InputStream\r\nX-Yahoo-Group-Post: member; u=66158715\r\nX-Yahoo-Profile: leftymiata\r\n\r\nThanks for all the great responses.\n\nI did get my unit test to work in ANT by playing around with the\ngetResourceAsStream call.\n\nThe new code is:\nInputStream is = Deal.class.getResourceAsStream(&quot;/RunPOEngineTest.xml&quot;);\nassertNotNull(is);\n\nThe &quot;Deal&quot; class lives in the same jar file as the xml file.  The xml\nfile is at the root of the jar so I used a slash at the beginning.\n\nEven though things are working I am still unclear as to why they are\nworking.  Scott&#39;s post is very informative but I must confess my\nignorance as to how class loaders work.  My understanding of what the\ngetResourceAsStream does is obviously lacking.  The way I thought it\nworked is that a call to getResourceAsStream will try to locate that\nfile by searching through your CLASSPATH, similar to how the reference\nto a class is found by looking through your classpath.  Since I am\ntrying to locate a resource I get the impression that things work\ndifferently.\n\nThis xml file that I am trying to use is only needed for unit tests,\nit is not needed in the final production code, therefore I originally\njust put the file into a jar that contains a bunch of &quot;.java&quot; files. \nBasically a jar of the source that developers can use as reference.  I\nended up moving it into the jar that contains the &quot;.class&quot; files.  One\nof those &quot;.class&quot; files is the Deal class.\n\nSo I guess my question is, are there any links online that give a\nlitte more in-depth explanation of class loaders or would someone like\nto explain it?\n\n\nThanks for your help,\n\nCraig\n\n\n--- In junit@yahoogroups.com, &quot;Stirling, Scott&quot; &lt;scott.stirling@w...&gt;\nwrote:\n&gt; &gt; From: Craig Duncan [mailto:leftymiata@y...]\n&gt; &gt; \n&gt; &gt; My scenario is that I have an xml file that is inside a jar.  When I\n&gt; &gt; run the unit test inside Eclipse the file is found and the tests run\n&gt; &gt; fine.  I even tried removing the jar from Eclipse&#39;s build path to make\n&gt; &gt; sure it was not finding the file in some other location.  The test\n&gt; &gt; failed without the jar in the path, so I am pretty sure the unit test\n&gt; &gt; is finding the file in the jar.\n&gt; \n&gt; Where in the jar is the XML file?  In the jar root?  Or in the\npackage of the class that&#39;s retrieving it?  If in the root of the jar,\nprepend a &quot;/&quot; to the resource name.  If it&#39;s packaged in the package\ndirectory, don&#39;t.\n&gt;  \n&gt; &gt; Now, when I run the unit tests from ANT I get a NullPointerException\n&gt; &gt; because the InputStream is Null.  I double checked the classpath that\n&gt; &gt; is printed out when the unit test runs and the jar file that contains\n&gt; &gt; the xml file is on the classpath.\n&gt; &gt; \n&gt; &gt; Here is the code I am using to read in the xml file.  It is pretty\n&gt; &gt; much the same as the original poster.\n&gt; &gt; \n&gt; &gt; // Get our sample input file.\n&gt; &gt; InputStream is = \n&gt; &gt; Class.class.getResourceAsStream(&quot;/RunPOEngineTest.xml&quot;);\n&gt; &gt; InputStreamReader sr = new InputStreamReader(is);\n&gt; \n&gt; Why are you doing Class.class.getResourceAsStream()?  This will\nresolve the resource relative to the classloader that the\njava.lang.Class class is in, which may or may not be the same as the\nloader your resource is in, depending on the classloader hierarchy of\nthe containing application (e.g.., Eclipse, JUnit, Ant) and how your\njar is loaded.  If everything is all in a standalone main() app and\neverything is in the system classpath, then using\nClass.getResourceAsStream() should work, but, in general and\nespecially in J2EE apps, that&#39;s not a portable way to do it.\n&gt; \n&gt; As someone else began to say:\n&gt; \n&gt; 1. Foo.class.getResourceAsStream(&quot;...&quot;); or\nthis.getClass().getResourceAsStream(&quot;...&quot;);\n&gt; \n&gt; This will look for the resource in the same classloader hierarchy as\nthe class calling getResourceAsStream().  getSystemResourceAsStream()\nshouldn&#39;t ever need to be called if you call getResource/AsStream()\nbecause the system classloader will call it under the covers if\nnecessary without you doing anything.\n&gt; \n&gt; 2.\nThread.currentThread().getContextClassLoader().getResourceAsStream(&quot;...&quot;);\n&gt; \n&gt; This fallback will work for when the calling class and the resource\nare in a classloader not in the normal classloader search hierarchy\n(hope I explained that right).  I&#39;ve used it when I had a system level\nclass (loaded in the system or other high level classloader) that\nprovided a util method for finding resources in potentially any\nclassloader.  In order for the system level class to find resources in\nlower level classloaders, such as a web app classloader, you have to\nget the current thread (normally a thread spawned by the app server\nfor handling web requests and loading web app classes), get its\nclassloader and retrieve the resource from there.  This is a fallback\nsince the higher level classloaders should get searched first.\n&gt; \n&gt; Scott Stirling\n&gt; Workscape, Inc.\n&gt; \n&gt; ***********************************************************************\n&gt; This message is intended only for the use of the intended recipient and\n&gt; may contain information that is PRIVILEGED and/or CONFIDENTIAL.  If you\n&gt; are not the intended recipient, you are hereby notified that any use,\n&gt; dissemination, disclosure or copying of this communication is strictly\n&gt; prohibited.  If you have received this communication in error, please\n&gt; destroy all copies of this message and its attachments and notify us\n&gt; immediately.\n&gt; ***********************************************************************\n\n\n", 
    "profile": "leftymiata", 
    "topicId": 10290, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 66158715, 
    "prevInTime": 10495, 
    "contentTrasformed": false, 
    "postDate": "1077113848", 
    "canDelete": false, 
    "nextInTopic": 10497, 
    "prevInTopic": 10491, 
    "headers": {
        "inReplyToHeader": "PDcyMDY4Mjk4Q0Q5OTEwNEFBRURFMkZERjg5QUMxNjBENEM0QzhDQGF2YW50aS5jb3JwLndvcmtzY2FwZS5uZXQ+", 
        "messageIdInHeader": "PGMwdnM1bys3cG1uQGVHcm91cHMuY29tPg=="
    }
}