{
    "numMessagesInTopic": 6, 
    "nextInTime": 10499, 
    "senderId": "qpp2Rynopuc6TsnVUzOsf4WAvAsV6M78iM7XUTM8pDE1wIBDJTen6wJsntf9Q-ja2Qq7fQ-_QwJs23LvrB3iRCmVlXeAR-4d", 
    "systemMessage": false, 
    "subject": "Executing dynamic tests", 
    "from": "&quot;Mike&quot; &lt;crewfanschmack@...&gt;", 
    "authorName": "Mike", 
    "msgSnippet": "Hello... Quite new to using jUnit, and of course, I am trying to use it for something other than it s base intended purpose. I am implementing software on a", 
    "msgId": 10498, 
    "profile": "crewfanschmack", 
    "topicId": 10498, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 59401374, 
    "messageBody": "<div id=\"ygrps-yiv-1835353721\">Hello...<br/>\n<br/>\n  Quite new to using jUnit, and of course, I am trying to use it for <br/>\nsomething other than it&#39;s base intended purpose.<br/>\n<br/>\n  I am implementing software on a platform.  In this case, we take <br/>\ndata in from many customers and map it to a semi-standard format that <br/>\nis stored in a DB in an obfuscated XML format that you access via <br/>\nobjects already deployed by the platform.<br/>\n<br/>\n  I do not need to test if I can grab a field, or anything like <br/>\nthat....what I need to be able to do, is test that when a client <br/>\nsends in some data, that it always contains required fields.<br/>\n<br/>\n  You would think this could be done by testing the input data, but <br/>\nthat would be very difficult because of the various formats of data <br/>\nand the engine that is used to parse that data.  I don&#39;t want to test <br/>\nif the data is in the stream, I need to test if the data made it to <br/>\nthe DB.<br/>\n<br/>\n  So what I&#39;m trying to do is use jUnit and some plugin derivatives <br/>\nto access the DB and grab a batch of data and go through <br/>\neach &quot;record&quot; and determine if it contains those required fields.  <br/>\nI have been successful in opening up a DB connection using jUnit++ <br/>\nwhich I think I can persist throughout the test suites.  Where I am <br/>\nstruggling is how to get my Tests to:<br/>\n<br/>\n- Grab a batch, and then cycle through the objects related to that <br/>\nbatch, running every test on each object<br/>\n<br/>\n- Organizing the TestSuites.  I&#39;m not really sure how to get them to <br/>\nproperly cascade down.  For example, I have the DB connection, but <br/>\nI&#39;m not sure where that should be placed.<br/>\n<br/>\nHopefully someone else has had to perform this semi-functional semi-<br/>\nunit test.  A Testing Suite like this would help tremendously to <br/>\nregression test during maintenance efforts.<br/>\n<br/>\n-Mike</div>", 
    "prevInTime": 10497, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1077141064", 
    "canDelete": false, 
    "nextInTopic": 10499, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGMxMG1vOCs0dW1zQGVHcm91cHMuY29tPg=="
    }
}