{
    "numMessagesInTopic": 6, 
    "nextInTime": 10502, 
    "senderId": "8qlG9etZTFE1v84DuQkQDlhiCV3V-mh0YjkmuLeW8zgA5OTQEnOEfrWf7ChdKP0ywfup55PzFbbZkYrSAaxg1jAZ4CRg9szN", 
    "systemMessage": false, 
    "subject": "Re: Executing dynamic tests", 
    "from": "&quot;Mike&quot; &lt;crewfanschmack@...&gt;", 
    "authorName": "Mike", 
    "msgSnippet": "... same ... this ... It is similar I think.  Perhaps what I should do is mention more about how I am allowed to access the data because of the way the ", 
    "msgId": 10501, 
    "profile": "crewfanschmack", 
    "topicId": 10498, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 59401374, 
    "messageBody": "<div id=\"ygrps-yiv-1364174737\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;J. B. Rainsberger&quot; &lt;jbrains@r...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Mike wrote:<br/>\n&gt; <br/>\n&gt; &gt; Where I am<br/>\n&gt; &gt; struggling is how to get my Tests to:<br/>\n&gt; &gt; <br/>\n&gt; &gt; - Grab a batch, and then cycle through the objects related to that<br/>\n&gt; &gt; batch, running every test on each object<br/>\n&gt; <br/>\n&gt; This sounds like a Parameterized Test Case: you want to execute the <br/>\n </span></blockquote>same <br/>\n<blockquote><span title=\"ireply\"> &gt; test logic for many rows of data. I would search the archives of <br/>\n </span></blockquote>this <br/>\n<blockquote><span title=\"ireply\"> &gt; group for &quot;Parameterized Test Case&quot;.<br/>\n<br/>\n </span></blockquote>It is similar I think.  Perhaps what I should do is mention more <br/>\nabout how I am allowed to access the data because of the way the <br/>\nplatform hides the actual implentation.<br/>\n<br/>\nUnfortunately, it&#39;s not as easy as just grabbing rows.  I get an <br/>\nobject which represents a file batch.  Then I can walk through that <br/>\nbatch to grab each record using a singleton on the batch object.  <br/>\nEach record is what I ultimately want to test upon.  The only way to <br/>\nget to a record is through a batch.<br/>\n<br/>\nIdeally, I want to be able to run these tests on any batch which are <br/>\nreferenced by an ID set at load time.  Ultimately, when a client <br/>\nchanges something, I want to be sure they didn&#39;t break the rules that <br/>\nwere used to extract the data.<br/>\n<br/>\nThe way I envision it, is you grab a batch, then iterate through the <br/>\nbatch getting each record object.  Once you&#39;ve gotten the object, you <br/>\nthen run your series of unit tests on that object.  YOu can check <br/>\nthat data is still there, to verifying that the JSP page that <br/>\naccesses this object contains everything that it is supposed to.  The <br/>\none thing to note is that the record is not a row, it&#39;s a BLOB which <br/>\ncan be accessed through accessor objects to get the data. <br/>\n<br/>\nThis is what I meant by cascading down.  My input is just the batch <br/>\nID, and I need to use that to get what I really want to test which <br/>\nare the records associated with that batch. <br/>\n<br/>\nWhat I&#39;m seeing in your post, is that I may be a bit too <br/>\nambitious/backwards. :)  Perhaps I need to send the batch into the <br/>\ntest and then iterate through each record rather than iterate through <br/>\neach record and pass it into each test.<br/>\n<br/>\nI was asking about where I might place the code to open and close the <br/>\nDB connection so I don&#39;t lose the connection while I&#39;m trying to <br/>\nulimately get to the record.  I don&#39;t want to open and close the <br/>\nconnection for each record. :)<br/>\n<br/>\nYou are quite correct that the complications come from the <br/>\napplication...I have written some basic jUnit tests over the past <br/>\nmonth.<br/>\n<br/>\nI just want to fit within the jUnit framework as much as possible.  <br/>\nAnother collegue wrote some code to test the web end, which used <br/>\njUnit and httpUnit, but he proceeded to overload every assert method <br/>\nand write one giant testThis method within which you called methods <br/>\nto test.  Seemed to really defeat the purpose of testing with the <br/>\njUnit framework, and sent me on this mission to find a better way.  <br/>\n<br/>\nI don&#39;t know if this makes any more sence..but hopefully it helps to <br/>\nclarify.</div>", 
    "prevInTime": 10500, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1077198791", 
    "canDelete": false, 
    "nextInTopic": 10508, 
    "prevInTopic": 10499, 
    "headers": {
        "inReplyToHeader": "PDQwMzNFMkE5LjQwMjAzMDhAcm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PGMxMmY0NytnNzJmQGVHcm91cHMuY29tPg=="
    }
}