{
    "numMessagesInTopic": 7, 
    "nextInTime": 10513, 
    "senderId": "xbpV4WYNhAkqwypNGafa2NDAT5fOu-9sxHMBz7HqDIyp5gAdXV7YGY-VQTRVITiepleoEuBpsBT0No3oxQzmnAW7apA0e2q1TS6m", 
    "systemMessage": false, 
    "subject": "Platform dependent JUnit testcases", 
    "from": "&quot;humbugzilla&quot; &lt;rlee@...&gt;", 
    "authorName": "humbugzilla", 
    "msgSnippet": "I m just getting into JUnit. Initially I was sceptical, but am becoming sold on it. This is one consideration which is bothering me. Let me hastily insert a", 
    "msgId": 10512, 
    "profile": "humbugzilla", 
    "topicId": 10512, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 176768928, 
    "messageBody": "<div id=\"ygrps-yiv-1091231654\">I&#39;m just getting into JUnit. Initially I was sceptical, but am<br/>\nbecoming sold on it. This is one consideration which is bothering me.<br/>\n<br/>\nLet me hastily insert a newbie warning here - I have _not_ read all<br/>\nthe documentation, nor have I tried and understood even all the<br/>\nchoices available when creating testcases and testsuites. However, I<br/>\nam finding useful benefit from JUnit so far and I&#39;m motivated to take<br/>\nit further. To some extent, I&#39;m beating a path for others in my team.<br/>\n<br/>\nJava is write-once-run-anywhere - right? However, some of us need to<br/>\ntest platform specific behaviour, for example, classes that only run<br/>\nin Windows or some other environment.<br/>\n<br/>\nHas anyone written up or done any work with JUnit in this area?<br/>\n<br/>\nAt the moment, I&#39;m envisaging something in a testcase/testsuite<br/>\nsetUp() method where I have some means of checking the the test code<br/>\nis being run in the correct environment - this may mean checking<br/>\nsystem properties or some external property such as environment<br/>\nvariables. If the environment isn&#39;t what I need for the tests to be<br/>\nvalid, then I want JUnit to accept a special fail() which says to<br/>\nJUnit - don&#39;t run _any_ of the tests in this testcase/testsuite.<br/>\n<br/>\nThere&#39;s no point in running them because they won&#39;t be valid tests in<br/>\nthe incorrect environment, so I don&#39;t want to see a whole bunch of<br/>\nfails because they shouldn&#39;t have been run.<br/>\n<br/>\nThanks if you read this far.</div>", 
    "prevInTime": 10511, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1077279451", 
    "canDelete": false, 
    "nextInTopic": 10516, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGMxNHRzcitvYnZkQGVHcm91cHMuY29tPg=="
    }
}