{
    "numMessagesInTopic": 2, 
    "nextInTime": 10511, 
    "senderId": "LkKEI7fKrUYI_4AOiNKyMWQnuoKhKI_jNKud5y96Ag8BPW4ZFFQkJdK2IhnwsfRKR76NZEeI7GPJRBAyDgdHcqUz7_TknSLg4wPXP30Bka2XAw", 
    "systemMessage": false, 
    "subject": "Help extending TestRunner display", 
    "from": "&quot;Bryan LaPlante&quot; &lt;blaplante@...&gt;", 
    "authorName": "Bryan LaPlante", 
    "msgSnippet": "Hi folks, I am new to JUnit. I have been searching the archives and looking for information pertaining to my current needs. Having found no answers quit like", 
    "msgId": 10510, 
    "profile": "iblaplante", 
    "topicId": 10510, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 135058087, 
    "messageBody": "<div id=\"ygrps-yiv-1669354410\">Hi folks,<br/>\n<br/>\nI am new to JUnit. I have been searching the archives and looking for<br/>\ninformation pertaining to my current needs. Having found no answers quit<br/>\nlike what I am looking for I would like to ask for some help in the area of<br/>\ncustomizing the junit.swingui.TestRunner.<br/>\n<br/>\nI was asked to come up with a way for our QA testers to test network Java<br/>\napplications that have no user interface. The end tester should not be<br/>\nrequired to know anything about Java. The network folks will guarantee that<br/>\neach tester will have a JVM installed on the there machine.<br/>\n<br/>\nI created 5 classes in the junit.http package called:<br/>\nHttpTestCase extends TestCase<br/>\nServerObject<br/>\nObjectHandler<br/>\nSerializableObject<br/>\nRemoteTestRunner<br/>\n<br/>\nI am using HttpTestCase to create myTest were I use a method called<br/>\ninvokeRemoteMethod(<br/>\n    String fullyQualifiedName,<br/>\n    String methodName,<br/>\n    Object[] args,<br/>\n    Class[] argtypes<br/>\n);<br/>\n<br/>\nthe method uses a ServerObject to store the data about the class that needs<br/>\nto have it&#39;s method invoked, then uses SerializableObject to serialize the<br/>\nServerObject and post it to the RemoteTestRunner servlet. On the server the<br/>\nServerObject is desterilized and the class is instantiated then with a bit<br/>\nof reflection the method is invoked. The servlet returns the data to the<br/>\nclient as an object or wrapper object if the return type is a primitive.<br/>\nAll of the is wrapped up in a executable jar file so that the tester only<br/>\nneeds to double click the jar file and then up comes<br/>\njunit.swingui.TestRunner to display the results of the test.<br/>\n<br/>\nWhat I am interested in doing is adding an assertSuccess method to the<br/>\njunit.framework and extend the junit.runner.TestRunListener with a public<br/>\nstatic final int STATUS_SUCCESS = 3 so that I can create a testSuccess<br/>\nmethod like the testFailed method found in junit.swingui.TestRunner. I have<br/>\ntraced most of it from the interface on. What I am having trouble with is<br/>\nhow to get message data to print out to the DefaultListModel. I want to say<br/>\nthat there should be a listener for exceptions that is handling the output<br/>\nto the list box but I can not seem to find my way into it.<br/>\n<br/>\nIf anyone has a previous post or other related reading material they would<br/>\ncare to share, it would be well received.<br/>\n<br/>\nThanks for listening to me carry on.<br/>\n<br/>\nBryan LaPlante<br/>\nNetwork Web Applications</div>", 
    "prevInTime": 10509, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1077260637", 
    "canDelete": false, 
    "nextInTopic": 10517, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDAwMDcwMWMzZjc3ZiRiNjA2NGY4MCRkNDc4ZmVhOUB2aW5jZW50Pg=="
    }
}