{
    "numMessagesInTopic": 4, 
    "nextInTime": 10515, 
    "senderId": "vWR8qUYkanWdJgmE_PLfeQtfNJVV80oTQ4HvM3R-ncyRUsP6FrZ-PQ8X3MYtYgVI7HIXsgOXPZvvb7A-G7EbLDeEbhQ3Irol7tWp", 
    "systemMessage": false, 
    "subject": "JUnit populating method tests in testcase", 
    "from": "&quot;humbugzilla&quot; &lt;rlee@...&gt;", 
    "authorName": "humbugzilla", 
    "msgSnippet": "I guess this is really a feature request, but I m not sure where is the right place to raise it. When creating a new testcase, JUnit offers to populate the", 
    "msgId": 10514, 
    "profile": "humbugzilla", 
    "topicId": 10514, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 176768928, 
    "messageBody": "<div id=\"ygrps-yiv-1314233447\">I guess this is really a feature request, but I&#39;m not sure where is<br/>\nthe right place to raise it.<br/>\n<br/>\nWhen creating a new testcase, JUnit offers to populate the testcase<br/>\nwith tests for each of the class-under-test&#39;s methods and of it&#39;s<br/>\nsuperclasses. This is nice, but I would like to see a couple of things.<br/>\n<br/>\n1. I would like a checkbox which means add all those testmethods but<br/>\ncommented out initially. This would save my usual next action which is<br/>\nto go through manually commenting them out - in some classes, this is<br/>\na lot of work.<br/>\n<br/>\n2. I would like to see a checkbox and textfield which would allow me<br/>\nto append a suffix to each testmethod. At my present stage of using<br/>\nJUnit, I find I start out with the test method given me by JUnit<br/>\nautomagically,  then I populate the body with my test, then I<br/>\ncopy/paste the testmethod, add 001 to the end of the first of them,<br/>\n002 to the end of the second one, and go on to edit the body of the<br/>\nsecond of these testmethods.<br/>\n<br/>\n(I know I said a couple, but pretty please..?)<br/>\n<br/>\n3. It would be great if while viewing an existing testcase file, I<br/>\ncould bring up some JUnit wizard that lets me add more testmethod(s)<br/>\nfrom the base or, I guess, even some other, class.<br/>\n<br/>\nNow maybe others will explain how these are already doable :-)<br/>\n<br/>\nThanks for reading this far.</div>", 
    "prevInTime": 10513, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1077280596", 
    "canDelete": false, 
    "nextInTopic": 10515, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGMxNHYwaysxMTZzQGVHcm91cHMuY29tPg=="
    }
}