{
    "numMessagesInTopic": 8, 
    "nextInTime": 10552, 
    "senderId": "bY7xyvtCQhS41UlQ4zu5iyXZtGEH8WbhWqUtzP-L92xGFJKAYGcE_uTQnFBaRVaL2NrBz2Y_hfMwQh7CmDPG38ZcewBXdJHlYMumMoAE", 
    "systemMessage": false, 
    "subject": "A test that will always fail", 
    "from": "Jonathan Oddy &lt;j.oddy@...&gt;", 
    "authorName": "Jonathan Oddy", 
    "msgSnippet": "Dear All, In my current project I am responsible for writing a UI client to respond to a number of different events sent to it from some server.  Earlier today", 
    "msgId": 10551, 
    "profile": "jonathanoddy", 
    "topicId": 10551, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124029770, 
    "messageBody": "<div id=\"ygrps-yiv-1338963146\">Dear All,<br/>\n<br/>\nIn my current project I am responsible for writing a UI client to respond to<br/>\na number of different events sent to it from some server.  Earlier today a<br/>\ndeveloper noticed a UI bug where by a selected row within one of my reports<br/>\nwas not maintaining its selection state whilst processing events.  After<br/>\ninvestigation I wrote a number of unit tests to highlight the fault and as a<br/>\nresult fix the bug.  However on testing in a live environment I noticed my<br/>\napplication still exhibited the same erroneous behaviour, this I have<br/>\ntracked down to an error condition within the server - in certain<br/>\ncircumstances the server sends an additional erroneous event to the client.<br/>\nThe client *must* assume each event received is both valid and correct, and<br/>\nacts accordingly, unfortunately what the user sees is the same visual bug.  <br/>\n<br/>\nWhilst investigating this I wrote a further test that demonstrates that the<br/>\nclient will always fail given a particular series of events.  I like this<br/>\ntest because it documents that there is a problem within our system - which<br/>\nis useful when QA/support come over some time in the future to query the<br/>\nbehaviour the failing test reminds me where the problem is and what needs to<br/>\nbe done to fix it.  However being pragmatic I can see the server guys not<br/>\nfixing this for some time (in fact as we move towards a major release of the<br/>\nserver on a different branch it is a moot point as to whether it will ever<br/>\nbe fixed on this branch).  All of this means that I probably now have a<br/>\nred-bar test for the rest of this branch&#39;s life - and this doesn&#39;t sit well<br/>\nwith me.<br/>\n<br/>\nSo I am asking whether anyone else has had a similar experience and what<br/>\nthey did to resolve it?  The only thing I can think of at the moement is to<br/>\ngenerate a couple of suites - one with all my tests in it, the other with<br/>\nall but my failing test.  I don&#39;t like that really because I like the simple<br/>\nclick and go approach that Eclipse gives me so I would still always get a<br/>\nred-bar, and secondly who says I&#39;d ever remember to run this special suite?<br/>\n<br/>\nPeoples thoughts most welcome.<br/>\n<br/>\nJonathan<br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nJonathan Oddy<br/>\nSERVICEPower Business Solutions Ltd<br/>\nPetersgate House - St Petersgate - Stockport - SK1 1HE - ENGLAND<br/>\nTel: +44 (0)161 476 2277<br/>\nEmail: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:j.oddy@...\">j.oddy@...</a> &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:j.oddy@...\">j.oddy@...</a>&gt;</div>", 
    "prevInTime": 10550, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1078162699", 
    "canDelete": false, 
    "nextInTopic": 10552, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PEU1Qzc5MDQ5RDQ2MUQzMTFCODMxMDAwNjI5NTBCNTRBMDEyN0MzRjNAbnQtc3RvYy0wLnNicz4="
    }
}