{
    "numMessagesInTopic": 6, 
    "nextInTime": 10594, 
    "senderId": "Yh-9UYPI6q50QF4wJuwSVdGdaTV5Kqhs8xB6XpXf43BMKqSJmeCSUHKyAG3bmvqcoJErmkReF4Gr1Wx6wUxJtumN8vJ5yV-JsPo4qA6G", 
    "systemMessage": false, 
    "subject": "Re: [junit] questions about junit", 
    "from": "Jason Rogers &lt;jacaetevha@...&gt;", 
    "authorName": "Jason Rogers", 
    "msgSnippet": "... Long Answer: Try thinking in smaller chunks.  Take one unit of code and test it.  Measure the time it takes you to test, what you had to change in order", 
    "msgId": 10593, 
    "profile": "jacaetev", 
    "topicId": 10591, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 109352929, 
    "messageBody": "<div id=\"ygrps-yiv-1539557801\">On Thu, 2004-03-04 at 22:04, joedejin_zhao wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi,<br/>\n&gt; <br/>\n&gt; I am doing a research on automatice testing framework for my <br/>\n&gt; company&#39;s application. Had read the docs of junit, but still not sure <br/>\n&gt; whether it is useful for us. Here is a description about our product <br/>\n&gt; and the sort of test that we are looking for. Looking foward to your <br/>\n&gt; suggestions?<br/>\n&gt; <br/>\n&gt; There are 2 levels of tests we need to do.  One is the Simsbuilder, <br/>\n&gt; and <br/>\n&gt; the other is for each model we implement for a client. <br/>\n&gt; <br/>\n&gt; I&#39;ll focus on Simsbuilder testing.  As a first draft, I&#39;ll basically <br/>\n&gt; do <br/>\n&gt; a brain dump and we can refine/add to this by iteration. <br/>\n&gt; <br/>\n&gt; These are the areas we need to test: <br/>\n&gt; <br/>\n&gt; Our product is a business model building tool. Users build a model <br/>\n&gt; using the tool and input a scenario, and then run the generated <br/>\n&gt; simulation based on the model and the scenario. The tool does c++ <br/>\n&gt; code generation, compilation, and execution of the model. Two kind of <br/>\n&gt; testing are needed. <br/>\n&gt; <br/>\n&gt; 1. Test tool itself. Test strategy would be to build up a set of test <br/>\n&gt; models and their correct output to test the logic of the tool. An <br/>\n&gt; automatic test framework can be built around these models so that <br/>\n&gt; they run through the process of compilation, execution and comparison <br/>\n&gt; of output. Errors could come out at each stage of that process. This <br/>\n&gt; is not funtional testing of the tool, but more logic testing of <br/>\n&gt; equational based engine of the tool.<br/>\n&gt; <br/>\n&gt; 2. Persistence <br/>\n&gt; There are two aspects of persistence we need to test.  first is the <br/>\n&gt; functional test, whether we can store and access data.  the second is <br/>\n&gt; performance test, whether the data server can handle the load.  For <br/>\n&gt; the first instance, we can use the data generated by the test models <br/>\n&gt; above, and put a test framework around testing the data integrity and <br/>\n&gt; access of the data server.  For performance test, we need to simulate <br/>\n&gt; multiple client accesses over the network, with simulated time <br/>\n&gt; delays, varying loads etc.<br/>\n<br/>\n </span></blockquote>Long Answer:<br/>\nTry thinking in smaller chunks.  Take one &quot;unit&quot; of code and test it.  Measure the time it takes you to test, what you had to change in order to test it, and so on.  Do this exercise 10 or 20 times.  At the end of that you will have a good idea whether or not you want to integrate JUnit into your development cycle.<br/>\n<br/>\nShort Answer:<br/>\n<blockquote><span title=\"ireply\"> &gt; Looking foward to your suggestions?<br/>\n </span></blockquote>Unless there are time and money constraints (and possibly some other types of constraints) JUnit will be helpful to you if you are writing Java code.<br/>\n<br/>\n-- <br/>\nJason Rogers<br/>\n<br/>\n&quot;Where there is no vision, the people perish...&quot;<br/>\nBible, Proverbs 29:18</div>", 
    "prevInTime": 10592, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1078474273", 
    "canDelete": false, 
    "nextInTopic": 10594, 
    "prevInTopic": 10592, 
    "headers": {
        "inReplyToHeader": "PGMyODk1bCtwZzkxQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDEwNzg0NzQyNzMuMTgwMTguNS5jYW1lbEBlYW51cy5yaXNrbWV0cmljcy1hYS5yaXNrbWV0cmljcy5jb20+", 
        "referencesHeader": "PGMyODk1bCtwZzkxQGVHcm91cHMuY29tPg=="
    }
}