{
    "numMessagesInTopic": 2, 
    "nextInTime": 10632, 
    "senderId": "6eFmetOXGP7gMt8Jmeid2hp0CFniLr5sscyNbKH-YtQWeUZNXAfJJByqk6Ai_-MrTVApfdnQLK6eXivnCqbKx4YZ2frgMbJqxrEu1K3E", 
    "systemMessage": false, 
    "subject": "Classloader problems", 
    "from": "&quot;Stewart Gebbie&quot; &lt;stewartg@...&gt;", 
    "authorName": "Stewart Gebbie", 
    "msgSnippet": "Hi, I am currently developing using JUnit as my test harness. I was creating a custom URL protocol handler and ran into problems. Ultimately I linked my ", 
    "msgId": 10631, 
    "topicId": 10631, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 179086068, 
    "messageBody": "<div id=\"ygrps-yiv-1009456626\">Hi,<br/>\n<br/>\nI am currently developing using JUnit as my test harness. I was creating a<br/>\ncustom URL protocol handler and ran into problems. Ultimately I linked my<br/>\nproblems to JUnits custom classloader and I am able to dodge the issue by<br/>\nusing the text UI or using -noloading with the GUI.<br/>\n<br/>\nThe symptom I experienced was a class variable (static variable) that was<br/>\nbeing initialised twice. This was frustrating since other constraints required<br/>\nthe use of static variables and thread-local storage.<br/>\n<br/>\nMy best analysis is that my first access to the class was handled by JUnits<br/>\nclassloader, but that the second access was handled by the default classloader<br/>\nsince it was loaded by code in rt.jar (namely the URL protocol handler<br/>\nbootstrap mechanism). Since the second access used the default classloader,<br/>\nthe JUnit classloader was not queried to check if the class was already<br/>\nloaded. The end result being that my static variable was reset to its default<br/>\nvalue.<br/>\n<br/>\nAfter reading about related bugs I realise that the general issue with the<br/>\nclassloader had already been discussed. I would like to know if there is<br/>\nactive development with respect to this issue and if it is likely to make it<br/>\ninto a pending release?<br/>\n<br/>\nThanks<br/>\nStewart<br/>\n<br/>\n-- <br/>\nStewart Gebbie</div>", 
    "prevInTime": 10630, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1079424461", 
    "canDelete": false, 
    "nextInTopic": 10649, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDIwMDQwMzE2MDgwNzQxLkdGMjk2OTRAc3Rld2FydC5sYW4+"
    }
}