{
    "numMessagesInTopic": 2, 
    "nextInTime": 10667, 
    "senderId": "xWlBVSedk0Ms_SrbU_y_z6B4HudPJb8QNn5gyUK6VNvzQhIpoIcvZWYkBezjzY329JMFxXHO7NEMgHUqqaTRo16aOmEuNg", 
    "systemMessage": false, 
    "subject": "Re: [junit] Parasoft JTest", 
    "from": "&quot;David Vydra&quot; &lt;david@...&gt;", 
    "authorName": "David Vydra", 
    "msgSnippet": "I think your analysis is correct. My experience shows that test-first is the most productive way to develop, especially when you take into account design ", 
    "msgId": 10666, 
    "profile": "dvydra2", 
    "topicId": 10622, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 21744742, 
    "messageBody": "<div id=\"ygrps-yiv-402893056\">I think your analysis is correct. My experience shows that test-first is the<br/>\nmost productive way to develop, especially when you take into account design<br/>\nquality and reduced debugging time. Truth is, even with the best intentions,<br/>\ndevelopers miss tests that can be created by such tools. My current thinking<br/>\nis that I definately want to drive the main use-cases via test-first, but I<br/>\nmay let the tools create certain boundary condition tests for me - if I like<br/>\nthe code they generate.<br/>\n<br/>\nAnother tool maker to watch in this space is Agitar.<br/>\n<br/>\nRegards,<br/>\nDavid<br/>\n<br/>\n-----------------<br/>\n&quot;Stedak&quot; &lt;sketcham at dsicdi dot com&gt;<br/>\n<br/>\nHello!<br/>\n<br/>\nDoes anyone have any thoughts or experience with Parasoft&#39;s JTest<br/>\nproduct? It is integrated with Eclipse to use JUnit.<br/>\n<br/>\nOn the upside I see that there is the knowledge that at least some<br/>\nunit testing is being done to all code. Most of the developers here<br/>\ndo not test.<br/>\n<br/>\nOn the downside (my personal opinion), test-writing first or at least<br/>\nat the same time as coding is much more effective than test-writing<br/>\nafter the fact. Code written without testing in mind is not very<br/>\ntestable. I don&#39;t see how JTest can help there although the code<br/>\nstandards module would seem to help.<br/>\n<br/>\n<br/>\nFor those who don&#39;t know, Parasoft&#39;s JTest is a tool to automatically<br/>\ngenerate tests for your code. It does a number of other things also.</div>", 
    "prevInTime": 10665, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1079648062", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 10622, 
    "headers": {
        "messageIdInHeader": "PDAzNjgwMWM0MGQzNiQ1ZTY4ZmI3MCQ2NTAxYThjMEBYUDE+"
    }
}