{
    "numMessagesInTopic": 3, 
    "nextInTime": 10665, 
    "senderId": "4s7xqN7_dajdeb1dfQl2gy80_OKb1PVTITViCocHAN2Qk9sGzitZzgbbKgkU4gPZCM8fAMhh9myheWCxo2TFI19QiOhgDFWt9MrMTfGigQ", 
    "systemMessage": false, 
    "subject": "Again... with testing interfaces...", 
    "from": "&quot;Thomas Robbs&quot; &lt;thomas.robbs@...&gt;", 
    "authorName": "Thomas Robbs", 
    "msgSnippet": "Imagine an interface I.  Class X implements I.  Class Y extends X. With my current use of Junit, I ve taken the Inner Test Class for implemented interfaces", 
    "msgId": 10664, 
    "profile": "trobbs2", 
    "topicId": 10664, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 151117042, 
    "messageBody": "<div id=\"ygrps-yiv-1812866678\">Imagine an interface I.  Class X implements I.  Class Y extends X.<br/>\n<br/>\nWith my current use of Junit, I&#39;ve taken the &quot;Inner Test Class for<br/>\nimplemented interfaces&quot; route.  That is, and I&#39;ll prefix test classes w/<br/>\na T...<br/>\n<br/>\nTX extends TestCase<br/>\nTX has an inner test class, TI<br/>\n<br/>\nTX&#39;s suite includes TX and TX.TI<br/>\n<br/>\nI&#39;m running into a situation where I&#39;d like to have the factory method<br/>\nin TI to create an instance of X.  No problem, create a new instance and<br/>\nreturn.<br/>\n<br/>\nHowever, when I get to Y, obviously it&#39;s still going to be creating an<br/>\ninstance of X.  What I&#39;d really like to do is have the factory method in<br/>\nTI call the factory method in TX to create an instance of X.  Thus, in<br/>\nTY, I would simply override this method and return an instance of Y<br/>\ninstead.  This would allow me to execute TY which would run TY&#39;s tests,<br/>\nTX&#39;s tests, and TI&#39;s tests all against an instance of Y.<br/>\n<br/>\nQuestions:<br/>\n<br/>\n1. How do I build the suite in TY?<br/>\n2. How can I properly link the factory methods so that I can properly<br/>\noverride them?<br/>\n\t- e.g. previously, I tried - TI.createI() would call<br/>\nTX.createX().  I can&#39;t do this<br/>\n\tas when I get to TY, TI is still referencing TX through a static<br/>\nreference.<br/>\n<br/>\nMy problem with the inner class approach is that I would have to<br/>\nreimplement a TI for each subclass of X to ensure that that subclass<br/>\ndidn&#39;t break the contract of I by overriding methods, etc.<br/>\n<br/>\nDue diligence on the human side would allow me to avoid any complex<br/>\nautomation of test inheritance, but humans forget and this will<br/>\nhopefully allievate the problems when humans forget.<br/>\n<br/>\nMaybe I&#39;m approaching this all wrong.  A fresh set of eyes would be<br/>\nhelpful.<br/>\n<br/>\nI&#39;ve read mentions of using a parameterized test case, but I&#39;m not<br/>\nfinding examples that fit the context of my problem.<br/>\n<br/>\nAny help would be great!<br/>\n<br/>\nThanks,<br/>\n<br/>\nTom</div>", 
    "prevInTime": 10663, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1079634376", 
    "canDelete": false, 
    "nextInTopic": 10672, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PENDNzdCMzg1NzYzN0VFNENCNzZFQTg0MjdCMThGMEI1MTAyNkMyQG1haW4tc3J2LmNhc2Vyby5jb20+"
    }
}