{
    "numMessagesInTopic": 7, 
    "nextInTime": 10796, 
    "senderId": "BP0hCT-SAnO412UPGdm6CuO7Tc6AwZZgOVdKbvE19Xkm3WEduw0w1G_s3aLLGUppYsdjWqQudhOKNr_CuBjQPWPDR5ZNXbHIQcVyVh_5", 
    "systemMessage": false, 
    "subject": "RE: [junit] Best practice - should I fake, or depend on real worl\td objects?", 
    "from": "Jonathan Oddy &lt;j.oddy@...&gt;", 
    "authorName": "Jonathan Oddy", 
    "msgSnippet": "... track? ... The later (is that the right answer?) I am trying to test some behaviour that requires the services of some other class A , my problem with", 
    "msgId": 10795, 
    "profile": "jonathanoddy", 
    "topicId": 10795, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124029770, 
    "messageBody": "<div id=\"ygrps-yiv-1517970331\">JB responded:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Jonathan Oddy wrote:<br/>\n&gt; <br/>\n&gt;&gt; Does this seem like a resonable direction to be going - or am I setting<br/>\n&gt;&gt; myself up for an unpleasant (unforseen) fall somewhere later down the<br/>\n </span></blockquote>track?<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n&gt;&gt; Any thoughts/criticisms welcome.<br/>\n&gt;<br/>\n&gt; Quick question: what are you trying to test? Deserialization? or using <br/>\n&gt; the deserialized object? Both? <br/>\n<br/>\n </span></blockquote>The later (is that the right answer?) I am trying to test some behaviour<br/>\nthat requires the services of some other class &quot;A&quot;, my problem with faking<br/>\n&quot;A&quot; is that there are (potentially) lots of methods within &quot;A&quot; that I might<br/>\nlike to use within the behaviour under test/implementation.  If I go the<br/>\nfake route (which I do reasonably regularly) then I have to fake *all* of<br/>\nthe methods that I am interested in, granted I can produce a whole host of<br/>\nfactory methods to create these fakes (and have for certain classes and<br/>\nuses) but in this instance there appears to be a lot of extra work here for<br/>\nnot much gain, especially when there is a real risk that my fake *might*<br/>\nintroduce some assumption that is clearly wrong, or an assumption that was<br/>\ncorrect until I changed the actual implementation of &quot;A&quot; for some other fix.<br/>\nI have already been biten by this (which probably says more about me than it<br/>\nshould...) and spent longer than I wished tracking down the fault in some<br/>\nproduction code.<br/>\n<br/>\nI have a number of deserialisation tests for those classes being<br/>\ndeserialised - so that&#39;s not what I am testing here.  I am simply using the<br/>\nfact that I &quot;know&quot; I have a &quot;working&quot; deserialisation process on some class<br/>\n&quot;A&quot; to speed up my test creation process.  It is much easier to data-scrape<br/>\nan objects serialised form from a log file and use an object constructed<br/>\nfrom that within my test than to fake it.  At least when using a<br/>\ndeserialised instance, I am using a first class object with no assumptions<br/>\nhardcoded (other than those within the class itself).  I do concede that I<br/>\nam coding assumptions via the data that the object is being populated from.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; (Do you get the hint in the question?)<br/>\n </span></blockquote>Not today, my brain hurts thanks to &quot;young-children-not-sleeping-syndrome&quot;.<br/>\n<br/>\nMy gut feeling is, as the other responder suggested, to do both and chose<br/>\nthe appropriate form for the situation currently being worked upon.<br/>\n<br/>\nJonathan</div>", 
    "prevInTime": 10794, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1081328984", 
    "canDelete": false, 
    "nextInTopic": 10798, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PEU1Qzc5MDQ5RDQ2MUQzMTFCODMxMDAwNjI5NTBCNTRBMDEyN0M0NkVAbnQtc3RvYy0wLnNicz4="
    }
}