{
    "numMessagesInTopic": 3, 
    "nextInTime": 10871, 
    "senderId": "-WGkVQBTerZNLFcEEMxZVM5CH42ZecVqu6aYOb6nhPdxDQ29TnZnrPALO_G1M-pUpJw0NnEKFx6xp3ai81l4_bnLXhrDPiAHVa531za9gko", 
    "systemMessage": false, 
    "subject": "JUnit report for multiple runs of a single class", 
    "from": "&quot;junit_rinaldi&quot; &lt;junit_rinaldi@...&gt;", 
    "authorName": "junit_rinaldi", 
    "msgSnippet": "I am able to run multiple instances of a single JUnit class to test projects.  In order to do this, the JUnit class runs an instance of a program and", 
    "msgId": 10870, 
    "profile": "junit_rinaldi", 
    "topicId": 10870, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 183107491, 
    "messageBody": "<div id=\"ygrps-yiv-1517137355\">I am able to run multiple instances of a single JUnit class to test<br/>\nprojects.  In order to do this, the JUnit class runs an instance of a<br/>\nprogram and determines whether it passes or fails.  Only one class is<br/>\nneeded because I can pass different projects and achieve the results. <br/>\nCreating multiple classes in this case is wasteful because all the<br/>\nsame code would be reused with the exception of the name of the<br/>\nclass.  However, because only a single class is used, the JUnit<br/>\nreport  option when running ANT cannot determine the difference<br/>\nbetween runs - it only knows it is another run of the same class.<br/>\n<br/>\nHow could I utilize the built in capabilities for reporting with only<br/>\nthat single class?   I am not familiar with what information is picked<br/>\nup upon compilation of the report.  Perhaps there is a way to &quot;fool&quot;<br/>\nthe software into thinking they are actually separate classes since<br/>\nthey are completely separate tests that I&#39;ve had create their own<br/>\nseparate XML output.  I am attempting to be platform independent,<br/>\nhowever, I may need to implement modifications with a shell script and<br/>\nlater duplicate similar actions in a batch script for windows.<br/>\n<br/>\nIn general, the output shows that there were a certain number of<br/>\ntests, but because the same class is used, the &lt;class&gt;.html file is<br/>\noverwritten along with other helpful output information.  This leaves<br/>\nonly the output for the last test run.<br/>\n<br/>\nIf anyone knows a good method for getting around this JUnit<br/>\nlimitation, please let me know!!!<br/>\n<br/>\nDavid</div>", 
    "prevInTime": 10869, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1082134434", 
    "canDelete": false, 
    "nextInTopic": 10873, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGM1cDMzMit2YmoyQGVHcm91cHMuY29tPg=="
    }
}