{
    "numMessagesInTopic": 17, 
    "nextInTime": 11101, 
    "senderId": "1bqde6b6Ch5V58z0F4N8ZP5fFZjcIHlAJFbBnlntvqhrl_2ynoWwadFZ0Dwuplh77iIJ_E-x038lciC2fDQlkMVpoazyXXZ5CoXdMg", 
    "systemMessage": false, 
    "subject": "Perform something before and after a complete test", 
    "from": "&quot;haefeleuser&quot; &lt;haefeleuser@...&gt;", 
    "authorName": "haefeleuser", 
    "msgSnippet": "I have written a class called XyzTestCase which extends TestCase. This has various reasons, for example because I needed to overwrite runBare method. Now I", 
    "msgId": 11100, 
    "profile": "haefeleuser", 
    "topicId": 11100, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174752849, 
    "messageBody": "<div id=\"ygrps-yiv-127585729\">I have written a class called XyzTestCase which extends TestCase.<br/>\n<br/>\nThis has various reasons, for example because I needed to overwrite <br/>\nrunBare method.<br/>\n<br/>\nNow I come to a limit and I don&#39;t know if it is possible.<br/>\n<br/>\nI want to perform something before the tests start. After all tests <br/>\nof a class have finished I want to perform another thing. Overwriting <br/>\ntearDown does not work for this requirement, it occurs too often. <br/>\nWhen the last test has finished I want to perform something. But it <br/>\nneeds to be within JUnit, not outside of it.<br/>\n<br/>\nSo I tried to put this inte XyzTestCase. Its easy to perform <br/>\nsomething before every test started. I simply put it into a static <br/>\nconstructor. But how can I perform something after every test has <br/>\nfinished? I tried to overwrite various methods of the upper class <br/>\nTestCase, but it didn&#39;t help. They were called too frequently or not <br/>\nat all.<br/>\n<br/>\nCan you please help me?</div>", 
    "prevInTime": 11099, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1086184930", 
    "canDelete": false, 
    "nextInTopic": 11103, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGM5a21sMitxaTU0QGVHcm91cHMuY29tPg=="
    }
}