{
    "numMessagesInTopic": 9, 
    "nextInTime": 11135, 
    "senderId": "Vv0AIsenuL63ZjJvhsrH56F7UK41TCjbsCCZXP9aRFPGZnmIS-4tdB8KSrs6fSo6FYUJUyRunvqbt7fK_ZEJVotwDaks2rEuFX69YXpUPw", 
    "systemMessage": false, 
    "subject": "Re: [junit] using JUnit with derived classes", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... It s an interesting notion, and one I can t argue away very easily. I suppose I am a victim of my own preconceptions. (Could I really be a dinosaur", 
    "msgId": 11134, 
    "rawEmail": "Return-Path: &lt;jbrains@...&gt;\r\nX-Sender: jbrains@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 59196 invoked from network); 7 Jun 2004 11:06:25 -0000\r\nReceived: from unknown (66.218.66.166)\n  by m23.grp.scd.yahoo.com with QMQP; 7 Jun 2004 11:06:25 -0000\r\nReceived: from unknown (HELO fep03-mail.bloor.is.net.cable.rogers.com) (66.185.86.73)\n  by mta5.grp.scd.yahoo.com with SMTP; 7 Jun 2004 11:06:25 -0000\r\nReceived: from [192.168.1.112] ([24.156.43.226])\n          by fep03-mail.bloor.is.net.cable.rogers.com\n          (InterMail vM.5.01.05.12 201-253-122-126-112-20020820) with ESMTP\n          id &lt;20040607110552.BKYH392202.fep03-mail.bloor.is.net.cable.rogers.com@[192.168.1.112]&gt;\n          for &lt;junit@yahoogroups.com&gt;; Mon, 7 Jun 2004 07:05:52 -0400\r\nMessage-ID: &lt;40C44C2B.2050309@...&gt;\r\nDate: Mon, 07 Jun 2004 07:06:19 -0400\r\nUser-Agent: Mozilla Thunderbird 0.6 (Windows/20040502)\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: junit@yahoogroups.com\r\nReferences: &lt;c7tsu3+fcsb@...&gt; &lt;40A2ACF7.9030704@...&gt; &lt;Pine.NEB.4.58.0405251309540.9233@...&gt; &lt;40B3829A.2040603@...&gt; &lt;Pine.NEB.4.58.0406071217050.448@...&gt;\r\nIn-Reply-To: &lt;Pine.NEB.4.58.0406071217050.448@...&gt;\r\nContent-Type: text/plain; charset=us-ascii; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-Authentication-Info: Submitted using SMTP AUTH PLAIN at fep03-mail.bloor.is.net.cable.rogers.com from [24.156.43.226] using ID &lt;jbrains@...&gt; at Mon, 7 Jun 2004 07:05:52 -0400\r\nX-eGroups-Remote-IP: 66.185.86.73\r\nFrom: &quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;\r\nSubject: Re: [junit] using JUnit with derived classes\r\nX-Yahoo-Group-Post: member; u=127224993\r\nX-Yahoo-Profile: nails762\r\n\r\nCurt Sampson wrote:\n\n&gt; On Tue, 25 May 2004, J. B. Rainsberger wrote:\n&gt; \n&gt;  &gt; I don&#39;t like the built-in assumption that tests belong to production\n&gt;  &gt; code. A test is just another client of the production code....\n&gt; \n&gt; While the test code is generally not run in production systems, I think\n&gt; of the unit tests as an essential, integral part of any chunk of code.\n&gt; Leaving out unit tests would be like--well, leaving out large chunks of\n&gt; the code itself. Code without tests is only half-written code.\n&gt; \n&gt; So in that sense, to me, if you&#39;re going to be using files for storage\n&gt; of code units anyway, putting the tests in a separate file seems akin to\n&gt; just chopping the class randomly in half, and putting half in one file,\n&gt; and half in the other. After all, from a TDD programmer&#39;s point of view,\n&gt; the tests and code are an inseparable chunk.\n\nIt&#39;s an interesting notion, and one I can&#39;t argue away very easily. I \nsuppose I am a victim of my own preconceptions. (Could I really be a \ndinosaur already?!) To me, tests are clients of production code, and \ntests are separate classes from production code, and in Java separate \nclasses go into separate files, therefore... well, the conclusion is clear.\n\n&gt;  &gt; ...and clients do not belong to providers. The implied dependency is\n&gt;  &gt; in the wrong direction and generally that way lie dragons.\n&gt; \n&gt; In fact, as I&#39;ve been doing more and more acceptance testing, I am\n&gt; seeing more and more cases where the code is merely a subservient\n&gt; dependency on the test.\n\nI think we are using different definitions of &quot;dependency.&quot;\n\nTo reword your statement, we programmers are merely code generators, \nusing the test cases as source and producing production code that passes \nthe test cases. The &quot;dependency&quot; is there: the production code we write \nmust pass the tests. There is a certain logical link, then, from the \ntests to the production code; however, production code does not depend \non the tests, meaning that production classes do not hardcode \ndependencies on test classes. At worst, production classes depend on \ninterfaces that Testing Objects might implement, but even then, it&#39;s \nonly a test that wires the production object and Testing Object together.\n\nJust because we write production code in response to test code doesn&#39;t \nmean that the production code /depends on/ (in the Java sense) the test \ncode.\n\n &gt; The tests are, after all, where we specified\n&gt; just what the code is to do, and where most of hard work (design and\n&gt; specification) was done. If you remove all the code, it can relatively\n&gt; easily be recreated, so long as you have those tests. If you delete the\n&gt; tests, you now have a pile of code with no specification of what it\n&gt; should do, only some behaviour that you can&#39;t safely modify. Losing the\n&gt; tests and keeping the code is akin in this case to losing your source\n&gt; code and being left only with compiled binaries.\n\nExactly: binaries do not depend on source code in the same way that test \ncode does not depend on production code. Instead, we generate one from \nthe other.\n\n&gt;  &gt; &gt; I don&#39;t see what the problem with [including tests in production\n&gt;  &gt; &gt; code] is. It might cause a bit of code bloat, but that&#39;s often not a\n&gt;  &gt; &gt; problem in many projects.\n&gt;  &gt;\n&gt;  &gt; I disagree with the notion that code bloat is not a common problem.\n&gt;  &gt; Refactoring exists in part because of code bloat.\n&gt; \n&gt; Actually, &quot;code bloat&quot; was possibly the wrong term to use here. I\n&gt; was refering to things like your distribution files getting larger.\n&gt; For example, the JAR files I roll out into production often include\n&gt; compiled versions of all of the unit tests, even though that code is not\n&gt; necessary in production. That may make my JAR file twice the size it\n&gt; would be otherwise, but in most circumstances I don&#39;t really care enough\n&gt; to do the work to try to remove the test code.\n\nI see what you mean. I suppose it&#39;s a question of taste, and maybe it&#39;s \na good sign. We have /encouraged/ projects to deliver their tests with \ntheir production code, so I suppose I should be happy. Still, we don&#39;t \nwant to introduce unnecessary dependencies (production -&gt; tests) and so \nit&#39;s a worthwhile exercise to /be able to/ package the production code \nentirely without tests.\n\n&gt;  &gt; &gt;  &gt; This brings up something I am struggling with: in C#/NUnit, we can\n&gt;  &gt; &gt;  &gt; declare a test without extending TestCase (even if we frequently \n&gt; extend\n&gt;  &gt; &gt;  &gt; Assert, anyway). Is there some great benefit to this over the \n&gt; way we do\n&gt;  &gt; &gt;  &gt; it in JUnit, SUnit, RubyUnit, PyUnit, ...?\n&gt;  &gt;...\n&gt;  &gt; I know it&#39;s possible, but I don&#39;t know why it&#39;s valuable. Can someone\n&gt;  &gt; with experience doing both make a comparison? Weblog? Anything?\n&gt; \n&gt; I think it&#39;s valuable because it gives you a lot more leway to play with\n&gt; the design of your testing framework within a particular application. I\n&gt; know that I often feel that certain refactoring directions I&#39;d like to\n&gt; try are closed to me because of the fairly strict structure of the JUnit\n&gt; testing framework.\n\nDo you have a specific example? Given that the structure (hierarchy) of \ntest classes does not need to reflect the structure of production \nclasses, what kinds of refactorings are difficult in JUnit but easy in \nNUnit? This is the kind of thing I need to explore, because my JUnit \npreconceptions hold me back when thinking in NUnit. You could jump-start \nme. :)\n\n&gt; A &quot;pain&quot; that I&#39;ve been feeling over the last few years has been the\n&gt; tension between code that is in an external library, and code that is\n&gt; in &quot;my&quot; source repository. For some things, the pain is bad enough, and\n&gt; my need for flexability strong enough, that I just import the source\n&gt; code for the external package and effectively start maintaining it\n&gt; myself. This introduces a maintenance load, however, if I&#39;m also going\n&gt; to track the changes from the external package. I think that being\n&gt; given more flexability in how one interfaces with an external chunk of\n&gt; code lessens this tension. That&#39;s one thing that has, over the past few\n&gt; years, started driving me away from the very static and declarative Java\n&gt; model (&quot;this interaface is declared as such, and may only be used in\n&gt; this way&quot;) more towards the Smalltalk model, where an interface can be\n&gt; thought of as any group of messages that one object sends to another.\n\nI want to know more of what&#39;s in here. When you have the time, energy \nand patience, pick a concrete example then write an article. Please. I \nwant to read it!\n\n&gt; I&#39;m sure that this message is not terribly clear; my thoughts on this\n&gt; topic are actually not terribly well formed at this time. But perhaps it\n&gt; gives you an inkling of what I&#39;m grasping towards here.\n\nAn inkling, but now that you&#39;ve whet my appetite, I want more....\n-- \nJ. B. Rainsberger,\nDiaspar Software Services\nhttp://www.diasparsoftware.com :: +1 416 791-8603\nLet&#39;s write software that people understand\n\n", 
    "profile": "nails762", 
    "topicId": 11010, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "prevInTime": 11133, 
    "contentTrasformed": false, 
    "postDate": "1086606379", 
    "canDelete": false, 
    "nextInTopic": 11143, 
    "prevInTopic": 11132, 
    "headers": {
        "inReplyToHeader": "PFBpbmUuTkVCLjQuNTguMDQwNjA3MTIxNzA1MC40NDhAYW5nZWxpYy12dGZ3LmN2cG4uY3luaWMubmV0Pg==", 
        "messageIdInHeader": "PDQwQzQ0QzJCLjIwNTAzMDlAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PGM3dHN1MytmY3NiQGVHcm91cHMuY29tPiA8NDBBMkFDRjcuOTAzMDcwNEByb2dlcnMuY29tPiA8UGluZS5ORUIuNC41OC4wNDA1MjUxMzA5NTQwLjkyMzNAYW5nZWxpYy12dGZ3LmN2cG4uY3luaWMubmV0PiA8NDBCMzgyOUEuMjA0MDYwM0Byb2dlcnMuY29tPiA8UGluZS5ORUIuNC41OC4wNDA2MDcxMjE3MDUwLjQ0OEBhbmdlbGljLXZ0ZncuY3Zwbi5jeW5pYy5uZXQ+"
    }
}