{
    "numMessagesInTopic": 10, 
    "nextInTime": 11147, 
    "senderId": "zQWz3HVhf-3DTcgQ46_IavaBLmNAD4HHU1vGubgOmmArFTW7YlWxeQW-OfNMHuNiEqIGUOrbmZ90UHVQhFT8Tf1uymLLe-YMt6XiLD-csw", 
    "systemMessage": false, 
    "subject": "Re: [junit] UI testing am I being lazy?", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... I don t like to write End to End tests; however, when someone returns me a defect, I have to admit that I missed something, and to punish myself, I do", 
    "msgId": 11146, 
    "profile": "nails762", 
    "topicId": 11135, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-602594928\">Jonathan Oddy wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Dear All,<br/>\n&gt; <br/>\n&gt; A while ago I started looking at using one of the frameworks available for<br/>\n&gt; testing UI code (of a traditional desktop app) and starting using one<br/>\n&gt; (abbot).  Primarily I used it to help test drive the implementation of<br/>\n&gt; various listeners required within a couple of dialogs I was writing.  Whilst<br/>\n&gt; slowing down the unit test process (because it renders a UI and &quot;robots&quot; the<br/>\n&gt; user control) it&#39;s worked pretty well for me. <br/>\n&gt; <br/>\n&gt; Now I come to the validation process and I have received a number of bugs to<br/>\n&gt; fix (no big deal) but my question is how much should I drive my bug fixing?<br/>\n&gt; Normally (prior to abbot) I&#39;d dig about my code to locate the appropriate<br/>\n&gt; code, create a test case (or cases) to highlight the bug and drive the fix<br/>\n&gt; appropriately.  Now I have a UI fault that is easy to reproduce - and I&#39;ve<br/>\n&gt; created a test case using abbot to highlight the fault, and can now dig<br/>\n&gt; through the code and fix it... but... this fault (as with a couple of other<br/>\n&gt; UI faults) resolves down to a failing implementation of some<br/>\n&gt; DocumentListener logic. <br/>\n&gt; <br/>\n&gt; So should I (would you) keep TDD the fix via the high level UI test case, or<br/>\n&gt; drill down and write &quot;lower&quot; level test cases for the DocumentListener<br/>\n&gt; implementation.  The former helps solve the current bug, the later also<br/>\n&gt; fixes the bug but has better coverage of the listener (which could be/is<br/>\n&gt; reused)?  Or should I duplicate the test to test both the UI working<br/>\n&gt; correctly and the listener being implemented correctly?  I don&#39;t like the<br/>\n&gt; idea of duplication, and I prefer using non UI tool testing (because of the<br/>\n&gt; quicker round trip effect), but it seems that I probably do need both tests,<br/>\n&gt; or am I missing something?<br/>\n<br/>\n </span></blockquote>I don&#39;t like to write End to End tests; however, when someone returns me <br/>\na defect, I have to admit that I missed something, and to punish myself, <br/>\nI do things I don&#39;t like. I do this:<br/>\n<br/>\n1. write a failing end to end test that shows the defect<br/>\n2. test-drive the fix<br/>\n<br/>\nDo you need both tests? No. But in the long run, and as a general <br/>\npractice, you /want/ both tests.<br/>\n-- <br/>\nJ. B. Rainsberger,<br/>\nDiaspar Software Services<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com\">http://www.diasparsoftware.com</a> :: +1 416 791-8603<br/>\nLet&#39;s write software that people understand</div>", 
    "prevInTime": 11145, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1086646290", 
    "canDelete": false, 
    "nextInTopic": 11148, 
    "prevInTopic": 11138, 
    "headers": {
        "inReplyToHeader": "PEU1Qzc5MDQ5RDQ2MUQzMTFCODMxMDAwNjI5NTBCNTRBMDEyN0M0RjVAbnQtc3RvYy0wLnNwLnNlcnZpY2Vwb3dlci5jb20+", 
        "messageIdInHeader": "PDQwQzRFODEyLjgwOTA1MDFAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PEU1Qzc5MDQ5RDQ2MUQzMTFCODMxMDAwNjI5NTBCNTRBMDEyN0M0RjVAbnQtc3RvYy0wLnNwLnNlcnZpY2Vwb3dlci5jb20+"
    }
}