{
    "numMessagesInTopic": 4, 
    "nextInTime": 11160, 
    "senderId": "1mo-wzQ3NBS5g3jfEtzzkw1Cg31hxIY38ZRvFcVMbelOOyEaUdS8xWb0YGXq3cutSWSbvy5l78rz9vGnhoyKfNS2-HoWf6HHUKM1", 
    "systemMessage": false, 
    "subject": "Re: [junit] Do i really need to write a Test Class ????", 
    "from": "Curt Sampson &lt;yahoo_sucks@...&gt;", 
    "authorName": "Curt Sampson", 
    "msgSnippet": "... Take a look at my recent Ruby example under the subject using JUnit with derived classes and tell me if that s the kind of thing you re thinking about. ", 
    "msgId": 11159, 
    "profile": "cjstokyo", 
    "topicId": 11151, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 110189933, 
    "messageBody": "<div id=\"ygrps-yiv-1921863741\">On Mon, 7 Jun 2004, Girish Patil wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  WHAT IF I GENERATE THE TEST CLASSES DYNAMICALLY WHERE<br/>\n&gt; I JUST GIVE CALLS TO ACTUAL  METHODS WITH ALL POSSIBLE<br/>\n&gt; COMBINATIONS WITH OUT WRITTING TEST CODE.<br/>\n<br/>\n </span></blockquote>Take a look at my recent Ruby example under the subject &quot;using JUnit<br/>\nwith derived classes&quot; and tell me if that&#39;s the kind of thing you&#39;re<br/>\nthinking about.<br/>\n<br/>\nIf not, you&#39;ll need to give me another explaination with more detail. It<br/>\nwould help greatly if you provided a complete (though not necessarially<br/>\nlarge) code example indicating exactly what lines are the lines of<br/>\nrepetitive code you want to get rid of.<br/>\n<br/>\nIf so, you&#39;re basically just SoL in Java; the language is so inflexible<br/>\nthat you&#39;re forced into writing a lot of repetitive code. According<br/>\nto Paul Graham, Lisp- and Scheme-like languages offer you the best<br/>\nchance of being able to move beyond this, by essentially writing custom<br/>\nprogramming languages within the language for particular purpose you<br/>\nhave in mind. After a year or so of looking at this, I&#39;m coming into<br/>\nviolent agreement with him. I&#39;ve been looking at Ruby to see how one<br/>\nmight do things better while still being enough like Java that other<br/>\nprogrammers can transition to it easily.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I CAN GENERATE TEST CALLS TO THESE METHODS DYNAMICALLY<br/>\n&gt; AND TEST THEIR VALIDITY<br/>\n<br/>\n </span></blockquote>I&#39;ve given up as a lost cause any serious work in dynamic code<br/>\ngeneration directly in Java. Either you use reflection, which is so<br/>\nprolix anyway that you need to be generating a lot of code to make it<br/>\nworthwhile, or you write a preprocessor for a custom language, which is<br/>\na pain.<br/>\n<br/>\nThe only thing that&#39;s really saved my sanity in the last year or so has<br/>\nbeen anonymous inner classes that extend other classes.<br/>\n<br/>\nAs an exercise, if anybody&#39;s interested in approaching this, try writing<br/>\na class that includes a state machine, and testing it thoroughly,<br/>\nespecially for allowable transitions from and to each state. I found<br/>\ntesting this pretty painful last time I had to do it.<br/>\n<br/>\ncjs<br/>\n-- <br/>\nCurt Sampson  &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cjs@...\">cjs@...</a>&gt;   +81 90 7737 2974   <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.NetBSD.org\">http://www.NetBSD.org</a><br/>\n    Don&#39;t you know, in this new Dark Age, we&#39;re all light.  --XTC</div>", 
    "prevInTime": 11158, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1086735018", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 11156, 
    "headers": {
        "inReplyToHeader": "PDIwMDQwNjA4MDYzNzA3LjY5NzA5LnFtYWlsQHdlYjE0OTI4Lm1haWwueWFob28uY29tPg==", 
        "messageIdInHeader": "PFBpbmUuTkVCLjQuNTguMDQwNjA5MDcyNTE1MC40NjFAYW5nZWxpYy12dGZ3LmN2cG4uY3luaWMubmV0Pg==", 
        "referencesHeader": "PDIwMDQwNjA4MDYzNzA3LjY5NzA5LnFtYWlsQHdlYjE0OTI4Lm1haWwueWFob28uY29tPg=="
    }
}