{
    "numMessagesInTopic": 5, 
    "nextInTime": 11248, 
    "senderId": "u57g6F2ECJ9SJwnYIEq1z-KN41-z95NgrwKbvKExrxDOBpr-sGJLdUb7obVAvo6ODnVLUYd1Vlg22nwoLp8vUT4jlVdBq2EfqnIqHQ", 
    "systemMessage": false, 
    "subject": "Beyond JUnit - talk at JavaOne", 
    "from": "&quot;albsavoia&quot; &lt;albsavoia@...&gt;", 
    "authorName": "albsavoia", 
    "msgSnippet": "Fellow JUnit users/fan, I am going to be giving a talk at JavaOne (next week in SF) on the future of unit/developer testing for Java. I was fortunate enough to", 
    "msgId": 11247, 
    "profile": "albsavoia", 
    "topicId": 11247, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174158319, 
    "messageBody": "<div id=\"ygrps-yiv-1830560640\">Fellow JUnit users/fan, I am going to be giving a talk at JavaOne <br/>\n(next week in SF) on the future of unit/developer testing for Java. <br/>\n<br/>\nI was fortunate enough to spend some time with Kent Beck while <br/>\npreparing it, and he actually gave me material and suggestions for <br/>\nsome of the slides and concepts.<br/>\n<br/>\nUnfortunately, I got stuck with a very tough time slot (afternoon of <br/>\nthe last day of the conference) and I don&#39;t know how many people <br/>\nwill manage to stick around after 4 days of Java tech talks :-).<br/>\n<br/>\nSo, if you are attending JavaOne, or have friends/colleagues <br/>\nattending, please try to show up so we can let the JavaOne <br/>\norganizers that there is enough interest in developer/unit testing <br/>\nand JUnit to give this kind of topic better time slots in the future.<br/>\n<br/>\nBelow is the time information and the abstract on the talk.<br/>\n<br/>\nI hope to see you there.<br/>\n<br/>\nThanks,<br/>\n<br/>\nAlberto<br/>\n<br/>\n<br/>\nTITLE: Beyond JUnit: The Future of Developer Testing for JavaTM <br/>\nTechnology<br/>\n<br/>\nSPEAKER: Alberto Savoia<br/>\n<br/>\nTIME: Thursday 3:45 PM   Hall E #135<br/>\n<br/>\nIf you are interested in what the future of <br/>\n<br/>\nSoftware testing finally is emerging from the dark ages and entering <br/>\ninto a renaissance due primarily to the growing popularity of <br/>\nextreme programming and other approaches that highlight the <br/>\nimportance and necessity for developer testing. Java developers are <br/>\nat the forefront of this revolution, as evidenced by the fact that <br/>\nJUnit has been downloaded more than 500,000 times, a stunning number <br/>\nfor a testing tool, and more than all of the other XUnit frameworks <br/>\ncombined. <br/>\n<br/>\nThanks to JUnit, we have automated and standardized test execution <br/>\nand reporting, but the creation and maintenance of developer and <br/>\nunit tests is still a time-consuming and mostly manual process. It&#39;s <br/>\ntime to raise the bar. Java gives us an opportunity to let computers <br/>\ndo 90% of the mundane work associated with test creation and <br/>\nmaintenance and to do <br/>\nit better than us. We should take advantage of this so developers <br/>\ncan focus on the aspects of programming and testing that fully <br/>\nleverage human intelligence and creativity. <br/>\n<br/>\nIn this presentation you learn how JavaTM Technology&#39;s unique set of <br/>\nfeatures, <br/>\ncombined with the computing power of modern CPUs, can be used to <br/>\naddress some of the thorniest problems associated with developer and <br/>\nunit testing. You learn the right way to handle some of the biggest <br/>\nchallenges intrinsic to testing such as combinatorial <br/>\nexplosions, the myriad of explicit and implicit class dependencies, <br/>\nuncoordinated and unexpected code changes, complex and time-<br/>\nconsuming test setup and test maintenance issues. You see code and <br/>\ntest examples that highlight the inherent inefficiencies and <br/>\nincompleteness of handcrafted tests, and how automation and <br/>\ncollaborative testing can save you from writing and maintaining 90% <br/>\nof the test code you think you need to write.</div>", 
    "prevInTime": 11246, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1087837243", 
    "canDelete": false, 
    "nextInTopic": 11251, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGNiNzQ3citvdmNiQGVHcm91cHMuY29tPg=="
    }
}