{
    "numMessagesInTopic": 8, 
    "nextInTime": 11241, 
    "senderId": "x2tqqETVwQFCo0-5Xag2yLQ1q8D4oeBWQ83HvCk_q2N7e69l_V5QYthe9gDPzj3-WkNPBG4C6oTKppdgh8AmM1JSqt4G687eC4_au-h_3S3lDXPyLpek1Q", 
    "systemMessage": false, 
    "subject": "RE: [junit] Re: JUnit tests and common resources", 
    "from": "&quot;Chappell, Simon P&quot; &lt;simon.chappell@...&gt;", 
    "authorName": "Chappell, Simon P", 
    "msgSnippet": " ... Our system communicates with PLCs (Programmable Logic Controllers) and we also have to accept protocols dictated to us by engineers. These protocols", 
    "msgId": 11240, 
    "topicId": 11214, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 88072055, 
    "messageBody": "<div id=\"ygrps-yiv-219601359\">&lt;snip&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I will try to answer couple of replies in a single message:<br/>\n&gt;<br/>\n&gt;1. I do have an interface defined and more. It is the low-level host <br/>\n&gt;protocol I need to test. The difficulty is that the device on the <br/>\n&gt;other end is often experimental and I cannot rely on perfect <br/>\n&gt;operation and documentation. I could try to take the high road and <br/>\n&gt;expect perfection from the manufacturer, but that is not how things <br/>\n&gt;work in my world :). What I am writing is a set of software drivers <br/>\n&gt;controlling devices from different manufacturers. I am trying to <br/>\n&gt;provide consistent interface to a class of hardware modules, all <br/>\n&gt;with a twist and all of them with vastly different protocols. <br/>\n&gt;Mocking the hardware will not help me much. It will be a waste of <br/>\n&gt;time trying to duplicate (and some times guess) all aspects of the <br/>\n&gt;behavior, when I can simply plug it in. In effect I am testing more <br/>\n&gt;the host protocol and the device then the business logic on my end. <br/>\n&gt;Again, I am developing a driver, not the business logic that will <br/>\n&gt;use that driver.<br/>\n<br/>\n </span></blockquote>Our system communicates with PLCs (Programmable Logic Controllers) and we also have to accept protocols dictated to us by engineers. These protocols could easily change as they try to swap out one brand of PLC and replace it with another. So, we wrote a very thin listener, that extracted the data we needed, loaded up a value object and passed it into the main body of our system. You can&#39;t test/mock/control everything, but you can certainly create some very definite boundaries and test everything inside.<br/>\n<br/>\n&lt;snip&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;3. It crossed my mind to put everything into one test method and <br/>\n&gt;call the individual test methods from there, but I do not like this <br/>\n&gt;approach. It invalidates in my opinion many of the benefits of <br/>\n&gt;JUnit. <br/>\n<br/>\n </span></blockquote>I don&#39;t follow you here. JUnit provides a framework for testing. Some tests are very simple, some tests are more complex, just because of the initial setup required before getting to the meat of the test. This is not JUnit&#39;s fault. To repeat JB and Mike Clark, if something is difficult in JUnit, it&#39;s a hint that you need to address something.<br/>\n<br/>\n&lt;snip&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; No, it isn&#39;t. Still, whenever I want to do something in my design <br/>\n&gt;that <br/>\n&gt;&gt; JUnit makes difficult, it is /usually/ a sign that my design needs <br/>\n&gt;&gt; Improvement.<br/>\n&gt;<br/>\n&gt;5. I do not agree entirely with the above. My concern was related to<br/>\n<br/>\n </span></blockquote>I&#39;m sorry you don&#39;t agree, in practice I have found this to be so true that it&#39;s not even funny (to use a Britishism).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;the fact that I see no way to control the flow in JUnit and it has <br/>\n<br/>\n </span></blockquote>Think about why you want to control the order of flow? Do you _really_ need to control the flow? I used to think so, and would create Suite objects to allow me to do just that, but now, as long as I can make each of my tests independent, then it doesn&#39;t matter at all what order they run in.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;very little to do with the design of the system being tested - good <br/>\n&gt;or bad. As far as I understand test framework should perform well <br/>\n&gt;even if the code it works with is bad (I hope this is not the case <br/>\n&gt;with mine J). I still consider this ability (flow control) <br/>\n&gt;completely missing in JUnit.  I think it would be very useful if I <br/>\n&gt;could have explicit control over what tests execute when and even <br/>\n&gt;branch the logic based on a condition. Perhaps jump from one test to <br/>\n&gt;another, etc. On the other hand I do not like the underlying <br/>\n&gt;suggestion that one should be dependent on the specific capabilities <br/>\n&gt;of any one testing framework. In a way, to design for JUnit. Test <br/>\n&gt;tools come and go and the merits of the design should be judged not <br/>\n&gt;by how easy is to use with JUnit, but how it performs.<br/>\n<br/>\n </span></blockquote>Perhaps the issue here is not that JUnit will not meet your unit testing needs, but rather that perhaps the testing needs you are describing here are actually functional testing needs. This would explain why you are so keen on sequences and conditional branches. At this point you may well be better advised to consider a non-JUnit based solution. JMeter leaps to mind as an option.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;The bottom line is that I found a solution that works. Thanks for <br/>\n&gt;all the good suggestions.<br/>\n<br/>\n </span></blockquote>Good suggestions is what we do best around here. :-)<br/>\n<br/>\nSimon<br/>\n<br/>\n-----------------------------------------------------------------<br/>\nSimon P. Chappell                     <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:simon.chappell@...\">simon.chappell@...</a><br/>\nJava Programming Specialist                      www.landsend.com<br/>\nLands&#39; End, Inc.                                   (608) 935-4526<br/>\n<br/>\n&quot;Wisdom is not the prerogative of the academics.&quot; - Peter Chappell</div>", 
    "prevInTime": 11239, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1087835909", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 11234, 
    "headers": {
        "messageIdInHeader": "PDhDOTJGQ0VDQzNFNEE2NDdBRUI5NzYxRUNGQjQ5M0MyMDUwREZEQHVzbXNnMDExLmxlaW50ZXJuYWwuY29tPg=="
    }
}