{
    "numMessagesInTopic": 14, 
    "nextInTime": 11246, 
    "senderId": "u8yVaYOaStfcAiZDWgHtbuwhipkRj4SoQOvWwqjeP83FwveumxbpnhJbRT8SgFHL1O1EIoXoH-Ncfxx5hhK3UfzacQHWXCO5G4g0EA", 
    "systemMessage": false, 
    "subject": "Re: JUnit automatically", 
    "from": "&quot;albsavoia&quot; &lt;albsavoia@...&gt;", 
    "authorName": "albsavoia", 
    "msgSnippet": "... Good questions J.B. I did not start this thread, and I don t know Shivam, but I felt compelled to answer since we are talking about our company s product ", 
    "msgId": 11245, 
    "profile": "albsavoia", 
    "topicId": 11226, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174158319, 
    "messageBody": "<div id=\"ygrps-yiv-1163041425\"><blockquote><span title=\"ireply\">&gt;How does a computer know what kinds of tests I need to write?<br/>\n&gt;How does a computer know what the expected results are?<br/>\n<br/>\n </span></blockquote>Good questions J.B.<br/>\n<br/>\nI did not start this thread, and I don&#39;t know Shivam, but I felt <br/>\ncompelled to answer since we are talking about our company&#39;s product <br/>\nAgitator, and I want to avoid misconceptions.<br/>\n<br/>\nAs you might guess, Agitator cannot know the expected results - only <br/>\nthe developer can know that.  What Agitator can do for you is <br/>\ngenerate test data that gets you code coverage and then shows you <br/>\nwhat it observed in the form of class and method invariants.  These <br/>\nobservations are in the form of Java boolean valued assertions.  For <br/>\nexample:<br/>\n\t<br/>\n\tFile.canWrite() == true<br/>\n<br/>\nOr<br/>\n\tFile.getPath().equals(&quot;C:&#92;foo&#92;bar&quot;)<br/>\n<br/>\nOr<br/>\n\tFile.list().length == 14<br/>\n<br/>\nThe developer looks at these observations and if they match the <br/>\nexpected results they can check a box and turn that into an <br/>\nassertion - the equivalent of writing &quot;assertEquals(14, <br/>\nFile.list.length)&quot; in Junit, for example.<br/>\n<br/>\nIf the observations don&#39;t match the expected behavior, the developer <br/>\ncan modify them.  For example, if the number in the last assertion <br/>\nwas supposed to be 17 instead of 14, the simply edit the observation <br/>\nand then &quot;promote&quot; it into an assertion:<br/>\n<br/>\n\tFile.list().length == 17<br/>\n<br/>\nOr the developer can create new assertion to associate with the <br/>\nmethod.<br/>\n<br/>\nCombined with Agitator&#39;s ability to automatically generate very <br/>\nrelevant test data and achieve very high code coverage automatically <br/>\n(through data flow analysis and other dynamic techniques), automated <br/>\nobservations are a powerful and very efficient way to create unit <br/>\ntests quickly to get the developer to consider inputs and conditions <br/>\nthat they might have missed.  But the developer input is still <br/>\nrequired to decide if what Agitator observed is what the code is <br/>\nsuppsed to do.<br/>\n<br/>\nI&#39;ll stop here because I don&#39;t want to use this forum to promote <br/>\nAgitator, but I wanted to clear any misconceptions and answer J.B.&#39;s <br/>\nquestions.<br/>\n<br/>\nIf you want to learn more about our Agitator and our experiences <br/>\nwith this new way to approach unit testing you can check out:<br/>\n<br/>\nwww.developertesting.com/<br/>\n<br/>\nThanks,<br/>\n<br/>\nAlberto</div>", 
    "prevInTime": 11244, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1087833096", 
    "canDelete": false, 
    "nextInTopic": 11248, 
    "prevInTopic": 11242, 
    "headers": {
        "inReplyToHeader": "PDQwRDRBMUI1LjMwNjA1MDJAcm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PGNiNzA2OCs3ZXNlQGVHcm91cHMuY29tPg=="
    }
}