{
    "numMessagesInTopic": 2, 
    "nextInTime": 11244, 
    "senderId": "_gA3Lms81Zm4iL7Iv6pOI5VLUiv4yI_jnUoFyAV6P87mr-IAOO9iLxgjJQrwZ6h1jIo0vxuBxTaOfKkKqNKT8suG6ftXmHufjpMM5A", 
    "systemMessage": false, 
    "subject": "Integration of JUnit in existing software-systems", 
    "from": "&quot;Coolspot714&quot; &lt;Coolspot714@...&gt;", 
    "authorName": "Coolspot714", 
    "msgSnippet": "Hello everybody, I d like to hear your opinions on a rather general subject. I m a student and I m doing a research about how JUnit could be used in my company", 
    "msgId": 11243, 
    "profile": "Coolspot714", 
    "topicId": 11243, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 29675476, 
    "messageBody": "<div id=\"ygrps-yiv-265371596\">Hello everybody,<br/>\n<br/>\nI&#39;d like to hear your opinions on a rather general subject. I&#39;m a <br/>\nstudent and I&#39;m doing a research about how JUnit could be used in my <br/>\ncompany to improve the efficiency of software development. What my <br/>\nbosses, not knowing a lot about JUnit, only having heard of it, first <br/>\nwanted to have was a piece of software which tests an existing <br/>\napplication on a technical level. (like &quot;one Button tests all&quot;)<br/>\n<br/>\nFrom what I know now, JUnit is a framework for the developer to <br/>\nimprove the quality of the application and to avoid failures in the <br/>\ncode which might otherwise be overseen. Now here&#39;s my question: does <br/>\nit make sense to take an existing application and try to write test <br/>\ncases/suites for it? The application is a rather abstract one, it&#39;s a <br/>\nmiddleware component (API) between one big and several smaller <br/>\napplications, it consist of several EJBs with basically lots of get-<br/>\nMethods, using JAX-RPC SOAP and RMI. <br/>\n<br/>\nI doubt it makes sense, but I don&#39;t have a lot of experience about <br/>\nwhat JUnit is capable of and how the code would have to be refactored.<br/>\n<br/>\nI guess it would make more sense telling the developers why and how <br/>\nto use JUnit in order to improve things in FUTURE developments and to <br/>\nstick with the old code without JUnit. What do you think? <br/>\n<br/>\nThank you for your replies!<br/>\n<br/>\nPS: Sorry I can&#39;t give you more information about the application I <br/>\nwas talking about, I&#39;m still in the process of understanding how it <br/>\nworks and I&#39;m not a Java-pro (yet:-).<br/>\n<br/>\nGreetings from Germany,<br/>\nThomas</div>", 
    "prevInTime": 11242, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1087825383", 
    "canDelete": false, 
    "nextInTopic": 11250, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGNiNm9sNyttcXZxQGVHcm91cHMuY29tPg=="
    }
}