{
    "numMessagesInTopic": 2, 
    "nextInTime": 11305, 
    "senderId": "9fcyPtivqmKTYiJBSKekHXDrqzRSb1MP66H3bprooGk3_HLcFhlHyX6sfwwX-El6qJIm9phe9oWTJTCkXq6UNlGvebV6NVuI", 
    "systemMessage": false, 
    "subject": "Remote Testing with JUnit", 
    "from": "&quot;Marv Lush&quot; &lt;marv_lush@...&gt;", 
    "authorName": "Marv Lush", 
    "msgSnippet": "I tried doing a search on the JUnit group archive about this topic, but apparently all my years in college did not teach me how to use a search engine", 
    "msgId": 11304, 
    "profile": "marv_lush", 
    "topicId": 11304, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 143105733, 
    "messageBody": "<div id=\"ygrps-yiv-1092640970\">I tried doing a search on the JUnit group archive about this topic,<br/>\nbut apparently all my years in college did not teach me how to use a<br/>\nsearch engine correctly...<br/>\n<br/>\nI have spent the last month or two puttting a series of testSuites<br/>\nwith about 2000 test cases.  I run these test cases by firing off a<br/>\ntestRunner on the machine where my testCase code is located (locally).<br/>\n<br/>\nThe software I am testing is &quot;supposed&quot; to run on differnt OS&#39;s and<br/>\ndifferent versions of the JVM, and various combinations of the two.<br/>\n<br/>\nSo my question is this: is there some app I can use to kick off my<br/>\nregression suite (ideally form a web-browser) on many machines of<br/>\nvarying combinations of OS/JVMs remotely, BUT HAVE THE TESTS RUN ON<br/>\nTHE REMOTE MACHINE&#39;S OWN JVM??? Then the app should harvest all the<br/>\nresults and put them ideally in HTML/XML format?<br/>\n<br/>\nI understand JUnitEE does most of this already, however from my<br/>\nunderstanding, JUnitEE will run the tests from the JVM where the<br/>\nJUnitEE is installed, thus NOT testing the regression suites on<br/>\ndifferent JVMs.<br/>\n<br/>\nHas anyone ever tried to modify JUnitEE to do something like this?? Is<br/>\nther another tool I should look at instead??<br/>\n<br/>\nI&#39;m sure I could just write something like this myself, but if there<br/>\nis something out there I could drop in, I could spend more of my time<br/>\nwriting new test cases and less time writing tools to make my<br/>\nregression output &quot;manager freiendly&quot;.<br/>\n<br/>\n<br/>\nTIA,<br/>\n/mn</div>", 
    "prevInTime": 11303, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1088450654", 
    "canDelete": false, 
    "nextInTopic": 11307, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGNicHI4dStpbzlnQGVHcm91cHMuY29tPg=="
    }
}