{
    "numMessagesInTopic": 5, 
    "nextInTime": 11328, 
    "senderId": "X7BvaQvpa-Tfrelp7YFyyt7p2yHU7KQ6bqKnwK45zkFh3FLzGP5pW80Gbtk-ngGAgNsGo9b7cfoc3hXB_m6uHVnjKJX-Ggk9ECiREZWOItY", 
    "systemMessage": false, 
    "subject": "Re: Help with JMock", 
    "from": "&quot;cliftonccraig&quot; &lt;cliftonccraig@...&gt;", 
    "authorName": "cliftonccraig", 
    "msgSnippet": "I figured out my problem with JMock from my earlier post. I didn t have all of the required libraries. 1st off I thought the jmock-cglibxx.jar available on the", 
    "msgId": 11327, 
    "profile": "cliftonccraig", 
    "topicId": 11327, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 190580959, 
    "messageBody": "<div id=\"ygrps-yiv-1779724196\">I figured out my problem with JMock from my earlier post. I didn&#39;t<br/>\nhave all of the required libraries. 1st off I thought the<br/>\njmock-cglibxx.jar available on the jmock website was enough to enable<br/>\nclass mocking. I went back and re-read the docs and realized that this<br/>\nJar only contained the interfaces for cglib mock objects. I then found<br/>\ndownloaded CGLIB as directed by the docs on the jmock site and tried<br/>\nagain. Still I was getting NoClassDefFound errors pointing to the<br/>\norg.objectweb.asm package. I immediately overreacted because we<br/>\nrecently switched from the objectweb JOnAS appserver to JBoss and I<br/>\nassumed that the error meant that there was stray references to<br/>\nobjectweb stuff somewhere in our codebase. I started complaining to<br/>\nthe developers here that we need to do a better job of reducing these<br/>\nhidden dependencies when I then realized that the error was<br/>\ncomplaining about yet another required jar for class mocking. I had to<br/>\ngo and download the ASM jar to complete the task. After doing all of<br/>\nthis I updated my paths in Idea and re-ran my test to discover that<br/>\nthe class I was trying to mock was final and could not be subclassed.<br/>\nWhat a poop on my dreams. Anyhow I just wanted to share my experience.<br/>\nRule of thumb, if you find the need to mock a class, rethink your<br/>\ndesign. I know my design stinks, which is why I&#39;m having so many problems.</div>", 
    "prevInTime": 11326, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1088608651", 
    "canDelete": false, 
    "nextInTopic": 11328, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGNidWxpYitwaWpoQGVHcm91cHMuY29tPg=="
    }
}