{
    "numMessagesInTopic": 3, 
    "nextInTime": 11344, 
    "senderId": "mUpFy2YhnNR4biCollbXYKQ5y-mEqGwosA4e6c_vOwi7QU0j1eJNjeMXZw2GLRUIL51v-jJrpkBfY-yOx7rrf6gN52G0Bgbd59ZLrw", 
    "systemMessage": false, 
    "subject": "Report from JavaOne talk on developer testing", 
    "from": "&quot;albsavoia&quot; &lt;albsavoia@...&gt;", 
    "authorName": "albsavoia", 
    "msgSnippet": "I have just come back from a great JavaOne. I was concerned that my presentation on unit testing Beyond JUnit - The Future of Developer Testing for Java", 
    "msgId": 11343, 
    "profile": "albsavoia", 
    "topicId": 11343, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174158319, 
    "messageBody": "<div id=\"ygrps-yiv-783767593\">I have just come back from a great JavaOne.<br/>\n<br/>\nI was concerned that my presentation on unit testing &quot;Beyond JUnit - <br/>\nThe Future of Developer Testing for Java&quot; would be poorly attended <br/>\nbecause it was late afternoon on the last day of the conference.<br/>\n<br/>\nFortunately, I was wrong.<br/>\n<br/>\nThe auditorium was packed and they had to re-direct a bunch of <br/>\npeople to an overflow room.  I estimate a total of 500 people <br/>\nlistened to it - which is pretty good for a breakout technical <br/>\nsession.<br/>\n<br/>\nSince Alberto Savoia is not exactly an household name :-), I know <br/>\nthat all these people did not come for me but for the topic.  Having <br/>\nthis many people showing up for a topic with &quot;testing&quot; in the title <br/>\nwould have been unthinkable a few years back - take it from me, I <br/>\ntried it.<br/>\n<br/>\nI opened the talk with a slide giving credit, and thanks, for the <br/>\ngrowing acceptance of developer testing to Kent Beck and Eric Gamma. <br/>\nIt felt great to have an appreciative audience with whom to share my <br/>\nadmiration and respect for their contributions.  In a few years I <br/>\nbelieve that the industry will finally look back and realize that <br/>\nwhat Kent and Eric have set into motion is worthy of major official <br/>\nrecognition.<br/>\n<br/>\nOverall, I believe that the talk was well received and it&#39;s my <br/>\nunderstanding that it may be available online on the JavaOne website <br/>\nsometime soon.  <br/>\n<br/>\nAlberto</div>", 
    "prevInTime": 11342, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1088782923", 
    "canDelete": false, 
    "nextInTopic": 11346, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGNjM3ZvYis1YjRnQGVHcm91cHMuY29tPg=="
    }
}