{
    "numMessagesInTopic": 18, 
    "nextInTime": 11515, 
    "senderId": "JpVj7gli77XQyKifMYSSRLgCa8VZ9sz1lpdls3qHC-Lc4_GjBHHCeEDaA6H1QMorWcTTgsz33EvpyWm7-C2OJpWGEde6RQNG", 
    "systemMessage": false, 
    "subject": "Re: Did my question get missed, somehow?", 
    "from": "&quot;cypherfox&quot; &lt;cypherfox@...&gt;", 
    "authorName": "cypherfox", 
    "msgSnippet": "Greetings, ... we ... look ... I expected that, it appears to be a common response to issues with the test framework.  The problem with dismissing it like that", 
    "msgId": 11514, 
    "profile": "cypherfox", 
    "topicId": 11495, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174888704, 
    "messageBody": "<div id=\"ygrps-yiv-382881308\">Greetings,<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;J. B. Rainsberger&quot; &lt;jbrains@r...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; cypherfox wrote:<br/>\n&gt; <br/>\n&gt; &gt; Greetings,<br/>\n&gt; &gt; Totally reasonable, and I probably made it more complex<br/>\n&gt; &gt; than it needed to be.<br/>\n&gt; &gt; <br/>\n&gt; &gt; I&#39;ll try a simpler question, but still related...<br/>\n&gt; &gt; <br/>\n&gt; &gt; I have state that I need to track between tests, in this case<br/>\n&gt; &gt; it&#39;s the message id that the last test put on the server, so<br/>\n&gt; &gt; that the next test can test reading it, and the third test<br/>\n&gt; &gt; can test deleting it.<br/>\n&gt; <br/>\n&gt; You should realize that this is a design smell. I&#39;m not saying that<br/>\n </span></blockquote>we <br/>\n<blockquote><span title=\"ireply\"> &gt; can&#39;t test it as is, but I /am/ saying that if it were my code, I&#39;d<br/>\n </span></blockquote>look <br/>\n<blockquote><span title=\"ireply\"> &gt; to change the design so that the tests don&#39;t depend on one another.<br/>\n<br/>\n </span></blockquote>I expected that, it appears to be a common response to issues<br/>\nwith the test framework.  The problem with dismissing it like<br/>\nthat is that if you are putting data onto a server, you WANT<br/>\nto test independantly that each of the operations work,<br/>\nwithout relying on all the later tests working for basic<br/>\noperations to pass.  Also, if earlier tests fail, you know<br/>\nimmediately that the rest will fail, so it gives a clear progression<br/>\nof fixes.  This, to me, is test isolation.  If a test fails, I know<br/>\nwhy it failed, because JUST that functionality isn&#39;t working.<br/>\n<br/>\nIf I *have to* make testRead() internally depend on doing<br/>\ntestPost() and then testDelete() afterwards (and much more<br/>\nas I describe later), then suddenly my test is being forced to<br/>\ndo way too much, and that smells to me of bad design in the<br/>\nframework, and this is totally irrespective of threading.<br/>\n<br/>\nSure, making tests completely independant is great if you&#39;re not<br/>\ntesting against anything ELSE that has state, but if you are, you<br/>\nneed to be able to retain something, a session id, a message id,<br/>\nthe connection to the server, etc.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; It appears that a new object is created for each call to a test*<br/>\n&gt; &gt; method, so there&#39;s no object-local way to preserve state.<br/>\n&gt; <br/>\n&gt; Right. At that point, you must do it through class-level data.<br/>\n<br/>\n </span></blockquote>Oof, see, this is bad.  It makes testing stateful systems very,<br/>\nvery difficult, and then testing multi-threaded systems near to<br/>\nimpossible.  I&#39;m sure we see things differently, but to me<br/>\nthe testing framework forcing me to use &#39;class-level data&#39;<br/>\n(i.e. statics) is a code smell of the test framework.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Is there any way to override this, making it call the test*<br/>\n&gt; &gt; methods all on the same object?<br/>\n&gt; <br/>\n&gt; Not without rewriting the framework. The framework was written <br/>\n&gt; /expressly with the goal/ of isolating tests from one another. The <br/>\n&gt; framework achieves this by executing each test in its own instance<br/>\n </span></blockquote>of <br/>\n<blockquote><span title=\"ireply\"> &gt; Test (or TestCase).<br/>\n<br/>\n </span></blockquote>The problem I have with this is it&#39;s completely unlike how code is<br/>\nactually used.  It&#39;s forcing a framework on code that makes it much<br/>\nless useful to test.  I don&#39;t need (or think it&#39;s right at all) to<br/>\ntest all of:<br/>\n<br/>\nconnect to server<br/>\ncreate user<br/>\ncreate mailbox<br/>\npost message<br/>\n*read message*<br/>\ndelete message<br/>\ndelete mailbox<br/>\ndelete user<br/>\ndisconnect<br/>\n<br/>\nall in one test, just in order to test the &#39;read message&#39; in the<br/>\nmiddle.<br/>\n<br/>\nAre you saying this is expressly what is desired?  That all<br/>\nthe authors think is appropriate is one single &#39;mega test&#39;<br/>\nthat runs all those functions?  Or was testing code that<br/>\ntalks to external stateful systems just not considered?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; My reasoning is that if I write a test which creates, reads,<br/>\n&gt; &gt; and deletes the entry from the server, I&#39;m doing too much<br/>\n&gt; &gt; in a single test.<br/>\n&gt; <br/>\n&gt; A test consists of three parts: arrange, act, assert. You need to<br/>\n </span></blockquote>set up <br/>\n<blockquote><span title=\"ireply\"> &gt; the system in a desired, known state (arrange), <br/>\n<br/>\n </span></blockquote>Done through the prior tests, and since they&#39;ve presumably<br/>\nsucceeded, the next test can run.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; do something of interest (act)<br/>\n<br/>\n </span></blockquote>E.g., The &#39;read message&#39;, which is the only thing of interest to the<br/>\ntestReadMessage method.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; then check the results (assert).<br/>\n<br/>\n </span></blockquote>See you&#39;re forgetting a few things, when dealing with stateful<br/>\nexternal systems.  Namely &#39;reset state&#39;, which should occur<br/>\nAFTER assert.  But it needs to be tested also, of course.  And<br/>\nsince it needs to be tested, it needs a test, preferrably simple<br/>\nbecause simple is good, that runs in the normal sequence of<br/>\nthings.   Instead of doing the 9 operations every time, for 9<br/>\ntests, the clear process is to do it once, in the prior test, and<br/>\nuse that state in the next test.<br/>\n<br/>\nStatics aren&#39;t an answer, and the framework forcing them on<br/>\ntests is a failure in the framework.  I was hoping that wasn&#39;t<br/>\nthe answer.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You are right: your test is <br/>\n&gt; doing too much, but I don&#39;t think the test is at fault.<br/>\n<br/>\n </span></blockquote>Each test is testing a single, basic unit of functionality.  You<br/>\nmisread me, I&#39;m saying that if I have to do all the steps<br/>\noutlined above EVERY time I want to do only ONE of those<br/>\ntests, then the test is doing far too much, and it&#39;s the<br/>\nframework at fault for forcing that kind of test process.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; The only place that threading comes in is that I can&#39;t use a<br/>\n&gt; &gt; static value to keep this data, because then it&#39;s shared among<br/>\n&gt; &gt; all the threads.<br/>\n&gt; <br/>\n&gt; I don&#39;t understand why you need multiple threads while running the <br/>\n&gt; tests. Could you run the tests in singlethreaded mode? The fact<br/>\n </span></blockquote>that you <br/>\n<blockquote><span title=\"ireply\"> &gt; want to test logic in multithreaded mode tells me that you may be<br/>\n </span></blockquote>trying <br/>\n<blockquote><span title=\"ireply\"> &gt; to test too many things at once.<br/>\n<br/>\n </span></blockquote>Yes, yes, the test is run once in single-threaded mode,<br/>\nto make sure the basic logic is correct.  I do that as a<br/>\nsanity test before running the multi-threaded test.  The<br/>\nproblem still exists, of course, because state should be<br/>\npreserved.  (Actually, there are about a half dozen pre-MT<br/>\ntest classes that are run, testing the logic of various layers.)<br/>\n<br/>\nIt&#39;s then run in a heavily multithreaded context, because<br/>\nthat&#39;s the context it&#39;s going to be run in the real world,<br/>\nso it tries to hash out any threading issues in the various<br/>\nlayers.  This is a test, after all.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; Any suggestions?<br/>\n&gt; <br/>\n&gt; What is your goal? To verify your logic? To test concurrency? At a <br/>\n&gt; minimum, do each of these separately, and not together.<br/>\n<br/>\n </span></blockquote>I do each of them separately.  I test the logic once, with the<br/>\nstorageTest class as a single thread.  I then try to test the<br/>\nconcurrency by calling storageTest from one to three hundred<br/>\nthreads.<br/>\n<br/>\nRight now, I have a &#39;massiveTest&#39; class which calls all the methods<br/>\nof the storageTest class directly, after doing a hand-setup so that<br/>\nthe storageTest object can query some data.  It&#39;s just a hack-around<br/>\nfor the problem that the TestSuite instantiates a new object every<br/>\ntime.  If it didn&#39;t do that, the code would be vastly cleaner.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; p.s.  Nope, no extensions yet, although I&#39;m eyeing TestResult<br/>\n&gt; &gt; as needing a touch of an upgrade...<br/>\n&gt; <br/>\n&gt; Interesting... do tell.<br/>\n<br/>\n </span></blockquote>Certainly.  The massiveTest I mentioned above has to call each<br/>\nmethod on storageTest directly, so when a failure occurs I can&#39;t<br/>\neasily determine WHERE it failed, because the only test that<br/>\nappears in TestResult is &#39;testMultithreadedStorage&#39;.<br/>\n<br/>\nIt would be good to have testMultithreadedStorage call the<br/>\nsuite.run(myResult) for the storageTest class (if that worked<br/>\nproperly with state preservation), and then aggregate the<br/>\nresults for all the threads, so it appears more like what really<br/>\nhappened, that the storageTest test suite was run 2000 times,<br/>\nand which calls failed, asserted, etc.<br/>\n<br/>\nThis was the part that was probably pretty complex and poorly<br/>\ndescribed in my original post, so I left it out initially.<br/>\n<br/>\n--  Morgan Schweers</div>", 
    "prevInTime": 11513, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1089937382", 
    "canDelete": false, 
    "nextInTopic": 11515, 
    "prevInTopic": 11512, 
    "headers": {
        "inReplyToHeader": "PDQwRjcxMTgzLjUwNzA4MDdAcm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PGNkNzc1NitsNnI0QGVHcm91cHMuY29tPg=="
    }
}