{
    "numMessagesInTopic": 18, 
    "nextInTime": 11539, 
    "senderId": "KlPS00hAKyKJARO0MZsK6PJ68uqR-DGf_EWb88N43XTFy6ytKhXJeORZaWBWjK4ldoEpJRbns5aftjOUMt0WIW20tJMNVeIK", 
    "systemMessage": false, 
    "subject": "Re: Did my question get missed, somehow?", 
    "from": "&quot;cypherfox&quot; &lt;cypherfox@...&gt;", 
    "authorName": "cypherfox", 
    "msgSnippet": "Greetings, This is true.  I recall reading about that trap , and I can definitely agree that s where the breakdown is.  For my project, there are (imo) very", 
    "msgId": 11538, 
    "rawEmail": "Return-Path: &lt;cypherfox@...&gt;\r\nX-Sender: cypherfox@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 73020 invoked from network); 16 Jul 2004 18:33:31 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m17.grp.scd.yahoo.com with QMQP; 16 Jul 2004 18:33:31 -0000\r\nReceived: from unknown (HELO n27.grp.scd.yahoo.com) (66.218.66.83)\n  by mta2.grp.scd.yahoo.com with SMTP; 16 Jul 2004 18:33:30 -0000\r\nReceived: from [66.218.67.190] by n27.grp.scd.yahoo.com with NNFMP; 16 Jul 2004 18:32:21 -0000\r\nDate: Fri, 16 Jul 2004 18:32:14 -0000\r\nTo: junit@yahoogroups.com\r\nMessage-ID: &lt;cd96ve+m23j@...&gt;\r\nIn-Reply-To: &lt;004d01c46b13$4ea5dce0$7064a8c0@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 3307\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-eGroups-Remote-IP: 66.218.66.83\r\nFrom: &quot;cypherfox&quot; &lt;cypherfox@...&gt;\r\nSubject: Re: Did my question get missed, somehow?\r\nX-Yahoo-Group-Post: member; u=174888704\r\nX-Yahoo-Profile: cypherfox\r\n\r\nGreetings,\nThis is true.  I recall reading about that &#39;trap&#39;, and I can\ndefinitely agree that&#39;s where the breakdown is.  For my\nproject, there are (imo) very well-defined, good reasons\nto test like this.  (A small one of which is that it was the\nperfect way to build the server structure in a &#39;test-first&#39;\nmanner, a much larger one is knowing the precise\nperformance implications of each functional unit of the\nprogram.)  They have nothing to do with JUnit&#39;s mission,\nhowever, and everything to do with mine as a developer.\n\nAnd you hit the nail on the head as well, when noting the\nfunctional vs. unit aspect of it.  I have a small set of tests\nthat test the overall correctness, and then the larger\nfunctional tests that *call* the smaller tests, in order to\nreuse test knowledge.  (Don&#39;t Repeat Yourself.)\n\nI am trying to do both with JUnit, under the theory that whenever\nI make a change, I re-run the test suite and if it works, then I&#39;m\ncomfortable that I&#39;m not going to have to deal with QA, because\nmy test suite is sufficiently complete and similar to actual\napplication use that (barring infrastructure issues) my code will\nJust Work.\n\nSo the answer is that what I&#39;m trying to do is beyond the scope\nof JUnit.  A small mod to JUnit would let me do it, but that mod\nwouldn&#39;t ever be accepted into JUnit-proper because it&#39;s effectively\nscope creep.\n\nThis actually makes me feel a lot better about making a local mod\nto JUnit.  I normally hate to do something like that without feeding\nthe patch back, but my project needs are just different than the\ntarget for the JUnit project.  I need tests, and I have them, but I\nalso need the performance numbers that I get, as well as higher\nlevel functional tests, as well as &#39;behavior under load&#39; tests.  You\ncan&#39;t do that with the basic JUnit framework.  It&#39;s absurd to claim\nI *shouldn&#39;t* do the other tests, as more tests are good, but I&#39;ll\neasily agree that it&#39;s clearly not what JUnit was designed for.\n\nThankfully small changes to JUnit make this completely possible\ninside its framework, and since it&#39;s not under active development,\nI don&#39;t have to worry about rolling in new versions.\n\nThere really are no other well-supported (by tools, at least)\ntesting frameworks out there, so if I want to do the kind of\ntesting I *need* to do, my choices are to build an entirely\nnew framework (which then won&#39;t integrate with other\nprograms like IntelliJ), or extend the quality work already\ndone.\n\n--  Morgan Schweers\n\n--- In junit@yahoogroups.com, &quot;Ilja Preuss&quot; &lt;preuss@d...&gt; wrote:\n&gt; cypherfox wrote:\n&gt; &gt; Greetings,\n&gt; &gt; I asked about a few feature enhancements, or more accurately\n&gt; &gt; if anyone had any reasons they shouldn&#39;t be done, or what\n&gt; &gt; testing paradigm I might be missing that made them wrong...\n&gt; \n&gt; Well, the paradigm that Junit follows and with which you seem to\nhave\n&gt; problems is that a testcase should be a full standalone test\nscenario\n&gt; and shouldn&#39;t depend at the results of other testcases at all.\n&gt; \n&gt; It might be that you are fallen into the &quot;a test method should test\na\n&gt; single method call&quot; trap (it shouldn&#39;t, it should test a single,\nsimple\n&gt; test scenario); or perhaps your tests are too big and more on the\n&gt; functional side than the unit side to be handled effectively using\n&gt; Junit.\n&gt; \n&gt; What do you think?\n&gt; \n&gt; Cheers, Ilja\n\n\n", 
    "profile": "cypherfox", 
    "topicId": 11495, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174888704, 
    "prevInTime": 11537, 
    "contentTrasformed": false, 
    "postDate": "1090002734", 
    "canDelete": false, 
    "nextInTopic": 11539, 
    "prevInTopic": 11522, 
    "headers": {
        "inReplyToHeader": "PDAwNGQwMWM0NmIxMyQ0ZWE1ZGNlMCQ3MDY0YThjMEBkaXN5Lm5ldD4=", 
        "messageIdInHeader": "PGNkOTZ2ZSttMjNqQGVHcm91cHMuY29tPg=="
    }
}