{
    "numMessagesInTopic": 18, 
    "nextInTime": 11541, 
    "senderId": "j-VcixWmp2l1RyythMXrvab2FR6a6TSpUsyu7i7Iy4XH2IVprVkUDE9IfdbSJobkM24TP3cidjMHpY9pQ0xJd3yGcQ19PIjV", 
    "systemMessage": false, 
    "subject": "Re: Did my question get missed, somehow?", 
    "from": "&quot;cypherfox&quot; &lt;cypherfox@...&gt;", 
    "authorName": "cypherfox", 
    "msgSnippet": "Greetings, ... I understand, and did not mean to be rude.  To me, the suggestion that testing the way I was is a code smell reads as a go fix your code before", 
    "msgId": 11540, 
    "profile": "cypherfox", 
    "topicId": 11495, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174888704, 
    "messageBody": "<div id=\"ygrps-yiv-1394729107\">Greetings,<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;J. B. Rainsberger&quot; &lt;jbrains@r...&gt; wrote:<br/>\n&gt; cypherfox wrote:<br/>\n&gt; <br/>\n&gt; &gt; The problem with dismissing it like<br/>\n&gt; &gt; that is...<br/>\n&gt; <br/>\n&gt; Rudeness objection. I expressly did not dismiss your point.<br/>\n<br/>\nI understand, and did not mean to be rude.  To me, the suggestion<br/>\nthat testing the way I was is a code smell reads as a &#39;go fix your code<br/>\nbefore bugging us&#39;.  I understand now that you didn&#39;t mean it like<br/>\nthat.<br/>\n<br/>\n&gt; &gt; The problem I have with this is it&#39;s completely unlike how code is<br/>\n&gt; &gt; actually used.  It&#39;s forcing a framework on code that makes it much<br/>\n&gt; &gt; less useful to test.  <br/>\n&gt; <br/>\n&gt; No-one is forcing anything. If JUnit doesn&#39;t work for you, then build <br/>\n&gt; your own testing framework. No-one is going to stop you.<br/>\n<br/>\nMmm..   Besides the point.  JUnit is the testing framework<br/>\nsupported by a massive number of tools, and my toolchain<br/>\nin particular.  If I can retrofit JUnit to fit my needs, it&#39;s the<br/>\noptimal answer.  I now do understand it&#39;s definitely not in<br/>\nJUnit&#39;s scope, however.<br/>\n<br/>\n&gt;  &gt; I don&#39;t need (or think it&#39;s right at all) to<br/>\n&gt; &gt; test all of:<br/>\n&gt; &gt; [...lots deleted...]<br/>\n&gt; &gt; all in one test, just in order to test the &#39;read message&#39; in the<br/>\n&gt; &gt; middle.<br/>\n&gt; <br/>\n&gt; Well of course not! I would /never/ do such a thing! I would just pull <br/>\n&gt; out the &quot;read message&quot; part and test it in isolation. I do that all the <br/>\n&gt; time, successfully, with JUnit.<br/>\n<br/>\nThe problem is that &#39;read message&#39; talks to a persistent mail<br/>\nserver.  It has to have a message on it to read.  It has to have<br/>\na user on it to read the message to.  It has to have a mailbox<br/>\nto read the message in.  It has to have selected that mailbox.<br/>\nMock objects don&#39;t test the actual networking code, and<br/>\nrequire 1.5x the maintenance anyway.  (Interface changes,<br/>\nespecially for code still under heavy development, need to be<br/>\npropogated not only to the test, but to the mock objects,<br/>\nconstantly.)<br/>\n<br/>\nI test from the bottom up, running the lowest layer of tests<br/>\nfirst.  If any level fails, I ignore the rest of the results until<br/>\nthat layer is fixed.  However, since some information (like<br/>\nhostnames) is passed from the top layer all the way down,<br/>\na bug in the top layer that generates a bad host name can<br/>\nonly be caught by the bottom layer actually trying to do<br/>\nthe work.<br/>\n<br/>\n&gt; &gt;  &gt; [...deletia: arrange, act, assert...]<br/>\n&gt; &gt; <br/>\n&gt; &gt; Done through the prior tests, and since they&#39;ve presumably<br/>\n&gt; &gt; succeeded, the next test can run.<br/>\n&gt; <br/>\n&gt; With object-level testing, /each/ test contains the &quot;Arrange, act, <br/>\n&gt; assert&quot; triad. In order for these tests to run quickly, each part must <br/>\n&gt; run quickly, and it turns out that when you make that a goal, good <br/>\n&gt; things happen. Different things than you&#39;re accustomed to, but good things.<br/>\n<br/>\nThe problem here is that the information is on a<br/>\nserver.  In order to arrange, I need to go through<br/>\nall the setup steps (create user, mailbox, message).<br/>\n<br/>\nHow would you accelerate that, and still allow the<br/>\nreadMessage test to actually test the networking<br/>\ncode?<br/>\n<br/>\n&gt; &gt; E.g., The &#39;read message&#39;, which is the only thing of interest to the<br/>\n&gt; &gt; testReadMessage method.<br/>\n&gt; <br/>\n&gt; Right. There should be absolutely no need to set up the system in a <br/>\n&gt; complicated manner, just to read a message (whatever that means in this <br/>\n&gt; context). Would you describe what &quot;read message&quot; does?<br/>\n<br/>\nPasses a request to a persistent IMAP-client thread which<br/>\nthen queries the IMAP server for the message, and returns<br/>\nit, then its converted to XML.  That&#39;s a broad overview, it<br/>\ngoes through several layers before that including some<br/>\nauthentication, for example.<br/>\n<br/>\n&gt; &gt;  &gt; then check the results (assert).<br/>\n&gt; &gt; <br/>\n&gt; &gt; See you&#39;re forgetting a few things, when dealing with stateful<br/>\n&gt; &gt; external systems.  <br/>\n&gt; <br/>\n&gt; Rudeness objection again. You do not know what I&#39;m remembering and what <br/>\n&gt; I&#39;m forgetting.<br/>\n<br/>\nYou&#39;re absolutely right, I shouldn&#39;t have said you had<br/>\nforgotten it, merely to point out that you left it out, and<br/>\nI consider it something very important.<br/>\n<br/>\n[...deletia...]<br/>\n&gt; Example: test #1 fails, and tests #2-#10 are now meaningless, because <br/>\n&gt; #1&#39;s failure leaves the system in an undesirable, strange state. To me, <br/>\n&gt; test failures ought not to affect one another.<br/>\n<br/>\nThis is the heirarchical test argument, and I don&#39;t want to get into it,<br/>\nbecause I have a &#39;practical&#39; and &#39;theoretical&#39; side, and they disagree<br/>\nvigorously with each other on this one.  :)  For any system that talks<br/>\nto a persistent store, there is always going to be a tear-down state<br/>\nthat has to be done.  If you don&#39;t allow it to talk to the persistent<br/>\nstore, then you&#39;re not testing all your code.<br/>\n<br/>\n[...deletia...]<br/>\n<br/>\n&gt; &gt; Statics aren&#39;t an answer, and the framework forcing them on<br/>\n&gt; &gt; tests is a failure in the framework.  I was hoping that wasn&#39;t<br/>\n&gt; &gt; the answer.<br/>\n&gt; <br/>\n&gt; Statics aren&#39;t an answer, and having to use them is a failure in the <br/>\n&gt; design of the production code.<br/>\n&gt; <br/>\n&gt; (It sounds silly when I state it that way, doesn&#39;t it?)<br/>\n<br/>\nStatics in production code would lead to an instant code<br/>\nreview, group meeting, and a (probably private) chewing<br/>\nout of the author, for anything more than an m_instance<br/>\nfor a singleton object.  No, it&#39;s not silly.  It&#39;s deadly serious<br/>\nwhen it comes to multi-threading, and it&#39;s a code smell in<br/>\nany other case.<br/>\n<br/>\nI strongly dislike having to use statics in my test suites, for<br/>\nthose reasons, among others.<br/>\n<br/>\n&gt; I&#39;m afraid that /you/ have misread /me/.<br/>\n&gt; <br/>\n&gt; I wrote: &quot;your test is doing too much&quot;<br/>\n&gt; You wrote: &quot;Each test is testing a single, basic unit...&quot;<br/>\n&gt; <br/>\n&gt; I didn&#39;t say that your test was /testing/ too much. I said that your <br/>\n&gt; test is /doing/ too much. Here&#39;s the distinction: the &quot;too much&quot; that <br/>\n&gt; your test is doing is jumping through hoops to set up global state that <br/>\n&gt; such a test does not need to set up, /if/ you approach it slightly <br/>\n&gt; differently.<br/>\n<br/>\nI&#39;m at a loss, I admit.  I need to test reading a message from a<br/>\nserver.  How do I do that, without writing the message to the<br/>\nserver first?  How do I test that the entire code path is working?<br/>\n<br/>\n&gt; &gt; [...multithreaded tests...]<br/>\n&gt; <br/>\n&gt; [...deletia: suggest Silk Performer?...]<br/>\n&gt; <br/>\n&gt; I feel even more strongly now that JUnit is not the right tool for the <br/>\n&gt; job you&#39;re trying to perform.<br/>\n<br/>\nIt is the best tool available for it, but it IS doing a different<br/>\nscope of tests than JUnit intends, I now completely agree.<br/>\nHowever, JUnit is mere inches away from being usable for<br/>\nit, so I&#39;m probably going to make a local change to be<br/>\nable to do the tests I need.<br/>\n<br/>\nSilk Performer, Load Runner, and such, are all good tools,<br/>\nbut they are for later in the process.<br/>\n<br/>\n&gt; &gt; [...deletia: massiveTest calling storageTest repeatedly...]<br/>\n&gt; <br/>\n&gt; I imagine you could build your own test runner easily enough to execute <br/>\n&gt; all the tests in a suite against the same fixture data.<br/>\n<br/>\nI&#39;d have to change TestSuite, rather than a test runner of my own,<br/>\nespecially as I generally run the tests under IntelliJ, before checking<br/>\nin my code.<br/>\n<br/>\n&gt; I still think that simply using class-level data would suffice. I still <br/>\n&gt; don&#39;t understand the objection. It appears that your tests are using <br/>\n&gt; some external resource (like a database, mail server/client, whatever). <br/>\n&gt; What&#39;s the difference between using an external resource and class-level <br/>\n&gt; data? It&#39;s all global, from the test case&#39;s point of view. I don&#39;t <br/>\n&gt; understand why using one would be any better or worse than using the other.<br/>\n<br/>\nBecause statics don&#39;t work on a multi-threaded project, and<br/>\nin order to re-use test knowledge, I want to reuse the storage<br/>\ntest case.<br/>\n<br/>\n&gt; &gt; [...deletia: TestResult extensions...]<br/>\n&gt; I /think/ I understand. There /are/ multithreaded extensions to JUnit, <br/>\n&gt; although I&#39;ve never tried any of them. MTUnit comes to mind, although <br/>\n&gt; that could be wrong. It may be worth examining.<br/>\n<br/>\nThere are, and MTUnit (that&#39;s the one recently released?) does some<br/>\nvery, very trippy things to work around TestResult results not being<br/>\naggregatable.<br/>\n<br/>\nHowever, a good point was made, that doing the tests I&#39;m having<br/>\ntrouble with are in the end, more functional than unit, and so not<br/>\nin the scope of JUnit.  I need this functionality *in* JUnit (because<br/>\nJUnit is supported by my toolchain), in order to do my testing<br/>\nquickly and easily before I do checkins, but it&#39;s not in the mission<br/>\nof JUnit to do this, so I shouldn&#39;t expect it from the framework.<br/>\n<br/>\n--  Morgan Schweers </span></blockquote></div>", 
    "prevInTime": 11539, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1090005527", 
    "canDelete": false, 
    "nextInTopic": 11541, 
    "prevInTopic": 11539, 
    "headers": {
        "inReplyToHeader": "PDQwRjdEQTgwLjcwOTAxMDZAcm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PGNkOTltbys2NHIxQGVHcm91cHMuY29tPg=="
    }
}