{
    "numMessagesInTopic": 16, 
    "nextInTime": 11543, 
    "senderId": "aWmVpQmOanqFEJ_cZ_wW9H7TJHvuQcHkZe5sQ3Yo-t7dcjwUO8-zNECOtKHWGk0bF2URrpKOSWQo2cyg48DV-2sHbiLh4H5q", 
    "systemMessage": false, 
    "subject": "Mock objects...", 
    "from": "&quot;cypherfox&quot; &lt;cypherfox@...&gt;", 
    "authorName": "cypherfox", 
    "msgSnippet": "Greetings, On a totally different note... One of the things mentioned as a solution in the other thread I started (mea culpa), was mock objects.  I m familiar", 
    "msgId": 11542, 
    "profile": "cypherfox", 
    "topicId": 11542, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174888704, 
    "messageBody": "<div id=\"ygrps-yiv-204663239\">Greetings,<br/>\nOn a totally different note...<br/>\n<br/>\nOne of the things mentioned as a solution in the other<br/>\nthread I started (mea culpa), was mock objects.  I&#39;m<br/>\nfamiliar with the idea, have written several, and for<br/>\nsimple things it makes some sense, but people talk<br/>\nabout them as if they&#39;re much more useful than I see<br/>\nthem as.<br/>\n<br/>\nThis is an area that I really don&#39;t know very well,<br/>\nhaving only written a few &#39;mock objects&#39;, most of<br/>\nwhich ended up having *frustratingly* high levels<br/>\nof complexity themselves, just for test objects.<br/>\nAn example is a database mock I put together.<br/>\nI was able to make it mostly work (querying a<br/>\nlist of &#39;n&#39; most recent entries, for example, was a<br/>\npain), but it required a good bit of debugging, and<br/>\nit ended up being nearly as complex as the actual<br/>\ndatabase class (and more so, in some cases, when<br/>\nI needed to test getting data in various orders<br/>\nwhich is super-easy in SQL, and annoyingly hard<br/>\nwhen you have to implement it yourself.)<br/>\n<br/>\nIt gets worse when you&#39;re trying to mock one of<br/>\nyour own classes, still under active development.<br/>\nAs the interface changes, from refactoring, or just<br/>\nnew aspects, the mock has to change also, as well<br/>\nas the tests.  And sometimes you have to figure out<br/>\nhow to even implement the new interface parts in<br/>\nthe mock, if at all possible.<br/>\n<br/>\nIf all you&#39;re doing is returning a single value, then<br/>\nyou can&#39;t reasonably test, &#39;get next&#39; type calls, or<br/>\nanything like that.  You need to add state to your<br/>\nmock, and *poof* you&#39;ve gotten into a situation<br/>\nwhere your mock is nearly as complex as the real<br/>\nthing.<br/>\n<br/>\nHow the heck do people mock things like database<br/>\naccess classes, mail servers, arbitrary web requests,<br/>\netc., without writing a huge amount of logic?<br/>\n<br/>\nWhat am I missing?<br/>\n<br/>\n--  Morgan Schweers</div>", 
    "prevInTime": 11541, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1090006916", 
    "canDelete": false, 
    "nextInTopic": 11544, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGNkOWIyNCtybThvQGVHcm91cHMuY29tPg=="
    }
}