{
    "numMessagesInTopic": 18, 
    "nextInTime": 11544, 
    "senderId": "HBzBGlfuz-IzUcCqlH3xbciWDv1hd8WyTe7nyI7iKsHOJc1wAqG1P-q4sDslWMFlb6EtAJh7SAKqU8U8FzEp5p0zuUYOkXTmdGyaH-E3CQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Did my question get missed, somehow?", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... That depends: if I m testing whether I can pull a message from an incoming mail server and display it on a screen, I can fake all those things. Of course,", 
    "msgId": 11543, 
    "profile": "nails762", 
    "topicId": 11495, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-1206650976\">cypherfox wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; Well of course not! I would /never/ do such a thing! I would just pull<br/>\n&gt;  &gt; out the &quot;read message&quot; part and test it in isolation. I do that all the<br/>\n&gt;  &gt; time, successfully, with JUnit.<br/>\n&gt; <br/>\n&gt; The problem is that &#39;read message&#39; talks to a persistent mail<br/>\n&gt; server.  It has to have a message on it to read.  It has to have<br/>\n&gt; a user on it to read the message to.  It has to have a mailbox<br/>\n&gt; to read the message in.  It has to have selected that mailbox.<br/>\n<br/>\n </span></blockquote>That depends: if I&#39;m testing whether I can pull a message from an <br/>\nincoming mail server and display it on a screen, I can fake all those <br/>\nthings.<br/>\n<br/>\nOf course, if you&#39;re testing end-to-end for concurrency purposes, then I <br/>\nagree, and as we&#39;ve seen, that changes everything.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Mock objects don&#39;t test the actual networking code, and<br/>\n&gt; require 1.5x the maintenance anyway.  (Interface changes,<br/>\n&gt; especially for code still under heavy development, need to be<br/>\n&gt; propogated not only to the test, but to the mock objects,<br/>\n&gt; constantly.)<br/>\n<br/>\n </span></blockquote>Even if it&#39;s 50% more maintenance, the tests would run, test what you <br/>\nneeded, and be much faster than trying to test message-reading logic <br/>\nagainst a real mail server. The overall cost is lower!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I test from the bottom up, running the lowest layer of tests<br/>\n&gt; first.  If any level fails, I ignore the rest of the results until<br/>\n&gt; that layer is fixed.  However, since some information (like<br/>\n&gt; hostnames) is passed from the top layer all the way down,<br/>\n&gt; a bug in the top layer that generates a bad host name can<br/>\n&gt; only be caught by the bottom layer actually trying to do<br/>\n&gt; the work.<br/>\n<br/>\n </span></blockquote>&quot;caught by&quot; or &quot;thrown by&quot;? I think you mean to say &quot;I won&#39;t know the <br/>\nhostname is bad until I try to use it.&quot; Perhaps. Perhaps another <br/>\nalternative is to check the hostname at startup and generate a log <br/>\nwarning or error saying &quot;Could not reach mail server&quot;. That may or may <br/>\nnot be a fatal startup error. That may or may not be something useful. <br/>\nI&#39;m just spinning alternatives, here.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; &gt;  &gt; [...deletia: arrange, act, assert...]<br/>\n&gt;  &gt; &gt;<br/>\n&gt;  &gt; &gt; Done through the prior tests, and since they&#39;ve presumably<br/>\n&gt;  &gt; &gt; succeeded, the next test can run.<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; With object-level testing, /each/ test contains the &quot;Arrange, act,<br/>\n&gt;  &gt; assert&quot; triad. In order for these tests to run quickly, each part must<br/>\n&gt;  &gt; run quickly, and it turns out that when you make that a goal, good<br/>\n&gt;  &gt; things happen. Different things than you&#39;re accustomed to, but good <br/>\n&gt; things.<br/>\n&gt; <br/>\n&gt; The problem here is that the information is on a<br/>\n&gt; server.  In order to arrange, I need to go through<br/>\n&gt; all the setup steps (create user, mailbox, message).<br/>\n&gt; <br/>\n&gt; How would you accelerate that, and still allow the<br/>\n&gt; readMessage test to actually test the networking<br/>\n&gt; code?<br/>\n<br/>\n </span></blockquote>That you can&#39;t do; but then, to test message-reading logic, there&#39;s no <br/>\nneed to talk to the network.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; &gt; E.g., The &#39;read message&#39;, which is the only thing of interest to the<br/>\n&gt;  &gt; &gt; testReadMessage method.<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; Right. There should be absolutely no need to set up the system in a<br/>\n&gt;  &gt; complicated manner, just to read a message (whatever that means in this<br/>\n&gt;  &gt; context). Would you describe what &quot;read message&quot; does?<br/>\n&gt; <br/>\n&gt; Passes a request to a persistent IMAP-client thread which<br/>\n&gt; then queries the IMAP server for the message, and returns<br/>\n&gt; it, then its converted to XML.  That&#39;s a broad overview, it<br/>\n&gt; goes through several layers before that including some<br/>\n&gt; authentication, for example.<br/>\n<br/>\n </span></blockquote>I suppose you&#39;re threading because you don&#39;t want to block on the <br/>\nrequest for retrieving mail. Does your user actually do anything while <br/>\nwaiting for mail to be retrieved? (If you have freedom to block, you <br/>\nremove a layer of complexity.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; [...deletia...]<br/>\n&gt;  &gt; Example: test #1 fails, and tests #2-#10 are now meaningless, because<br/>\n&gt;  &gt; #1&#39;s failure leaves the system in an undesirable, strange state. To me,<br/>\n&gt;  &gt; test failures ought not to affect one another.<br/>\n&gt; <br/>\n&gt; This is the heirarchical test argument, and I don&#39;t want to get into it,<br/>\n&gt; because I have a &#39;practical&#39; and &#39;theoretical&#39; side, and they disagree<br/>\n&gt; vigorously with each other on this one.  :)  For any system that talks<br/>\n&gt; to a persistent store, there is always going to be a tear-down state<br/>\n&gt; that has to be done.  If you don&#39;t allow it to talk to the persistent<br/>\n&gt; store, then you&#39;re not testing all your code.<br/>\n<br/>\n </span></blockquote>Sure I&#39;m testing all my code. I&#39;m just choosing not to test JDBC at the <br/>\nsame time. JDBC works, for the most part; I don&#39;t need to test it. I <br/>\nonly need to know whether I use it correctly. Don&#39;t test the platform.<br/>\n<br/>\nI wish I had an open project of this type so that I could give it to you <br/>\nto hammer on for a while... maybe that would make it clear how what I do <br/>\ncould possibly work.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; [...deletia...]<br/>\n&gt; <br/>\n&gt;  &gt; &gt; Statics aren&#39;t an answer, and the framework forcing them on<br/>\n&gt;  &gt; &gt; tests is a failure in the framework.  I was hoping that wasn&#39;t<br/>\n&gt;  &gt; &gt; the answer.<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; Statics aren&#39;t an answer, and having to use them is a failure in the<br/>\n&gt;  &gt; design of the production code.<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; (It sounds silly when I state it that way, doesn&#39;t it?)<br/>\n&gt; <br/>\n&gt; Statics in production code would lead to an instant code<br/>\n&gt; review, group meeting, and a (probably private) chewing<br/>\n&gt; out of the author, for anything more than an m_instance<br/>\n&gt; for a singleton object.  No, it&#39;s not silly.  It&#39;s deadly serious<br/>\n&gt; when it comes to multi-threading, and it&#39;s a code smell in<br/>\n&gt; any other case.<br/>\n&gt; <br/>\n&gt; I strongly dislike having to use statics in my test suites, for<br/>\n&gt; those reasons, among others.<br/>\n<br/>\n </span></blockquote>Class-level data is not a code smell on its own. With greatest love and <br/>\nrespect, I find that statement utterly ridiculous.<br/>\n<br/>\nIf you are on a team that (rightly so) views any use of class-level data <br/>\nas suspicious, and you want to avoid suspicion, I understand; but I <br/>\nwould not routinely use that as a reason not to do what needs to be done.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; I&#39;m afraid that /you/ have misread /me/.<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; I wrote: &quot;your test is doing too much&quot;<br/>\n&gt;  &gt; You wrote: &quot;Each test is testing a single, basic unit...&quot;<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; I didn&#39;t say that your test was /testing/ too much. I said that your<br/>\n&gt;  &gt; test is /doing/ too much. Here&#39;s the distinction: the &quot;too much&quot; that<br/>\n&gt;  &gt; your test is doing is jumping through hoops to set up global state that<br/>\n&gt;  &gt; such a test does not need to set up, /if/ you approach it slightly<br/>\n&gt;  &gt; differently.<br/>\n&gt; <br/>\n&gt; I&#39;m at a loss, I admit.  I need to test reading a message from a<br/>\n&gt; server.  How do I do that, without writing the message to the<br/>\n&gt; server first?  How do I test that the entire code path is working?<br/>\n<br/>\n </span></blockquote>Test /your/ code, and not the IMAP implementation--unless, of course, <br/>\nyou wrote the IMAP implementation. Even if you did write it, test /that/ <br/>\non its own, then trust that it works. Hide the IMAP implementation <br/>\nbehind an interface, then pretend it isn&#39;t there. If your fake behaves <br/>\nthe same way the actual implementation does, then how does its client <br/>\ntell the difference?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; &gt; [...multithreaded tests...]<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; [...deletia: suggest Silk Performer?...]<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; I feel even more strongly now that JUnit is not the right tool for the<br/>\n&gt;  &gt; job you&#39;re trying to perform.<br/>\n&gt; <br/>\n&gt; It is the best tool available for it, but it IS doing a different<br/>\n&gt; scope of tests than JUnit intends, I now completely agree.<br/>\n&gt; However, JUnit is mere inches away from being usable for<br/>\n&gt; it, so I&#39;m probably going to make a local change to be<br/>\n&gt; able to do the tests I need.<br/>\n<br/>\n </span></blockquote>Then that sounds good.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Silk Performer, Load Runner, and such, are all good tools,<br/>\n&gt; but they are for later in the process.<br/>\n<br/>\n </span></blockquote>I don&#39;t understand why, but it&#39;s your decision.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;  &gt; &gt; [...deletia: massiveTest calling storageTest repeatedly...]<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; I imagine you could build your own test runner easily enough to execute<br/>\n&gt;  &gt; all the tests in a suite against the same fixture data.<br/>\n&gt; <br/>\n&gt; I&#39;d have to change TestSuite, rather than a test runner of my own,<br/>\n&gt; especially as I generally run the tests under IntelliJ, before checking<br/>\n&gt; in my code.<br/>\n<br/>\n </span></blockquote>Does IntelliJ not make building plugins easy enough? I&#39;m just learning <br/>\nto write Eclipse plugins, myself. It seems a pretty useful skill.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; I still think that simply using class-level data would suffice. I still<br/>\n&gt;  &gt; don&#39;t understand the objection. It appears that your tests are using<br/>\n&gt;  &gt; some external resource (like a database, mail server/client, whatever).<br/>\n&gt;  &gt; What&#39;s the difference between using an external resource and class-level<br/>\n&gt;  &gt; data? It&#39;s all global, from the test case&#39;s point of view. I don&#39;t<br/>\n&gt;  &gt; understand why using one would be any better or worse than using the <br/>\n&gt; other.<br/>\n&gt; <br/>\n&gt; Because statics don&#39;t work on a multi-threaded project, and<br/>\n&gt; in order to re-use test knowledge, I want to reuse the storage<br/>\n&gt; test case.<br/>\n<br/>\n </span></blockquote>Well, you seem to have a decision, and you seem to be ready to move <br/>\nforward. I have to wonder, though: why does a database work on a <br/>\nmultithreaded project, but class-level data does not? I&#39;ve seen plenty <br/>\nof projects that use multithreading, but nevertheless talk to a <br/>\ndatabase. Or maybe I got it wrong.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; &gt; [...deletia: TestResult extensions...]<br/>\n&gt;  &gt; I /think/ I understand. There /are/ multithreaded extensions to JUnit,<br/>\n&gt;  &gt; although I&#39;ve never tried any of them. MTUnit comes to mind, although<br/>\n&gt;  &gt; that could be wrong. It may be worth examining.<br/>\n&gt; <br/>\n&gt; There are, and MTUnit (that&#39;s the one recently released?) does some<br/>\n&gt; very, very trippy things to work around TestResult results not being<br/>\n&gt; aggregatable.<br/>\n&gt; <br/>\n&gt; However, a good point was made, that doing the tests I&#39;m having<br/>\n&gt; trouble with are in the end, more functional than unit, and so not<br/>\n&gt; in the scope of JUnit.  I need this functionality *in* JUnit (because<br/>\n&gt; JUnit is supported by my toolchain), in order to do my testing<br/>\n&gt; quickly and easily before I do checkins, but it&#39;s not in the mission<br/>\n&gt; of JUnit to do this, so I shouldn&#39;t expect it from the framework.<br/>\n<br/>\n </span></blockquote>I don&#39;t think you /need/ to do it in JUnit. I think you could probably <br/>\ndo it in Ant (say), then run that before checkins. I admit, it would be <br/>\n/nice/ to do it with JUnit, but you may be making work for yourself by <br/>\ndeciding that it /must/ be that way.<br/>\n-- <br/>\nJ. B. Rainsberger,<br/>\nDiaspar Software Services<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com\">http://www.diasparsoftware.com</a> :: +1 416 791-8603<br/>\nLet&#39;s write software that people understand</div>", 
    "prevInTime": 11542, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1090007268", 
    "canDelete": false, 
    "nextInTopic": 11550, 
    "prevInTopic": 11541, 
    "headers": {
        "inReplyToHeader": "PGNkOTltbys2NHIxQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDQwRjgzMEU0LjQwMTAzMDRAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PGNkOTltbys2NHIxQGVHcm91cHMuY29tPg=="
    }
}