{
    "numMessagesInTopic": 18, 
    "nextInTime": 11551, 
    "senderId": "9ZJ6et3jiKo164HKQCAVp0RNHJOl2o3iemWG-6f28E9AGj9Rql1IKgQtxdJrphbIQJ9uLSdOjXtCLdXlZYYiGRJzOQw4piU4", 
    "systemMessage": false, 
    "subject": "Re: Did my question get missed, somehow?", 
    "from": "&quot;cypherfox&quot; &lt;cypherfox@...&gt;", 
    "authorName": "cypherfox", 
    "msgSnippet": "Greetings, Hmmm...  This is getting long. ... those ... It s actually just testing that it retrieves the message from the server, and gets the right data,", 
    "msgId": 11550, 
    "profile": "cypherfox", 
    "topicId": 11495, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174888704, 
    "messageBody": "<div id=\"ygrps-yiv-1165327694\">Greetings,<br/>\nHmmm...  This is getting long.<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;J. B. Rainsberger&quot; &lt;jbrains@r...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; cypherfox wrote:<br/>\n&gt; &gt; [...deletia: &#39;read message&#39; talks to a persistent mail server...]<br/>\n&gt; <br/>\n&gt; That depends: if I&#39;m testing whether I can pull a message from an <br/>\n&gt; incoming mail server and display it on a screen, I can fake all<br/>\n </span></blockquote>those <br/>\n<blockquote><span title=\"ireply\"> &gt; things.<br/>\n<br/>\n </span></blockquote>It&#39;s actually just testing that it retrieves the message from the<br/>\nserver, and gets the right data, after it&#39;s converted to XML.<br/>\n<br/>\nAn example of the kind of bug found, my unit tests discovered<br/>\nthat I was losing the final CRLF in the data being converted to<br/>\nXML after having been written and re-read, because the data<br/>\ncame back in LF-only format.  Killer bug?  No.  Good to know?<br/>\nYeah, definitely.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Of course, if you&#39;re testing end-to-end for concurrency purposes,<br/>\n </span></blockquote>then I <br/>\n<blockquote><span title=\"ireply\"> &gt; agree, and as we&#39;ve seen, that changes everything.<br/>\n<br/>\n </span></blockquote>And this is another aspect of my tests, albiet one that is<br/>\noutside of JUnit&#39;s scope, but achievable with custom mods.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Mock objects don&#39;t test the actual networking code, and<br/>\n&gt; &gt; require 1.5x the maintenance anyway.  (Interface changes,<br/>\n&gt; &gt; especially for code still under heavy development, need to be<br/>\n&gt; &gt; propogated not only to the test, but to the mock objects,<br/>\n&gt; &gt; constantly.)<br/>\n&gt; <br/>\n&gt; Even if it&#39;s 50% more maintenance, the tests would run, test what<br/>\n </span></blockquote>you <br/>\n<blockquote><span title=\"ireply\"> &gt; needed, and be much faster than trying to test message-reading<br/>\n </span></blockquote>logic <br/>\n<blockquote><span title=\"ireply\"> &gt; against a real mail server. The overall cost is lower!<br/>\n<br/>\n </span></blockquote>...but the value of the tests is less certain, because it&#39;s not<br/>\ntesting<br/>\nthe real logic, and you have to watch out for bugs in the mock<br/>\nobjects.  The key comes later, though, because it&#39;s *all* my code,<br/>\neffectively.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; a bug in the top layer that generates a bad host name can<br/>\n&gt; &gt; only be caught by the bottom layer actually trying to do<br/>\n&gt; &gt; the work.<br/>\n&gt; <br/>\n&gt; &quot;caught by&quot; or &quot;thrown by&quot;?<br/>\n<br/>\n </span></blockquote>Heh, switching between english and code.  Sorry, &#39;caught by&#39; here<br/>\nmeans that the bottom Java layer fails to connect, notes (catches,<br/>\nsees) the error, and sends back an XML &#39;error&#39; response.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I think you mean to say &quot;I won&#39;t know the <br/>\n&gt; hostname is bad until I try to use it.&quot; Perhaps. Perhaps another <br/>\n&gt; alternative is to check the hostname at startup and generate a log <br/>\n&gt; warning or error saying &quot;Could not reach mail server&quot;. That may or<br/>\n </span></blockquote>may <br/>\n<blockquote><span title=\"ireply\"> &gt; not be a fatal startup error. That may or may not be something<br/>\n </span></blockquote>useful. <br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m just spinning alternatives, here.<br/>\n<br/>\n </span></blockquote>True, and while there&#39;s logic (for load balancing on the real site)<br/>\nthat generates a list of servers, I can lock it to a subset, but this<br/>\ndoesn&#39;t test the real world use, again.  I know I&#39;m conflating the<br/>\nunit and functional tests again, but since nobody but me is<br/>\ngoing to write the functional tests, and I need to be confident<br/>\nthat the code is solid when I hand it off to our small, overworked<br/>\nQA group.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; How would you accelerate that, and still allow the<br/>\n&gt; &gt; readMessage test to actually test the networking<br/>\n&gt; &gt; code?<br/>\n&gt; <br/>\n&gt; That you can&#39;t do; but then, to test message-reading logic, there&#39;s<br/>\n </span></blockquote>no <br/>\n<blockquote><span title=\"ireply\"> &gt; need to talk to the network.<br/>\n<br/>\n </span></blockquote>I admit, I balk at testing the rough equivalent of<br/>\n  &#39;foo() { return bar(); }&#39;<br/>\nwith<br/>\n  &#39;bar() { return &quot;answer&quot;; }&#39;<br/>\nand then<br/>\n  &#39;assertEquals(foo(), &quot;answer&quot;);&#39;<br/>\nIf my messageRead calls to a storage server to get the message,<br/>\nthere&#39;s not much conditional logic (as it should be, and barring<br/>\nerrors) between the call and the spot that I&#39;d put a mock object<br/>\nto return the answer.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Passes a request to a persistent IMAP-client thread which<br/>\n&gt; &gt; then queries the IMAP server for the message, and returns<br/>\n&gt; &gt; it, then its converted to XML.  That&#39;s a broad overview, it<br/>\n&gt; &gt; goes through several layers before that including some<br/>\n&gt; &gt; authentication, for example.<br/>\n&gt; <br/>\n&gt; I suppose you&#39;re threading because you don&#39;t want to block on the <br/>\n&gt; request for retrieving mail. Does your user actually do anything<br/>\n </span></blockquote>while <br/>\n<blockquote><span title=\"ireply\"> &gt; waiting for mail to be retrieved? (If you have freedom to block,<br/>\n </span></blockquote>you <br/>\n<blockquote><span title=\"ireply\"> &gt; remove a layer of complexity.)<br/>\n<br/>\n </span></blockquote>Actually, the problem is that this layer is in the middle of an<br/>\noutfacing set of load-balanced no-shared-information servers<br/>\neach of which take up to 300 connections from a web front end,<br/>\nand filter it to a (theoretically smaller) set of threaded queues<br/>\nwhich talk to &#39;n&#39; servers on the back end.  As entries are put into<br/>\nthe queue to be run, a thread that talks to the IMAP server wakes<br/>\nup and processes it, putting the result into a result queue for<br/>\nthe front-facing threads to pick up.  It&#39;s a pretty deep system,<br/>\nso for me to feel confidence in it, the testing of all levels is<br/>\nintensely crucial before I hand off the code.<br/>\n<br/>\nEffectively it&#39;s translation of IMAP queries to a more friendly<br/>\nprotocol for our front-end facing engineers to code to, as well<br/>\nas hiding the load balancing, database activities, and XML<br/>\ntranslation from them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sure I&#39;m testing all my code. I&#39;m just choosing not to test JDBC at<br/>\n </span></blockquote>the <br/>\n<blockquote><span title=\"ireply\"> &gt; same time. JDBC works, for the most part; I don&#39;t need to test it.<br/>\n </span></blockquote>I <br/>\n<blockquote><span title=\"ireply\"> &gt; only need to know whether I use it correctly. Don&#39;t test the<br/>\n </span></blockquote>platform.<br/>\n<br/>\nUnfortunately, I *am* the platform.  The IMAP server is customized<br/>\nwith my modifications which are used by the IMAP client which is<br/>\ncompletely implemented by our own engineers (actually, another<br/>\nengineer, and totally refactored by me, as it was a quick hack to<br/>\ndemo that we could even do it).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; [...deletia: I don&#39;t like statics...]<br/>\n&gt; &gt; those reasons, among others.<br/>\n&gt; <br/>\n&gt; Class-level data is not a code smell on its own. With greatest love<br/>\n </span></blockquote>and <br/>\n<blockquote><span title=\"ireply\"> &gt; respect, I find that statement utterly ridiculous.<br/>\n<br/>\n </span></blockquote>I understand that you, and many others, feel that way.  The problem<br/>\nis that anything class-level is inherently dangerous for<br/>\nmulti-threaded<br/>\napps.  You have to treat static (mutable!) data as a hand grenade, and<br/>\ncarefully check the pin every time you touch it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you are on a team that (rightly so) views any use of class-level<br/>\n </span></blockquote>data <br/>\n<blockquote><span title=\"ireply\"> &gt; as suspicious, and you want to avoid suspicion, I understand; but I <br/>\n&gt; would not routinely use that as a reason not to do what needs to be<br/>\n </span></blockquote>done.<br/>\n<br/>\nI understand, and I make very sparing use of class-level data,<br/>\nbut I always must have a good reason, as it has always been a<br/>\ncode smell to me.  Even disregarding the unpleasantness of<br/>\nmultithreaded code, every time I&#39;ve removed excessive statics<br/>\nfrom my code, the code has gotten better.  I think of them as<br/>\nfile-global variables (C++ism) and that gets my hackles up<br/>\nquickly.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; I&#39;m at a loss, I admit.  I need to test reading a message from a<br/>\n&gt; &gt; server.  How do I do that, without writing the message to the<br/>\n&gt; &gt; server first?  How do I test that the entire code path is working?<br/>\n&gt; <br/>\n&gt; Test /your/ code, and not the IMAP implementation--unless, of<br/>\n </span></blockquote>course, <br/>\n<blockquote><span title=\"ireply\"> &gt; you wrote the IMAP implementation.<br/>\n<br/>\n </span></blockquote>Well, we (as a company) did, and I (embarassed admission) don&#39;t<br/>\ntotally trust it, even though I&#39;ve massively re-written it.  If I&#39;d<br/>\nwritten it from scratch with the interface I&#39;ve put on it, I&#39;d trust<br/>\nit,<br/>\nbecause I&#39;d have written unit tests for it as I went.  I&#39;ve had to<br/>\nback-build unit tests for it, even as I refactored it, and the<br/>\nresult is a LOT better, but I sleep better knowing that my tests do<br/>\ngo all the way through the process of manipulating the client<br/>\nclass.  (Yes, I do know that the red flag of &#39;write more tests for<br/>\nthat class!&#39; has been raised with this.  I do whenever I can, but<br/>\ntesting the whole stack does a great job of shaking out the<br/>\nissues.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Even if you did write it, test /that/ <br/>\n&gt; on its own, then trust that it works. Hide the IMAP implementation <br/>\n&gt; behind an interface, then pretend it isn&#39;t there. If your fake<br/>\n </span></blockquote>behaves <br/>\n<blockquote><span title=\"ireply\"> &gt; the same way the actual implementation does, then how does its<br/>\n </span></blockquote>client <br/>\n<blockquote><span title=\"ireply\"> &gt; tell the difference?<br/>\n<br/>\n </span></blockquote>This gets to my Mock question, because if my fake *behaves*<br/>\nthe same way, how is it very much less complex than the<br/>\nclient + the server together?  That&#39;s the other thread, though.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; [...deletia: minor local mods to JUnit will work for me...]<br/>\n&gt; <br/>\n&gt; Then that sounds good.<br/>\n&gt; <br/>\n&gt; &gt; Silk Performer, Load Runner, and such, are all good tools,<br/>\n&gt; &gt; but they are for later in the process.<br/>\n&gt; <br/>\n&gt; I don&#39;t understand why, but it&#39;s your decision.<br/>\n<br/>\n </span></blockquote>Because those tools automate user interaction, and potentially<br/>\nprotocol interaction, not actual API calls.  QA will probably use<br/>\nsomething like that for testing the protocol that I expose,<br/>\nbut for this I&#39;m trying to test my code, so I feel confident<br/>\nthat QA will be able to test the even larger picture.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Does IntelliJ not make building plugins easy enough? I&#39;m just<br/>\n </span></blockquote>learning <br/>\n<blockquote><span title=\"ireply\"> &gt; to write Eclipse plugins, myself. It seems a pretty useful skill.<br/>\n<br/>\n </span></blockquote>It probably is, but to reimplement pretty much everything that was<br/>\ndone for the JUnit plugin (which comes with it) would be a lot outside<br/>\nthe &#39;core competency&#39; of the company I&#39;m working for, and I don&#39;t<br/>\nthink they&#39;d buy off on the time.  Entirely political, corporate and<br/>\neconomic issues, not technical.  The whole practical vs. theoretical<br/>\nthing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Because statics don&#39;t work on a multi-threaded project, and<br/>\n&gt; &gt; in order to re-use test knowledge, I want to reuse the storage<br/>\n&gt; &gt; test case.<br/>\n&gt; <br/>\n&gt; Well, you seem to have a decision, and you seem to be ready to move <br/>\n&gt; forward. I have to wonder, though: why does a database work on a <br/>\n&gt; multithreaded project, but class-level data does not? I&#39;ve seen<br/>\n </span></blockquote>plenty <br/>\n<blockquote><span title=\"ireply\"> &gt; of projects that use multithreading, but nevertheless talk to a <br/>\n&gt; database. Or maybe I got it wrong.<br/>\n<br/>\n </span></blockquote>A database provides a point of synchronization.  When you talk to<br/>\nthe database, the server itself serializes (to some extent) your<br/>\nactivity, and manages the concurrency.  With multi-threading,<br/>\nirregardless of a database, you have to carefully manage your own<br/>\nsynchronization on static variables.  If at all possible, the best<br/>\nanswer is to not use class-level data.<br/>\n<br/>\nThe difference between an external server and an internal class<br/>\nvariable is that the external server behaves as a point of<br/>\nsynchronization.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; However, a good point was made, that doing the tests I&#39;m having<br/>\n&gt; &gt; trouble with are in the end, more functional than unit, and so not<br/>\n&gt; &gt; in the scope of JUnit.  I need this functionality *in* JUnit<br/>\n </span></blockquote>(because<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; JUnit is supported by my toolchain), in order to do my testing<br/>\n&gt; &gt; quickly and easily before I do checkins, but it&#39;s not in the<br/>\n </span></blockquote>mission<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; of JUnit to do this, so I shouldn&#39;t expect it from the framework.<br/>\n&gt; <br/>\n&gt; I don&#39;t think you /need/ to do it in JUnit. I think you could<br/>\n </span></blockquote>probably <br/>\n<blockquote><span title=\"ireply\"> &gt; do it in Ant (say), then run that before checkins. I admit, it<br/>\n </span></blockquote>would be <br/>\n<blockquote><span title=\"ireply\"> &gt; /nice/ to do it with JUnit, but you may be making work for yourself<br/>\n </span></blockquote>by <br/>\n<blockquote><span title=\"ireply\"> &gt; deciding that it /must/ be that way.<br/>\n<br/>\n </span></blockquote>Well, the problem is I&#39;d have to reimplement all the great stuff<br/>\nthat&#39;s gone into the JUnit test suite, and THEN add my own<br/>\nstuff.  I&#39;m actually optimizing for the least work by adding a little<br/>\nsnippet of code to JUnit.<br/>\n<br/>\nIt&#39;s just that it&#39;s not in keeping with the intent of the framework.<br/>\n<br/>\n--  Morgan Schweers</div>", 
    "prevInTime": 11549, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1090014866", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 11543, 
    "headers": {
        "inReplyToHeader": "PDQwRjgzMEU0LjQwMTAzMDRAcm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PGNkOWlxaSt2bTd2QGVHcm91cHMuY29tPg=="
    }
}