{
    "numMessagesInTopic": 4, 
    "nextInTime": 11700, 
    "senderId": "WJRs_E81iGcw9BrBsPG807VBKu-TTiKT9i2pd0vRvMmU1wWBNbzuV4uroyokPPJtbt0YLGHOEu4hIIA26TEflPxwyhiNmuorODjeBp0oGh28_Uty", 
    "systemMessage": false, 
    "subject": "RE: [junit] Functionality Tests", 
    "from": "&quot;Kevin O&#39;Sullivan&quot; &lt;kosullivan@...&gt;", 
    "authorName": "Kevin O&#39;Sullivan", 
    "msgSnippet": "Hi -I ve recently worked on a project where the developers were using junit to write end-to-end tests and unless the DB was setup and the webservices were up", 
    "msgId": 11699, 
    "profile": "kosullivan_eland", 
    "topicId": 11677, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 42238173, 
    "messageBody": "<div id=\"ygrps-yiv-282532243\">Hi -I&#39;ve recently worked on a project where the developers were using junit<br/>\nto write end-to-end tests and unless the DB was setup and the webservices<br/>\nwere up and running the tests would fail.  My only problem with this was<br/>\nthey were stored in a source subdirectory called &#39;junit&#39; implying that they<br/>\nwere actual unit tests.<br/>\nI simply renamed the directory &#39;junit&#39; to &#39;systemtest&#39;, and changed the<br/>\ntarget names in ant&#39;s build.xml and everyone was happy - as far as I&#39;m<br/>\nconcerned it does not make any difference that junit is being used to drive<br/>\nsystem tests as long as its clear that they are system tests.<br/>\n<br/>\nIn your case, just keep what you have (system tests are as important as unit<br/>\ntests) and start writing unit tests. Realistically you can&#39;t retro fit unit<br/>\ntests to an existing project (time constraints), so just start adding unit<br/>\ntests for any code you modify, bug fix etc.<br/>\n<br/>\nRgds,<br/>\nKevin.<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jsa@...\">jsa@...</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jsa@...\">jsa@...</a>]<br/>\nSent: Wednesday, July 28, 2004 15:04<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSubject: [junit] Functionality Tests<br/>\n<br/>\n<br/>\nHy,<br/>\n<br/>\nafter some lurking on this list and following the discussions that happen<br/>\nhere I&#39;ve come to the conclusion that the tests I&#39;m currently running on<br/>\nmy project(s) are not really unit tests, although they use JUnit. As far<br/>\nas I can tell they can be more accurately described as beeing<br/>\nfunctionality tests as they usually test one use case end-to-end. That<br/>\ncame into beeing, since when I joined the project there were no tests at<br/>\nall (aside from a few bit-rotted functionallity tests) and I started<br/>\nwriting what I thought at that time to be unit tests.<br/>\n<br/>\nFor example there are several tests that define a query (defined in OQL<br/>\n(similar to SQL, but working on an object level)) that get&#39;s converted to<br/>\nSQL, run on the database, the result retrieved, converted to java objects<br/>\nand then my test checks wether the objects are exactly the objects that<br/>\nwere expected. I think I do have a rather clean idea how this could be<br/>\nsplit into unit tests, only the system I&#39;m testing is not modular enough<br/>\nto allow this. (And to refactor it I&#39;d need more tests, that I can&#39;t write<br/>\n&#39;till it&#39;s refactored ... a classical catch-22).<br/>\n<br/>\nFortunately there is some heavy refactoring in the future of this project<br/>\nthat will allow me to introduce more &quot;real&quot; unit tests ...<br/>\n<br/>\nThe reason I write all this down is that I&#39;d like to hear wether anyone of<br/>\nyou has any experience/good advice for this kind of unit-test-free legacy<br/>\nsystem. I&#39;d be interested how you use functionality tests (in addition to<br/>\nunit tests?) and wether anyone knows any tools that are better suited for<br/>\nthis kind of job than JUnit.<br/>\n<br/>\nregards<br/>\nJoachim Sauer<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Links</div>", 
    "prevInTime": 11698, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1091028666", 
    "canDelete": false, 
    "nextInTopic": 11703, 
    "prevInTopic": 11686, 
    "headers": {
        "inReplyToHeader": "PE9GMUQ5NjkyQUMuREE3NzRGNzktT040MjI1NkVERi4wMDRDNjQyRi00MjI1NkVERi4wMDRENDgwMkBzaWxiZXJncmF1LmNvbT4=", 
        "messageIdInHeader": "PE5FQkJJS0JNSUxFRU1OR0ZETk5JT0VJUENQQUEua29zdWxsaXZhbkBlbGFuZHRlY2guY29tPg=="
    }
}