{
    "numMessagesInTopic": 2, 
    "nextInTime": 11708, 
    "senderId": "PzkRsmkSWE6krIh-fDKkH787rAAu7v-kfmjHmSYEOBXYaNqqZhPEBbw2D4wroWoCW3byNR0HLW5L_FTULJXTYC5nBdC_oh9rnU_5Al4v9Q", 
    "systemMessage": false, 
    "subject": "Re: [junit] Please provide advice on automatic unit testing and test driven development", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... What Agitar and Parasoft do is no more automated unit testing than JUnit/TDD. It s all automated unit testing: automating unit tests. What Parasoft does", 
    "msgId": 11707, 
    "profile": "nails762", 
    "topicId": 11701, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-492193070\">analystresearch2002 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   I am a consultant working for a software company who has asked me to<br/>\n&gt; recommend new testing frameworks that will be becoming useful in the era<br/>\n&gt; of web services.<br/>\n&gt; <br/>\n&gt;   I&#39;ve run across test driven development - which appears to be a<br/>\n&gt; process of having developers develop JUnit tests before they write any<br/>\n&gt; code (i.e. document the symantics before you go to implementation)<br/>\n&gt; <br/>\n&gt;   I&#39;ve also run into automated unit testing - which appears to be a<br/>\n&gt; product concept:  reducing the burden of developers creating tests<br/>\n&gt; themselves - companies like Agitar and Parasoft are playing here.<br/>\n<br/>\n </span></blockquote>What Agitar and Parasoft do is no more &quot;automated unit testing&quot; than <br/>\nJUnit/TDD. It&#39;s all automated unit testing: automating unit tests.<br/>\n<br/>\nWhat Parasoft does is suggest tests for basic, generic boundary <br/>\nconditions. It&#39;s useful for testing legacy code.<br/>\n<br/>\nWhat Agitar does includes (but is not limited to) identifying behavioral <br/>\ninvariants for code, making it easy to promote those to assertions in <br/>\nJUnit tests. The idea appears to be that if something is invariant now, <br/>\nthen you&#39;d like it to be invariant from this day forward, so put it in a <br/>\ntest. This looks absolutely /killer/ for testing legacy code.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   I would like some feedback: what are the pro&#39;s and con&#39;s of these<br/>\n&gt; solutions?  Are there other solutions?  What types of companies would<br/>\n&gt; benefit from either of these?  What are the risks or downsides of<br/>\n&gt; using these systems?  Do you recommend either TDD or AUT and why?<br/>\n<br/>\n </span></blockquote>I have no experience with Parasoft&#39;s or Agitar&#39;s products, /however/ I <br/>\nknow others who do have such experience and am relaying some of that here.<br/>\n<br/>\nI recommend test-driving all new code. This is especially good for <br/>\ngreenfield projects, where /everything/ is new code. The advantages are <br/>\nnumerous and well-documented: 100% coverage, simpler cleaner designs, a <br/>\nsafety net for changes... the only disadvantage is not really a TDD <br/>\nproblem, but a learning problem--you have to learn how to do TDD.<br/>\n<br/>\nIf you need to add tests to existing code, Agitar&#39;s product looks like <br/>\nit would help out immensely in identifying what the product already does <br/>\nand making it easier to turn that information into regression tests.<br/>\n<br/>\nMost projects need to do both: add features (new code) and fix features <br/>\n(legacy code), and so I recommend test-driving the new features and <br/>\nusing something like Agitar&#39;s product to help add tests to the existing <br/>\ncode.<br/>\n-- <br/>\nJ. B. Rainsberger,<br/>\nDiaspar Software Services<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com\">http://www.diasparsoftware.com</a> :: +1 416 791-8603<br/>\nLet&#39;s write software that people understand</div>", 
    "prevInTime": 11706, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1091205699", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 11701, 
    "headers": {
        "inReplyToHeader": "PGNlYzNpYitmdjBjQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDQxMEE3QTQzLjEwMDAxMDdAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PGNlYzNpYitmdjBjQGVHcm91cHMuY29tPg=="
    }
}