{
    "numMessagesInTopic": 2, 
    "nextInTime": 11702, 
    "senderId": "Ly1ooCpAzL8KpzH_4h1zZBMoCHWc38l2BGfis81Pl3JiOxTEwtT_4dvUSMOUU_2mkJRw9V0layxc9YSqzkB0Hbwrk1BjJCs0UiK5AKd0z7B97uEj1rNDAKHkBbQ", 
    "systemMessage": false, 
    "subject": "Please provide advice on automatic unit testing and test driven development", 
    "from": "&quot;analystresearch2002&quot; &lt;analystresearch2002@...&gt;", 
    "authorName": "analystresearch2002", 
    "msgSnippet": "Hi there, I am a consultant working for a software company who has asked me to recommend new testing frameworks that will be becoming useful in the era of web", 
    "msgId": 11701, 
    "profile": "analystresearch2002", 
    "topicId": 11701, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 193749782, 
    "messageBody": "<div id=\"ygrps-yiv-308678648\">Hi there,<br/>\n<br/>\n  I am a consultant working for a software company who has asked me to<br/>\nrecommend new testing frameworks that will be becoming useful in the era<br/>\nof web services.<br/>\n<br/>\n  I&#39;ve run across test driven development - which appears to be a<br/>\nprocess of having developers develop JUnit tests before they write any<br/>\ncode (i.e. document the symantics before you go to implementation)<br/>\n<br/>\n  I&#39;ve also run into automated unit testing - which appears to be a<br/>\nproduct concept:  reducing the burden of developers creating tests<br/>\nthemselves - companies like Agitar and Parasoft are playing here.<br/>\n<br/>\n  I would like some feedback: what are the pro&#39;s and con&#39;s of these<br/>\nsolutions?  Are there other solutions?  What types of companies would<br/>\nbenefit from either of these?  What are the risks or downsides of<br/>\nusing these systems?  Do you recommend either TDD or AUT and why?<br/>\n<br/>\n  I could really use some intelligent feedback on this topic. <br/>\nAppreciate any help you can provide.  Thanks.</div>", 
    "prevInTime": 11700, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1091146123", 
    "canDelete": false, 
    "nextInTopic": 11707, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGNlYzNpYitmdjBjQGVHcm91cHMuY29tPg=="
    }
}