{
    "numMessagesInTopic": 9, 
    "nextInTime": 1185, 
    "senderId": "L-Z5iY6aB9MFIZQRggSvtSRIh4gLPB0DsnWQGX0dh17n5ZM7O2rOIWpic4eF5txoBytc8Z55ysgVJrluCaHzeSZhb1ZmBw", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Unit testing stochastic (random) methods", 
    "from": "Nic McPhee &lt;mcphee@...&gt;", 
    "authorName": "Nic McPhee", 
    "msgSnippet": "... There s almost certainly some truth in this. ... I agree with the granularity point, and we re certainly trying to follow that guideline.  The rub is", 
    "msgId": 1184, 
    "topicId": 1167, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-500406644\"><blockquote><span title=\"ireply\">&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mcphee@...\">mcphee@...</a> wrote:<br/>\n&gt;&gt;  The problem is that our system is quite complex, with lots of<br/>\n&gt;&gt;  different components all feeding off the same random number stream.<br/>\n&gt;<br/>\n&gt;Maybe, that&#39;s pointing towards the real problem.<br/>\n<br/>\n </span></blockquote>There&#39;s almost certainly some truth in this.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Unit testing should<br/>\n&gt;strive for minimal granularity, i.e. test one component (unit) at a<br/>\n&gt;time. Depending on your current architecture and dependencies between<br/>\n&gt;components you will have to create lots of dummy and/or mock objects.<br/>\n&gt;Major refactorings might be necessary.<br/>\n<br/>\n </span></blockquote>I agree with the granularity point, and we&#39;re certainly trying to <br/>\nfollow that guideline.  The rub is two-fold.  First, as mentioned <br/>\nbefore, the system (a framework, actually) is some 300-400 classes at <br/>\nthis point (and you could double that if you included apps built on <br/>\ntop of the framework), and there are a number of layers each building <br/>\non those that came before.  Second, all this was designed and built <br/>\nseveral years before our lives were blessed by JUnit, so we&#39;re now <br/>\ntrying to add tests bit by bit after the fact.  Progress on this has <br/>\nbeen at best slow, with most of the added tests being in the lowest <br/>\nlayers (where the interactions are minimized).  My worry is that if <br/>\nthe only way (or the Right Way) to deal with this involves major <br/>\nrefactorings (that are not otherwise seen as important - we&#39;re <br/>\nactually quite happy with most of the design), then no one&#39;s going to <br/>\nmake it a priority and it isn&#39;t going to happen.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Maybe a first step could be to give each component its own random number<br/>\n&gt;stream. Either for testing only or fpr both test and production.<br/>\n<br/>\n </span></blockquote>This is an interesting idea, and would require further thought.  It&#39;s <br/>\nnot immediately clear to me how this would affect the <br/>\nbehavior/performance of the system, and it raises some design issues <br/>\nwe&#39;d have to work through.  It would, however, make these testing <br/>\nissues easier to deal with, and might actually be a Good Thing.<br/>\n<br/>\nThanks to all for the ideas.<br/>\n<br/>\n\tNic</div>", 
    "prevInTime": 1183, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "989748403", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 1181, 
    "headers": {
        "inReplyToHeader": "PDNBRkNFM0FGLjg2NkEzM0JDQGdteC5uZXQ+", 
        "messageIdInHeader": "PHAwNDMzMDEwMWI3MjQwOWU5MjhjMEBbMjEyLjY3LjEwMy40MF0+", 
        "referencesHeader": "PDlkaDRhMytnN2U5QGVHcm91cHMuY29tPiA8M0FGQ0UzQUYuODY2QTMzQkNAZ214Lm5ldD4="
    }
}