{
    "numMessagesInTopic": 4, 
    "nextInTime": 11904, 
    "senderId": "tM7DdkpUIMdz17eADbKDTLiWSM5P98UFxwsHOxVEctmd1l4YS37NGjF20QoiQTaxNBiuAms5rLIuGzCmBJPb8AqNawXPkQjBh8U", 
    "systemMessage": false, 
    "subject": "Re: [junit] Test Dependency", 
    "from": "Andrew Forward &lt;aforward@...&gt;", 
    "authorName": "Andrew Forward", 
    "msgSnippet": "You might also consider looking at ways to create a Project without a database.  As J.B Rainsberger stated, your Experiment tests do not care much about", 
    "msgId": 11903, 
    "profile": "andrewforward1978", 
    "topicId": 11897, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 190547346, 
    "messageBody": "<div id=\"ygrps-yiv-91105420\">You might also consider looking at ways to create a Project without a<br/>\ndatabase.  As J.B Rainsberger stated, your Experiment tests do not<br/>\ncare much about creating a project - they just want one.<br/>\n<br/>\nThe same is true then for most of our Project tests as well.  You can<br/>\none (or a few) test to make sure that writing to the DB works - but<br/>\nsubsequent tests (that again care little about the creation of a<br/>\nProject but rather just want a Project) can use a Project that was not<br/>\ndatabase driven.<br/>\n<br/>\nThere are several advantages to following the above style including <br/>\n<br/>\n1) Speed of test execution (non-database driven tests are usually<br/>\nfaster than database tests),<br/>\n<br/>\n2) Complexity of test setup (in its current state - each test that<br/>\nrequires a Project also requires the database and managing that is<br/>\nmore complex then simply using an in-memory Project),<br/>\n<br/>\n3) Increased test de-coupling (if the database goes down, or is<br/>\nimproperly configured, then all your Project tests will fail - instead<br/>\nof those that more concretely point to a database issue)<br/>\n<br/>\nTo be fair, there are some disadvantages as well.<br/>\n<br/>\n1) Fewer tests exercise a real Project (aka database driven) - but we<br/>\nare talking about unit tests so in most circles this is expected (you<br/>\ncan still use a database driven Project for integration tests)<br/>\n<br/>\n2) Code refactoring to support DB driven and non-db driven Projects. <br/>\nYou could consider Mock-objects, abstracting the persistence layer (to<br/>\nnow include an In-Memory as well as database implementation) as well<br/>\nas just re-thinking how objects interact with one another (is the<br/>\nforeign key constraint an Experiment issue, or a database one?)<br/>\n<br/>\nandrew f<br/>\n<br/>\n<br/>\n<br/>\nOn Fri, 03 Sep 2004 17:27:21 -0500, J. B. Rainsberger<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jbrains@...\">jbrains@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; sebashkw wrote:<br/>\n&gt; <br/>\n&gt; &gt; Say I have a Project class and Experiment class that I need to test using<br/>\n&gt; &gt; Junit. They are simple codes that writes into the database. The rule is a<br/>\n&gt; &gt; Project must be added before a Experiment can be added. This is<br/>\n&gt; &gt; because Experiment has a foreign key that points to Project.<br/>\n&gt; <br/>\n&gt; OK. Project [1]--&gt;[*] Experiment.<br/>\n&gt; <br/>\n&gt; &gt; In my ProjectTest I have a testCreateProject test. But in my<br/>\n&gt; &gt; ExperimentTest where I have my testCreateExperiment test, I need to<br/>\n&gt; &gt; create a project before it will be successful.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Whats the practice for this? Do I put the createProject inside my<br/>\n&gt; &gt; testCreateExperiment method? Then I will be actually testing two different<br/>\n&gt; &gt; class (Project and Experiment) in a single method<br/>\n&gt; &gt; (testCreateExperiment)..<br/>\n&gt; <br/>\n&gt; I don&#39;t agree with this last statement.<br/>\n&gt; <br/>\n&gt; In what state does your environment need to be to test creating an<br/>\n&gt; experiment? It appears that there must be a project in the database with<br/>\n&gt; a known project primary key first. In that case, put one there -- this<br/>\n&gt; is what setUp() is for. In TestExperiment.setUp(), then, invoke<br/>\n&gt; createProject().<br/>\n&gt; <br/>\n&gt; Rather than /testing/ createProject(), you are /using/ createProject()<br/>\n&gt; -- assuming that it works -- to test createExperiment(). I&#39;m not sure<br/>\n&gt; that that&#39;s wise, but that&#39;s another subject, covered in depth in _JUnit<br/>\n&gt; Recipes_.<br/>\n&gt; <br/>\n&gt; &gt; If anyone is going to suggest control the order of executing the test (i.e.<br/>\n&gt; &gt; run ProjectTest before ExperimentTest), note that I need the return value<br/>\n&gt; &gt; from testCreateProject in testCreateExperiment.<br/>\n&gt; <br/>\n&gt; That&#39;s fine -- store that value in a field of TestExperiment and let<br/>\n&gt; testCreateExperiment() use that field.<br/>\n&gt; --<br/>\n&gt; J. B. Rainsberger,<br/>\n&gt; Diaspar Software Services<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com\">http://www.diasparsoftware.com</a> :: +1 416 791-8603<br/>\n&gt; Let&#39;s write software that people understand<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\naforward</div>", 
    "prevInTime": 11902, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1094309527", 
    "canDelete": false, 
    "nextInTopic": 11904, 
    "prevInTopic": 11902, 
    "headers": {
        "inReplyToHeader": "PDQxMzhFRkM5LjQwMjAyQHJvZ2Vycy5jb20+", 
        "messageIdInHeader": "PDFlNGZmYzM1MDQwOTA0MDc1MjNkZGE5NmU0QG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PGNoOWUxNytycDYxQGVHcm91cHMuY29tPiA8NDEzOEVGQzkuNDAyMDJAcm9nZXJzLmNvbT4="
    }
}