{
    "numMessagesInTopic": 5, 
    "nextInTime": 11955, 
    "senderId": "Q414QMZWmaeLMzwDiHT9WzRShtd6xX-jN6k3GfZ2utIZyg1-zNlt7T8cA2MsPxX3rBU4YmpIQux73QR6KNgnlWpkuOmvZoXKCZP0J3ZeUFchbD2MacyjDcx50Mlo", 
    "systemMessage": true, 
    "subject": "Re: [junit] looking for comparision of JUnitEE and Parasoft&#39;s JTest", 
    "from": "=?iso-8859-1?q?Yagiz=20Erkan?= &lt;yagiz_erkan@...&gt;", 
    "authorName": "Yagiz Erkan", 
    "msgSnippet": "Hi Fazle, We evaluated Parasoft s Jtest early in 2004. We got representatives presenting the product to us and helping us with technical questions. Obviously", 
    "msgId": 11954, 
    "profile": "yagiz_erkan", 
    "topicId": 11940, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 69859277, 
    "messageBody": "<div id=\"ygrps-yiv-620721715\">Hi Fazle,<br/>\n<br/>\nWe evaluated Parasoft&#39;s Jtest early in 2004. We got representatives presenting<br/>\nthe product to us and helping us with technical questions. <br/>\n<br/>\nObviously the unit tests are just a part of Jtest. So comparing Jtest with a<br/>\nunit test framework or extension doesn&#39;t seem correct. However, we opted not to<br/>\nuse Jtest mostly because of its price (it was around 100,000 Euro (approx.<br/>\n$120,000) for the whole company) and partially because we liked open source<br/>\nsoftware solution and wanted to give it a chance.<br/>\n<br/>\nOur comparison was between Jtest on one side and CruiseControl, JUnit,<br/>\nCheckStyle, BugFind, PMD, Savant, Clover on the other side. With the exception<br/>\nof Clover (a great code coverage tool that we use on the server side) our<br/>\ncurrent system consists of the open source products. We didn&#39;t think that Jtest<br/>\ngave us anything more that was worth $120,000.<br/>\n<br/>\nHuman side and discipline are more important than the tools alone...<br/>\n<br/>\nI strongly advice to make an assessment of what you expect to get from Jtest<br/>\ntype solutions, then to take some time to evaluate different systems, highlight<br/>\nthe differences and discuss with whoever takes the decisions. If you&#39;re not<br/>\nbuying the tool for the right reasons/tasks, it&#39;s going to be added to the<br/>\nunused tools lists.<br/>\n<br/>\n - Yagiz Erkan -<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://yagiz.blogspot.com\">http://yagiz.blogspot.com</a><br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.erkans.com\">http://www.erkans.com</a></div>", 
    "prevInTime": 11953, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1094832973", 
    "canDelete": false, 
    "nextInTopic": 11957, 
    "prevInTopic": 11943, 
    "headers": {
        "inReplyToHeader": "PGNoc2VmdCtrZDlvQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDIwMDQwOTEwMTYxNjEzLjE4MDU3LnFtYWlsQHdlYjQxNTExLm1haWwueWFob28uY29tPg=="
    }
}