{
    "numMessagesInTopic": 13, 
    "nextInTime": 12030, 
    "senderId": "_DbztTTQwSa3J-FcT-bKx_0fYhRtS3RH1dvE4lGe3hM3tU00e-98jKmbX_rzVdhjSaRLGkyaH0JrdAPpUkzOABRrVo3NvY3C", 
    "systemMessage": false, 
    "subject": "Re: [junit] test last", 
    "from": "Russell Gold &lt;russgold@...&gt;", 
    "authorName": "Russell Gold", 
    "msgSnippet": "... Sure, most of us have to deal with legacy code at some point. Michael Feathers has even written a whole book on the subject. In general, test last is not", 
    "msgId": 12029, 
    "profile": "russgold", 
    "topicId": 12027, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 190065409, 
    "messageBody": "<div id=\"ygrps-yiv-348127654\">On Thu, 23 Sep 2004 10:12:46 -0000, Coolspot714 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:coolspot714@...\">coolspot714@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi everybody,<br/>\n&gt; <br/>\n&gt; my question concerns a different approach of writing tests. I&#39;m in the<br/>\n&gt; unfortunate situation of having to write tests for an existing<br/>\n&gt; application(I haven&#39;t been involved in the development).<br/>\n&gt; <br/>\n&gt; I found tons of information about test-driven development and<br/>\n&gt; test-first, but hardly anything about writing tests after the<br/>\n&gt; application has been developed. Any experiences?<br/>\n<br/>\n </span></blockquote>Sure, most of us have to deal with legacy code at some point. Michael<br/>\nFeathers has even written a whole book on the subject.<br/>\n<br/>\nIn general, test last is not the way to go if you can avoid it -<br/>\nbuilding the tests first makes sure that the code is inherently<br/>\ntestable out of necessity. That is not always the case if you try to<br/>\nwrite the tests last. And when you write the tests first, you can be<br/>\nsure that they fail when the code is wrong and pretty sure that<br/>\npassing means the code is correct. If you write them after the fact,<br/>\nthey may pass whether the code works or doesn&#39;t.<br/>\n<br/>\nAnd if that is not enough for you, consider this: when you use the<br/>\ntests to drive you development, you actually write them because it is<br/>\nsimply easier and faster to develop that way (for one thing, many of<br/>\nus TDD practitioners rarely need to use the debugger). When you write<br/>\nthem afterwards, you do so reluctantly, since the *code already works*<br/>\n- so you don&#39;t think you need them.<br/>\n<br/>\nA simple analogy: have you ever seen a stone arch being built? If not,<br/>\ncan you picture how it must be done? Once all the stones are in place,<br/>\nthey stay there because none of them can fall through the others. But<br/>\nhow do you get them there in the first place? Image trying to hold all<br/>\nthe stones in place simultaneously while you try to get the keystone<br/>\nset. You would drop a lot of them and get really frustrated. But a<br/>\nmason first builds a simple wooden form shaped like the interior of<br/>\nthe arch and piles the stones on it. Then he takes it away when they<br/>\nare in place. Even though he has done this &quot;extra work&quot; of building<br/>\nthe form, it is faster and more reliable to do it that way. It is the<br/>\nsame thing with developer unit tests.<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; It still isn&#39;t determined yet on which level the tests should take<br/>\n&gt; place. &quot;Real unit-tests&quot; (&quot;test everything that could possibly break&quot;)<br/>\n&gt; would be too much work for the given time(~6 weeks), I guess. So it<br/>\n&gt; might be more something like acceptance tests.<br/>\n&gt; <br/>\n&gt; The SUT is a middleware-API running on an application server, using<br/>\n&gt; webservices and RMI to get and set customer data from several remote<br/>\n&gt; databases (lots of getters for about 10mio customers). =&gt; no user<br/>\n&gt; interface/gui etc.<br/>\n&gt; <br/>\n&gt; Since we still have to exactly figure out what we want to test, I<br/>\n&gt; would appreciate some information about whether or not JUnit is the<br/>\n&gt; right choice in general (alternatives?) and some advices for my &quot;test<br/>\n&gt; last&quot; approach.<br/>\n&gt; <br/>\n&gt; Thanks in advance,<br/>\n&gt; Thomas<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 12028, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1095948205", 
    "canDelete": false, 
    "nextInTopic": 12030, 
    "prevInTopic": 12027, 
    "headers": {
        "inReplyToHeader": "PGNpdTdpdSszdW5kQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDg1M2FjNGY0MDQwOTIzMDcwMzc5YzZlMTNAbWFpbC5nbWFpbC5jb20+", 
        "referencesHeader": "PGNpdTdpdSszdW5kQGVHcm91cHMuY29tPg=="
    }
}