{
    "numMessagesInTopic": 3, 
    "nextInTime": 12093, 
    "senderId": "BKKfujuzfIRGEROijAeK5E0b6qFqRJuHa2r2VkcONrJBQgfFp8QfMQd0OvHm7co1aDhLYC4vyeNt2zUkHWYKqyzeq5I", 
    "systemMessage": true, 
    "subject": "Re: junit & broadvision", 
    "from": "&quot;Eric&quot; &lt;avatar_x@...&gt;", 
    "authorName": "Eric", 
    "msgSnippet": "... used to ... a ... correct that ... the ... First thanks thanks for a response to my question. I know Junit was developed with unit testing of everything", 
    "msgId": 12092, 
    "profile": "ayebeeguilty", 
    "topicId": 12073, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 140146451, 
    "messageBody": "<div id=\"ygrps-yiv-537566549\"><blockquote><span title=\"ireply\">&gt; JUnit /can/ be used to test anything that is Java, it can even be <br/>\n </span></blockquote>used to  <br/>\n<blockquote><span title=\"ireply\"> &gt; test non-Java apps.  The proof of whether or not it is suited to <br/>\n </span></blockquote>a  <br/>\n<blockquote><span title=\"ireply\"> &gt; particular need is an exercise left to the reader.  You are <br/>\n </span></blockquote>correct that  <br/>\n<blockquote><span title=\"ireply\"> &gt; your question is very broad.  A better answer may come if you take <br/>\n </span></blockquote>the  <br/>\n<blockquote><span title=\"ireply\"> &gt; time to define your needs to us.<br/>\n<br/>\n </span></blockquote>First thanks thanks for a response to my question. <br/>\n<br/>\nI know Junit was developed with unit testing of everything that is <br/>\njava. The basic concepts and methods of testing strings, hash tables <br/>\nand other objects created in classes and their methods is not that <br/>\nhard to understand. <br/>\n<br/>\nBut the question I didn&#39;t ask and should have is about testing <br/>\nserver objects. BroadVision has many server objects (Site, User, <br/>\nSession, HttpRequests, ...) that are passed to the classes and are <br/>\nneeded to perform the logic contained in them. I have been reading <br/>\nabout HttpUnit and ServletUnit and it seems that if I am going to <br/>\nwrite successful unit tests employing JUnit, I am going to have to <br/>\nsomehow get these objects from the server. So while I can write a <br/>\nTestSuite which has some values that I will be testing against, how <br/>\nam I suppose to get the BV Server to supply the objects that only A <br/>\nBV server can provide? Do I need to integrate Cactus, or one of the <br/>\nother Unit testing modules to make this happen? I guess I am looking <br/>\nfor any suggestions or recommendations of what will provide the <br/>\nserver interaction with Junit. While hard coding values in a test <br/>\nsuite provides adequate testing for some things it won&#39;t cut it for <br/>\ndynamic server objects that can&#39;t be replicated by static values. <br/>\nThe last thing I want to do is strip classes of the logic that <br/>\nrequire those values because it couldn&#39;t possibly provide adequate <br/>\nor realistic testing scenarios or environments that I am testing for <br/>\nin the first place.<br/>\n<br/>\n<br/>\nEric</div>", 
    "prevInTime": 12091, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1096640832", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 12074, 
    "headers": {
        "inReplyToHeader": "PG9wc2UyNW9vYnMwdTMxZTZAZWFudXMucmlza21ldHJpY3MtYWEucmlza21ldHJpY3MuY29tPg==", 
        "messageIdInHeader": "PGNqanBnMCttNHQ0QGVHcm91cHMuY29tPg=="
    }
}