{
    "numMessagesInTopic": 5, 
    "nextInTime": 12107, 
    "senderId": "pPVth54mF2kPNxUzTzCNx_Sj9lod4fx8yOy29Y5FQ9OHm7w197ZJVY0hyXQu-j4H3tGuf3WyiW54PmF0lABzZY2wsjE", 
    "systemMessage": true, 
    "subject": "Best Strategy for testing DAOs - dependency issues", 
    "from": "&quot;MKlaene&quot; &lt;mklaene@...&gt;", 
    "authorName": "MKlaene", 
    "msgSnippet": "I m having some concerns as I write some tests for my DAOs.  My concern is that I can t figure out a good way to write these tests without relying on other DAO", 
    "msgId": 12106, 
    "profile": "MKlaene", 
    "topicId": 12106, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 52223449, 
    "messageBody": "<div id=\"ygrps-yiv-858374461\">I&#39;m having some concerns as I write some tests for my DAOs.  My <br/>\nconcern is that I can&#39;t figure out a good way to write these tests <br/>\nwithout relying on other DAO methods.<br/>\n<br/>\nFor example, my employeeDAO might have a createEmployee(Employee <br/>\nemployee) method and a getEmployeeById(Integer id) method.  Almost <br/>\nall of my tests rely on a employee record being pre-populated.  For <br/>\nnow, I&#39;m calling my createEmployee DAO method in setup() so every <br/>\ntest has it.  Then I call the deleteEmployee(Employee employee) <br/>\nmethod in tearDown().  It bothers me somewhat to have to do this as <br/>\nI would prefer to only call those methods within their corresponding <br/>\ntest methods.  <br/>\n<br/>\nI&#39;ve looked at DBUnit.  The problem here is that I still have to <br/>\npopulate my bean from the database - then I&#39;m back to calling a DAO <br/>\nmethod like getEmployeeById in every method - an undesirable <br/>\ndependency.  Another option I guess would be to have some DAO <br/>\nmethods used only for testing but this seems overkill.  I&#39;d rather <br/>\nuse the database during testing too, not mock objects.<br/>\n<br/>\nSo, I guess my questions are:<br/>\n<br/>\n1.)Is there a good way to test DAOs in isolation, without relying on <br/>\nother DAO methods?<br/>\n2.)Does it really matter that much anyway if I use other DAO <br/>\nmethods?  I mean, the goal is for ALL tests to pass anyway.  It can <br/>\nbe confusing if your testDeleteEmployee method fails due to a <br/>\nfailure in createEmployee which you have to call first, but I guess <br/>\nit wouldn&#39;t take long to figure out what really happened.<br/>\n<br/>\nAny feedback would be appreciated.<br/>\nThanks,<br/>\nMike</div>", 
    "prevInTime": 12105, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1097147514", 
    "canDelete": false, 
    "nextInTopic": 12110, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGNrMzg5cStoZ3E0QGVHcm91cHMuY29tPg=="
    }
}