{
    "numMessagesInTopic": 17, 
    "nextInTime": 12163, 
    "senderId": "s1sJSpHAx2xFDjT3nRdlalNzPAu_TOMz9qvtogfc6TlUF5-R8YYr6t9WC_2iWKiGlXOW53MQMIqrsdDBCi5H3Xc7qzPqDm4494mdFw", 
    "systemMessage": true, 
    "subject": "Perform something before and after a complete test", 
    "from": "&quot;haefeleuser&quot; &lt;haefeleuser@...&gt;", 
    "authorName": "haefeleuser", 
    "msgSnippet": "I posted this question half a year ago. The answer that I received was to use a decorator. It works this way. But I cannot execute a test with its decorator in", 
    "msgId": 12162, 
    "profile": "haefeleuser", 
    "topicId": 11100, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174752849, 
    "messageBody": "<div id=\"ygrps-yiv-1268150474\">I posted this question half a year ago. The answer that I received <br/>\nwas to use a decorator. It works this way. But I cannot execute a <br/>\ntest with its decorator in Eclipse. So I cannot use it.<br/>\n<br/>\nHere is the bug report which I posted at the Eclipse site. Its bug <br/>\n76232. Since I didn&#39;t receive any answer there, I post it here. I <br/>\nhope someone can help me.<br/>\n<br/>\n<br/>\n<br/>\nI want to perform something before the tests start. After all tests <br/>\nof a class have finished I want to perform another thing. Overwriting <br/>\ntearDown does not work for this requirement, it is called too often <br/>\nby JUnit. When the last test has finished I want to perform <br/>\nsomething. But it needs to be within JUnit, not outside of it.<br/>\n<br/>\nI&#39;ve coded something like this in the main method to solve the <br/>\nproblem:<br/>\nTestDecorator myTestSetup = new MyTestSetup(new SupplierArticleTest<br/>\n(&quot;testInitialValidation&quot;));<br/>\njunit.textui.TestRunner.run(myTestSetup);<br/>\n<br/>\nIt works but it doesn&#39;t work in the Eclipse JUnit view. It should <br/>\nwork in the JUnit view. Can I decorate a test and start it with its <br/>\ndecoration in the Eclipse JUnit view? Or is there another solution <br/>\nfor my problem?<br/>\n<br/>\nThe most straightforward thing would have been if I had two <br/>\nadditional methods in the TestCase: setUpTestCase() and <br/>\ntearDownTestCase(). Both would be called only once, the first, when <br/>\nthe test (all test methods in a TestCase) starts and the last when <br/>\nthe test ends (all test methods in a TestCase).</div>", 
    "prevInTime": 12161, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1098172256", 
    "canDelete": false, 
    "nextInTopic": 12165, 
    "prevInTopic": 11293, 
    "headers": {
        "messageIdInHeader": "PGNsMmgxMCtxNWJoQGVHcm91cHMuY29tPg=="
    }
}