{
    "numMessagesInTopic": 6, 
    "nextInTime": 12238, 
    "senderId": "Ev25sOXGXGjeu5dg9bbjQSjjvP8zfiniw6L_DGTiWXz8wHQfVJCAEjdlTtu2cgD5zsZjedzif4qwfwSzQxvVyXW6lg5rX_18nNOJjhY", 
    "systemMessage": true, 
    "subject": "Ant&#39;s  using class name and not test name in XML report", 
    "from": "&quot;Charles Fineman&quot; &lt;cfineman@...&gt;", 
    "authorName": "Charles Fineman", 
    "msgSnippet": "First, i m using ant 1.5.4 and junit 3.8.1 (and i have those jars installed in the ant lib directory). Now... I have a TestSuite that takes the name of a", 
    "msgId": 12237, 
    "profile": "cfineman", 
    "topicId": 12237, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 85846439, 
    "messageBody": "<div id=\"ygrps-yiv-1377820056\">First, i&#39;m using ant 1.5.4 and junit 3.8.1 (and i have those jars<br/>\ninstalled in the ant lib directory).<br/>\n<br/>\nNow... I have a TestSuite that takes the name of a script as a<br/>\nparameter. That script contains a series of request/response pairs. I<br/>\ndynamically generate a test case for each line in the file and add it<br/>\nto the TestSuite. The name of the TestSuite is the name of the script<br/>\nfile so I can distinguish between runs.<br/>\n<br/>\nI run this insisde Eclipse and the TestSuite&#39;s name is correct (i.e.<br/>\nit&#39;s the name of the script) but when I run it using ant with an XML<br/>\nformatter, the name of the test is the name of the class. <br/>\n<br/>\nFor the time being I&#39;m going to create a second TestSuite under the<br/>\nmain test suite and give it the correct name since all the children of<br/>\nthe original have synthetic names and show up find in the generated XML.<br/>\n<br/>\nIs this a known issue? Better workarounds than what i&#39;ve mentioned above?<br/>\n<br/>\n[ BTW... feel free to comment on the way I&#39;m doing this. We want to<br/>\nsupport various scripts for different levels of the system and this<br/>\nwill make it easy for QA folks to add additional tests to the<br/>\nregression suites ]</div>", 
    "prevInTime": 12236, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1099081186", 
    "canDelete": false, 
    "nextInTopic": 12241, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGNsdThsMitrOWwzQGVHcm91cHMuY29tPg=="
    }
}