{
    "numMessagesInTopic": 4, 
    "nextInTime": 12263, 
    "senderId": "pwlAsX9_OQDs7SX6hhEs7DudPyR0hZdXIEwB3a5fEZyJBDLpEzoCgKv7E_ug2xCgD1hkty87iaiL9IqlKsYS1c0FkPbkqS_eb2SNyBiS9kWKzpaz9c2i", 
    "systemMessage": false, 
    "subject": "RE: [junit] EJB - JUnit Testing", 
    "from": "&quot;Tambascio, Larry&quot; &lt;ltambascio@...&gt;", 
    "authorName": "Tambascio, Larry", 
    "msgSnippet": "Hi Sreenivasa, Cactus (http://jakarta.apache.org/cactus) is the closest you ll probably get to an EJB testing framework.  The approach it takes is to run the", 
    "msgId": 12262, 
    "topicId": 12253, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 135164432, 
    "messageBody": "<div id=\"ygrps-yiv-1762912114\">Hi Sreenivasa,<br/>\n<br/>\nCactus (http://jakarta.apache.org/cactus) is the closest you&#39;ll probably get<br/>\nto an EJB testing framework.  The approach it takes is to run the tests from<br/>\nit&#39;s own servlet, so you&#39;re running the test in the container.  It makes for<br/>\na good integration test (make sure it&#39;s deployed correctly, etc.).<br/>\nDeploying to run tests may slow things down a little.<br/>\n<br/>\nAnother option would be mock objects (http://www.mockobjects.com,<br/>\nhttp://www.easymock.org).  It has a lot of mock objects that will make your<br/>\nEJB think it&#39;s in a container.  I actually haven&#39;t tried them for EJBs, but<br/>\nit would be the first place I would go.<br/>\n<br/>\nIf your EJB is simply a façade, then I&#39;d concentrate more on testing the<br/>\nsupporting business classes/methods, which it sounds like you&#39;re already<br/>\ndoing.<br/>\n<br/>\nGood luck,<br/>\n-Larry<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: skmajji [mailto:skmajji@...] <br/>\nSent: Thursday, November 04, 2004 2:34 PM<br/>\nTo: junit@yahoogroups.com<br/>\nSubject: [junit] EJB - JUnit Testing<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nHi,<br/>\n<br/>\nCurrently I am writing JUnit to test our business methods on EJBs. Is <br/>\nthere a framework exists exclusively for testing EJBs? <br/>\n<br/>\nThank you,<br/>\n_Sreenivasa<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\nThis email and its attachments are confidential under applicable law and are <br/>\nintended for use of the senders addressee only, unless the sender expressly<br/>\nagrees otherwise, or unless a separate written agreement exists between<br/>\nIron Mountain and a recipient company governing communications between the <br/>\nparties and any data that may be transmitted. Transmission of email over<br/>\nthe Internet is not a secure communications medium. If you are requesting<br/>\nor have requested the transmittal of personal data, as defined in applicable<br/>\nprivacy laws, by means of email or in an attachment to email, you may wish<br/>\nto select a more secure alternate means of transmittal that better supports<br/>\nyour obligations to protect such personal data. If the recipient of this <br/>\nmessage is not the recipient named above, and/or you have received this email<br/>\nin error, you must take no action based on the information in this email.<br/>\nYou are hereby notified that any dissemination, misuse or copying or <br/>\ndisclosure of the communication by a recipient who has received this message<br/>\nin error is strictly prohibited. If this message is received in error, please<br/>\nreturn this email to the sender and immediately highlight any error in <br/>\ntransmittal. <br/>\nThank You</div>", 
    "prevInTime": 12261, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1099668094", 
    "canDelete": false, 
    "nextInTopic": 12264, 
    "prevInTopic": 12253, 
    "headers": {
        "messageIdInHeader": "PEREOENCMjQ0RUFGMkRCNEM4NUI5OUMxQzk5NjNFMkQyMDgyRDAwQjlAY29sZXhjbDIuY29ycC5wbGE+"
    }
}