{
    "numMessagesInTopic": 4, 
    "nextInTime": 12350, 
    "senderId": "fpu3s4oAbEDXUlBadtU51KXod958XlByBGJUINPVxuDLJe0-b-Ue8K2WrbZfA59LLE0eBUVAJED7Q6RBeCu7y4XpETR2PyPxlKTdwFUlbnpPz5-6", 
    "systemMessage": true, 
    "subject": "Virtualmock in practice?", 
    "from": "&quot;wellman_daniel&quot; &lt;daniel_wellman@...&gt;", 
    "authorName": "wellman_daniel", 
    "msgSnippet": "Hello all, I ve got the need to test some legacy code which uses some hard-coded references to other concrete objects, or uses a service locator/factory to", 
    "msgId": 12349, 
    "profile": "wellman_daniel", 
    "topicId": 12349, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 203434778, 
    "messageBody": "<div id=\"ygrps-yiv-570195884\">Hello all,<br/>\n<br/>\nI&#39;ve got the need to test some legacy code which uses some hard-coded <br/>\nreferences to other concrete objects, or uses a service <br/>\nlocator/factory to obtain other business objects.  I&#39;m reading J. B. <br/>\nRainsberger&#39;s excellent &quot;JUnit Recipes&quot; book and this led me to check <br/>\nout mock objects.<br/>\n<br/>\nI&#39;d like to use mock objects to simulate the behavior of these <br/>\ncollaborating objects (until I can refactor the design of course!).  <br/>\nVirtualmock seems like a great tool to do this, and the source <br/>\nexample in the distribution (iutest/test/functional/SampleTest.java) <br/>\nmakes sense to me.  I&#39;ve never done this AOP-style of development <br/>\nthough, so while the code seems to make sense, the logic of how to <br/>\nmodify my ant script and test process is a mystery to me.<br/>\n<br/>\n1. Is virtualmock still in development?  I didn&#39;t notice any updates <br/>\nfor about 10 months on the Sourceforge project, and Googling for info <br/>\non virtualmock returned very little (no mailing list discussions, <br/>\netc.?).  The included version of AspectWerkz seems to be out of date <br/>\nas well (0.9 included, but now 2.0 is available.)<br/>\n<br/>\n2. Has there been any additional discussion/documentation on adding <br/>\nthe virtualmock / AOP process to my project&#39;s ant test build file?  <br/>\n<br/>\n3. Does jMock with CGLib provide the functionality to intercept calls <br/>\nto concrete objects instantiated by the object under test? (As <br/>\nvirtualmock appears to do)<br/>\n<br/>\n<br/>\nI really like virtualmock&#39;s ability to use your compiler&#39;s code <br/>\ncompletion and compile-time method invocation validation, though this <br/>\ndoesn&#39;t have to be my main selling point.  If jMock with CGLib can <br/>\nprovide the same sort of functionality (see my point #3) then I&#39;m <br/>\nhappy to try it out as well.<br/>\n<br/>\n<br/>\nThanks for your advice,<br/>\n<br/>\nDan</div>", 
    "prevInTime": 12348, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1100878751", 
    "canDelete": false, 
    "nextInTopic": 12354, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGNubDQydittNXY0QGVHcm91cHMuY29tPg=="
    }
}