{
    "numMessagesInTopic": 4, 
    "nextInTime": 12357, 
    "senderId": "CSj9F3SGybgWiXtYPWKZAAxg3swuu8YMSTOpRMhfF6wjfU-LATSyk4yR9pvNpr9XliLbcjZTzGa9lVl130Ro_fzAUei9JIbToUiXHTPvjqOtXWnAs42_ZqUIrGk", 
    "systemMessage": true, 
    "subject": "Executing methods of test reflectively?", 
    "from": "&quot;supreme_java_guru_1&quot; &lt;supreme_java_guru_1@...&gt;", 
    "authorName": "supreme_java_guru_1", 
    "msgSnippet": "Hi all, I am working on a GUI test harness that will run GUI tests, unit tests and http tests. Long story short, the GUI harness helps in building test suites.", 
    "msgId": 12356, 
    "profile": "supreme_java_guru_1", 
    "topicId": 12356, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 68436909, 
    "messageBody": "<div id=\"ygrps-yiv-1810139480\">Hi all,<br/>\n<br/>\nI am working on a GUI test harness that will run GUI tests, unit tests<br/>\nand http tests. Long story short, the GUI harness helps in building<br/>\ntest suites. Part of this harness is allowing the user to add new<br/>\ntestcases in a graphical tree, define the class name, and the methods<br/>\nof the class. All of this is embeddable within existing applications,<br/>\nsuch as a Swing GUI app to allow a developer to quickly assemble and<br/>\nexecute individual tests without having to drop to the command line.<br/>\nAll of this works presently. My one BIG problem is trying to get the<br/>\ntest results from the test cases that are ran, so that I can embed<br/>\nsomething similar to the &lt;junitreport&gt; task that ant has. After a<br/>\nsingle test, or a group of tests run, I want my harness to show the<br/>\noutput.<br/>\n<br/>\nMy initial thought was that I did not have to execute a junit TestCase<br/>\nthrough the junit run(TestResult) method. Basically, I was hoping I<br/>\ncould somehow get the assertXxx() output directly. As it stands right<br/>\nnow, I use my own custom classloader because the harness allows the<br/>\nuser to specify a location for the source files (which my harness will<br/>\nauto-generate and maintain), the compiled files, and any 3rd party<br/>\nlibraries the test classes use. I read with interest how junit has its<br/>\nown custom classloader to reload tests. My harness does the same<br/>\nthing, only that I do NOT want ANY of the testcase classes or 3rd<br/>\nparty libraries to be on the application classpath. Because of this,<br/>\nunless I modify/update junit&#39;s classloader, I need to use my own<br/>\ncustom classloader. So, all of this works great. I just need a way to<br/>\nget the output of the testcase runs, and hopefully apply the same html<br/>\nformatter that the &lt;junitreport&gt; task applies so that I can see the<br/>\nsame type of html pages that it produces.<br/>\n<br/>\nI would appreciate anyone&#39;s thoughts or suggestions on how to make<br/>\nthis work. Worse case, I am forced to &quot;wrap&quot; my test cases into a<br/>\nJunit testcase/testsuite and execute the run(TestResult) call somehow.<br/>\nThe problem with this is, my harness allows the user to add methods to<br/>\na testcase graphically, so I have the name of the method to call using<br/>\nreflection, but I see no way to directly use the JUnit testcase and<br/>\nsupply the method name to execute. Actually, I take that back, you CAN<br/>\ncall a Test() implementation with the String name of the method. The<br/>\nproblem I have is that I can NOT hard-code the TestCase implementation<br/>\nclass. That TOO is reflective.. right now I dynamically load it using<br/>\nClass.forName(). So, is there a way, if I can not get the TestResult<br/>\nwithout running it through the junit system, to add to a TestSuite a<br/>\ndynamically created class WITH the method name to execute?<br/>\n<br/>\nThanks.. sorry for the long post. Up against a wall on this one. I&#39;ll<br/>\nkeep plugging away, but if anyone has ideas, I would be much obliged<br/>\nto get some help!</div>", 
    "prevInTime": 12355, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1100912952", 
    "canDelete": false, 
    "nextInTopic": 12358, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGNubTVmbytvaTkwQGVHcm91cHMuY29tPg=="
    }
}