{
    "numMessagesInTopic": 1, 
    "nextInTime": 12466, 
    "senderId": "gGTOZ-wat1kdcEoSJjSsyzD2iethZAhCsd4xGP5oXJp55VfV2b5dJuZrlT_TkTWdKI3RQVuEf3UyndlAJM_k2CO5blqbL8oxnQdebxzARg", 
    "systemMessage": false, 
    "subject": "ANN: Invitation to Open Space at XP Day Toronto 2005", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "[Note to moderators: We will post one more short announcement closer to the start of the event. If you feel this content is inappropriate for your mailing", 
    "msgId": 12465, 
    "profile": "nails762", 
    "topicId": 12465, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-29627019\">[Note to moderators: We will post one more short announcement closer to <br/>\nthe start of the event. If you feel this content is inappropriate for <br/>\nyour mailing list, then please let us know.]<br/>\n<br/>\nInvitation to Open Space at<br/>\nX P  D A Y  T O R O N T O<br/>\nWestin Prince Hotel; Toronto, Ontario<br/>\nFebruary 19, 2005<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.xpday.info\">http://www.xpday.info</a><br/>\n<br/>\n From the Fringes to the Mainstream:<br/>\n<br/>\nAddressing the challenges of Agile adoption<br/>\n<br/>\nJ. B. Rainsberger and Ron Jeffries invite you to join us in OpenSpace<br/>\nat XP Day Toronto on February 19, 2005 to explore what is happening in<br/>\nthe software development market and in agile software development<br/>\ntoday. Come to network and swap ideas, and join with our invited<br/>\nexperts to influence what happens on a local scale.<br/>\n<br/>\nWithin the Agile Software Development community, people have been<br/>\nsaying for a while now that we have nearly consumed the Enthusiasts<br/>\nand the Early Adopters, and that we&#39;re up against the problem of<br/>\nCrossing the Chasm to the mainstream market of Pragmatists,<br/>\nConservatives, and Skeptics.<br/>\n<br/>\n(Learn more about the Technology Adoption Lifecycle curve at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Crossing_the_Chasm)\">http://en.wikipedia.org/wiki/Crossing_the_Chasm)</a><br/>\n<br/>\nMeanwhile, the economic conditions in the world have put competitive<br/>\npressure on agile proponents, leading to a proliferation of<br/>\ndifferentiated styles of agile: XP, Scrum, Crystal, and even to some<br/>\ngrowing corporate incursions such as Enterprise XP and announcements<br/>\nfrom Microsoft.<br/>\n<br/>\nAt the same time, owing to improved telecommunications and other<br/>\ntechnologies, and to the growth in excellent software development<br/>\nskills in countries all over the world, people who need software have<br/>\na new menu of alternative ways to get their software: home grown,<br/>\npurchased, contracted nearby, contracted overseas. Each of these<br/>\napproaches offers new challenges to those who acquire software, and to<br/>\nthose who develop software in one or more of those venues.<br/>\n<br/>\nWe have invited members of the international Extreme Programming<br/>\ncommunity via various XP-related mailing lists, as well as local<br/>\nsoftware communities in southern Ontario, eastern Canada and the<br/>\nnorth-eastern US. To help bridge the gap between industry and<br/>\nacademics, we have also invited Toronto-area software companies as<br/>\nwell as faculty and students from area universities and colleges. And<br/>\nwe anticipate that our invited speakers will drop in to lend their<br/>\nexperience to various discussions.<br/>\n<br/>\nThe agenda for our conversations in OpenSpace will be up to you, based<br/>\non your perception of the challenges and opportunities in bringing XP<br/>\nand Agile practices to your work. You will also be asked to take<br/>\nresponsibility for reporting your ideas and proposals. Your initiative<br/>\nwill be essential to our success. Organizations have used Open Space<br/>\nTechnology successfully across Canada and around the world to enable<br/>\nspirited and productive dialogue. This approach will allow you to<br/>\nfocus on those issues for which you have a passion to discover<br/>\nsolutions and strategies. An interest in software development is all<br/>\nthat you need to bring to the event. Familiarity with Agile methods,<br/>\nor a desire to know more about them will be helpful. A desire to learn<br/>\nwhat you can and to contribute what you can, is essential. It&#39;s not<br/>\nnecessary to be practicing XP or any Agile method to attend. There are<br/>\nno magic bullets here, just people with valuable experiences and a<br/>\ndesire to do better in the future.<br/>\n<br/>\nIt&#39;s not necessary to be practicing XP or any Agile method to attend.<br/>\nThere are no magic bullets here, just people with valuable experiences<br/>\nand a desire to do better in the future.<br/>\n<br/>\nGoals: By the end of this meeting, we want to have:<br/>\n<br/>\n     * Recognition of the common aspects of all agile methods, and any<br/>\n       important differences<br/>\n     * Broad understanding of what goes into the decision process for<br/>\n       selecting a software development approach: forces, alternatives,<br/>\n       dimension<br/>\n     * Strategies for individuals and groups wanting to inject more<br/>\n       Agile practices into their work<br/>\n     * New acquaintances in the software field, potentially leading to<br/>\n       new collaborations or business alliances<br/>\n     * Recommendations for actions by individuals and organizations<br/>\n       interested in software development and the agile methods<br/>\n     * Commitments from participants to carry these ideas forward to<br/>\n       the next level<br/>\n<br/>\nOur commitment to you: You will be putting in a full day of your time<br/>\nso that we can move forward toward our collective vision. In turn, as<br/>\norganizers, we make the following commitments to you.<br/>\n<br/>\n     * Individual discussion groups will have an opportunity to post<br/>\n       their results for all participants to review;<br/>\n     * Proceedings of the sessions will be published on the web by<br/>\n       Sunday evening;<br/>\n     * A voluntary directory of participants will be provided to<br/>\n       facilitate further collaboration between participants after<br/>\n       the event.<br/>\n<br/>\nTo find out more about Open Space as a meeting approach you might like<br/>\nto check out: www.spiritedorg.com, the site maintained by Toronto&#39;s<br/>\nforemost OST trainer. The meeting approach will be new for many of<br/>\nyou, so expect some pleasant surprises. An interesting story about<br/>\nwhat happened when Reebok used Open Space for Product Development can<br/>\nbe found at <a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/3slw2:\">http://tinyurl.com/3slw2:</a> &quot;You never know who&#39;ll bring in<br/>\nyour next 20 million dollars.&quot;<br/>\n<br/>\nYour hosts:<br/>\n<br/>\nRon Jeffries is the senior author of Extreme Programming Installed,<br/>\nand was the on-site XP coach for the original Extreme Programming<br/>\nproject. Ron has been involved with Extreme Programming and Agile<br/>\nmethods for over eight years, presenting numerous talks and publishing<br/>\npapers on the topic. Microsoft has just released Ron&#39;s latest book,<br/>\nExtreme Programming Adventures in C#. Ron is also the proprietor of<br/>\nwww.XProgramming.com, a well-known source of XP information.<br/>\n<br/>\nRon is an independent consultant, and is one of the creators of Object<br/>\nMentor&#39;s popular XP Immersion course. He has advanced degrees in<br/>\nmathematics and computer science, and has been a software developer<br/>\nfor more years than most of you have been alive. His teams have built<br/>\noperating systems, compilers, relational database systems, and a large<br/>\nrange of applications. Ron&#39;s software products have produced revenue<br/>\nof over half a billion dollars, and he wonders why he didn&#39;t get any<br/>\nof it.<br/>\n<br/>\n     I&#39;m looking forward to some exciting discussions about how things<br/>\n     are done today, how XP and the other Agile methods fit together,<br/>\n     and what we can do to make our software development lives better.<br/>\n<br/>\nJ. B. (Joe) Rainsberger is the author of JUnit Recipes: Practical<br/>\nMethods for Programmer Testing, and has spent the last four years<br/>\nbecoming a better programmer by learning how to be a better tester. He<br/>\nis a prominent member of the JUnit community, but also a regular<br/>\ncontributor to the XP community at large. He will be shaping the<br/>\nprogram of the Agile 2005 conference in Denver, Colorado as the chair<br/>\nof the tutorials committee. J. B. has recently launched a new web<br/>\nsite, www.MasterProgrammer.info, which brings together resources for<br/>\nprogrammers to move along the road from apprentice to master.<br/>\n<br/>\n     I am thrilled to make Open Space a part of XP Day Toronto 2005.<br/>\n     Tutorials are an important part of any conference, but the real<br/>\n     magic happens in the hallway conversations that dot the landscape<br/>\n     of most conferences I have attended. With Deborah Hartmann as our<br/>\n     faciliator and Ron Jeffries providing the inspiration, this<br/>\n     promises to be an enjoyable and productive event. I will even have<br/>\n     to duck out of the XP Project Room to attend a session or two!<br/>\n<br/>\nYour Facilitator:<br/>\n<br/>\nDeborah Hartmann is an active proponent of Agile practices, and is a<br/>\nCertified ScrumMaster (Practitioner). Deborah has persevered in the<br/>\nsoftware industry since the early 80&#39;s, and during her extended<br/>\nconsulting experience often thought &quot;there&#39;s got to be a better way!&quot;<br/>\nDeborah promotes approaches like XP, Scrum and OpenSpace as means to<br/>\nproduce better ideas, teams and products. Deb sponsored the &quot;Growing<br/>\nAgile Practices&quot; OpenSpace event held in Toronto in 2004. This will be<br/>\nher first opportunity to facilitate an OpenSpace event, under the<br/>\ntutelage of Larry Peterson, one of Canada&#39;s foremost OpenSpace<br/>\ntrainers.<br/>\n<br/>\n-- <br/>\nJ. B. (Joe) Rainsberger<br/>\nDiaspar Software Services<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com\">http://www.diasparsoftware.com</a><br/>\nAuthor, JUnit Recipes: Practical Methods for Programmer Testing</div>", 
    "prevInTime": 12464, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1102867649", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDQxQkM2Q0MxLjMwOTA2MDVAcm9nZXJzLmNvbT4="
    }
}