{
    "numMessagesInTopic": 14, 
    "nextInTime": 12474, 
    "senderId": "zntCgIn-iaOHsjFt8NRrGqxN7El-d2ROesgdJFZrJihoKoMRfCDveiwjStfzx4NAe4dmhrhyfDY_AGW9b59j", 
    "systemMessage": true, 
    "subject": "Instantiated TestCase won&#39;t run tests", 
    "from": "junityahoo@...", 
    "authorName": "junityahoo@claymccoy.com", 
    "msgSnippet": "So I write my first TestCase class.  Lets call it MyTestCase.  It works great by itself.  It fakes some data that it will need, then runs through some tests to", 
    "msgId": 12473, 
    "topicId": 12473, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 208325191, 
    "messageBody": "<div id=\"ygrps-yiv-1394592284\">So I write my first TestCase class.  Lets call it MyTestCase.  It works great by<br/>\nitself.  It fakes some data that it will need, then runs through some tests to<br/>\nmake sure everything works right.  Great!<br/>\n<br/>\nNow what I want to do is instantiate MyTestCase from another TestCase and have<br/>\nit run through the tests.  The reason that I want to do this is because the<br/>\nother TestCase (lets call it AnotherTestCase is going to feed it the fake data<br/>\nthat I want.  So I also have made a constructor for loadign the fake data in<br/>\nMyTestCase.  I would have thought this would be simple.  This is the code that I<br/>\nwould think that I could put in a test method of AnotherTestCase and have it run<br/>\nthe tests of MyTestCase:<br/>\n<br/>\nTestCase ts = new MyTestCase(FakeData);<br/>\nts.run();<br/>\n<br/>\nBut when I execute AnotherTestCase, it executes these lines, but ts.run() does<br/>\nnot cause the tests in MyTestCase to run.  The Setup() of MyTestCase runs, but<br/>\nno tests.  What is run used for then, and how do I do what I am tryign to do?<br/>\nEven using the regular constructor I can&#39;t make this work.  If I set up a static<br/>\nsuite method in MyTestCase then I can run the tests, but not on the specific<br/>\nMyTestCase that I instantiated.  I want to run the tests for this specific<br/>\ninstance that I created.  The run() is after all an instance method.  I can&#39;t<br/>\nfind any information about how to do this.  I must be thinking about this wrong.<br/>\n Help would be greatly appreciated.<br/>\nThanks<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 12472, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1102978672", 
    "canDelete": false, 
    "nextInTopic": 12481, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDMxMjIyNDI5LjExMDI5Nzg2NzI4NjIuSmF2YU1haWwuanVuaXR5YWhvb0BjbGF5bWNjb3kuY29tPg=="
    }
}