{
    "topicId": 12473, 
    "postDate": "1103054477", 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "from": "junityahoo@...", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "xc2njbBwDR2njb9Bd1fXxUmFl_qyDW9Jk_zpoOTApSKzqgv-_irS-sbLWYuCO3nZyfbIKUPvDwfeaBABXE9O", 
    "nextInTime": 12482, 
    "userId": 208325191, 
    "prevInTime": 12480, 
    "prevInTopic": 12473, 
    "headers": {
        "messageIdInHeader": "PDMyMzc2MDYxLjExMDMwNTQ0Nzc5NzUuSmF2YU1haWwuanVuaXR5YWhvb0BjbGF5bWNjb3kuY29tPg=="
    }, 
    "authorName": "junityahoo@claymccoy.com", 
    "numMessagesInTopic": 14, 
    "msgSnippet": "I just wrote my first TestCase class. Lets call it MyTestCase. It works great by itself. It fakes some data that it will need, then runs through some tests to ", 
    "contentTrasformed": false, 
    "msgId": 12481, 
    "nextInTopic": 12493, 
    "systemMessage": true, 
    "rawEmail": "Return-Path: &lt;junityahoo@...&gt;\r\nReceived: (qmail 2114 invoked from network); 15 Dec 2004 16:18:40 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m25.grp.scd.yahoo.com with QMQP; 15 Dec 2004 16:18:40 -0000\r\nReceived: from unknown (HELO n4a.bulk.scd.yahoo.com) (66.94.237.38)\n  by mta6.grp.scd.yahoo.com with SMTP; 15 Dec 2004 16:18:40 -0000\r\nReceived: from [66.218.69.1] by n4.bulk.scd.yahoo.com with NNFMP; 15 Dec 2004 16:17:35 -0000\r\nReceived: from [66.218.67.190] by mailer1.bulk.scd.yahoo.com with NNFMP; 15 Dec 2004 16:17:35 -0000\r\nX-Sender: junityahoo@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 39070 invoked from network); 14 Dec 2004 20:02:04 -0000\r\nReceived: from unknown (66.218.66.166)\n  by m3.grp.scd.yahoo.com with QMQP; 14 Dec 2004 20:02:04 -0000\r\nReceived: from unknown (HELO www7.kc.aoindustries.com) (65.77.211.64)\n  by mta5.grp.scd.yahoo.com with SMTP; 14 Dec 2004 20:02:04 -0000\r\nReceived: from ao1.kc.aoindustries.com (ao1.kc.aoindustries.com [65.77.211.65])\n\t(authenticated bits=0)\n\tby www7.kc.aoindustries.com (8.12.9-20030917/8.12.9) with ESMTP id iBEK1HoA001725\n\tfor &lt;junit@yahoogroups.com&gt;; Tue, 14 Dec 2004 14:01:17 -0600\r\nDate: Tue, 14 Dec 2004 14:01:17 -0600\r\nMessage-ID: &lt;32376061.1103054477975.JavaMail.junityahoo@...&gt;\r\nTo: junit@yahoogroups.com\r\nMime-Version: 1.0\r\nX-eGroups-Remote-IP: 65.77.211.64\r\nFrom: junityahoo@...\r\nSubject: Instantiated TestCase won&#39;t run tests\r\nX-Yahoo-Group-Post: member; u=208325191\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\nX-Yahoo-Newman-Property: groups-system\r\nX-eGroups-Approved-By: nails762 &lt;jbrains@...&gt; via web; 15 Dec 2004 16:17:33 -0000\r\nX-eGroups-Remote-IP: 66.94.237.38\r\n\r\n\nI just wrote my first TestCase class. Lets call it MyTestCase. It works great by\nitself. It fakes some data that it will need, then runs through some tests to\nmake sure everything works right. Great! \nNow what I want to do is instantiate MyTestCase from another TestCase and have\nit run through the tests. The reason that I want to do this is because the other\nTestCase (lets call it AnotherTestCase) is going to feed it the fake data that I\nwant.  The reason that I want be able to do this because by default I want\nMyTestCase to run on it&#39;s own fake data with the regular constructor, but I also\nwant the option to have a list of fake data that I can feed MyTestCase one at a\ntime so that I test all elements in the list.  So I want to call it externally\nand instantiate it with each element in the list, and run the tests on that\ninstance.  I have made a special constructor on MyTestCase for loading the fake\ndata. Below is the code that I would think that I could put in a test method of\nAnotherTestCase and have it run the tests of MyTestCase on my instance.\n\nJust for clarification this might be in a loop where I iterate through the list\nand pull out each piece of &quot;FakeData.&quot;  But the whole list thing is only\nmentioned because that is the reason that I am trying to run tests on a specific\ninstance in the first place.\n\nTestCase ts = new MyTestCase(FakeData);\nts.run();\n\nBut when I execute this code it executes these lines, but ts.run() does not\ncause the tests in MyTestCase to run. The Setup() of MyTestCase runs, but no\ntests. What is run used for then, and how do I do what I am trying to do? Even\nusing the regular constructor no tests are run.\n\nI&#39;ve seen two close solutions posted everywhere, but neither fits my needs:\n\nI&#39;ve seen that I can set up a static suite method in MyTestCase.  When I do this\nI can run the tests, but not on the specific MyTestCase that I instantiated. I\nwant to run the tests for this specific instance that I created. The run() is\nafter all an instance method. I can&#39;t find any information about how to do this.\nI must be thinking about this wrong.\n\nI have seen where I can overwrite runTest() in MyTestCase and put all the tests\nin there that I want to run.  Sure it runs the tests from the instance that I\npopulated with fake data, but there are three big problems with this.\n* I hate the idea of having to modify runTest() if I add or remove methods.  I\nlike the reflection where anything named test* runs.  This should be how it\nworks automatically.  But I can only figure out how to make this run from a test\nsuite that you instantiate with a class object.  I can&#39;t run my instances that way.\n* The tests actually run, but setup is only called before the whole group of\ntests.  Setup and tear down are supposed to run before and after EACH test.  So\noverriding runTest() in this way is actually breaking the rules of how the tests\nare expected to run.  For this reason alone I don&#39;t think that anyone should\never override runTest() in this way.  Sure you can actually put the setup and\ntear down method calls before and after each test method call.  But come on,\nwhat happened to having all my tests run automatically by reflection!?!\n * The output of the tests is not displayed, it is lost, and the test output is\nonly about the one that is run from AnotherTestCase.  There may be some way to\nredirect this.  I see how I can get the test results from the run method.  But I\ndon&#39;t know what to do with it.\n\nIn summary, I just want to send some data to an instance of a TestCase subclass,\nand run the tests on it.  This should be trivial.  What do I need to do?\n\nHelp would be greatly appreciated. \nThanks \n\n\n[Non-text portions of this message have been removed]\n\n\n\n\n\n", 
    "subject": "Instantiated TestCase won&#39;t run tests"
}