{
    "numMessagesInTopic": 14, 
    "nextInTime": 12505, 
    "senderId": "C1JWUhZVQ0HvoFuk7-mLDtjvbedFsVagIHHB7zvJSW1b80DKbWlJYOElYqN79wyhJpFMe7YGaFgaVSeiiYP4", 
    "systemMessage": true, 
    "subject": "Re: [junit] Instantiated TestCase won&#39;t run tests", 
    "from": "junityahoo@...", 
    "authorName": "junityahoo@claymccoy.com", 
    "msgSnippet": "... But I keep feeling like there must be a way to get this behaviour out of JUnit and I am just missing it.  I m willing to accept that it is a problem with", 
    "msgId": 12504, 
    "topicId": 12473, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 208325191, 
    "messageBody": "<div id=\"ygrps-yiv-1619556404\"><blockquote><span title=\"ireply\">&gt; &gt; Is it so wrong to want to instantiate a test with some parameters and<br/>\n&gt; &gt; automatically run the tests on it?<br/>\n&gt; <br/>\n&gt; No, but JUnit was not designed that way.<br/>\n<br/>\n </span></blockquote>But I keep feeling like there must be a way to get this behaviour out of JUnit<br/>\nand I am just missing it.  I&#39;m willing to accept that it is a problem with me<br/>\nrather than JUnit.  Is there something about my outlook on testing that I need<br/>\nto refine?  I am surprised that data driven testing like this is not supported,<br/>\nas it seems like soemthign that would be used a lot.  What is the reasoning<br/>\nbehind JUnit not beign designed for this, and is there soemthign that I can do<br/>\nto acheive what I want while still keeping with JUnit&#39;s design goals.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is a different problem from the one you described before, so it&#39;s a <br/>\n&gt; different one from what I tried to help you solve.<br/>\n<br/>\n </span></blockquote>Yes, that is why I tried to describe it better.  I really appreciate your taking<br/>\nthe time to understand what I am saying and help me.  I bought your book<br/>\nyesterday and I plan to read it over the holidays.<br/>\nAlright I will look into FitNesse like you suggested.  But I still feel like<br/>\nthere is either an issue with JUnit or my understanding of it since I failed to<br/>\nmake this work.<br/>\n<br/>\nThanks!! :)<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 12503, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1103315785", 
    "canDelete": false, 
    "nextInTopic": 12506, 
    "prevInTopic": 12501, 
    "headers": {
        "messageIdInHeader": "PDI5MDQwNzMwLjExMDMzMTU3ODU2NzIuSmF2YU1haWwuanVuaXR5YWhvb0BjbGF5bWNjb3kuY29tPg=="
    }
}