{
    "numMessagesInTopic": 14, 
    "nextInTime": 12514, 
    "senderId": "pVDYfmndFXHbJc7WT1MyXBOPfpMFcfY0CkC4myUSIUNUQ7EzST63nZjKdbXHkMIxnPQa3NRDj0kCWkhHyAZc", 
    "systemMessage": true, 
    "subject": "Re: [junit] Instantiated TestCase won&#39;t run tests", 
    "from": "junityahoo@...", 
    "authorName": "junityahoo@claymccoy.com", 
    "msgSnippet": "I’d like to clarify that I never meant to assert that: a)\tI was going to figure out how to do something with Junit that everyone else previously was", 
    "msgId": 12513, 
    "topicId": 12473, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 208325191, 
    "messageBody": "<div id=\"ygrps-yiv-2054188525\">Id like to clarify that I never meant to assert that:<br/>\na)\tI was going to figure out how to do something with Junit that everyone else<br/>\npreviously was incapable of.<br/>\nb)\tJunit was expected to solve my every testing problem.<br/>\n<br/>\nRather than deem Junit insufficient, my first thought was that I was missing<br/>\nsomething.  This stance was taken out of respect for all the very smart people<br/>\nwho&#39;ve been working with JUnit since 1999.  The reason that I asked on this<br/>\nforum is to take some stock in what someone with experience has to say. <br/>\nI was expecting some explanation of why this type of testing was not supported.<br/>\n Maybe that there were better paradigms that Junit preferred.  I was simply<br/>\ntrying to best understand a piece of software before moving on.<br/>\nI guess I&#39;m confused about your need to be condescending, especially since my<br/>\nmotivations to respect previous work, listen to experience, and recognize<br/>\nsoftware limitations seem to line up pretty nicely with your views.<br/>\nThanks for you time, I guess I&#39;ll have to wait until you explain the solutions<br/>\nthat you alluded to.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junityahoo@...\">junityahoo@...</a> wrote:<br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt;  &gt; &gt; Is it so wrong to want to instantiate a test with some parameters and<br/>\n&gt; &gt;  &gt; &gt; automatically run the tests on it?<br/>\n&gt; &gt;  &gt;<br/>\n&gt; &gt;  &gt; No, but JUnit was not designed that way.<br/>\n&gt; &gt; <br/>\n&gt; &gt; But I keep feeling like there must be a way to get this behaviour out of <br/>\n&gt; &gt; JUnit<br/>\n&gt; &gt; and I am just missing it.  I&#39;m willing to accept that it is a problem <br/>\n&gt; &gt; with me<br/>\n&gt; &gt; rather than JUnit.  Is there something about my outlook on testing that <br/>\n&gt; &gt; I need<br/>\n&gt; &gt; to refine?  I am surprised that data driven testing like this is not <br/>\n&gt; &gt; supported,<br/>\n&gt; &gt; as it seems like soemthign that would be used a lot.  What is the reasoning<br/>\n&gt; &gt; behind JUnit not beign designed for this, and is there soemthign that I <br/>\n&gt; &gt; can do<br/>\n&gt; &gt; to acheive what I want while still keeping with JUnit&#39;s design goals.<br/>\n&gt; <br/>\n&gt; You&#39;re welcome to feel that way; I won&#39;t press the issue anymore. It&#39;s <br/>\n&gt; entirely possible that all the very smart people who&#39;ve been working <br/>\n&gt; with JUnit since 1999 have missed what you&#39;ll eventually figure out. I <br/>\n&gt; have to allow for that possibility. Still, if I were you, I think I <br/>\n&gt; might take some stock in what someone with experience has to say.<br/>\n&gt; <br/>\n&gt; That said, highly data-driven testing /is/ supported by JUnit, as long <br/>\n&gt; as you don&#39;t care about how it reports tests in test runs. You could <br/>\n&gt; simply write this test:<br/>\n&gt; <br/>\n&gt; testAlgorithm<br/>\n&gt;      data = some array<br/>\n&gt;      foreach (item in data)<br/>\n&gt;          doTest(item)<br/>\n&gt; <br/>\n&gt; This works just fine, except:<br/>\n&gt; <br/>\n&gt; 1. If the algorithm fails for the 5th row of data, you&#39;ll never know <br/>\n&gt; what happens with the 6th row, because the test will fail<br/>\n&gt; <br/>\n&gt; 2. Although you&#39;re really running n tests, JUnit will report it as only 1.<br/>\n&gt; <br/>\n&gt; If you don&#39;t care about these so-called limitations, then you&#39;re done.<br/>\n&gt; <br/>\n&gt; Now you /can/ run all your test*() methods for each row in a List of <br/>\n&gt; fixture objects, but I don&#39;t want to get into the details of how until I <br/>\n&gt; have time to sit down and write an article about it. Today&#39;s not the day.<br/>\n&gt; <br/>\n&gt; Finally, you were earlier talking about something like instantiating and <br/>\n&gt; running a test from some other test. JUnit /definitely/ don&#39;t work that <br/>\n&gt; way. Don&#39;t even bother. Tests do not run other tests; that&#39;s why we have <br/>\n&gt; test runners.<br/>\n&gt; <br/>\n&gt; &gt;  &gt; This is a different problem from the one you described before, so it&#39;s a<br/>\n&gt; &gt;  &gt; different one from what I tried to help you solve.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Yes, that is why I tried to describe it better.  I really appreciate <br/>\n&gt; &gt; your taking<br/>\n&gt; &gt; the time to understand what I am saying and help me.  I bought your book<br/>\n&gt; &gt; yesterday and I plan to read it over the holidays.<br/>\n&gt; &gt; Alright I will look into FitNesse like you suggested.  But I still feel like<br/>\n&gt; &gt; there is either an issue with JUnit or my understanding of it since I <br/>\n&gt; &gt; failed to<br/>\n&gt; &gt; make this work.<br/>\n&gt; <br/>\n&gt; Understand that what I&#39;m about to say is a little harsh, but it&#39;s true. <br/>\n&gt; I hope we&#39;re all mature enough to take it in the spirit in which it&#39;s given:<br/>\n&gt; <br/>\n&gt;   * A sign of maturity in any profession is when we recognize the <br/>\n&gt; limitations of tools and work around them, often by finding better <br/>\n&gt; tools. To try hopelessly to reshape every problem so that one tool <br/>\n&gt; solves it is wishful thinking. It&#39;s a phase we all go through and have <br/>\n&gt; to get through.<br/>\n&gt; <br/>\n&gt; Four years ago, I was you, hoping that JUnit would do everything <br/>\n&gt; including massage my feet when I was tired.<br/>\n&gt; <br/>\n&gt; I hope Fit/FitNesse helps you solve the problem in a nicer way. If not, <br/>\n&gt; then just wait for my next recipe: &quot;Parameterized Test Suite&quot;. :)<br/>\n&gt; <br/>\n&gt; Take care.<br/>\n&gt; -- <br/>\n&gt; J. B. (Joe) Rainsberger<br/>\n&gt; Diaspar Software Services<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com\">http://www.diasparsoftware.com</a><br/>\n&gt; Author, JUnit Recipes: Practical Methods for Programmer Testing<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 12512, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1103577322", 
    "canDelete": false, 
    "nextInTopic": 12515, 
    "prevInTopic": 12506, 
    "headers": {
        "messageIdInHeader": "PDE2OTI1MTAyLjExMDM1NzczMjIzMzcuSmF2YU1haWwuanVuaXR5YWhvb0BjbGF5bWNjb3kuY29tPg=="
    }
}