{
    "numMessagesInTopic": 4, 
    "nextInTime": 12512, 
    "senderId": "HiwlQaX17wv1hgOm6BVQodXxk7YI0TgzWOibnlB2KBCJeG92tcE0I-CWfMLFrL-CAlLEhQVHsClMQIyMC-KVKOezrLOMvHE_cznhZyu2-L3ozeXZrgt2", 
    "systemMessage": false, 
    "subject": "RE: [junit] Testing a Struts Action with a mock back end", 
    "from": "&quot;Tambascio, Larry&quot; &lt;ltambascio@...&gt;", 
    "authorName": "Tambascio, Larry", 
    "msgSnippet": "Alex, I m assuming that you re externalizing your dependencies in your Struts action.  Meaning that you ve got set/get methods for things that provide ", 
    "msgId": 12511, 
    "topicId": 12509, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 135164432, 
    "messageBody": "<div id=\"ygrps-yiv-245025711\">Alex,<br/>\n<br/>\nI&#39;m assuming that you&#39;re &quot;externalizing your dependencies&quot; in your Struts<br/>\naction.  Meaning that you&#39;ve got set/get methods for things that provide<br/>\nJavaMail interfaces in your Struts action.  So how are you currently<br/>\ninjecting the JavaMail objects into your Struts action??<br/>\n<br/>\nAssuming you are doing that, it could be as simple as mocking JavaMail<br/>\n(using easymock, for example, I don&#39;t know if mockobjects itself has<br/>\nJavaMail mocks) and injecting those to your Struts action in setUp.<br/>\n<br/>\nIf your struts action class hierarchy is &quot;hardwired&quot; to get references to<br/>\nJavaMail (e.g. through JNDI), then you&#39;ve shot yourself in the foot.  But<br/>\nI&#39;m thinking that&#39;s not the problem.  I think mocking JavaMail is the part<br/>\nthat&#39;s not done for you yet.<br/>\n<br/>\nForgive my obscurity around JavaMail.  It&#39;s not an API I&#39;m incredibly<br/>\nfamiliar with, but the external dependency problem is one I&#39;ve been dealing<br/>\nwith quite a bit.<br/>\n<br/>\nThe trick of subclassing the object you&#39;re testing to override and provide<br/>\nmock implementations of dependencies may not work with MockStrutsTestCase,<br/>\nbecause it&#39;s bound to the struts-config file to invoke the execute method.<br/>\nSeems like there should be some way to override that configuration to point<br/>\nto the subclass, but I&#39;m not sure how much that would buy you.<br/>\n<br/>\nPerhaps some code snippet from your action&#39;s execute method would help<br/>\nclarify your problem, or at least allow me/us to provide more concrete<br/>\nexamples of ways around.<br/>\n<br/>\nHope some of this helps.<br/>\n<br/>\nLater,<br/>\n-Larry<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: emilander [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:emilander@...\">emilander@...</a>] <br/>\nSent: Monday, December 20, 2004 1:32 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSubject: [junit] Testing a Struts Action with a mock back end<br/>\n<br/>\n<br/>\n<br/>\nI am trying to write some unit tests for a Struts Action that uses <br/>\nJavaMail to send a message. It seems to do this I&#39;ll need to <br/>\n<br/>\n1 - Use a junit extension built for Struts<br/>\n2 - Use IOC to substitute a mock JavaMail implementation for the <br/>\nreal thing.<br/>\n<br/>\nI have found StrutsTestCase (<a rel=\"nofollow\" target=\"_blank\" href=\"http://strutstestcase.sourceforge.net/)\">http://strutstestcase.sourceforge.net/)</a> <br/>\nas a framework for doing #1, but it does not seem to allow me to do <br/>\n#2. I could do #2 without #1 by refactoring into a helper class, but <br/>\nthat would leave the action untested.<br/>\n<br/>\nDo anyone have any ideas how to do both #1 and #2?<br/>\n<br/>\nThanks<br/>\nAlex<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\nThis email and its attachments are confidential under applicable law are <br/>\nintended for use of the senders addressee only, unless the sender expressly<br/>\nagrees otherwise, or unless a separate written agreement exists between <br/>\nIron Mountain and a recipient company governing communications between the <br/>\nparties and any data that may be so transmitted. Transmission of email over<br/>\nthe Internet is not a secure communications medium. If you are requesting or<br/>\nhave requested the transmittal of personal data, as defined in applicable<br/>\nprivacy laws, by means of email or in an attachment to email, you may wish<br/>\nto select a more secure alternate means of transmittal that better supports<br/>\nyour obligations to protect such personal data. If the recipient of this <br/>\nmessage is not the recipient named above, and/or you have received this email<br/>\nin error, you must take no action based on the information in this email.<br/>\nYou are hereby notified that any dissemination, misuse or copying or <br/>\ndisclosure of this communication by a recipient who has received this message<br/>\nin error is strictly prohibited. If this message is received in error please <br/>\nreturn this email to the sender and immediately highlight any error in <br/>\ntransmittal. <br/>\nThank You</div>", 
    "prevInTime": 12510, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1103574870", 
    "canDelete": false, 
    "nextInTopic": 12512, 
    "prevInTopic": 12509, 
    "headers": {
        "messageIdInHeader": "PEREOENCMjQ0RUFGMkRCNEM4NUI5OUMxQzk5NjNFMkQyMDhFQTI3MzZAY29sZXhjbDIuY29ycC5wbGE+"
    }
}