{
    "numMessagesInTopic": 14, 
    "nextInTime": 12538, 
    "senderId": "8tpiq4h03V8fvAQJu0Gyh_bYLKEJLF2R6FSHSYw6zB7eqDsIbRdRUUWBCRYdI2vkFDOxpDhq7t3e7OPVVOorqcbVvrxHvthAiLapx0lDUQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Instantiated TestCase won&#39;t run tests", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... It would be best to start with Kent Beck s original paper, Smalltalk Testing with Patterns . It gives you some insight into the intent and design of JUnit", 
    "msgId": 12537, 
    "profile": "nails762", 
    "topicId": 12473, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-807563395\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junityahoo@...\">junityahoo@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt;  &gt; But can you understand why what you wrote could have come across that<br/>\n&gt;  &gt; way? It was pretty clear to me.<br/>\n&gt; <br/>\n&gt; E-mail can cause a lot of misunderstandings, especially when one <br/>\n&gt; projects their<br/>\n&gt; own assumptions into what they are reading.<br/>\n<br/>\n </span></blockquote>...and we all do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That is understandable.  But if you could point me to these pages then I <br/>\n&gt; would<br/>\n&gt; voraciously consume them.  I have of course read all the attached <br/>\n&gt; documentation<br/>\n&gt; that comes with JUnit, and I have been trying to make use of the <br/>\n&gt; JUnit-Addons<br/>\n&gt; package.<br/>\n<br/>\n </span></blockquote>It would be best to start with Kent Beck&#39;s original paper, &quot;Smalltalk <br/>\nTesting with Patterns&quot;. It gives you some insight into the intent and <br/>\ndesign of JUnit (based on SUnit). Google will help you find it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sure, but it is also enervating when you are told to give it up when you <br/>\n&gt; know<br/>\n&gt; that there is more to the story.<br/>\n<br/>\n </span></blockquote>If we&#39;d been able to chat over beer, I&#39;d have been happy to go on....<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I believe that I have found my own answer.  At least here are my <br/>\n&gt; thoughts at the<br/>\n&gt; moment.  Data driven testing in the way that I am trying to do it is not <br/>\n&gt; easily<br/>\n&gt; supported in JUnit.  There is likely a reason for this, since a lot of <br/>\n&gt; thought<br/>\n&gt; has gone into producing JUnit.  I now believe that my approach is not in <br/>\n&gt; keeping<br/>\n&gt; with JUnit.  Since I am running the actual metadata from the application <br/>\n&gt; through<br/>\n&gt; the test, I am doing more of a data driven functional type of testing.  A<br/>\n&gt; solution that appears more consistent with JUnit and unit testing in general<br/>\n&gt; seems to be to make some mock metadata classes that are specially <br/>\n&gt; designed to<br/>\n&gt; exercise my code in the test.  This way my test is not dependent on any<br/>\n&gt; production code rather than the actual class that it is testing, and I <br/>\n&gt; am not<br/>\n&gt; trying to dynamically find all the production code and iterate through <br/>\n&gt; it all.<br/>\n&gt; Instead I am looking to carefully engineer my own metadata to exercise <br/>\n&gt; my tests.<br/>\n&gt; To implement this I basically wrote an abstract test class, and then made<br/>\n&gt; specific subclasses that are each mainly concerned with building <br/>\n&gt; specific mock<br/>\n&gt; data.  It is okay that this data is hardcoded rather than dynamic <br/>\n&gt; because I am<br/>\n&gt; looking to exercise the code by carefully building my own data rather than<br/>\n&gt; running through all data that currently exists in the application.  I was<br/>\n&gt; basically being lazy by using data that already existed and not crafting <br/>\n&gt; my own.<br/>\n<br/>\n </span></blockquote>&quot;Lazy&quot; might be harsh, but I&#39;m with you.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But running actual production data does seem useful at least a few times <br/>\n&gt; when<br/>\n&gt; testing your own tests, just because there is some potential in catering <br/>\n&gt; to your<br/>\n&gt; own tests when writing your own data as well.  Does that part make <br/>\n&gt; sense?  This<br/>\n&gt; is the only thing that feels strange about my current ideas.  Am I on <br/>\n&gt; the right<br/>\n&gt; track?<br/>\n<br/>\n </span></blockquote>Yes; it&#39;s just a question of which tools, and for this kind of <br/>\nend-to-end testing, I recommend Fit/FitNesse, especially when it&#39;s <br/>\nheavily data-driven, by which I mean the same algorithm and 100 sets of <br/>\ninput/expected output. The Fit ColumnFixture is built for that purpose.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know that there are many frustrations with dealing with a mailing list.  I<br/>\n&gt; applaud your taking the time to answer people’s questions, and feel very <br/>\n&gt; lucky<br/>\n&gt; to have the opportunity to carry on a dialog with an expert.  Thanks so <br/>\n&gt; much for<br/>\n&gt; your time getting me past this hurdle.<br/>\n<br/>\n </span></blockquote>No problem. Thanks for your patience. Take care.<br/>\n-- <br/>\nJ. B. (Joe) Rainsberger<br/>\nDiaspar Software Services<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com\">http://www.diasparsoftware.com</a><br/>\nAuthor, JUnit Recipes: Practical Methods for Programmer Testing</div>", 
    "prevInTime": 12536, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1103747374", 
    "canDelete": false, 
    "nextInTopic": 12538, 
    "prevInTopic": 12533, 
    "headers": {
        "inReplyToHeader": "PDMwMjIzMjM0LjExMDM2NjYwMzQ2MTYuSmF2YU1haWwuanVuaXR5YWhvb0BjbGF5bWNjb3kuY29tPg==", 
        "messageIdInHeader": "PDQxQzlEOTJFLjUwNzA0MDFAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDMwMjIzMjM0LjExMDM2NjYwMzQ2MTYuSmF2YU1haWwuanVuaXR5YWhvb0BjbGF5bWNjb3kuY29tPg=="
    }
}