{
    "numMessagesInTopic": 12, 
    "nextInTime": 12657, 
    "senderId": "Bl_IjUupnBofZ9QCqFJWvGfXygxTIO06kL4rBf6xT-KxCWVlC1JigR1zvVX7382m9c6Xfn3QH_g3", 
    "systemMessage": false, 
    "subject": "Re: [junit] Reporting historical test results", 
    "from": "didoss@...", 
    "authorName": "didoss@comcast.net", 
    "msgSnippet": "Paul - Thanks for the reply.  Unfortunately, we are already doing that. We run a nightlybuild with tests.  It copies the previous results to a backup-reports", 
    "msgId": 12656, 
    "rawEmail": "Return-Path: &lt;didoss@...&gt;\r\nX-Sender: didoss@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 98876 invoked from network); 12 Jan 2005 15:16:11 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m24.grp.scd.yahoo.com with QMQP; 12 Jan 2005 15:16:11 -0000\r\nReceived: from unknown (HELO rwcrmhc13.comcast.net) (204.127.198.39)\n  by mta3.grp.scd.yahoo.com with SMTP; 12 Jan 2005 15:16:11 -0000\r\nReceived: from 204.127.197.117 ([204.127.197.117])\n          by comcast.net (rwcrmhc13) with SMTP\n          id &lt;2005011215160901500naqr7e&gt;; Wed, 12 Jan 2005 15:16:09 +0000\r\nReceived: from [139.177.224.128] by 204.127.197.117;\n\tWed, 12 Jan 2005 15:16:09 +0000\r\nTo: junit@yahoogroups.com\r\nDate: Wed, 12 Jan 2005 15:16:09 +0000\r\nMessage-Id: &lt;011220051516.26199.41E53F390001B8CA0000665722007340769C9C010B070B@...&gt;\r\nX-Mailer: AT&T Message Center Version 1 (Dec 17 2004)\r\nX-Authenticated-Sender: ZGlkb3NzQGNvbWNhc3QubmV0\r\nMIME-Version: 1.0\r\nX-eGroups-Remote-IP: 204.127.198.39\r\nFrom: didoss@...\r\nSubject: Re: [junit] Reporting historical test results\r\nX-Yahoo-Group-Post: member; u=180862158\r\nX-Yahoo-Profile: dijdoss\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\n\r\nPaul -\n\nThanks for the reply.  Unfortunately, we are already doing that.\n\nWe run a nightlybuild with tests.  It copies the previous results to a backup-reports directory, cleans the reports directory, and then creates the current results html files.  Then, we send out an e-mail to the team, with the links to the various reports (for different &#39;chunks&#39; of code), both current and previous.\n\nEvery morning, I am opening those reports and copying the highest level data (from the summary section -&gt; #tests, #failures, #errors) into an excel spreadsheet.\n\nCurrently, we are trying to get our testing back under control - many iterations of allowing people to say their stories were complete without appropriate - or even working - tests.  Additionally, in the past, we have found that we have a velocity treshhold - after which our testing goes downhill.  So, we have a need to maintain this historical information, over the life of the project.\n\nI am looking for a way to automate this.  What I&#39;m thinking of is:\nwhen the reporting functionality totals the summary numbers, it could also output to another file type (ideally, straight into an excel spreadsheet; minimally, into a file that can be used as a data source for a spreadsheet) a configurable data set: date, time, #tests, #failures, #errors, #time.\n\nDianne\n\n-------------- Original message -------------- \n\n\n\n\nDianne Doss asked\n\n\nIs there an automated way to output the summary data (#tests,\n#errors, #failures) from my JUnit Report to an external file\n(possibly xls, or a file accessible by spreadsheet) in order to\nmaintain a history of our results?\n\nIn the ideal world, there would never be any errors or failures, but\nthe point of the testing is to make us confident in making code\nchanges.  We run a nightlybuild regression, so the next morning I\ncan see if I missed anything (sometimes the failures are well\nremoved from the actual class that was changed).\n\nSo, we would like to be able to record historical data of the\nfluctuations.  In the past, manually, we have found that the\nerrors/failures go up when we get above a certain velocity.\n\nThanks for any insight that can be provided.\n\nDianne Doss\n\n\nDear Doss,\n\n              If you are generating JUnit Report through Ant, definitely you\nshould write one build.xml file. Before generating new report, why not you\ntake copy of the previous report.  In Ant API  contains copy tag and move\ntag. So\nfirst step you take a back up using Copy/ Move tag.\nSecond step you clear your old report using delete tag.\nThird step create report folder again.\nFinally you generate new report.\n\n\n\nPaul Domnic J.\n\nScandent Group\n4th Floor, KRM Centre,\nNo.2, Harrington Road,\nChetpet,\nChennai 600 031\nIndia\n\nTel:+91 44  5211 8090\nFax:+91 44  5211 8068\nImportant Email Information :- The  information  in  this  email is\nconfidential and may  be  legally  privileged. It  is  intended  solely for\nthe addressee. Access to  this email  by anyone  else  is  unauthorized.  If\nyou are not the intended recipient, any disclosure, copying, distribution or\nany action taken or omitted to be taken in reliance on it, is prohibited\nand may be unlawful. If you are not the intended addressee please contact\nthe sender and dispose of this e-mail immediately.\n\n\n\n\nYahoo! Groups Links\n\nTo visit your group on the web, go to:\nhttp://groups.yahoo.com/group/junit/\n  \nTo unsubscribe from this group, send an email to:\njunit-unsubscribe@yahoogroups.com\n  \nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. \n\n[Non-text portions of this message have been removed]\n\n\n", 
    "profile": "dijdoss", 
    "topicId": 12642, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 180862158, 
    "prevInTime": 12655, 
    "contentTrasformed": false, 
    "postDate": "1105542969", 
    "canDelete": false, 
    "nextInTopic": 12658, 
    "prevInTopic": 12655, 
    "headers": {
        "messageIdInHeader": "PDAxMTIyMDA1MTUxNi4yNjE5OS40MUU1M0YzOTAwMDFCOENBMDAwMDY2NTcyMjAwNzM0MDc2OUM5QzAxMEIwNzBCQGNvbWNhc3QubmV0Pg=="
    }
}