{
    "numMessagesInTopic": 26, 
    "nextInTime": 1268, 
    "senderId": "DD9Hsgdlw9bhOd_0-AxoA2W3SLWeCWK7Ag9UEDqxJ-CQV_vD6Ys5lyxPW1QYoa9LTEeYUbqg0p2e8JspZIYmHvvsCSu-Sg", 
    "systemMessage": false, 
    "subject": "How to test protected and private methods/ fields?", 
    "from": "&quot;Jens Andersen&quot; &lt;jensa@...&gt;", 
    "authorName": "Jens Andersen", 
    "msgSnippet": "Hi all, First of all I have to mention that I m pretty novice when it comes to use JUnit for writing unittests. But I have a question which I hope some of you ", 
    "msgId": 1267, 
    "topicId": 1267, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-56748946\">Hi all,<br/>\n<br/>\nFirst of all I have to mention that I&#39;m pretty novice when it comes to use<br/>\nJUnit for writing unittests. But I have a question which I hope some of you<br/>\ncan help me with - it&#39;s regarding testing private/protected methods and how<br/>\nto organize my test package.<br/>\n<br/>\nFirst the package. I have read to articles regarding test (&quot;Junit best<br/>\npractices&quot; from JavaWorld and &quot;Incremental development with Ant and JUnit&quot;<br/>\nfrom developerWorks). In the JBT article Andy Schneider advice you to keep<br/>\ntests in the same location as the source code. And in the Incremental...<br/>\narticle Malcolm Davis advice you to make a separate package. Which approach<br/>\nis the best to use?<br/>\n<br/>\nI must admit that I like the idea of making a separate package but then<br/>\nagain - how do I then test private and protected methods? And if I keep the<br/>\ntests in the same location as the source code - who do I then test private<br/>\nmethods?<br/>\n<br/>\nI would very much appreciate if some of you could give me a little example<br/>\n<br/>\nKind regards,<br/>\n<br/>\nJ. Andersen</div>", 
    "prevInTime": 1266, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "990607459", 
    "canDelete": false, 
    "nextInTopic": 1268, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDIwMDEwNTIzMDg0NC5LQUEwOTA2MkBuZXdtYWlsLml0LWMuZGs+"
    }
}