{
    "numMessagesInTopic": 12, 
    "nextInTime": 12674, 
    "senderId": "mtocsxMZmWGtGOqgOg6t1pU_J4jkK3IEsUaLewvkdYXk1E17sohzJnrgRWhwNVKVvX59G00OnBCCeS3AEgkrC0HAZV0vxWY2iSTHgY6F", 
    "systemMessage": true, 
    "subject": "Re: Reporting historical test results", 
    "from": "&quot;Carsten Kiess&quot; &lt;junit@...&gt;", 
    "authorName": "Carsten Kiess", 
    "msgSnippet": "Hello Dianne, in a current project we had the need to identify new failed testcases in opposite to already known failed testcases. So we do the following: - a", 
    "msgId": 12673, 
    "profile": "tangledupinbonn", 
    "topicId": 12642, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 189296033, 
    "messageBody": "<div id=\"ygrps-yiv-1979625453\">Hello Dianne,<br/>\n<br/>\nin a current project we had the need to identify new failed testcases<br/>\nin opposite to already known failed testcases. So we do the following:<br/>\n<br/>\n- a status-method (returning a string) is introduced into each<br/>\ntestcases (this is not necessary, but helpful)<br/>\n- a java-program scans the testcases, generates an omitted list (not<br/>\nready, run manual etc) as csv and generates suites for the testcases<br/>\n(based on package names)<br/>\n- another javaprogram (lets call it the runner) starts the tests,<br/>\nbeginning with the &quot;anchor&quot;-suite - there is no graphical output<br/>\n(could probably done with a listener)<br/>\n- the runner loads the saved result of the previous test run (refer to<br/>\nbelow)<br/>\n- the runner compares the result of the current run (which gives also<br/>\ninformation like total numbers of testcases, failed testcases, runtime<br/>\netc) with the previous run<br/>\n- remark: the result contains the same information which is available<br/>\nin the gui-runner and probably in xml-reports<br/>\n- If a current failure is not found in the previous list, then it gets<br/>\nthe status new (this works also for different errors for the same<br/>\ntestcase)<br/>\n- the runner saves the new result as csv (status, class, failure,<br/>\nexception) under a fixed name as reference for the next run and<br/>\nadditionally archives it with a timestamp<br/>\n<br/>\nThe result of this process is:<br/>\n- the omitted list tells us how much work is left (it is also archived<br/>\nwith a timestamp, but this history is needed not that often)<br/>\n- the overall statistics of the testrun tells us how much work ist<br/>\ndone &lt;g&gt;<br/>\n- the testresults gives us a list of failures to work on and most<br/>\nimportant the newly introduced errors get the status new - to be<br/>\nchecked immediately<br/>\n- a simple textsearch on the archive-directory reveals the history of<br/>\na testcase (when and how did he show up in the failure-history)<br/>\n- by copying and renaming an archived result we can run the current<br/>\ntests against any historical result (daily regression versus weekly<br/>\nbuild for example)<br/>\n<br/>\nI manually import the csv-files and the statistical information into a<br/>\nspreadsheet with three tabs: omitted, failed, regression history<br/>\n(charts with the overall numbers, especially the number of &quot;new&quot;<br/>\nerrors). At least the creation of the csv-data is no problem (the<br/>\ncomplete set of information is available) and the import could be<br/>\nsemi-automized with a macro - I have not figured out how to insert an<br/>\nexcel-row directly from java. The only thing I would like to add is to<br/>\nsave the eclipse-logfile as well, but I do not know how ...<br/>\n<br/>\nTo me the important thing is to keep the historical data and to see<br/>\nimmediately when a testcase fails. In theory everything is green and<br/>\nif not it is fixed before the next run ... at least thats what the<br/>\ntheory says &lt;g&gt;. Maybe you can use and extend this approach to extract<br/>\nand excel the data you need.<br/>\n<br/>\n   cheers, Carsten <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, didoss@c... wrote:<br/>\n&gt; Not hearing anyone running forward with a solution, I&#39;m left with<br/>\ntwo questions: one for the group, and one for some &#39;higher up&#39;.<br/>\n&gt; <br/>\n&gt; For the group: do you think that this would be useful functionality<br/>\nfor someone to try and creat?<br/>\n&gt; <br/>\n&gt; For some &#39;higher up&#39;: if I were interested in writing this code,<br/>\nwhat is the process for that?<br/>\n&gt; <br/>\n&gt; thanks, Dianne<br/>\n&gt; <br/>\n&gt; -------------- Original message -------------- <br/>\n&gt; <br/>\n&gt; Paul Dominic writes:<br/>\n&gt;       <br/>\n&gt;                     If you are generating JUnit Report through Ant,<br/>\n&gt; definitely you<br/>\n&gt;       should write one build.xml file. Before generating new report,<br/>\n&gt; why not you<br/>\n&gt;       take copy of the previous report.  In Ant API  contains copy<br/>\ntag<br/>\n&gt; and move<br/>\n&gt;       tag. So<br/>\n&gt;       first step you take a back up using Copy/ Move tag.<br/>\n&gt;       Second step you clear your old report using delete tag.<br/>\n&gt;       Third step create report folder again.<br/>\n&gt;       Finally you generate new report.<br/>\n&gt; <br/>\n&gt; Are you saying there&#39;s no extension for JUnit that sends the test<br/>\n&gt; results/report into a database, using JDBC or some other mechanism?<br/>\n I&#39;m<br/>\n&gt; new to JUnit, too, but I find it hard to believe that there isn&#39;t<br/>\n&gt; already software to store historical test results in a database.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Todd.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; To visit your group on the web, go to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/junit/\">http://groups.yahoo.com/group/junit/</a><br/>\n&gt;   <br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n&gt;   <br/>\n&gt; Your use of Yahoo! Groups is subject to the Yahoo! Terms of<br/>\nService. <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 12672, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1105704099", 
    "canDelete": false, 
    "nextInTopic": 12683, 
    "prevInTopic": 12672, 
    "headers": {
        "inReplyToHeader": "PDAxMTMyMDA1MTQ1My4zNjE3LjQxRTY4QjY0MDAwMThERjIwMDAwMEUyMTIyMDA3NTAzMzA5QzlDMDEwQjA3MEJAY29tY2FzdC5uZXQ+", 
        "messageIdInHeader": "PGNzOGNiMytsbHJoQGVHcm91cHMuY29tPg=="
    }
}