{
    "numMessagesInTopic": 26, 
    "nextInTime": 1278, 
    "senderId": "qIEtblD9rwX2bMoUioKUSafNttEtwellMNEI40sHvh_YpDV8cQBuBW3ZZeJtuwj3SPYBqwaFXJ1I0AyvXPLeHXSdUfBf46xtR2YbqgwjVQ", 
    "systemMessage": false, 
    "subject": "RE: [junit] How to test protected and private methods/ fields?", 
    "from": "Matt Caswell &lt;m.caswell@...&gt;", 
    "authorName": "Matt Caswell", 
    "msgSnippet": "Q. What are we trying to do when we do unit testing? A. We are testing all of the interfaces exposed by a unit to external components to ensure that those", 
    "msgId": 1277, 
    "topicId": 1267, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-713885371\">Q. What are we trying to do when we do &quot;unit&quot; testing?<br/>\nA. We are testing all of the interfaces exposed by a &quot;unit&quot; to external<br/>\ncomponents to ensure that those interfaces react as we would expect them to<br/>\nin all reasonable scenarios that we can think of.<br/>\n<br/>\nSo to answer the question about private/protected methods: Does a private<br/>\nmethod expose itself to external components? No - therefore we do not need<br/>\nto test them. Errors within private methods will become apparent from<br/>\ntesting the other interfaces.<br/>\n<br/>\nDo we need to test protected methods? Yes - protected methods are accessible<br/>\nexternal to the unit and therefore form part of that unit&#39;s interface. If<br/>\nyou are going to call protected methods there are four ways that you could<br/>\ndo it that I can think of:<br/>\na)Subclass the class you are testing<br/>\nb)Use reflection<br/>\nc)Don&#39;t use protected methods, always use public<br/>\nd)Place the test code in the same package<br/>\n<br/>\nOption &quot;a&quot; is a bit icky, and will only work in certain situations anyway<br/>\n(how do you test a &quot;final&quot; class? Java only has single inheritance so how do<br/>\nyou extend TestCase as well...etc). Option &quot;b&quot; will work but is also icky -<br/>\nand a sledgehammer to crack a nut. Option &quot;c&quot; will work but I would always<br/>\nbe loathe to do it. My instinct is always to place as much restriction as<br/>\npossible on a method (the more I expose the more I have to maintain and the<br/>\nhigher coupling I could potentially have). Option &quot;d&quot; will work and is the<br/>\nsimplest to do.<br/>\n<br/>\nI recommend option d. As has been previously suggested I always place my<br/>\ntest code in the same package but a separate directory to maintain<br/>\nseparation of the two things.<br/>\n<br/>\nMatt<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Jens Andersen<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSent: 23/05/01 09:44<br/>\nSubject: [junit] How to test protected and private methods/ fields?<br/>\n<br/>\nHi all,<br/>\n<br/>\nFirst of all I have to mention that I&#39;m pretty novice when it comes to<br/>\nuse<br/>\nJUnit for writing unittests. But I have a question which I hope some of<br/>\nyou<br/>\ncan help me with - it&#39;s regarding testing private/protected methods and<br/>\nhow<br/>\nto organize my test package.<br/>\n<br/>\nFirst the package. I have read to articles regarding test (&quot;Junit best<br/>\npractices&quot; from JavaWorld and &quot;Incremental development with Ant and<br/>\nJUnit&quot;<br/>\nfrom developerWorks). In the JBT article Andy Schneider advice you to<br/>\nkeep<br/>\ntests in the same location as the source code. And in the Incremental...<br/>\narticle Malcolm Davis advice you to make a separate package. Which<br/>\napproach<br/>\nis the best to use?<br/>\n<br/>\nI must admit that I like the idea of making a separate package but then<br/>\nagain - how do I then test private and protected methods? And if I keep<br/>\nthe<br/>\ntests in the same location as the source code - who do I then test<br/>\nprivate<br/>\nmethods?<br/>\n<br/>\nI would very much appreciate if some of you could give me a little<br/>\nexample<br/>\n<br/>\nKind regards,<br/>\n<br/>\nJ. Andersen<br/>\n<br/>\n<br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n <br/>\n<br/>\nYour use of Yahoo! Groups is subject to<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a></div>", 
    "prevInTime": 1276, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "990620444", 
    "canDelete": false, 
    "nextInTopic": 1279, 
    "prevInTopic": 1276, 
    "headers": {
        "messageIdInHeader": "PDI5Qzg0Q0YyNUQwM0Q1MTE5RkNGMDA5MDI3QjY3QjVBNzQwNzNFQEVYQ0hBTkdFMT4="
    }
}