{
    "numMessagesInTopic": 7, 
    "nextInTime": 12823, 
    "senderId": "KFSLfpBN-Nj4N54qcyWrl-oP55jsbEfvJYAEBr2OhakkqlRTlee_7PpgPLxuhhQDgzBqUG2opltFqtFcU3jEeaa-KMLGqExEgPdr", 
    "systemMessage": false, 
    "subject": "RE: [junit] Re: Testing exceptions", 
    "from": "&quot;Pico Geyer&quot; &lt;picog@...&gt;", 
    "authorName": "Pico Geyer", 
    "msgSnippet": "Hi lasitha. Thanks for your reply. Previous replies to my question??? This is the first reply I get to my question so either their must be something wrong with", 
    "msgId": 12822, 
    "profile": "feugan3333", 
    "topicId": 12807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 213535375, 
    "messageBody": "<div id=\"ygrps-yiv-216755682\">Hi lasitha.<br/>\n<br/>\nThanks for your reply. <br/>\n<br/>\nPrevious replies to my question???<br/>\n<br/>\nThis is the first reply I get to my question so either their must be<br/>\nsomething wrong with my mailbox or there is a delay between the time you<br/>\nregister for the mailing list and the time you start receiving messages.<br/>\nI did not even receive the question that I posted.<br/>\n<br/>\n <br/>\n<br/>\nWould someone please be so kinds as to repost those replies?<br/>\n<br/>\n <br/>\n<br/>\nLasitha: I find the article that you have linked very interesting.<br/>\n<br/>\n <br/>\n<br/>\nAm I suffering from the overuse of checked exceptions? I&#39;m not sure. I<br/>\nbasically only used checked exceptions because the way I understand it:<br/>\nruntime exceptions are for circumstances that you can not foresee and<br/>\ntherefore can not handle.<br/>\n<br/>\n <br/>\n<br/>\nThe java tutorial&#39;s opinion on exceptions tends not to agree with you.<br/>\nIt seems they propose the rigorous use of checked exceptions and<br/>\ninfrequent use of runtime exceptions. I&#39;m just a newbie so if I&#39;ve got<br/>\nthe whole story wrong, please give an explanation :-)<br/>\n<br/>\n <br/>\n<br/>\nTo extend the example below with the FileNotFoundException, What is the<br/>\neffect of throwing a runtime exception? Will the program terminate with<br/>\nthis exception? Also if the name of the file was chosen by the user<br/>\ninstead, would it be better to use a checked exception?<br/>\n<br/>\n <br/>\n<br/>\nThanks for all your help.<br/>\n<br/>\nPico<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Pico, previous replies to your question have hopefully given you some<br/>\n&gt;guidance in testing exceptions, but i have to raise some questions<br/>\n&gt;about your error handling strategy in general...<br/>\n<br/>\n&gt;&lt;warning&gt;<br/>\n&gt;I am going to make a case against checked exceptions.  This is a much<br/>\n&gt;discussed topic, and you should be able to find many differing<br/>\n&gt;opinions.  For a detailed argument /against/ checked exceptions in<br/>\n&gt;java, see Bruce Eckels article:<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mindview.net/Etc/Discussions/CheckedExceptions\">http://www.mindview.net/Etc/Discussions/CheckedExceptions</a><br/>\n&gt;&lt;/warning&gt;<br/>\n<br/>\n&gt;--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;Pico Geyer&quot; &lt;picog@s...&gt; wrote:<br/>\n&gt;&gt; ...<br/>\n&gt;&gt; <br/>\n&gt;&gt; try{<br/>\n&gt;&gt;       statement1<br/>\n&gt;&gt;       statement2<br/>\n&gt;&gt; }<br/>\n&gt;&gt; catch(ExceptionType1 e1){<br/>\n&gt;&gt;       System.err.println(&quot;The following exception occurred &quot; +<br/>\n&gt;&gt; e1.toString());<br/>\n&gt;&gt; }<br/>\n&gt;&gt;<br/>\n&gt;&gt; I know that this is not a very good way of handling exceptions...<br/>\n&gt;Glad you noticed :)!<br/>\n<br/>\n&gt;&gt; The most obvious solution would be to let the method throw all<br/>\n&gt;&gt; exceptions that are generated. <br/>\n&gt;For argument&#39;s sake, lets explore that option...<br/>\n<br/>\n&gt;Here&#39;s a question: if you&#39;re not going to do anything about an<br/>\n&gt;exception, why bother catching it?  And logging doesn&#39;t count - it&#39;s<br/>\n&gt;mere hand-waving.  In fact, here&#39;s how i would rate the possible<br/>\n&gt;responses to a typical exception:<br/>\n<br/>\n&gt;1. Catch it and do nothing - if you do this, i /will/ fire you!<br/>\n&gt;2. Catch it and log it - marginally better, but you&#39;re still fired.<br/>\n&gt;3. Catch it, log it and rethrow it - you can keep your job, but your<br/>\n&gt;log file will be filled up with the same exception logged repeatedly.<br/>\n&gt;4. Catch it and rethrow it - better, but if so, why catch it in the<br/>\n&gt;first place?<br/>\n<br/>\n&gt;(note that the topmost layers of your code are exempt - they obviously<br/>\n&gt;have to catch all exceptions and at least report them).<br/>\n<br/>\n&gt;If the answer to item 4. is that you have to catch exceptions because<br/>\n&gt;the compiler forces you to, then your problem is the over-use of<br/>\n&gt;checked exceptions.<br/>\n<br/>\n&gt;&gt; The problem is that there are 5 or 6 different types of <br/>\n&gt;&gt; exceptions that this method can generate and <br/>\n&gt;&gt; this seems to make my code very messy.<br/>\n&gt;/Any/ piece of code can raise dozens of exceptions, but you don&#39;t have<br/>\n&gt;to respond to most of them because they&#39;re /unchecked/.  I am curious<br/>\n&gt;why throwing your 5/6 exception makes your code messy - is it because<br/>\n&gt;they are checked?<br/>\n<br/>\n&gt;Consider what happens if you get in the habit of not using checked<br/>\n&gt;exceptions and wrapping any existing checked exceptions with a<br/>\n&gt;RuntimeException:<br/>\n<br/>\n&gt;    try {<br/>\n&gt;        new FileInputStream(new File(&quot;/tmp/temp.txt&quot;));<br/>\n&gt;    }<br/>\n&gt;    catch (FileNotFoundException e) {<br/>\n&gt;        throw new RuntimeException(e);<br/>\n&gt;    }<br/>\n&gt;<br/>\n&gt;Now the client code isn&#39;t /forced/ to write a catch block for the<br/>\n&gt;FileNotFoundException. If the client actually needs to respond to this<br/>\n&gt;particular exception, use a specific extension of RuntimeException.<br/>\n&gt;<br/>\n&gt;What you&#39;ll often find, however, is that the majority of your code<br/>\n&gt;won&#39;t actually care about exceptions, leaving them to propogate up to<br/>\n&gt;your top-level controllers where they can be communicated to users in<br/>\n&gt;some fashion.<br/>\n<br/>\n&gt;I admit i&#39;m presenting an over-simplified view of the problem;<br/>\n&gt;moreover, this attitude towards exception-handling makes most sense<br/>\n&gt;within an environment supported by rigorous and automated unit<br/>\n&gt;testing.  Such environments encourage a rather simple strategy for<br/>\n&gt;dealing with exceptions:<br/>\n&gt;* Fix the bug in your code that /caused/ the exception, instead of<br/>\n&gt;writing more code to respond to bad code. *<br/>\n<br/>\n&gt;Sorry if i&#39;ve gone off on a tangential rant: i don&#39;t really have<br/>\n&gt;enough evidence to assume you are suffering from over-use of checked<br/>\n&gt;exceptions.  In any case, i hope this is food for thought.<br/>\n<br/>\n&gt;Cheers, lasitha.<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 12821, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1107777363", 
    "canDelete": false, 
    "nextInTopic": 12825, 
    "prevInTopic": 12816, 
    "headers": {
        "messageIdInHeader": "PEFEREYzRkUxOUQ2NDIxNDJBQjBGMDk4NzYxQUEwQ0U5MDhFNzcxQHNzbWFpbi5zb2Z0c3RhcnQuY28uemE+"
    }
}