{
    "topicId": 1267, 
    "postDate": "990629329", 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "from": "Dan North &lt;dan@...&gt;", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "panHFyRRatDN3rQqQnBRmkgENFZmGMwqnMucgbSRj_VnL7X6MTYbXLW5GJqYBPmCT40CGFMboMwY1fr0hD6LvhFH", 
    "nextInTime": 1285, 
    "userId": 0, 
    "prevInTime": 1283, 
    "prevInTopic": 1283, 
    "headers": {
        "inReplyToHeader": "PDNCMEJDMDlDLjNGRUNBRDRDQG1ycy51bW4uZWR1Pg==", 
        "messageIdInHeader": "PDUuMS4wLjE0LjIuMjAwMTA1MjMxNTQxNTUuMDFmZjQyMThAbWFpbC5jYWRyaW9uLmNvbT4=", 
        "referencesHeader": "PDQuMy4xLjIuMjAwMTA1MjMxNTMwNTguMDJjY2JmYzhAbHVjYXMuY3YubXNsLmVzPg=="
    }, 
    "authorName": "Dan North", 
    "numMessagesInTopic": 26, 
    "msgSnippet": "In response to Nic s specific example, I would suggest this is crying out for a Strategy design pattern.  In this case, the algorithm and any refinements would", 
    "contentTrasformed": false, 
    "msgId": 1284, 
    "nextInTopic": 1285, 
    "systemMessage": false, 
    "rawEmail": "Return-Path: &lt;dan@...&gt;\r\nX-Sender: dan@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-7_1_3); 23 May 2001 14:53:46 -0000\r\nReceived: (qmail 53677 invoked from network); 23 May 2001 14:47:29 -0000\r\nReceived: from unknown (10.1.10.26) by l7.egroups.com with QMQP; 23 May 2001 14:47:29 -0000\r\nReceived: from unknown (HELO the?beast.cadrion.com) (212.158.7.253) by mta1 with SMTP; 23 May 2001 14:47:29 -0000\r\nReceived: from CAPONE.cadrion.com (tech7dev.cadrion.co.uk [212.158.7.146]) by the_beast.cadrion.com with SMTP (Microsoft Exchange Internet Mail Service Version 5.5.2653.13) id KS43K41S; Wed, 23 May 2001 15:47:07 +0100\r\nMessage-Id: &lt;5.1.0.14.2.20010523154155.01ff4218@...&gt;\r\nX-Sender: DNorth@...\r\nX-Mailer: QUALCOMM Windows Eudora Version 5.1\r\nDate: Wed, 23 May 2001 15:48:49 +0100\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] How to test protected and private methods/ fields?\r\nIn-Reply-To: &lt;3B0BC09C.3FECAD4C@...&gt;\r\nReferences: &lt;4.3.1.2.20010523153058.02ccbfc8@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;; format=flowed\r\nFrom: Dan North &lt;dan@...&gt;\r\n\r\nIn response to Nic&#39;s specific example, I would suggest this is crying out \nfor a Strategy design pattern.  In this case, the algorithm and any \nrefinements would be represented by their own class and would therefore be \ntestable in their own right.\n\nI agree that a private method probably shouldn&#39;t need independent testing \noutside of the public/protected method(s) that call it, but I will \ntypically use a protected method as a default implementation (eg. have an \ninterface, then an abstract class that implements that interface with some \ndefault protected implementations, then a bunch of classes that extend the \nabstract class and override the methods they are interested in).  In this \ncase, I do actually want to test the protected methods, and Matt&#39;s solution \nof test cases in the same package in a different directory seems an \ninherently elegant solution to this problem.\n\nStill annoyed that I didn&#39;t know that about protected methods though :o)\n\nDan.\n\n\nAt 14:52 23/05/2001 +0100, you wrote:\n&gt;Jim Cheesman wrote:\n&gt;\n&gt; &gt; At 02:20 PM 23/05/01, you wrote:\n&gt; &gt; &gt;So to answer the question about private/protected methods: Does a private\n&gt; &gt; &gt;method expose itself to external components? No - therefore we do not need\n&gt; &gt; &gt;to test them. Errors within private methods will become apparent from\n&gt; &gt; &gt;testing the other interfaces.\n&gt; &gt;\n&gt; &gt; Undoubtably that&#39;s true. But then if we are accepting that testing\n&gt; &gt; public/friendly/protected methods adecuately test these methods, why not go\n&gt; &gt; one step beyond and say that black box testing is all we need? It seems to\n&gt; &gt; me that testing private methods is as useful and valid as testing\n&gt; &gt; non-private ones, just at a different level of granularity.\n&gt;\n&gt;As a specific example, say I&#39;ve got some computation that involves a fairly\n&gt;hairy algorithm in one place.  I probably want to encapsulate that algorithm\n&gt;into its own method so, e.g., I can Substitute in a new Algorithm later when\n&gt;someone points out that I (again) made the problem a lot harder than it needed\n&gt;to be.  I may well want to make that method private, though, as its existence\n&gt;or signature could reveal more about the internals of my class than I&#39;d like;\n&gt;it might, e.g., have an argument that refers to a component of some (private)\n&gt;field.\n&gt;\n&gt;Presumably I would be _especially_ interested in testing such a method given\n&gt;that it represents a non-trivial algorithm.  If I&#39;m forced to only test it\n&gt;indirectly then the tests of the public methods are likely to be harder to\n&gt;write and may depend in weird ways on this (hidden) implementation decision.\n&gt;\n&gt;I find that one of the (many) advantages of breaking things down into little\n&gt;methods is that writing the tests is both less difficult and less\n&gt;(psychologically) daunting.  Big methods with complex behaviors are a pain to\n&gt;test because there&#39;s so much _thinking_ involved in figuring out appropriate\n&gt;boundary conditions, blah, blah, blah, while little methods are usually much\n&gt;easier to test just because they&#39;re easier to understand.  The flipside,\n&gt;though, is (as has been mentioned before) I don&#39;t want the creation of these\n&gt;little (sub)methods to make my public class interface (and consequently my\n&gt;public obligations) bigger and more complex.  Thus I almost always make these\n&gt;new little methods private initially, and only change them to protected or\n&gt;public later when some clear need arises.  (As others have noted, this is\n&gt;essentially an application of YAGNI.)\n&gt;\n&gt;     Nic\n&gt;\n&gt;\n&gt;To unsubscribe from this group, send an email to:\n&gt;junit-unsubscribe@yahoogroups.com\n&gt;\n&gt;\n&gt;Your use of Yahoo! Groups is subject to http://docs.yahoo.com/info/terms/\n\n--\nDan North\nVP Development  -  Cadrion Technologies  -  +44 (0)20 7440 9550\n\nCONFIDENTIALITY\nThis e-mail and any attachments are confidential\nand may also be privileged. If you are not the named recipient,\nplease notify the sender immediately and do not disclose the\ncontents to another person, use it for any purpose, or store\nor copy the information in any medium\n\n\n", 
    "subject": "Re: [junit] How to test protected and private methods/ fields?"
}