{
    "numMessagesInTopic": 26, 
    "nextInTime": 1286, 
    "senderId": "94tea3OZQrtV2pN8-nKT0kKdTL27z8m6Il9l0MZC4HHQn-kbXuE5MOvTIt_xEb9REl997-_AezXupg5SqeTnqymxUDbvqjIL", 
    "systemMessage": false, 
    "subject": "Re: How to test protected and private methods/ fields?", 
    "from": "&quot;Nic McPhee&quot; &lt;mcphee@...&gt;", 
    "authorName": "Nic McPhee", 
    "msgSnippet": "... crying out ... therefore be ... I found this comment (and Ilja s, who made essentially the same point) quite interesting.  Two issues come up, though. ", 
    "msgId": 1285, 
    "topicId": 1267, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-476659069\">--- In junit@y..., Dan North &lt;dan@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; In response to Nic&#39;s specific example, I would suggest this is<br/>\n </span></blockquote>crying out <br/>\n<blockquote><span title=\"ireply\"> &gt; for a Strategy design pattern.  In this case, the algorithm and any <br/>\n&gt; refinements would be represented by their own class and would<br/>\n </span></blockquote>therefore be <br/>\n<blockquote><span title=\"ireply\"> &gt; testable in their own right.<br/>\n<br/>\n </span></blockquote>I found this comment (and Ilja&#39;s, who made essentially the same point)<br/>\nquite interesting.  Two issues come up, though.<br/>\n<br/>\nFirst, the Strategy Pattern buys you some flexibility at the cost of<br/>\nsome added complexity.  You could read the principle of YAGNI as<br/>\nsaying don&#39;t pay for the flexibility until you know you need it.  If I<br/>\ndon&#39;t have any real reason to believe that I&#39;m likely to swap in a new<br/>\nalgorithm later, then moving the algorithm into its own class could be<br/>\nseen as overkill.  (There are still, however, plenty of reasons to<br/>\nencapsulate it in its own method, like readability and coherence.) <br/>\nMoving it into its own class does buy you something in simplifying the<br/>\ntesting, though, so is that (up-front, immediate) benefit sufficient<br/>\nto justify the cost of the pattern?<br/>\n<br/>\nThe other issue is that there&#39;s probably some sort of spectrum here,<br/>\nwith little tiny methods on the one hand and big complex algorithms on<br/>\nthe other.  The tiny methods can probably be private and not directly<br/>\ntested (although that&#39;s not entirely obvious), and the big guys<br/>\nprobably can/should be pulled out into their own classes.  In between,<br/>\nthough, it would seem that there are (private, helper) methods that<br/>\naren&#39;t big enough to justify their own class, but are still big enough<br/>\nthat you&#39;d want to test them independently.<br/>\n<br/>\n\tNic</div>", 
    "prevInTime": 1284, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "990631605", 
    "canDelete": false, 
    "nextInTopic": 1286, 
    "prevInTopic": 1284, 
    "headers": {
        "inReplyToHeader": "PDUuMS4wLjE0LjIuMjAwMTA1MjMxNTQxNTUuMDFmZjQyMThAbWFpbC5jYWRyaW9uLmNvbT4=", 
        "messageIdInHeader": "PDllZ2tybCsycGFvQGVHcm91cHMuY29tPg=="
    }
}