{
    "numMessagesInTopic": 7, 
    "nextInTime": 12891, 
    "senderId": "1yJ17Oz8SZLO-kclno7H75H62vqQwEqGQCPr1w1rlfEZxwz51VrV979bHosMAWVeToDA71KMMJKNkqs1n3XlCzyzRRBm8G5JOyl9tCukGOT19Q", 
    "systemMessage": false, 
    "subject": "Automated Testing for Web applications - Any Experiences ?", 
    "from": "&quot;nirajkumar1096&quot; &lt;nirajkumar1096@...&gt;", 
    "authorName": "nirajkumar1096", 
    "msgSnippet": "While I am not a hardcore Xp practitioner, I have used junit extensively. I have been attempting to find an effective framework that extends junit s capability", 
    "msgId": 12890, 
    "profile": "nirajkumar1096", 
    "topicId": 12864, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 97673312, 
    "messageBody": "<div id=\"ygrps-yiv-1636392351\">While I am not a hardcore Xp practitioner, I have used junit<br/>\nextensively. I have been attempting to find an effective framework<br/>\nthat extends junit&#39;s capability to Web app testing. There are numerous<br/>\nbut in my mind their effectiveness is in question.<br/>\n<br/>\nRecently I have been trying to create a sample of automated tests for<br/>\nour enterprise web application running on Oracle 9IAS. The application<br/>\nis quite complex and uses Javascript extensively.<br/>\nMy purpose is to create a test that mimics the steps in a `Change<br/>\nRequest&#39; or `Defect&#39; . This would be created by the<br/>\ndeveloper and<br/>\nexecuted before and after the bugfix/change. Therefore I needed a java<br/>\nbased framework with which to create the test cases.<br/>\n<br/>\nSince these test case need to test a web application, I researched and<br/>\nfinally focused on following three options. Note that while there are<br/>\nbunch of tools/frameworks, I did not find any big winners.<br/>\n<br/>\nJAKARTA CACTUS  While I have successfully created some tests with<br/>\nJakarta Cactus Framework to create server side tests that have access<br/>\nto HttpSession etc. objects., this does not allow us to mimic a<br/>\nuser&#39;s<br/>\nbrowser experience.<br/>\n<br/>\nHTTPUNIT/JWEBUNIT  After spending considerable time with this<br/>\nframework, I feel it has ways to go before it can be used for complex<br/>\nWeb application testing. One of the primary issue is limited support<br/>\nfor Javascript. Even if I was to bypass that, I found that the time<br/>\ntaken to create an automated test is too long.<br/>\n<br/>\nTESTMAKER  This is created and recommend by Frank Cohen in his<br/>\nbook<br/>\nJava Testing and Design. My reservations with this tool is that I did<br/>\nnot get the impression that is was used by enough developers/testers.<br/>\nIt is also promoted as record/playback tool and such tools may work<br/>\nwell for simple scripts, they can cause maintenance issues for large<br/>\ntesting harness.<br/>\n<br/>\nMy question is :<br/>\n<br/>\n1. Has anyone implemented automated testing harness for their<br/>\nenterprise web application that has brought significant value to QA of<br/>\ntheir software product/system?<br/>\n<br/>\n2. If so, then what was the tool/framework used ? And would you say<br/>\ncritical success factor is<br/>\na) your architecture/methodology of automated testing harness or<br/>\nb) the tool/framework<br/>\n<br/>\n3. Is this even feasible exercise? Can automated testing harness be<br/>\ncreated to enterprise web applications?<br/>\n<br/>\nThank you<br/>\n<br/>\n- Niraj<br/>\nSurya Infosys Corp</div>", 
    "prevInTime": 12889, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1108662766", 
    "canDelete": false, 
    "nextInTopic": 12895, 
    "prevInTopic": 12869, 
    "headers": {
        "messageIdInHeader": "PGN2MmxsZSthc3R1QGVHcm91cHMuY29tPg=="
    }
}