{
    "numMessagesInTopic": 26, 
    "nextInTime": 1291, 
    "senderId": "JhJ1PazqSf0rA5ecM9rAxhIGoJwh_0xND6mprK_WwOdEslztWwI0zeiRAQKo76-VBtVxGCwmg2c293P35S_uUpCR", 
    "systemMessage": false, 
    "subject": "RE: [junit] How to test protected and private methods/ fields?", 
    "from": "Dan North &lt;dan@...&gt;", 
    "authorName": "Dan North", 
    "msgSnippet": "Something just occurred to me.  Isn t this whole thread Heisenberg s Uncertainty Principle applied to unit testing? Or is it just getting a little late on a", 
    "msgId": 1290, 
    "topicId": 1267, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-2126593823\">Something just occurred to me.  Isn&#39;t this whole thread Heisenberg&#39;s <br/>\nUncertainty Principle applied to unit testing?<br/>\n<br/>\nOr is it just getting a little late on a Wednesday?<br/>\n<br/>\nCheers,<br/>\nDan.<br/>\n<br/>\n<br/>\nAt 12:03 23/05/2001 -0400, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Just about everyone&#39;s weighed in on this topic.  It&#39;s an interesting one.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;I&#39;d like to remind that the reason for the name &quot;unit test&quot; is that it<br/>\n&gt;refers to the _scope_ of the components that are being tested, relative to<br/>\n&gt;the entire system.  The term &quot;unit testing&quot; should not imply anything too<br/>\n&gt;prescriptive about the strategies employed to test thoroughly at that scope,<br/>\n&gt;though as others have stated, there are guidelines.  In object oriented<br/>\n&gt;programming the &quot;unit&quot; scope is often a class, but is also often a single<br/>\n&gt;method or a cluster of closely related classes.  Truly, a program can be<br/>\n&gt;broken into even smaller units - expressions and statements - but everyone<br/>\n&gt;agrees this is too granular for testing.<br/>\n&gt;<br/>\n&gt;Also recall that the test of whether we&#39;ve tested _enough_ should be code<br/>\n&gt;coverage analysis of the component/subsystem/system under test when run<br/>\n&gt;against our test suite.  If testing all the public and protected methods<br/>\n&gt;also happens to test your private methods and exception handlers thoroughly,<br/>\n&gt;then you&#39;re all set, but you don&#39;t know that unless you have extremely<br/>\n&gt;simple applications, or you are doing coverage analysis.  Anyway, it is<br/>\n&gt;unsafe to conclude a priori that public API testing is all that is needed;<br/>\n&gt;each situation should determine the tools and strategies used.<br/>\n&gt;<br/>\n&gt;I have two examples to offer that may help when you&#39;re in a tough situation<br/>\n&gt;where testing private methods or protected classes.<br/>\n&gt;<br/>\n&gt;One is a private field accessor class, the other is a technique.<br/>\n&gt;<br/>\n&gt;I&#39;m attaching the FieldAccessor, which is mainly from Larman and Guthrie&#39;s<br/>\n&gt;Java 2 performance and idiom book.  Personally, I have yet to need this<br/>\n&gt;class for anything, but I thought I&#39;d pass it along.  It&#39;s javadoc&#39;ed.<br/>\n&gt;<br/>\n&gt;The technique is one that I have found useful at least once, which is to put<br/>\n&gt;a public static inner class that extends junit.framework.TestCase in the<br/>\n&gt;class under test.  This gives the inner class full access to the outer<br/>\n&gt;class&#39;s private methods and members, while allowing the inner class to be an<br/>\n&gt;instance of a JUnit test case.  I sent an example of this to this list a few<br/>\n&gt;weeks ago.  Another handy thing is that when you compile the outer class,<br/>\n&gt;the inner test case is produced in a separate class file which can be safely<br/>\n&gt;deleted when packaging the outer class for production (because the outer<br/>\n&gt;class makes no references to the static inner class).<br/>\n&gt;<br/>\n&gt;Scott Stirling<br/>\n&gt;Macromedia<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;-----Original Message-----<br/>\n&gt;<br/>\n&gt;From: Jens Andersen<br/>\n&gt;<br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt;Sent: 5/23/01 4:44 AM<br/>\n&gt;<br/>\n&gt;Subject: [junit] How to test protected and private methods/ fields?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;Hi all,<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;First of all I have to mention that I&#39;m pretty novice when it comes to<br/>\n&gt;<br/>\n&gt;use<br/>\n&gt;JUnit for writing unittests. But I have a question which I hope some of<br/>\n&gt;<br/>\n&gt;you<br/>\n&gt;can help me with - it&#39;s regarding testing private/protected methods and<br/>\n&gt;<br/>\n&gt;how<br/>\n&gt;to organize my test package.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;First the package. I have read to articles regarding test (&quot;Junit best<br/>\n&gt;<br/>\n&gt;practices&quot; from JavaWorld and &quot;Incremental development with Ant and<br/>\n&gt;<br/>\n&gt;JUnit&quot; from developerWorks). In the JBT article Andy Schneider advice you to<br/>\n&gt;<br/>\n&gt;keep<br/>\n&gt;tests in the same location as the source code. And in the Incremental...<br/>\n&gt;<br/>\n&gt;article Malcolm Davis advice you to make a separate package. Which<br/>\n&gt;<br/>\n&gt;approach is the best to use?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;I must admit that I like the idea of making a separate package but then<br/>\n&gt;<br/>\n&gt;again - how do I then test private and protected methods? And if I keep<br/>\n&gt;<br/>\n&gt;the<br/>\n&gt;tests in the same location as the source code - who do I then test<br/>\n&gt;<br/>\n&gt;private methods?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;I would very much appreciate if some of you could give me a little<br/>\n&gt;<br/>\n&gt;example<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;Kind regards,<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;J. Andersen<br/>\n&gt;<br/>\n&gt;To unsubscribe from this group, send an email to:<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n<br/>\n </span></blockquote>--<br/>\nDan North<br/>\nDevelopment Team  -  Cadrion Consulting Ltd  -  +44 (0)20 7440 9550<br/>\n<br/>\nCONFIDENTIALITY<br/>\nThis e-mail and any attachments are confidential<br/>\nand may also be privileged. If you are not the named recipient,<br/>\nplease notify the sender immediately and do not disclose the<br/>\ncontents to another person, use it for any purpose, or store<br/>\nor copy the information in any medium</div>", 
    "prevInTime": 1289, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "990637276", 
    "canDelete": false, 
    "nextInTopic": 1291, 
    "prevInTopic": 1289, 
    "headers": {
        "inReplyToHeader": "PEMzODQzQkQxQjgzREQyMTE5RDc5MDAwMDkyQTdCQUQ0MDVGNDkxQTZAcGxhdGludW0uYWxsYWlyZS4gY29tPg==", 
        "messageIdInHeader": "PDUuMS4wLjE0LjIuMjAwMTA1MjMxNzU3MjYuMDIwNTYyYjBAbWFpbC5jYWRyaW9uLmNvbT4="
    }
}