{
    "numMessagesInTopic": 13, 
    "nextInTime": 12912, 
    "senderId": "6k0YXgzLCaLBJV6OuMBIxc7rZwXLq--EqKfpL9D8Ww3ozCv-MSVj35E1_zRYh7vxWqXcgyPSFl1d1JbwSfqCx6REZ2NVnj6cpe8h", 
    "systemMessage": false, 
    "subject": "Junit and mock objects", 
    "from": "&quot;Pico Geyer&quot; &lt;picog@...&gt;", 
    "authorName": "Pico Geyer", 
    "msgSnippet": "Hi all. As suggested earlier my members of this list, I m trying to implement mock objects to test my code. I m coming across a couple of problems though, and", 
    "msgId": 12911, 
    "profile": "feugan3333", 
    "topicId": 12911, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 213535375, 
    "messageBody": "<div id=\"ygrps-yiv-1804840555\">Hi all.<br/>\n<br/>\nAs suggested earlier my members of this list, I&#39;m trying to implement<br/>\nmock objects to test my code.<br/>\n<br/>\nI&#39;m coming across a couple of problems though, and would like some<br/>\nadvice if possible.<br/>\n<br/>\nI&#39;m not sure what to do when I need to mock 3rd party code. Most of the<br/>\ndocumentation about mock objects says: &quot;don&#39;t mock 3rd party code&quot;, but<br/>\nif I don&#39;t, then how am I expected to test my code that uses these 3rd<br/>\nparty libraries.<br/>\n<br/>\nIn particular I found this statement from<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mockobjects.com/DynaMock.html:\">http://www.mockobjects.com/DynaMock.html:</a><br/>\n&quot;We have found that mocking third party classes (and interfaces) over<br/>\nwhich we have no control causes problems in the long run. It is better<br/>\nto define an interfaces for your objects in terms of concepts in your<br/>\napplication, and then implement them as wafer-thin adapters to the third<br/>\nparty libraries. That has two benefits: (a) your objects are easier to<br/>\nunderstand, and (b) your application is not polluted with references to<br/>\nthird party packages that might have to be replaced for non-technical<br/>\nreasons. You do not need to have full control over the entire codebase<br/>\nto follow this approach.&quot;<br/>\n<br/>\nI don&#39;t really understand what is meant by this. I&#39;ll return to the<br/>\nexample that I&#39;ve been struggling with, one of my classes takes a<br/>\nNetworkInterface object as a parameter to the constructor. Now in order<br/>\nfor me to test that all is well in the constructor I need to mock<br/>\nNetworkInterface.<br/>\n<br/>\nIf somebody could please give me an example of what to do. If possible<br/>\nplease use a class that takes NetorkInterface as an argument to the<br/>\nconstructor as an example, as I&#39;m struggling to understand this.<br/>\n<br/>\nBtw I would post this on the easyMock mailing list, but I&#39;m having<br/>\nproblems joining this list.<br/>\n<br/>\nThanks in Advance<br/>\nPico</div>", 
    "prevInTime": 12910, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1108981784", 
    "canDelete": false, 
    "nextInTopic": 12912, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PEFEREYzRkUxOUQ2NDIxNDJBQjBGMDk4NzYxQUEwQ0U5MDhFNzhDQHNzbWFpbi5zb2Z0c3RhcnQuY28uemE+"
    }
}