{
    "numMessagesInTopic": 3, 
    "nextInTime": 12981, 
    "senderId": "Tv-TKnWGjFfGrF8hR5GgL5WD6AgDbBYxhYlEzxYckhhp-eD-fbhaj6yIYVIFWv6ung5QV13P5IBjCd3qv6scKnyxtrGkswoAIRljY26d", 
    "systemMessage": false, 
    "subject": "Re: [junit] Approach for testing privately contained list?", 
    "from": "Harring Figueiredo &lt;harringf@...&gt;", 
    "authorName": "Harring Figueiredo", 
    "msgSnippet": "... IMHO, this is a bad approach. You are creating a Class just to wrap the functionality of another class. Later on, if the base class needs to be modified,", 
    "msgId": 12980, 
    "profile": "harringf", 
    "topicId": 12976, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124038550, 
    "messageBody": "<div id=\"ygrps-yiv-2054614529\">--- kk_oop &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kk_oop@...\">kk_oop@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Hi.<br/>\n&gt; <br/>\n&gt; In Java, we have a class MyClass that privately contains an ArrayList<br/>\n&gt; as an attribute called myList.  We were looking for a way to enable a<br/>\n&gt; JUnit test case class to call MyClass methods, then check the state of<br/>\n&gt; myList.<br/>\n&gt; <br/>\n&gt; Here&#39;s a what we are considering:<br/>\n&gt; <br/>\n&gt; a.  Make a protected method in MyClass called getMyList that returns<br/>\n&gt; myList and performs lazy instantiation (it&#39;ll only instantiate myList<br/>\n&gt; the first time it is called but will return myList everytime). <br/>\n&gt; MyClass should only access myList through this getter.<br/>\n&gt; <br/>\n&gt; b. Make a test version of MyClass called something like TestMyClass. <br/>\n&gt; Give that a public version of the myList attribute called myTestList.<br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; c. Override getMyList so it will use myTestList instead of myList.<br/>\n&gt; <br/>\n&gt; d. The test case class will instantiate TestMyClass, and call its<br/>\n&gt; methods polymorphically through an variable of type MyClass.<br/>\n&gt; <br/>\n&gt; e.  When the test case wants to check the list values, it will just<br/>\n&gt; cast MyClass back to TestMyClass and access the public myTestList.<br/>\n&gt; <br/>\n&gt; The upside of this is that myList gets to remain private in the<br/>\n&gt; production code.  The downside is that we are not actually using<br/>\n&gt; myList in the test runs.  My thought was that if myTestList is the<br/>\n&gt; same type as myList and the override version of getMyList does exactly<br/>\n&gt; the same thing as the production code&#39;s getMyList (except for acting<br/>\n&gt; on the test version of myList), this downside becomes negligible.<br/>\n&gt; <br/>\n&gt; Note that we would define TestMyClass as an inner class of the JUnit<br/>\n&gt; test case so it will not have a .java file generated for it.<br/>\n&gt; <br/>\n&gt; Any thoughts on this approach?  Good?  Bad?  Recommend a different<br/>\n&gt; approach?<br/>\n&gt; <br/>\n&gt; Thanks for any feedback!<br/>\n&gt; <br/>\n&gt; Ken<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>  IMHO, this is a bad approach. You are creating a Class just to wrap the<br/>\nfunctionality of another class. Later on, if the base class needs to be<br/>\nmodified, you will have to make sure you _remember_ to modify the class that<br/>\nwraps it.<br/>\n<br/>\n The point of the testing is to check the status of the object you are testing.<br/>\ni.e. verify that when you change the status of that object, the object is<br/>\n_actually_ being modified.<br/>\n<br/>\n I am sure you are adding something to the list and later on accessing it,<br/>\nright ? If so, you should have a method that adds something to the class and<br/>\nlater on access it. Try testing that fuctionnality, and that should be all.<br/>\n<br/>\nHarring Figueiredo.<br/>\n<br/>\n<br/>\n\t\t<br/>\n__________________________________ <br/>\nDo you Yahoo!? <br/>\nRead only the mail you want - Yahoo! Mail SpamGuard. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://promotions.yahoo.com/new_mail\">http://promotions.yahoo.com/new_mail</a></div>", 
    "prevInTime": 12979, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1109690814", 
    "canDelete": false, 
    "nextInTopic": 12981, 
    "prevInTopic": 12976, 
    "headers": {
        "inReplyToHeader": "PGQwMHFldStpcDl0QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDIwMDUwMzAxMTUyNjU0LjcyNjU2LnFtYWlsQHdlYjUyMDA1Lm1haWwueWFob28uY29tPg=="
    }
}