{
    "numMessagesInTopic": 7, 
    "nextInTime": 13000, 
    "senderId": "sCPaJrLbZfLExg8srS8FvaWftUY-MwMPny6tUup60-KnB00fwKB-Q4RllqUaTCzidJnoIBZYLd93IAma9jlZrvV9nZ_0elh27Et4s-M6", 
    "systemMessage": false, 
    "subject": "Re: [junit] Change the system time for the test", 
    "from": "Jason Rogers &lt;jacaetevha@...&gt;", 
    "authorName": "Jason Rogers", 
    "msgSnippet": "... Sounds like your tests may be driving your design -- that s a good thing. I have two similar ideas: 1. Consider creating your class with a DateProvider for", 
    "msgId": 12999, 
    "profile": "jacaetev", 
    "topicId": 12997, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 109352929, 
    "messageBody": "<div id=\"ygrps-yiv-2020348561\">haefeleuser wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; For my JUnit tests I need to modify the system time.<br/>\n&gt;<br/>\n&gt; Instead of doing this manually by changing the OS clock I would like<br/>\n&gt; to change the clock programatically in Java.<br/>\n&gt;<br/>\n&gt; Of course I can set the time on the Calendar object in the JUnit test.<br/>\n&gt; But it has no effect on the tested class. In the tested class &quot;new<br/>\n&gt; Date() &quot; returns always the current date and not the one which I set<br/>\n&gt; in my JUnit test.<br/>\n&gt;<br/>\n&gt; I have test data for business logic which I create before the test<br/>\n&gt; starts and which contain absolute dates like 2004-12-31. So I need to<br/>\n&gt; modify the system date for my tests.<br/>\n&gt;<br/>\n&gt; What I need to test is calculation of the average sold quantity. But<br/>\n&gt; only the last X weeks (from today) need to be considered. My test<br/>\n&gt; sales data contains dates like 2004-12-31. Its much easier for me to<br/>\n&gt; write and understand data with such &quot;absolute&quot; dates instead of<br/>\n&gt; relative dates (by rolling the dates around and not understanding it<br/>\n&gt; quickly). So it would be good for me to simply set the system date<br/>\n&gt; before the test starts and thus use absolute dates for my tests<br/>\n&gt; instead of relative ones.<br/>\n&gt;<br/>\n&gt; Of course I could make the dates of the test data relative, but that<br/>\n&gt; would be harder to code, understand and to maintain. It better for me<br/>\n&gt; to change the system time. But it needs to be done programatically in<br/>\n&gt; the JUnit test and not manually by changing the OS date by hand.<br/>\n&gt;<br/>\n&gt; Can you provide a solution for that please?<br/>\n<br/>\n<br/>\n </span></blockquote>Sounds like your tests may be driving your design -- that&#39;s a good thing.<br/>\n<br/>\nI have two similar ideas:<br/>\n  1. Consider creating your class with a DateProvider for which your <br/>\ntest can supply a mock implementation.<br/>\n  2. Add a Date as a parameter to the method or to your class&#39; <br/>\nconstruction routine<br/>\n<br/>\nThe other thing you could do is make your test data relative, which you <br/>\nhave said you are not willing to do.  This would be my choice if there <br/>\nwas no clear design choice to make date retrieval in the class something <br/>\nother than Today.  I am not sure why you think it would be much worse <br/>\nthan what you are doing now (with an absolute date).<br/>\n<br/>\n-- <br/>\nJason Rogers<br/>\n<br/>\n&quot;I am crucified with Christ: nevertheless I live; yet not I,<br/>\nbut Christ liveth in me: and the life which I now live in <br/>\nthe flesh I live by the faith of the Son of God, who loved <br/>\nme, and gave himself for me.&quot;<br/>\n    Galatians 2:20</div>", 
    "prevInTime": 12998, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1109791837", 
    "canDelete": false, 
    "nextInTopic": 13002, 
    "prevInTopic": 12998, 
    "headers": {
        "inReplyToHeader": "PGQwNTBzaCs5ZjdxQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDQyMjYxNDVELjMwMDA5MDJAZmFzdC1tYWlsLm9yZz4=", 
        "referencesHeader": "PGQwNTBzaCs5ZjdxQGVHcm91cHMuY29tPg=="
    }
}