{
    "numMessagesInTopic": 17, 
    "nextInTime": 1309, 
    "senderId": "nA2cU1GrGBqWne-N8byOzpYZDVZbYd8KnpDhSOSbp9jFQW8bQtHNkQ_2tQuycl9XEsVqSXQTqvnXK2TCWYNGuQs", 
    "systemMessage": false, 
    "subject": "Testing private methods", 
    "from": "darren.hobbs@...", 
    "authorName": "darren.hobbs@yellgroup.com", 
    "msgSnippet": "cc: bcc: Contact:   Tel: 2761  -  None Available, 1st Floor South, Queens Walk Testing private methods I will confess to being somewhat confused by all the", 
    "msgId": 1308, 
    "topicId": 1308, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-925797495\">cc:<br/>\nbcc:<br/>\nContact:   Tel: 2761  -  None Available, 1st Floor South, Queens Walk<br/>\n<br/>\nTesting private methods<br/>\n<br/>\nI will confess to being somewhat confused by all the concern over testing<br/>\nprivate methods.  If you are coding in a &#39;test-first&#39; style, then the tests will<br/>\ndrive your code, and any private methods you end up with must invariably be<br/>\ncalled by one of your public methods.  If you have a private method, and the<br/>\n_only_ way to test it is to use reflection, or make it public, or use an inner<br/>\nclass, what is it doing?  If its not used by any of your tested code, why is it<br/>\nthere at all?  I know other instances of the same class can call private<br/>\nmethods, but I have never yet seen an application that relied upon this feature,<br/>\nand if you have objects of the same class calling private methods on each other,<br/>\nI would consider that an indication that the design needs work.  Even if it is<br/>\nnecessary, surely the object making the private call must be doing so<br/>\n(ultimately) in response to a public/protected/package method call?  Which you<br/>\ncan test.<br/>\n<br/>\nIf your method chains are so large its hard to pinpoint the problem when a unit<br/>\ntest fails, then perhaps some refactoring is in order to break up the chain.  A<br/>\nmethod call should generally perform one discreet action.  In almost every<br/>\napplication I&#39;ve seen where hard-to-find bugs are causing problems, many of them<br/>\ncould be reduced by making the methods smaller, and having more of them.  As<br/>\nlong as each method does one well-defined thing, and is sensibly named, having<br/>\nmore small methods will cause less confusion than having methods that are 300<br/>\nlines long.<br/>\n<br/>\nRegards,<br/>\n<br/>\n-Darren<br/>\n<br/>\n<br/>\n[Information] -- PostMaster:<br/>\nThis transmission is intended solely for the addressee(s) and may be<br/>\nconfidential. If you are not the named addressee, or if the message has been<br/>\naddressed to you in error, you must not read, disclose, reproduce, distribute or<br/>\nuse this transmission.<br/>\n<br/>\nDelivery of this message to any person other than the named addressee is not<br/>\nintended in any way to waive confidentiality.  If you have received this<br/>\ntransmission in error please contact the sender or delete the message.<br/>\n<br/>\nThank you.</div>", 
    "prevInTime": 1307, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "990784743", 
    "canDelete": false, 
    "nextInTopic": 1338, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDAwMjU2QTU3LjAwMzZEQTgxLjAwQHF1ZWd3MDEuYnR5cD4="
    }
}