{
    "numMessagesInTopic": 1, 
    "nextInTime": 13242, 
    "senderId": "NrtSWv4SGcdErEgio_DNUsd6WkZzK-pWNFsUSeztuPsJxQxPONHQU13OQEjtUz9NJIR2CR7HVmJ7aFW-KvpZj78n", 
    "systemMessage": true, 
    "subject": "ANN: Call for Papers on Software Testing", 
    "from": "Cem Kaner &lt;kaner@...&gt;", 
    "authorName": "Cem Kaner", 
    "msgSnippet": "CALL FOR PAPERS: JOURNAL OF THE ASSOCIATION FOR SOFTWARE TESTING The Journal of the Association for Software Testing ( ", 
    "msgId": 13241, 
    "profile": "cemkaner", 
    "topicId": 13241, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 21539620, 
    "messageBody": "<div id=\"ygrps-yiv-2115164740\">CALL FOR PAPERS:<br/>\nJOURNAL OF THE ASSOCIATION FOR SOFTWARE TESTING<br/>\n<br/>\nThe Journal of the Association for Software Testing ( <br/>\nhttp://associationforsoftwaretesting.org/) is seeking papers on the <br/>\ntheory, practice, and teaching of software testing for its first <br/>\nissues. We welcome papers from scholars and from practitioners in the <br/>\nfield. We will also consider proposals for special issues organized by <br/>\na guest editor.<br/>\n<br/>\nWe welcome submissions at any time, but our tentative deadline for <br/>\narticles for the first issue is September 1, 2005.<br/>\n<br/>\nThe emphasis of the first issue will be on putting the field in <br/>\nperspective. There are some very strongly different visions of testing. <br/>\nA broad paper that gives the reader insight into one of those visions <br/>\n(along with supporting empirical data or literature review) would be <br/>\nparticularly welcome. Well-researched and well-documented attacks on <br/>\nother viewpoints are as welcome as well-researched and well-documented <br/>\nadvocations.<br/>\n<br/>\nSubmissions outside of this emphasis will still be considered, but <br/>\nmight be published in the next issue.<br/>\n<br/>\nThe Charter for the Journal is at the end of this message, as is a list <br/>\nof members of our Editorial Board. The Charter describes in more detail <br/>\nthe types of papers that we will consider.<br/>\n<br/>\nTo submit a paper, please send the manuscript to Cem Kaner, <br/>\nkaner@....<br/>\n<br/>\nAuthors are encouraged to submit abstracts before writing and sending <br/>\npapers. The abstract can be any reasonable length. Abstracts will be <br/>\nrapidly evaluated, not peer reviewed. The response to the abstract will <br/>\nbe brief, of the nature &quot;Yes, this appears to be within the scope of <br/>\nthe Journal and could be a promising paper&quot; or &quot;No, we are not likely <br/>\nto accept a paper along these lines.&quot; A positive response to an <br/>\nabstract will not be a commitment to publish the associated paper, nor <br/>\nis a negative response a guaranteed rejection  of the associated paper. <br/>\nIt is merely a rough, informal indicator that might save some <br/>\nprospective authors some time.<br/>\n<br/>\nWe expect to publish the Journal on the Web, under a Creative Commons <br/>\nlicense that allows anyone to reprint the article but not to modify it. <br/>\nArticles will be formatted consistently, paginated consecutively across <br/>\nissues, within an annual volume. It will *look* like a traditional <br/>\nprinted journal, but it will be available to the testing community for <br/>\nfree. We follow the style of the American Psychological Association <br/>\n(http://www.apastyle.org/) largely because this is the most carefully <br/>\ndefined and most accessible professional society style available to <br/>\nprospective authors.<br/>\n<br/>\nAST is a recently-formed nonprofit professional service organization <br/>\ndedicated to advancing the understanding and practice of software <br/>\ntesting. The AST serves a community of scholars, students, and software <br/>\ndevelopment practitioners by providing forums for discussion of all <br/>\naspects of software testing through conferences, publications, web <br/>\nsites, and other services.<br/>\n<br/>\n=============================================================<br/>\nEDITORIAL CHARTER OF THE<br/>\nJOURNAL OF THE ASSOCIATION FOR SOFTWARE TESTING<br/>\n<br/>\nThe primary purpose of the Journal of the Association for Software <br/>\nTesting is to publish peer-reviewed materials of archival value that <br/>\nadvance the understanding and practice of software testing. The Journal <br/>\nwill accept a wide range of original, unpublished materials.<br/>\n<br/>\nJAST is published electronically rather than in print. As a result, <br/>\nprinting costs do not constrain the length of articles. Articles can be <br/>\nof any length, but must be concisely written; verbose articles will be <br/>\nreturned to the author for revision.<br/>\n<br/>\nEMPIRICAL & THEORETICAL RESEARCH (Peer Reviewed)<br/>\n<br/>\nJAST welcomes original scientific and engineering research reports. <br/>\nPapers that focus on a mathematical model are welcome; however our <br/>\nstrong preference is that such a paper include data that at least <br/>\nestablishes the plausibility of the model.<br/>\n<br/>\nModel journals for articles in this category<br/>\n<br/>\n• \tACM Transactions on Software Engineering and Methodology<br/>\n• \tIEEE Transactions on Software Engineering<br/>\n• \tJournal of Experimental Psychology: Learning, Memory & Cognition<br/>\n• \tJournal of the Acoustical Society of America<br/>\n• \tPerception & Psychophysics<br/>\n<br/>\nWe encourage authors to include appendices that provide fine details of <br/>\nexperimental methods or a finer-grained presentation of the <br/>\nexperimental data.<br/>\n<br/>\nLITERATURE REVIEWS (Peer Reviewed)<br/>\n<br/>\nA literature review is a thorough guided tour through the published <br/>\nmaterial related to a specific question or topic. The author of the <br/>\nreview helps the reader make sense of the topic under discussion, its <br/>\nliterature, and the controversies in the literature. A review may be <br/>\nwritten at the level of a tutorial (for people who are somewhat <br/>\nknowledgeable about testing in general but not about this topic in <br/>\nparticular) or at a level that assumes a professional understanding of <br/>\nthe field. A tutorial-level paper should be appropriate as a <br/>\nrequired-reading assignment in an undergraduate course on software <br/>\ntesting. A professional-level paper should be appropriate for use in a <br/>\ngraduate course on software testing.<br/>\n<br/>\nWithin this category, we will also consider reflections. A reflection <br/>\nis a narrowly-scoped review that puts years of the author&#39;s work in <br/>\nperspective. For example, the head of a research laboratory might <br/>\ndescribe the evolution and progress of her research program, its <br/>\nsuccesses, surprises and problems. A consultant might describe the <br/>\nevolution of his practice. A manager of a corporate test group that <br/>\nconsciously innovates might describe the evolution of the group&#39;s <br/>\npractice. A reflection must connect the described work to the scholarly <br/>\nand/or practitioners&#39; publications that guided or reported the work, <br/>\nand to additional publications that will place the work in context for <br/>\nthe reader.<br/>\n<br/>\nLiterature review authors are welcome to build a case for a theoretical <br/>\nposition or viewpoint in their review, but must provide references to <br/>\nthe strongest references that would disagree with them.<br/>\n<br/>\nReviews may cover any area of testing, including ethics, methodology, <br/>\neducation and training, law, or commercial issues (such as outsourcing <br/>\nor certification). The editor and reviewers must be convinced however <br/>\nthat the topic or question is relevant, important, and is covered <br/>\nthoroughly, fairly, and in a way that makes sense of the topic for the <br/>\nreader.<br/>\n<br/>\nMuch of the interesting work in testing was first done in industry and <br/>\npresented in industry conferences or as technical reports on private <br/>\nwebsites. References to these are encouraged, especially when a copy of <br/>\nthe referenced report is still available to the general public.<br/>\n<br/>\nModel journals for articles in this category:<br/>\n<br/>\n• \tACM Computing Surveys<br/>\n• \tPsychological Bulletin<br/>\n• \tJohn Marshall Journal of Computer and Information Law<br/>\n<br/>\nCASE STUDIES (Peer Reviewed)<br/>\n<br/>\nA case study provides an in-depth description of an actual application <br/>\nor use of a model or theory, a tool, a technique, or a process. A good <br/>\ncase study is typically rich in details, especially details that help <br/>\nus understand how and why the model (theory, tool, technique, process) <br/>\nwas (or was not) valuable and what we can do to make application <br/>\neasier, cheaper, or more successful. The details trigger and support <br/>\ninsights and help readers form hypotheses, rather than providing <br/>\nproofs. Case studies present editorial challenges. For example, we <br/>\nprefer to know the real names of companies and products, but ethical or <br/>\nlegal considerations sometimes make this impossible. Another example: <br/>\nwe will err on the side of rejection if we suspect that a particular <br/>\nreport is a marketing document for a tool vendor or consultant. We <br/>\nencourage authors to disclose their backgrounds, biases, and potential <br/>\nconflicts of interest, but will not publish the sociopolitical rants <br/>\nthat sometimes make up case study disclosures. We expect case study <br/>\nreports to be reflective. Nothing goes perfectly; few things <br/>\ncompetently done fail completely. What could have been done differently <br/>\nand why? What conclusions should we be less or more confident in <br/>\nbecause of the details of the case? What hypotheses does the case <br/>\nsuggest for research, and what methodological suggestions does it <br/>\nprovide for executing the research?<br/>\n<br/>\nA narrower type of case study is the failure analysis. A failure <br/>\nanalysis considers a failure that was caused by a defect in the design <br/>\nor implementation of software. As with the longer case study, the <br/>\narticle should provide details—publicly-verifiable details if the <br/>\nproduct is identifiable—and guidance to the reader as to the underlying <br/>\nlessons to take away.<br/>\n<br/>\nUltimately, a key question for us will be whether the case study&#39;s <br/>\ndetails will still be instructive for readers ten years from now.<br/>\n<br/>\nARTICLE SETS (Peer Reviewed)<br/>\n<br/>\nAn article set includes one or more original articles plus detailed, <br/>\nreviewed comments and criticisms of each article. This can be a way for <br/>\nauthors who have competing views or approaches to square off in a <br/>\nthorough, well-documented debate. We have seen some symposia, <br/>\nespecially legal symposia, that have created such an effect, but we&#39;re <br/>\nwilling to consider other structures.<br/>\n<br/>\nWe will not publish case studies that advocate the use of a particular <br/>\ntool, but we might publish a set of case studies that allow the reader <br/>\nto compare successes of competing tools. The critical question is <br/>\nwhether the set is likely to give a careful reader insights into the <br/>\nclass of tool (and the tool-associated techniques).<br/>\n<br/>\nMETHODOLOGICAL REPORTS (Peer Reviewed)<br/>\n<br/>\nMethodological reports describe new equipment and methods for <br/>\nconducting research. These are tutorials, from one scientist to <br/>\nanother, explaining how to conduct a specific type of experiment or how <br/>\nto apply a specific type of equipment to a type of experiment. This is <br/>\nnot a place for vendor reports. Nor is it a place for re-explanations <br/>\nof matters that already appear in textbooks. Models for such articles <br/>\ncan be found in:<br/>\n<br/>\n• \tBehavior Research Methods, Instruments, & Computers<br/>\n<br/>\nSTATISTICAL METHODS & MODELS (Peer Reviewed)<br/>\n<br/>\nJAST will occasionally accept tutorial articles on the use of <br/>\nstatistics or probability models in software testing. The burden of <br/>\npersuasion is on the author to convince the editor that such an article <br/>\nfills an important gap in the knowledge of readers of this journal. <br/>\nSuch a paper might establish context by citing examples of <br/>\nmisunderstanding of the computation, theory or use of the statistic or <br/>\nprobability model.<br/>\n<br/>\nWe have seen examples of such articles in:<br/>\n<br/>\n• \tASQ Technometrics<br/>\n• \tJurimetrics<br/>\n• \tPsychological Bulletin<br/>\n<br/>\nAuthors are encouraged to submit a proposal for an article of this type <br/>\nto the editor before submitting a manuscript. We suspect that <br/>\nrelatively few of these proposals will be accepted. For more author <br/>\nguidance, see our Information For Authors.<br/>\n<br/>\nPOSITION PAPERS AND INTERVIEWS WITH FAMOUS PEOPLE (NOT Peer Reviewed)<br/>\n<br/>\nThe Journal will sometimes accept position papers, editorials, and <br/>\ninterviews of notable people in the field. The Editor may consult <br/>\ncolleagues in the evaluation of such a submission, but the final <br/>\ndecision is the Editor&#39;s alone. The Editor&#39;s primary question is <br/>\nwhether the article is likely to be of interest to readers of the <br/>\ncurrent issue and of continuing interest to future readers. For <br/>\nexample, an interview in which Richard Feynman explained how he <br/>\ndesigned instructional materials might be of interest for decades.<br/>\n<br/>\nREQUIREMENTS FOR PUBLICATION<br/>\n<br/>\nSubmitted materials must follow the style and guidelines of the <br/>\nAmerican Psychological Association. (See http://www.apastyle.org ) A <br/>\nbrief summary of the referencing style is available at <br/>\nhttp://webster.commnet.edu/apa/apa_index.htm<br/>\n<br/>\nSubmitted articles must be written in English and be in final or <br/>\nnear-final form. Unless the editor has given prior permission to submit <br/>\na rough draft, rough drafts will be returned unreviewed.<br/>\n<br/>\nSubmitted materials must be original and unpublished. We will consider <br/>\narticles that describe material originally presented at a conference, <br/>\nbut the article must substantially extend the conference presentation. <br/>\nIf a conference paper was published, this must be disclosed at time of <br/>\nsubmission and the submitted article must be so differently worded from <br/>\nthe conference paper there is unquestionably no infringement of the <br/>\nrights of the owner of copyright in the conference paper.<br/>\n<br/>\nThe person submitting an article must have the authority to publish it. <br/>\nFor example, we cannot accept and publish an article that reveals trade <br/>\nsecrets of the author&#39;s employer.<br/>\n<br/>\nFinally, JAST has a zero-tolerance policy with regard to plagiarism. <br/>\nJAST will not knowingly publish a plagiarized article and it will <br/>\nreject without review, as a matter of policy, any submissions from <br/>\nauthors who previously submitted a plagiarized article to JAST.<br/>\n<br/>\n=============================================================<br/>\n<br/>\nEDITORIAL BOARD OF THE<br/>\nJOURNAL OF THE ASSOCIATION FOR SOFTWARE TESTING<br/>\n<br/>\nFranck Barbier\t\t   Laboratoire d&#39;Informatique de l&#39;Université de Pau et <br/>\ndes Pays de l&#39;Adour, France<br/>\nJuris Borzovs\t\t\t   Riga Information Technology Institute and University <br/>\nof Latvia, Latvia<br/>\nJoao Cangussu\t\t   University of Texas at Dallas, United States<br/>\nLuiz Capretz\t\t\t   University of Western Ontario, Canada<br/>\nRoss Collard\t\t\t   Collard & Company, United States<br/>\nLydie Du Bousquet\t\t   Laboratorire Logiciels, Systèmes et Réseaux - <br/>\nIMAG, France<br/>\nRobert Glass\t\t\t   Computing Trends, United States<br/>\nJon Hagar\t\t\t   Lockheed Martin, United States<br/>\nJoel Henry\t\t\t   University of Montana at Missoula, United States<br/>\nRob Hierons\t\t\t   Brunel University, United Kingdom<br/>\nAmir Kolsky\t\t\t   Xpand Software, Israel<br/>\nYves Ledru\t\t\t   Laboratoire Logiciels Systèmes Réseaux - IMAG, France<br/>\nBruno Legeard\t\t   Laboratoire d&#39;Informatique de l&#39;Université de <br/>\nFranche-Comté, France<br/>\nHareton Leung\t\t   The Hong Kong Polytechnic University, Hong Kong<br/>\nNashat Mansour\t\t   Lebanese American University, Lebanon<br/>\nKeith W. Miller\t\t   University of Illinois at Springfield, United States<br/>\nLinda Miller\t\t\t   TMM Solutions, United States<br/>\nShari Lawrence Pfleeger   Rand Corporation, United States<br/>\nMaaret Pyhäjärvi\t\t   F-Secure Corporation, Finland<br/>\nMuthu Ramachandran\t   Leeds Metropolitan University, United Kingdom<br/>\nPer Runeson\t\t\t   Lund University, Sweden<br/>\nPatrick Schroeder\t\t   Milwaukee School of Engineering, United States<br/>\nAlberto, Savoia\t\t   Agitar Software Inc., United States<br/>\nJavier Tuya\t\t\t   University of Oviedo, SPAIN<br/>\nTanja Vos\t\t\t   Instituto Tecnologico de Informática, Spain<br/>\nHong Zhu\t\t\t   Oxford Brookes University, United Kingdom<br/>\n<br/>\n<br/>\n=============================================================<br/>\n<br/>\n<br/>\nCem Kaner, Professor of Software Engineering<br/>\nDirector, Center for Software Testing Education & Research<br/>\nFlorida Institute of Technology, 150 West University Blvd., Melbourne, <br/>\nFL 32901.<br/>\nhttp://www.kaner.com, http://www.testingeducation.org, <br/>\nhttp://www.badsoftware.com<br/>\nSenior author of<br/>\n\tLessons Learned in Software Testing<br/>\n\tTesting Computer Software, and<br/>\n\tBad Software: What to Do When Software Fails.</div>", 
    "prevInTime": 13240, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1112857830", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGI1MDg0MjUzMjc1MzRjOGZjMGI3M2Y2NjBiNzRkNGQyQGthbmVyLmNvbT4="
    }
}