{
    "numMessagesInTopic": 32, 
    "nextInTime": 13252, 
    "senderId": "p9tdNw7FhV8SO0NOBNe7ESwBOFye6qpQRktryoL08YqlcjJmPHVfI6cRxOohA_PLKhTWgmCPNNEeENtiZVs_nH7vz4_PNw", 
    "systemMessage": false, 
    "subject": "RE: [junit] How does Unit test in a heirarchy works...", 
    "from": "&quot;Ilja Preuss&quot; &lt;preuss@...&gt;", 
    "authorName": "Ilja Preuss", 
    "msgSnippet": "Redirected to Junit list... ... OK... :) ... I still don t understand why you d have more than one test class be dependent on those lookups at all. Sounds like", 
    "msgId": 13251, 
    "profile": "ipreussde", 
    "topicId": 13233, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 96623270, 
    "messageBody": "<div id=\"ygrps-yiv-321527578\">Redirected to Junit list...<br/>\n<br/>\nArun J wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; JAK is my name...J ArunKumar..I&#39;m not so popular so you<br/>\n&gt; cannot find me in the acronym finder.;-)  Thanks again for taking<br/>\n&gt; time on this. <br/>\n<br/>\n </span></blockquote>OK... :) <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;Where an object in the web needs to<br/>\n&gt;&gt;  collaborate with other objects in the web, in your unit tests<br/>\n&gt;&gt; replace them  with stub/mock implementations.&quot;<br/>\n&gt; <br/>\n&gt; True..and that is the first approach and that what I am<br/>\n&gt; doing...leaving the deep inheritance, provide a mock<br/>\n&gt; implementation parent and test different level through multiple tests.<br/>\n&gt; <br/>\n&gt;&gt;  Second, I understood you to say that you are reusing objects between<br/>\n&gt;&gt; tests,  so only the first test using an object would instantiate it,<br/>\n&gt;&gt; the following  would reuse it. Generally, this is a big no-no in unit<br/>\n&gt;&gt; testing, and I&#39;d like  to understand why you think you need to do it.<br/>\n&gt; <br/>\n&gt; I do a lookup and use those managers to initialise some<br/>\n&gt; objects.  And I do not want to lookup managers again and<br/>\n&gt; again to initialize these objects everytime for use.  As long<br/>\n&gt; as behavior of these lookups and initialization doesn&#39;t<br/>\n&gt; change over different Unit tests I do not see why it should be a<br/>\n&gt; no-no.. <br/>\n<br/>\n </span></blockquote>I still don&#39;t understand why you&#39;d have more than one test class be<br/>\ndependent on those lookups at all. Sounds like a kind of coupling I wouldn&#39;t<br/>\nwant to have.<br/>\n<br/>\nIf you aren&#39;t worried about it, you can initiliaze those objects once using<br/>\na TestSetup decorator, though. And again, take a look at the Object Mother<br/>\npattern.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;  Let me clarify: I certainly encountered code that was hard to test<br/>\n&gt;&gt; using  Junit. My solution until now always was to improve the code,<br/>\n&gt;&gt; not to extend  Junit, though. And I wholeheartedly think it was the<br/>\n&gt;&gt; better solution.<br/>\n&gt; <br/>\n&gt; We can debate this forever.   To what extent we should support<br/>\n&gt; testability..? I hope you concur we should stop at some level.<br/>\n<br/>\n </span></blockquote>I&#39;m not interested in a debate. I&#39;m interested in discussion, though, in<br/>\nlearning about the experiences of others, and in providing my experience to<br/>\nthose who are interested in it.<br/>\n<br/>\nIf nothing else, my reasoning might explain to you why Junit is the way it<br/>\nis, why it doesn&#39;t out of the box support the type of testing you are<br/>\nrequesting, which you seemed to be curious about. If you really think you<br/>\nneed to do that kind of testing and are not interested in discussing<br/>\nalternatives, that&#39;s fine with me. In my experience Junit is flexible enough<br/>\nto provide that kind of testing, too, as an extension.<br/>\n<br/>\nAnd to provide an answer to your very first question in this thread: the<br/>\npain you are experiencing seems to mainly come from the fact that you want<br/>\nto use Junit differently from how most of its other users use and advocate<br/>\nit.<br/>\n<br/>\nTake care, Ilja</div>", 
    "prevInTime": 13250, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1112966432", 
    "canDelete": false, 
    "nextInTopic": 13254, 
    "prevInTopic": 13250, 
    "headers": {
        "inReplyToHeader": "PGU3MTczMzBlMDUwNDA4MDUwOTFmZGMzOWY2QG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PDAwNzYwMWM1M2MzZCRiZTJkNzk1MCQ3MDY0YThjMEBkaXN5Lm5ldD4="
    }
}