{
    "numMessagesInTopic": 32, 
    "nextInTime": 13308, 
    "senderId": "KfV9swMxcnO3DxvocV6HzgwqTZozgaY27ld11SGT9JHr2PnIBKPWomD2OTMx-35ojX1NbEeKSjtpFWW6_954jCln", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: How does Unit test in a heirarchy works...", 
    "from": "Arun J &lt;mail.jak@...&gt;", 
    "authorName": "Arun J", 
    "msgSnippet": "Greetings folks, my comments inline.. ... I mentioned my design has a heirarchical structure and would like to have my tests also have a heirarchical structure", 
    "msgId": 13307, 
    "profile": "jayarunkumar", 
    "topicId": 13233, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 190187075, 
    "messageBody": "<div id=\"ygrps-yiv-1051601702\">Greetings folks,<br/>\nmy comments inline..<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt;&gt; The design /is/ the point of the discussion.<br/>\n&gt;  &gt; <br/>\n&gt;  &gt; No, it is *a* point of discussion.  It&#39;s healthy to ask the<br/>\n&gt;  &gt; original poster if this design is really necessary, but if<br/>\n&gt;  &gt; they say &quot;yes&quot;, then we should just move on to solving their<br/>\n&gt;  &gt; problem and not patronize them on how pure their architecture is.<br/>\n&gt;  <br/>\n&gt;  You are probably more referring to my posts than to J.B.&#39;s.<br/>\n&gt;  <br/>\n&gt;  If the OP said something along the lines of &quot;I know the design is<br/>\n&gt;  suboptimal, but I currently can&#39;t do something about it&quot;, I would have<br/>\n&gt;  accepted that and concentrated on solving his testing problem using Junit.<br/>\n&gt;  <br/>\n&gt;  But I didn&#39;t understand him to say that. Instead I understood him to say<br/>\n&gt;  something more along the lines of &quot;my design is quite good the way it is,<br/>\n&gt;  and it is strange that Junit doesn&#39;t support testing it very well.&quot;<br/>\n&gt;  <br/>\n&gt;  From the little I know about his design, I still doubt that the design is<br/>\n&gt; as<br/>\n&gt;  good as it could be, and I thought it might be of value to point that out,<br/>\n&gt;  and perhaps even get an interesting discussion going on that issue. If I<br/>\n&gt;  sounded patronizing that way, I appologize - that wasn&#39;t my intent.<br/>\n<br/>\n </span></blockquote>I mentioned my design has a heirarchical structure and would like to<br/>\nhave my tests also have a heirarchical structure for testing this<br/>\nbehavior easily.  This would help avoid lots of redundant coding and<br/>\nleads to cleaner & easy to understand implementation.  I was using<br/>\njUnit (cactus based on this) but it is found to be not meant for this.<br/>\n<br/>\nFine, alternates like ObjectMother (which maintains heirarchical impl<br/>\nand single level tests classes just use them as helpers), TestNG were<br/>\nsuggested which is what I expected from this thread.  Also, it was<br/>\nmade clear that jUnit is not meant to do this, which is absolutely<br/>\nfine.<br/>\n<br/>\nExpecting OO behavior in test classes is a requirement which I see for<br/>\nmy design at least.  I did not want to &#39;derail&#39; the discussion from<br/>\ntesting to making design changes and thatz why I made it clear that<br/>\n&#39;letz not question the design&#39;.  Also someone was of the opinion that<br/>\ndeep heirarchy could be a bad design..I wanted to step-in and say &#39;of<br/>\ncourse not..it has it&#39;s own reason&#39;.<br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; In real life, faulty or imperfect designs are the norm.<br/>\n&gt;  <br/>\n&gt;  Sure. That&#39;s one reason unit testing is so valuable: it makes some of the<br/>\n&gt;  imperfectionism more visible, so that we can work on it.<br/>\n </span></blockquote>&#39;Faulty or imperfect design&#39;- well thatz not the case when we can&#39;t<br/>\nuse jUnit for this purpose.  May be there are other tools which meets<br/>\nthis need.  Sometimes the app design might not provide interfaces to<br/>\nsuch a granular level that unit test might need.  It doesn&#39;t mean the<br/>\ndesign is imperfect or sub-optimal.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; If a framework forces you to change your design to be useful,<br/>\n&gt;  &gt; you can bet that most companies will keep their design and<br/>\n&gt;  &gt; choose another framework.<br/>\n&gt;  <br/>\n&gt;  And some developers would rather choose a framework that is lightweight<br/>\n&gt; than<br/>\n&gt;  one that better supports scenarios they don&#39;t strive for anyway. It&#39;s nice<br/>\n&gt;  that we have a choice, isn&#39;t it?<br/>\n&gt;  <br/>\n<br/>\n </span></blockquote>The intent to bring this up is to know..<br/>\n1. Is this a common requirement and if yes, how is it handled?<br/>\n2. If not, what is the recommended way of doing this?<br/>\n3. tradeoffs, pros & cons of each of these approaches.<br/>\n4. Any tools/framework which supports these.<br/>\n5. Real time experience on testing some of this kind..<br/>\n<br/>\nI wanted to provide nice examples for expressing my need with a sample<br/>\ncode.  Also I would like to summarize things which I have got out of<br/>\nthis discussion.  Becoz of lack of time I could not do that so far.  I<br/>\nwill find time if someone really want to take this forward.<br/>\n<br/>\n~JAK<br/>\n<br/>\n~JAK</div>", 
    "prevInTime": 13306, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1113828164", 
    "canDelete": false, 
    "nextInTopic": 13309, 
    "prevInTopic": 13306, 
    "headers": {
        "inReplyToHeader": "PDAwOWUwMWM1NDNlZSRmMjFlNWEwMCQ3MDY0YThjMEBkaXN5Lm5ldD4=", 
        "messageIdInHeader": "PGU3MTczMzBlMDUwNDE4MDU0MjZiODVjYjYzQG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PGQzbW9zaCszYXI3QGVHcm91cHMuY29tPiA8MDA5ZTAxYzU0M2VlJGYyMWU1YTAwJDcwNjRhOGMwQGRpc3kubmV0Pg=="
    }
}