{
    "numMessagesInTopic": 55, 
    "nextInTime": 13452, 
    "senderId": "d_-0q9SoAkB5ZapxtRF5orQRRAP0kYziT1-8AplviClJRNpt60P0F6NtAl8c2F0m05Cr0afhfecgig4036RwFF16SOBowpPsChHwXA", 
    "systemMessage": false, 
    "subject": "DbUnit & ORM", 
    "from": "&quot;haefeleuser&quot; &lt;haefeleuser@...&gt;", 
    "authorName": "haefeleuser", 
    "msgSnippet": "We use a kind of ORM (Object/Relational Mapper) for persistance. But for easier understanding of my questions lets assume we work with Hibernate (a dream would", 
    "msgId": 13451, 
    "profile": "haefeleuser", 
    "topicId": 13451, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174752849, 
    "messageBody": "<div id=\"ygrps-yiv-1572605259\">We use a kind of ORM (Object/Relational Mapper) for persistance.<br/>\n<br/>\nBut for easier understanding of my questions lets assume we work with<br/>\nHibernate (a dream would come true...)<br/>\n<br/>\nDoes it make sense to use DbUnit when we use an ORM and not directly JDBC?<br/>\n<br/>\nBy using an ORM we try to avoid dealing too much with the relational<br/>\nstuff. But if we would use DbUnit, we would have to deal with<br/>\nrelational stuff, don&#39;t we? I mean there is this XML dataset file for<br/>\nDbUnit which seems to be a simplified SQL create script.<br/>\n<br/>\nIf I build test data in Java code, it is much easier for me to<br/>\nunderstand the data set than if I look at that XML dataset file for<br/>\nDbUnit. What if a entity name or a attribute name changes? Then the<br/>\nXML dataset file would not work anymore for DbUnit unless it is<br/>\nupdated. Much maintainance work and prone to errors.<br/>\n<br/>\nBesides this, if we create data with our ORM, it can be assured, that<br/>\nthe created data is valid because we have validation rules for each<br/>\nentity. If someone writes test data for DbUnit in that XML file, then<br/>\nno validation is done when the data is created.<br/>\n<br/>\nFor cleaning up the database we use a so called<br/>\n&quot;EntityGarbageCollector&quot; (EGC). As soon as we create an entity, we put<br/>\nit in the EGC. In the tearDown method the garbage is diposed, e.g. the<br/>\nentities are deleted in a generic way by the EGC.<br/>\n<br/>\nI am not defending our solution at all cost. Here are many JUnit<br/>\nexperts and I would be happy to read your opinion on this topic. So<br/>\ndoes DbUnit make sense when using an Object/Relational Mapper?</div>", 
    "prevInTime": 13450, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1115749829", 
    "canDelete": false, 
    "nextInTopic": 13465, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGQ1cXVrNStsNHN2QGVHcm91cHMuY29tPg=="
    }
}