{
    "numMessagesInTopic": 6, 
    "nextInTime": 13536, 
    "senderId": "ixoOG_LqXLjaN6iBZcEgpKwZzf8q7utZxkS80meT-p9B-QkPafstVIm3gAITDoJrXWt33u2YDml7NOVuznejKmWvJIPelwD_aaJ4t2Qkay5L-xYgpMJdRQpsEFA", 
    "systemMessage": true, 
    "subject": "RE: [junit] TDD compared to tradition development coupled with automated unit test generation", 
    "from": "&quot;Damian Sinclair&quot; &lt;damian.sinclair@...&gt;", 
    "authorName": "Damian Sinclair", 
    "msgSnippet": "The only auto-generation I ve found useful is the simple test-class template available in most IDEs, beyond that it would seem to both miss the point of the", 
    "msgId": 13535, 
    "profile": "mwtbones", 
    "topicId": 13511, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 213858273, 
    "messageBody": "<div id=\"ygrps-yiv-1978152121\">The only auto-generation I&#39;ve found useful is the simple test-class<br/>\ntemplate available in most IDEs, beyond that it would seem to both miss<br/>\nthe point of the analysis and learning inherent in creating a test and<br/>\nleave you prone to suffering at the hands of an overly literal<br/>\ntest-generation algorithm. I would be very interested to hear of<br/>\nanything better, but I do find it difficult to imagine anything that<br/>\nwould be capable of replacing the value of even a poor set of<br/>\nhand-written tests.<br/>\n<br/>\n If you just like the idea of tools as rewarding toys, then I like<br/>\nJester (<a rel=\"nofollow\" target=\"_blank\" href=\"http://jester.sourceforge.net/)\">http://jester.sourceforge.net/)</a>, although it isn&#39;t exactly<br/>\nsimple to integrate into a development environment.<br/>\n<br/>\n I think Kevin Klinemeier caught the more approachable issue, which is<br/>\nhow to encourage a team to develop their own tests. In addition to his<br/>\nadvice I can only suggest that you:<br/>\n<br/>\n 1. Ask them to create tests as part of normal development tasks.<br/>\n 2. Give them time to create the tests (although you will eventually<br/>\nfind the tests save time, they will need more time up-front).<br/>\n 3. Support them in creating the tests and don&#39;t place great pressure on<br/>\nthem over it, especially if the underlying development is pressurised<br/>\nalready.<br/>\n 4. Evaluate tests together, perhaps have a group task where each person<br/>\ncreates a test for a class or method and then you compare and discuss<br/>\n(this is where jester can be quite valuable in exposing test<br/>\nblind-spots).<br/>\n 5. Link bug-fixing to test creation -- assuming that you have a<br/>\nbug-database, this is an effective way of adding tests of value to<br/>\nexisting code.<br/>\n 6. If you feel they won&#39;t react badly to it, consider writing seed<br/>\ntests yourself.<br/>\n<br/>\n<br/>\n Although we&#39;re meant to be rational, technical people, this is one of<br/>\nthe many issues that is more problematic on an emotional level than it<br/>\nis in any practical sense. Only you know your team and how they work and<br/>\nit could be that none of the above would be useful for you. I can&#39;t<br/>\nclaim to have cracked the problem myself, but there&#39;s always hope. <br/>\n<br/>\n Best of luck with it,<br/>\n <br/>\n<br/>\n Damian Sinclair<br/>\n<br/>\n=======================================================================<br/>\nThis email may contain confidential and privileged information and is intended for the named or<br/>\nauthorised recipients only. If you are not the named or authorised recipient of this email,<br/>\nplease note that any copying, distribution, disclosure or use of its contents is strictly<br/>\nprohibited. If you have received this email in error please notify the sender immediately and<br/>\nthen destroy it. The views expressed in this email are not necessarily those held by VNL, and VNL<br/>\ndoes not accept any liability for any action taken in reliance on the contents of this message.<br/>\nVNL does not guarantee that the integrity of this email has been maintained, nor that it is free<br/>\nof viruses, interceptions or interference.<br/>\n<br/>\n_______________________________________________________________________<br/>\nThis email has been scanned for all known viruses by the MessageLabs Email Security System.<br/>\n_______________________________________________________________________</div>", 
    "prevInTime": 13534, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1116229558", 
    "canDelete": false, 
    "nextInTopic": 13571, 
    "prevInTopic": 13521, 
    "headers": {
        "messageIdInHeader": "PDAyQkY0MjA4RkEyOEE1NEZCOTk1MzVBNTI4NTU4Q0QyMDMxQzgyQjlAbWFpbC51ay52aWRlb25ldHdvcmtzLmNvbT4="
    }
}