{
    "numMessagesInTopic": 1, 
    "nextInTime": 13547, 
    "senderId": "Cs1TqMmzvfd9hKdoRxKoxvutac7FksC_N53RKDo0U_kYxBnE8g1mnbpd1FqAcB900UrnmdxWWJBJf7EiRGxDogRZtq8TwhTszfEbbsMjUSmli7PpNldI", 
    "systemMessage": false, 
    "subject": "Request for Database Applications Tested with JUnit and DBUnit", 
    "from": "&quot;Gregory M. Kapfhammer&quot; &lt;gkapfham@...&gt;", 
    "authorName": "Gregory M. Kapfhammer", 
    "msgSnippet": "Hello, I am involved with a research project that is focusing on the testing and analysis of database applications.  Our research addresses test adequacy, test", 
    "msgId": 13546, 
    "profile": "gregorykapfhammer", 
    "topicId": 13546, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 43214365, 
    "messageBody": "<div id=\"ygrps-yiv-1005216202\">Hello,<br/>\n<br/>\nI am involved with a research project that is focusing on the testing<br/>\nand analysis of database applications.  Our research addresses test<br/>\nadequacy, test suite execution, test coverage monitoring, regression<br/>\ntest selection and prioritization, and test data generation.<br/>\nCurrently, we have a number of case study applications that we use<br/>\nduring the experimental evaluation of the efficiency and effectiveness<br/>\nof our algorithms.<br/>\n<br/>\nHowever, we are interested in applying our techniques to new<br/>\napplications written by additional software developers.  In<br/>\nparticular, we are currently interested in testing applications that<br/>\n(i) interact with relational databases through SQL Strings and JDBC<br/>\ndrivers, (ii) use an RDBMS such as HSQLDB, MySQL, or PostreSQL (with a<br/>\npreference to programs that use HSLQDB), (iii) use the DBUnit and<br/>\nJUnit testing frameworks, and (iv) includes the tracking of defects<br/>\nand version information.<br/>\n<br/>\nIf you are developing a program that fits (or nearly fits)<br/>\nrequirements (i) - (iv), could you contact me on or off list with<br/>\ninformation about your project?  If your application does not have all<br/>\nof the above characteristics (e.g., no defect tracking or the use of a<br/>\ndifferent RDBMS) I would still be interested in learning more about<br/>\nyour project.  Also, I would be excited to learn more about your<br/>\ntesting approach beyond those discussions that have already taken<br/>\nplace on this list.<br/>\n<br/>\nKind Regards,<br/>\n<br/>\ngreg<br/>\n<br/>\n-- <br/>\nGregory M. Kapfhammer<br/>\nInstructor, Computer Science Department<br/>\nAllegheny College<br/>\nOffice: 814-332-2880<br/>\ngkapfham(at)allegheny(dot)edu<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://cs.allegheny.edu/~gkapfham/\">http://cs.allegheny.edu/~gkapfham/</a></div>", 
    "prevInTime": 13545, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1116360521", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDIwMDUwNTE3MjAwODQxLkdBNDIyOEBtYXNzYWguYWxsZWdoZW55LmVkdT4="
    }
}