{
    "numMessagesInTopic": 14, 
    "nextInTime": 13561, 
    "senderId": "zGH5-3Hlc3Q9GDnVQ2DGKiQWWbjhSvQxc0mEKUIP9OOl0nbHudu1yuKECOdkKKJL7nP9OiyvTXjM-qd_nt3NMCC5v15k0VxELwvk65lBtw", 
    "systemMessage": true, 
    "subject": "Re: [junit] Testing package private classes", 
    "from": "Elliotte Harold &lt;elharo@...&gt;", 
    "authorName": "Elliotte Harold", 
    "msgSnippet": "... It has been my experience that most programmers, including myself, write too much code. That is, we write code covering cases that simply cannot happen.", 
    "msgId": 13560, 
    "topicId": 13552, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 12653864, 
    "messageBody": "<div id=\"ygrps-yiv-1223061756\">Cedric Beust wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unit testing allows you to test very small portions of code in order to<br/>\n&gt; catch failures as soon as possible.  If all you test is public/protected<br/>\n&gt; methods, you will miss an opportunity to catch a bug in a very fundamental<br/>\n&gt; piece of your code and you will be wasting time looking for it.<br/>\n<br/>\n </span></blockquote>It has been my experience that most programmers, including myself, write <br/>\ntoo much code. That is, we write code covering cases that simply cannot <br/>\nhappen. The more code you have the more bugs you have. Removing code is <br/>\none of the surest ways to remove bugs, not to mention save time.<br/>\n<br/>\nThe discipline required to write all tests exclusively through public <br/>\ninterfaces often reveals that the code is not in fact behaving the way <br/>\none thinks it is. Code is not activated that seems like it should be. <br/>\nCode paths don&#39;t flow the way one expects. Sometimes the mere act of <br/>\ntrying to test a particular piece of private code and failing reveals <br/>\nthe bugs.<br/>\n<br/>\nIt is critical, though, that you use code coverage tools like Cobertura <br/>\nand Clover to actually see what&#39;s being tested. That way you know <br/>\nwhether or not you&#39;re actually testing the inner, private parts of your <br/>\ncode. What&#39;s really interesting is when you discover that a piece of <br/>\ncode you thought was being tested isn&#39;t. That discovery often reveals a <br/>\nbug that the test themselves weren&#39;t finding.<br/>\n<br/>\nFinally, a separate reason for limiting the tests to the public (and <br/>\nprotected) interfaces is the same as the reason for keeping some code <br/>\nprivate in the first place. This allows you to change algorithms and <br/>\nimplementations freely without worrying about breaking the tests. More <br/>\nimportantly, it tells you that if you make a change and the tests break, <br/>\nit really is a bug. When you&#39;re testing the private parts directly, <br/>\nmajor changes are expected to break tests and require the tests to be <br/>\nmodified. Thus it stops being obvious whether test breakage signals a <br/>\nregression or a test problem.<br/>\n<br/>\nIn my test suites, I test only what I&#39;m willing to guarantee. The tests <br/>\nbecome contracts. They are even more than the API documentation the <br/>\npromise of what my software will support. And I&#39;m only willing to <br/>\npromise to support the public and protected APIs.<br/>\n<br/>\nIt is worth noting that most of my work, especially the most tested <br/>\nparts of my work, takes the form of libraries rather than client or <br/>\nserver applications. Possibly the distinction between unit and <br/>\nacceptance testing is a little weaker here. Many end user applications <br/>\ndon&#39;t really provide any published API at all. Nonetheless I suspect <br/>\nthat even in purely internal APIs it makes sense to distinguish between <br/>\nwhat&#39;s guaranteed to be supported and what&#39;s merely a means to an end <br/>\nthat may change as necessary to optimize or refactor a code base. Tests <br/>\nshould only touch the stable, guaranteed parts.<br/>\n<br/>\n-- <br/>\nElliotte Rusty Harold  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elharo@...\">elharo@...</a><br/>\nXML in a Nutshell 3rd Edition Just Published!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafeconleche.org/books/xian3/\">http://www.cafeconleche.org/books/xian3/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/exec/obidos/ISBN=0596007647/cafeaulaitA/ref=nosim\">http://www.amazon.com/exec/obidos/ISBN=0596007647/cafeaulaitA/ref=nosim</a></div>", 
    "prevInTime": 13559, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1116503695", 
    "canDelete": false, 
    "nextInTopic": 13565, 
    "prevInTopic": 13559, 
    "headers": {
        "inReplyToHeader": "PDIwMDUwNTE5MDEwNC5qNEoxNFczZDAxMTgzMUAyMTYtMjM5LTQ1LTQuZ29vZ2xlLmNvbT4=", 
        "messageIdInHeader": "PDQyOEM3RThGLjMwMDA1QG1ldGFsYWIudW5jLmVkdT4=", 
        "referencesHeader": "PDIwMDUwNTE5MDEwNC5qNEoxNFczZDAxMTgzMUAyMTYtMjM5LTQ1LTQuZ29vZ2xlLmNvbT4="
    }
}