{
    "numMessagesInTopic": 19, 
    "nextInTime": 13587, 
    "senderId": "dX8CF_jbcBELQO_L67N4QEqLF6BhyuXE01lRWpKIGmSyUEK1WLH0bg00W7VmsVYNDW4FXmjJnlz4rLS1rwLvicp5_d3CxMulO-yEZXQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Good examplefor Intro course", 
    "from": "Kevin Lawrence &lt;kevin@...&gt;", 
    "authorName": "Kevin Lawrence", 
    "msgSnippet": "I did this yesterday in a kind of Extreme Hour. I did a spreadsheet and got as far as formulas and cell references. I didn t get as far as a GUI, but I could", 
    "msgId": 13586, 
    "profile": "kevinwilliamlawrence", 
    "topicId": 13574, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 81949451, 
    "messageBody": "<div id=\"ygrps-yiv-1091088788\">I did this yesterday in a kind of Extreme Hour. I did a spreadsheet and <br/>\ngot as far as formulas and cell references. I didn&#39;t get as far as a <br/>\nGUI, but I could have with a little more time.<br/>\n<br/>\nThis was more of a demo than a tutorial and it went very well.<br/>\n<br/>\n<br/>\nInspiration came from an exercise Bill Wake did a couple of years back<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/extremeprogramming/message/41017\">http://groups.yahoo.com/group/extremeprogramming/message/41017</a><br/>\n<br/>\n<br/>\nKevin<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:didoss@...\">didoss@...</a> wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; I&#39;d go for some basic checkbook program (like a really stripped down Quicken, or the likes) - as everybody understands that,...or some similar concept that is familiar in an everyday life, and therefore easy to explain.<br/>\n&gt; <br/>\n&gt; If you stick with something that is really scalable, then you (or they) can scale to any level,...for both functionality and GUI.<br/>\n&gt; <br/>\n&gt; For functionality - small scale is text file of data with basic command line options to input/retrieve data (deposit, withdrawal, balance),...medium scale is maybe still flat file data with more diverse command options (max/min/avg balance),...even add in functionality to put your data in buckets (descretionary/mandatory spending; type of spending - groceries, books, clothes, recreation, etc) to be able to drill down to different levels - &quot;how much money did I spend each quarter at the bookstore buying new books on Java, JUnit, etc.?&quot;<br/>\n&gt; <br/>\n&gt; For GUI - small scale is various command line options to input/retrieve data,...medium scale is mildly interesting GUI to ease input/retrieval,...work your way up to a better GUI with some bells and whistles,...even add in functionality to do bars, graphs, etc. - &quot;how much money did I spend each quarter at the bookstore buying new books on Java, JUnit, etc.?&quot;<br/>\n&gt; <br/>\n&gt; -------------- Original message -------------- <br/>\n&gt; I&#39;m developing a course on test driven development and JUnit. This <br/>\n&gt; course will be taught in a variety of formats and lengths ranging from <br/>\n&gt; 90-minute seminar to one or two day hands on tutorial to a traditional <br/>\n&gt; university setting. Obviously how much I can cover and how deep I can go <br/>\n&gt; will vary depending on format, length, and audience level.<br/>\n&gt; <br/>\n&gt; I&#39;m wondering if anyone has any good ideas for examples to use in this <br/>\n&gt; course? Ideally I&#39;d like something that&#39;s simple enough to do in a day, <br/>\n&gt; but still gives attendees a feeling that they&#39;ve developed something <br/>\n&gt; real. I could possibly do something involving the Mandelbrot set or <br/>\n&gt; cellular automata. However, I&#39;d prefer something a little less <br/>\n&gt; mathematical if possible.<br/>\n&gt; <br/>\n&gt; I&#39;d like it to have a GUI component, but at the same time I&#39;d like that <br/>\n&gt; to show up fairly late in the application, and for the application to <br/>\n&gt; still make sense if there&#39;s not time to cover testing GUIs.<br/>\n&gt; <br/>\n&gt; It should be possible to develop this program on a laptop not connected <br/>\n&gt; to the Internet. i.e. no databases access, network communications, web <br/>\n&gt; services, the U.S. tax code, and so forth.<br/>\n&gt; <br/>\n&gt; Students will have a wide variety of backgrounds so I want to avoid any <br/>\n&gt; special knowledge of subjects like XML processing, financial <br/>\n&gt; derivatives, quantum physics, and so forth. I should be able to cover <br/>\n&gt; the background necessary to start writing the program in 10 minutes or <br/>\n&gt; less.<br/>\n&gt; <br/>\n&gt; Any ideas?<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 13585, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1116606167", 
    "canDelete": false, 
    "nextInTopic": 13587, 
    "prevInTopic": 13585, 
    "headers": {
        "inReplyToHeader": "PDA1MTkyMDA1MTgyNy4yNzU3MC40MjhDREE3NzAwMDkxNDE0MDAwMDZCQjIyMjA1ODg5MTE2OUM5QzAxMEIwNzBCQGNvbWNhc3QubmV0Pg==", 
        "messageIdInHeader": "PDQyOEUwRUQ3LjgwNjAyMDhAZGlhbW9uZC1za3kuY29tPg==", 
        "referencesHeader": "PDA1MTkyMDA1MTgyNy4yNzU3MC40MjhDREE3NzAwMDkxNDE0MDAwMDZCQjIyMjA1ODg5MTE2OUM5QzAxMEIwNzBCQGNvbWNhc3QubmV0Pg=="
    }
}