{
    "numMessagesInTopic": 19, 
    "nextInTime": 13581, 
    "senderId": "EjrJMTx2WNJ8rUtRXqy_bmneKuw5oLcUx5fwKqzCpcijn_Ny3k4t_w0daM8zQqRr5Ohg570oEnUdsFdtCedWGqXoiLu_sBmKMYc", 
    "systemMessage": false, 
    "subject": "Re: [junit] Good examplefor Intro course", 
    "from": "Kevin Klinemeier &lt;zipwow@...&gt;", 
    "authorName": "Kevin Klinemeier", 
    "msgSnippet": "What about using the mail API, or perhaps some Jabber message API? It s server-side stuff, which tends to be straightforward to write tests for.  At the end", 
    "msgId": 13580, 
    "profile": "zipwow", 
    "topicId": 13574, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 198331568, 
    "messageBody": "<div id=\"ygrps-yiv-288373960\">What about using the mail API, or perhaps some Jabber message API? <br/>\nIt&#39;s server-side stuff, which tends to be straightforward to write<br/>\ntests for.  At the end you can still plug the output into a GUI to see<br/>\nthe results of the application.  Some folks may be already familiar<br/>\nwith these APIs, but you can turn that into an opportunity to make the<br/>\npoint that the kind of tests you want to write would involve the<br/>\ncontent that is sent *via* the APIs, not the adherence to the<br/>\nstandard.<br/>\n<br/>\nSomething like, &quot;whenever x is true, a message should be sent to lists<br/>\nincluding Y, with message contents z&quot;.  Using a mail API, and making<br/>\nassertions about the mail objects created (without sending them<br/>\nthrough an actual mail server) would drive home the point that you<br/>\nwant to test the message *creation* unit, and not necessarily the<br/>\nactual round-trip of sending the mail and receiving it.  Once you&#39;ve<br/>\nwritten your tests, you can the fire up the full application and see<br/>\nit go in a real enough way (assuming you run a little mailserver<br/>\nlocally for this).<br/>\n<br/>\nThis can be a powerful demonstration of how you can develop code to<br/>\nAPIs using unit tests, even before the implementation is ready.  I&#39;ve<br/>\nwritten a good chuck of code to in-house APIs that were not ready or<br/>\nhad major bugs.<br/>\n<br/>\nLastly, an illuminating question may be this:  What aspects of Unit<br/>\nTesting do you want to drive home with this example?  I&#39;m guessing<br/>\nyour presentation already has these points, and you want your<br/>\ncourseware to reveal them in a pretty obvious way.  Here&#39;s some<br/>\nguesses and some ideas for &#39;tasks&#39; based on above:<br/>\n<br/>\nUnit tests make development easier.<br/>\n<br/>\nThe initial &#39;task&#39; of getting the emails/messages sent through the<br/>\nserver is faster because the tests run faster than the email server. <br/>\nIf you&#39;re using Jabber, claim that the Jabber API you&#39;re using is only<br/>\ndefined, not implemented.  Heck, that might even be true at the<br/>\nmoment!<br/>\n <br/>\nUnit tests make for easier refactoring.<br/>\n<br/>\nAfter the initial &#39;task&#39; is done, tell the users they need to localize<br/>\nthe content messages, sending them in English and Martian, using a<br/>\n&#39;translator&#39; that you provide.  The initial tests are all still valid<br/>\nin English, and new ones are added for Martian.<br/>\n<br/>\nI think you&#39;ll want to have more than one iteration in your example. <br/>\nUnit Tests pay you back one release at a time, and over time, that&#39;s<br/>\nwhere their value is.<br/>\n<br/>\n-Kevin<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 5/19/05, Elliotte Harold &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elharo@...\">elharo@...</a>&gt; wrote:<br/>\n&gt; I&#39;m developing a course on test driven development and JUnit. This<br/>\n&gt; course will be taught in a variety of formats and lengths ranging from<br/>\n&gt; 90-minute seminar to one or two day hands on tutorial to a traditional<br/>\n&gt; university setting. Obviously how much I can cover and how deep I can go<br/>\n&gt; will vary depending on format, length, and audience level.<br/>\n&gt; <br/>\n&gt; I&#39;m wondering if anyone has any good ideas for examples to use in this<br/>\n&gt; course? Ideally I&#39;d like something that&#39;s simple enough to do in a day,<br/>\n&gt; but still gives attendees a feeling that they&#39;ve developed something<br/>\n&gt; real. I could possibly do something involving the Mandelbrot set or<br/>\n&gt; cellular automata. However, I&#39;d prefer something a little less<br/>\n&gt; mathematical if possible.<br/>\n&gt; <br/>\n&gt; I&#39;d like it to have a GUI component, but at the same time I&#39;d like that<br/>\n&gt; to show up fairly late in the application, and for the application to<br/>\n&gt; still make sense if there&#39;s not time to cover testing GUIs.<br/>\n&gt; <br/>\n&gt; It should be possible to develop this program on a laptop not connected<br/>\n&gt; to the Internet. i.e. no databases access, network communications, web<br/>\n&gt; services, the U.S. tax code, and so forth.<br/>\n&gt; <br/>\n&gt; Students will have a wide variety of backgrounds so I want to avoid any<br/>\n&gt; special knowledge of subjects like XML processing, financial<br/>\n&gt; derivatives, quantum physics, and so forth. I should be able to cover<br/>\n&gt; the background necessary to start writing the program in 10 minutes or<br/>\n&gt; less.<br/>\n&gt; <br/>\n&gt; Any ideas?<br/>\n&gt; <br/>\n&gt; --<br/>\n&gt; Elliotte Rusty Harold  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elharo@...\">elharo@...</a><br/>\n&gt; XML in a Nutshell 3rd Edition Just Published!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafeconleche.org/books/xian3/\">http://www.cafeconleche.org/books/xian3/</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/exec/obidos/ISBN=0596007647/cafeaulaitA/ref=nosim\">http://www.amazon.com/exec/obidos/ISBN=0596007647/cafeaulaitA/ref=nosim</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 13579, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1116540526", 
    "canDelete": false, 
    "nextInTopic": 13581, 
    "prevInTopic": 13579, 
    "headers": {
        "inReplyToHeader": "PDQyOENCMUE0LjYwOTAzMDNAbWV0YWxhYi51bmMuZWR1Pg==", 
        "messageIdInHeader": "PDRmZmYwNjRmMDUwNTE5MTUwODM0YTJjNDU4QG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PDQyOENCMUE0LjYwOTAzMDNAbWV0YWxhYi51bmMuZWR1Pg=="
    }
}