{
    "numMessagesInTopic": 19, 
    "nextInTime": 13589, 
    "senderId": "edkhsluJ1-8zO9F0KMb9wVAo2VDui6AOOvYStOCAbs8Ral2OkzI2EHIvkUUVzB-MH8fBSXVOAvMWj3bayyxCm6tDSJgfdAoRZ5d2rqIJ", 
    "systemMessage": false, 
    "subject": "Test First Courses was: [Re: [junit] Good examplefor Intro course]", 
    "from": "Jason Rogers &lt;jacaetevha@...&gt;", 
    "authorName": "Jason Rogers", 
    "msgSnippet": "... That s just the point.  They didn t have to learn the platform/language.  We focused on concepts, not implementation.  The follow-up courses would need", 
    "msgId": 13588, 
    "profile": "jacaetev", 
    "topicId": 13574, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 109352929, 
    "messageBody": "<div id=\"ygrps-yiv-540833238\">Cedric Beust wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>] On<br/>\n&gt; &gt; Behalf Of Jason Rogers<br/>\n&gt;<br/>\n&gt; &gt; One tack I take in doing these types of workshops is to<br/>\n&gt; &gt; concentrate on unit testing skills, not language issues.  I<br/>\n&gt; &gt; therefore tend to choose a language platform that is<br/>\n&gt; &gt; unfamiliar to the wider audience.  This helps the audience to<br/>\n&gt; &gt; not get caught up in implementation details (eg. coding<br/>\n&gt; &gt; styles, method names, etc.) because if it is a language they<br/>\n&gt; &gt; are unfamiliar with they will tend not to bother about those<br/>\n&gt; &gt; things.<br/>\n&gt;<br/>\n&gt; ...  but it seems to me they will be even more distracted by having to <br/>\n&gt; learn<br/>\n&gt; this unfamiliar platform and language.<br/>\n<br/>\n </span></blockquote>That&#39;s just the point.  They didn&#39;t have to learn the <br/>\nplatform/language.  We focused on concepts, not implementation.  The <br/>\nfollow-up courses would need more knowledge of the platform/language.  <br/>\nBut with those follow-ups I still don&#39;t tend to force it upon them.  I <br/>\nlet the audience choose what suits them from an array of platforms and <br/>\nlanguages.  We lay down ground rules for what the platform needs to be <br/>\nable to accomplish and they are off on their own while I facilitate <br/>\ndiscussion and problem-solving.  This type of environment (more often <br/>\nthan not) also lends quite well to code sharing, paired programming, <br/>\nquick spikes, etc. which are very useful in the realm of testing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; IMO, it should be the instructor who adjusts their class to what their<br/>\n&gt; students know and not the other way around...<br/>\n<br/>\n </span></blockquote>In principal I don&#39;t disagree with you -- however, the students aren&#39;t <br/>\nexpected to adjust what they know to my class.<br/>\n<br/>\nIn taking this approach, I was helping the students to get the baggage <br/>\nout of the way.  I do this type of class with seasoned programmers who <br/>\ndon&#39;t have much experience in automated unit testing and it works <br/>\nbeautifully.  That isn&#39;t just my opinion, all the feedback I get from <br/>\nthese classes are generally very positive in regards to the language & <br/>\nplatform I end up choosing.  As I said in my original post, your mileage <br/>\nmay vary.  However, I think you do yourself a disservice by shooting it <br/>\ndown without trying it or experiencing it.<br/>\n<br/>\n-- <br/>\nJason Rogers<br/>\n<br/>\n&quot;I am crucified with Christ: nevertheless I live; yet not I,<br/>\nbut Christ liveth in me: and the life which I now live in <br/>\nthe flesh I live by the faith of the Son of God, who loved <br/>\nme, and gave himself for me.&quot;<br/>\n    Galatians 2:20</div>", 
    "prevInTime": 13587, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1116610788", 
    "canDelete": false, 
    "nextInTopic": 13590, 
    "prevInTopic": 13587, 
    "headers": {
        "inReplyToHeader": "PDIwMDUwNTIwMTYxNS5qNEtHRkR1QzAwOTg0MEAyMTYtMjM5LTQ1LTQuZ29vZ2xlLmNvbT4=", 
        "messageIdInHeader": "PDQyOEUyMEU0LjcwNzAyQGZhc3QtbWFpbC5vcmc+", 
        "referencesHeader": "PDIwMDUwNTIwMTYxNS5qNEtHRkR1QzAwOTg0MEAyMTYtMjM5LTQ1LTQuZ29vZ2xlLmNvbT4="
    }
}