{
    "numMessagesInTopic": 1, 
    "nextInTime": 13593, 
    "senderId": "YOJbRzrpVjDeXtMjaRpxlCdZi7jFAYFAfYTPZ-Ev96YuBhXFf9iI_baM2nfPcQ5xQQguQzfvQyBA_GMC_4jFKA", 
    "systemMessage": true, 
    "subject": "Registration open for Agile2005", 
    "from": "&lt;alex_viggio@...&gt;", 
    "authorName": "alex_viggio@comcast.net", 
    "msgSnippet": "Registration is now open for the Agile2005 Conference to be held at the Denver Marriott City Center July 24-29. We are offering a special discounted rate of ", 
    "msgId": 13592, 
    "profile": "aviggio", 
    "topicId": 13592, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 217227167, 
    "messageBody": "<div id=\"ygrps-yiv-1486232647\">Registration is now open for the Agile2005 Conference to be held at the Denver<br/>\nMarriott City Center July 24-29. We are offering a special discounted rate of<br/>\n$1499 through the Super-Early Bird date of May 27.  Members of the<br/>\nAgileAlliance, ACM, or IEEE are eligible for a rate of $1399.  The academic rate<br/>\nis $549 until May 27.  Please act quickly to ensure that you take advantage of<br/>\nthese special rates, a significant savings over the Just-In-Time rate of $1799.<br/>\n<br/>\nThe merger of XP Agile Universe with the Agile Development Conference has<br/>\nresulted in a record number of submissions and a very strong program.  We have<br/>\nan excellent collection of tutorials, workshops, experience reports and research<br/>\npapers.  Some of the tutorial and workshop presenters include Jim Highsmith, Ken<br/>\nSchwaber, Ron Jeffries, Mary Poppendieck, Rebecca Wirfs-Brock and many more.<br/>\nBob Martin and Brian Marick will be giving a keynote presentation.  Our fellows<br/>\nthis year are Tim Lister, Ward Cunningham and Kent Beck.<br/>\n<br/>\nFor conference agenda, session descriptions and on-line registration go to<br/>\nwww.agile2005.org<br/>\n<br/>\nWe are also putting out a call for student volunteers that would like to work at<br/>\nthe conference.<br/>\n<br/>\nCall for Student Volunteers<br/>\n<br/>\nThe local organizing committee is seeking student volunteers to assist with a<br/>\nmyriad of tasks to optimize the attendees&#39; experiences at the conference. None<br/>\nof these tasks are difficult, but all are important and critical to the success<br/>\nof the conference. Volunteering is a great way to meet other students, industry<br/>\nrepresentatives, and probably some of your favorite authors.<br/>\n<br/>\nAny student registered in a full-time undergraduate or graduate program for 2005<br/>\nmay become a student volunteer for Agile2005. You must be willing to commit to<br/>\nvolunteering to work 4 conference sessions (~16-20 hours) during the conference<br/>\nbetween July 24-29.  In return for participating as a volunteer, you will<br/>\nreceive daily access to choice conference sessions, free food, fun parties and<br/>\ninvaluable exposure to key industry leaders. You will be responsible for<br/>\nsupplying your own transportation, lodging, and other incidental costs. However,<br/>\nit may be possible to obtain support through other sources such as your<br/>\ndepartment.<br/>\n<br/>\nIf interested, please apply by sending the volunteer form<br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.agileunited.org/volunteers/volunteer_form.pdf)\">http://www.agileunited.org/volunteers/volunteer_form.pdf)</a> via email to the<br/>\nvolunteer coordinator at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:volunteers@...\">volunteers@...</a> with your name, educational<br/>\ninstitution, and whether or not you have volunteered at either XPAU or ADC in<br/>\npast years. If your application is accepted, your conference registration fee<br/>\nwill be waived.</div>", 
    "prevInTime": 13591, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1116476718", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDAxMmMwMWM1NWMyYSRjM2E4MzYxMCQwNDAwYThjMEBnMS5jb20+"
    }
}