{
    "numMessagesInTopic": 55, 
    "nextInTime": 13598, 
    "senderId": "pbPEDOvoPdhApqpIZyZRhEXLvRKt3Vf5fxWkFQtfd1lUUOSI2EJ8lyFovIUGxZXkabrThhhN18sN_FQJJbPbF7Gh-v63h0ZVK3rYtqRHO11flpz7QnY3kx4JesLUrTuT0RZHqDU", 
    "systemMessage": false, 
    "subject": "RE: Isolation or Collaboration", 
    "from": "=?us-ascii?Q?Harald_M._Muller?= &lt;harald.m.mueller@...&gt;", 
    "authorName": "Harald M. Muller", 
    "msgSnippet": "Just 2 small points: ... [...] ... Sane state does NOT mean that everything can be done to the object at every time. Cedric s initialized example is", 
    "msgId": 13597, 
    "profile": "harald_m_mueller", 
    "topicId": 13451, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 74507428, 
    "messageBody": "<div id=\"ygrps-yiv-1064251404\">Just 2 small points:<br/>\n<br/>\nJ. B. Rainsberger wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Cedric Beust wrote:<br/>\n&gt; <br/>\n&gt; &gt; Real code relies on dependencies all the time:<br/>\n&gt; &gt; <br/>\n </span></blockquote>[...]<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &gt; - This method can only be invoked if such field has been <br/>\n&gt; initialized.<br/>\n&gt; <br/>\n&gt; All objects should be in a &quot;sane&quot; state all the time. If not, <br/>\n&gt; then the <br/>\n&gt; design could be improved to avoid this problem. The Pragmatic <br/>\n&gt; Programmers call what you describe as &quot;Programming by Coincidence&quot;.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>&quot;Sane state&quot; does NOT mean that everything can be done to the object at<br/>\nevery time. Cedric&#39;s &quot;initialized&quot; example is probably actually a design<br/>\nflaw, but for other states, it makes of course much sense to disallow<br/>\ncertain operations: If a database connection is not open, you cannot<br/>\nexecute a select; if a file has been deleted, it cannot be deleted a<br/>\nsecond time; a bill that has been cancelled cannot be invoiced; etc.etc.<br/>\nIn many cases I saw and see, programmers/designers/architects seem to<br/>\nbelieve that the String class (where you can indeed execute every method<br/>\nsensibly at every time) is the paradigmatic example of a class. Nothing<br/>\ncan be further from the truth: Many classes have an &quot;interesting state<br/>\ndiagram&quot;, where certain operations can only be invoked if certain<br/>\nconditions hold.<br/>\n<br/>\n[...]<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; - A certain object can only be created if a previous object <br/>\n&gt; has been created<br/>\n&gt; &gt; before.<br/>\n&gt; <br/>\n&gt; If so, then the previous object should be the only thing that <br/>\n&gt; can create <br/>\n&gt; the new object!<br/>\n<br/>\n </span></blockquote>This is often contrary to design concepts with somewhat centralized<br/>\nresponsibilities. For example, if you look at the UML metamodel, an<br/>\nassociation is a thing &quot;between two (or more) classes&quot; - so an<br/>\nassociation (e.g. in an UML tool) can only be created when the classes<br/>\n(e.g. class &quot;icons&quot;) are there. Obviously, the order of the class<br/>\n(&quot;icon&quot;) creation is not important - but both must be there. Usually,<br/>\none does not design this by giving the &quot;icons&quot; the responsibility of<br/>\ncreating the association (even in this case, the creating &quot;icon&quot; must<br/>\ncheck whether the other one exists), but has a central &quot;association<br/>\ncreation tool&quot; which checks for the existence of the necessary icons.<br/>\n<br/>\nStill, on a more general level - e.g. when one talks about closely tied<br/>\ngroups of classes (yes: they are there; not even one of the tutorials<br/>\nthat explain JUnit pretends that litterally everything makes sense to be<br/>\nmocked) - the guidelines hinted at by JBR do make sense.<br/>\n<br/>\nRegards<br/>\nHarald M. Mueller</div>", 
    "prevInTime": 13596, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1116697585", 
    "canDelete": false, 
    "nextInTopic": 13598, 
    "prevInTopic": 13596, 
    "headers": {
        "inReplyToHeader": "PDExMTY2OTU3NDMuMTAzOTcuNjMwMzIubTE5QHlhaG9vZ3JvdXBzLmNvbT4=", 
        "messageIdInHeader": "PDAwMDIwMWM1NWUyZCQwYzcxN2FiMCRiYjAwYThjMEBIQVJSWT4="
    }
}