{
    "numMessagesInTopic": 14, 
    "nextInTime": 13606, 
    "senderId": "7y8BoKEGkrVXzEJJz0dsJ8NgtIY9EhO6LrAf05XXvAi0UoAGo0CK0Nlm_qIC7SsXOSKnyAPa0eSROrHPVMiwX-qAoMY5ea9byg-9Dg1eMg", 
    "systemMessage": false, 
    "subject": "Dogmatic or Heuristic?", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "Cedric Beust wrote:  ... This brings up an interesting question -- at least, for me. Well, two, I guess. First: Where is the line that divides being", 
    "msgId": 13605, 
    "profile": "nails762", 
    "topicId": 13552, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-1379264764\">Cedric Beust wrote:<br/>\n<br/>\n&lt;snip /&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt; Don&#39;t be dogmatic about testing:  test whatever you think can break.  And<br/>\n&gt; it&#39;s okay if it includes private methods.<br/>\n<br/>\n </span></blockquote>This brings up an interesting question -- at least, for me.<br/>\n<br/>\nWell, two, I guess.<br/>\n<br/>\nFirst: Where is the line that divides &quot;being dogmatic&quot; from &quot;trusting a <br/>\nheuristic&quot;? In this case, it was &quot;test only through the public <br/>\ninterface&quot;, which is a heuristic I follow, because it generally leads me <br/>\nto a better design. (I&#39;ll omit the reasons, because the community has <br/>\nwritten about them at length. Google is your friend.) Cedric, who seems <br/>\nnot to follow that heuristic, wonders whether doing so is dogmatic, and <br/>\nrightly so.<br/>\n<br/>\nI looked up &quot;dogma&quot; at dictionary.com and got this definition:<br/>\n<br/>\n&quot;An authoritative principle, belief, or statement of ideas or opinion, <br/>\nespecially one considered to be absolutely true.&quot;<br/>\n<br/>\nAnd &quot;heuristic&quot;:<br/>\n<br/>\n(adj.) Of or relating to a usually speculative formulation serving as a <br/>\nguide in the investigation or solution of a problem<br/>\n<br/>\n(n.) A heuristic (adj.) process or method.<br/>\n<br/>\nSo the dividing line appears to be the notion of &quot;absolute truth&quot;. This <br/>\nleads me to recast the question as:<br/>\n<br/>\nWhere is the line that divides &quot;absolute truth&quot; from &quot;sensible default&quot;? <br/>\nIn other words, I only test a private method if I am in a situation <br/>\nwhere I have to. What makes this stance dogmatic, rather than heuristic?<br/>\n<br/>\nJust an open question for the community to consider.<br/>\n<br/>\nThe second question is perhaps more of a comment than a question. I <br/>\nthink that when a novice asks us a question, it&#39;s OK for us to provide a <br/>\nsimple, dogmatic-sounding answer. This person is learning, and is <br/>\ntherefore not well-informed about the consequences of the choices he has <br/>\nin front of him. As a result, we have a responsibility to suggest the <br/>\ncourse we think is right and ask him to try it so he can learn the way <br/>\nwe did. In this case, a little dogma doesn&#39;t hurt. Notice, though, that <br/>\nit&#39;s dogma from the learner&#39;s perspective, and only due to a lack of <br/>\nexperience. For me, at least, it&#39;s a heuristic. :)<br/>\n<br/>\nIncidentally, I only bring this up because we tend to see dogma as <br/>\nnegative, and I don&#39;t see why that must be. That said, perhaps we ought <br/>\nto ask more questions before giving answers....<br/>\n<br/>\nTake care, everyone.<br/>\n-- <br/>\nJ. B. (Joe) Rainsberger<br/>\nDiaspar Software Services<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com\">http://www.diasparsoftware.com</a><br/>\nAuthor, JUnit Recipes: Practical Methods for Programmer Testing</div>", 
    "prevInTime": 13604, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1116853314", 
    "canDelete": false, 
    "nextInTopic": 13607, 
    "prevInTopic": 13565, 
    "headers": {
        "inReplyToHeader": "PDIwMDUwNTE5MDEwNC5qNEoxNFczZDAxMTgzMUAyMTYtMjM5LTQ1LTQuZ29vZ2xlLmNvbT4=", 
        "messageIdInHeader": "PDQyOTFENDQyLjEwMTA1MDVAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDIwMDUwNTE5MDEwNC5qNEoxNFczZDAxMTgzMUAyMTYtMjM5LTQ1LTQuZ29vZ2xlLmNvbT4="
    }
}