{
    "topicId": 1354, 
    "postDate": "991376899", 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "from": "Paul Hodgetts &lt;prh@...&gt;", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "QIrNxoGPA_eKrQXx8gjs-6X8G5cGZ77snkWArIrqOQJRWYQXaQZlvRjSejjSpsLBQK7e4dxbHzcVBKuMvd-Jv29BQmN6b9M", 
    "nextInTime": 1362, 
    "userId": 0, 
    "prevInTime": 1360, 
    "prevInTopic": 1354, 
    "headers": {
        "inReplyToHeader": "PDk5MTM0NTkyMC43NjEuMjIxNzUubDEwQHlhaG9vZ3JvdXBzLmNvbT4=", 
        "messageIdInHeader": "PDQuMi4yLjIwMDEwNTMxMjI0ODMwLjAwYzEyNzgwQG1haWwuenp5enh0ZWsuY29tPg=="
    }, 
    "authorName": "Paul Hodgetts", 
    "numMessagesInTopic": 4, 
    "msgSnippet": "... working ... Short answer:  Sure, a JUnit test can call more than one method in sequence, to act sort of as a controller for a use case, and/or call a", 
    "contentTrasformed": false, 
    "msgId": 1361, 
    "nextInTopic": 1435, 
    "systemMessage": false, 
    "rawEmail": "Return-Path: &lt;prh@...&gt;\r\nX-Sender: prh@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-7_1_3); 1 Jun 2001 06:28:24 -0000\r\nReceived: (qmail 59836 invoked from network); 1 Jun 2001 06:28:23 -0000\r\nReceived: from unknown (10.1.10.27) by l9.egroups.com with QMQP; 1 Jun 2001 06:28:23 -0000\r\nReceived: from unknown (HELO relay1.pair.com) (209.68.1.20) by mta2 with SMTP; 1 Jun 2001 06:28:23 -0000\r\nReceived: (qmail 13861 invoked from network); 1 Jun 2001 06:27:12 -0000\r\nReceived: from 2cust61.vr1.lax4.broadband.uu.net (HELO zxyzx) (63.13.232.61) by relay1.pair.com with SMTP; 1 Jun 2001 06:27:12 -0000\r\nX-pair-Authenticated: 63.13.232.61\r\nMessage-Id: &lt;4.2.2.20010531224830.00c12780@...&gt;\r\nX-Sender: zzyzx@...\r\nX-Mailer: QUALCOMM Windows Eudora Pro Version 4.2.2 \r\nDate: Thu, 31 May 2001 23:28:19 -0700\r\nTo: junit@yahoogroups.com\r\nSubject: Re: DoesJUnit support integration testing of multiple objects?\r\nIn-Reply-To: &lt;991345920.761.22175.l10@yahoogroups.com&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;; format=flowed\r\nFrom: Paul Hodgetts &lt;prh@...&gt;\r\n\r\nRobert Scheffel wrote:\n\n &gt; I&#39;m assigned the task of using JUnit to test the Java implementation of Use\n &gt; Cases.  Typically, a Use Case is implemented across several objects, \nworking\n &gt; together to accomplish a task.  This is one level out from unit testing one\n &gt; object; this is testing the integration of more than one object.\n &gt;\n &gt; Does JUnit facilitate and support the integration testing of multiple\n &gt; components?\n\nShort answer:  Sure, a JUnit test can call more than one method in sequence,\nto act sort of as a controller for a use case, and/or call a method on a\ncontroller that runs the use case, and then test to make sure the use case\nexhibited the desired behavior (some behaviors, like the generation of web\npages may need some additional tools like HTTPUnit).\n\nA few of us on our team have been discussing different flavors of &quot;unit&quot;\ntesting over the past few days...\n\n From the outside in, there are tests that operate on the outermost surface\narea of the system, treating the whole thing as much of a black box as\npossible.  In other words, they generate the same stimuli as the users, and\ntest for the same behaviors that the user would expect.  The sequence of\nstimuli and behaviors is essentially a scenario of a use case.  I believe\nthese are typically called acceptance tests.\n\nOnce we start peeking under the hood, we can go after parts of the system -\nsubsystems and collaborations of objects - and test them for functional\nbehavior as well.  A use case scenario gets decomposed into more detailed\ninternal scenarios that assign responsibility for the use case behaviors to\nobjects and collaborations.  This decomposition/scenario design is a more\nformal process step in some methodologies, and is less formal in XP but\nsomething a good designer will consider nevertheless.  We can write tests\nthat run the internal scenario, generating the stimuli (probably method\ncalls) and looking for the correct behavior (state changes, generated\noutputs, etc.).  I don&#39;t know what to call these - perhaps &quot;functional\nunit tests.&quot;  These seem to be more of what you&#39;re talking about.\n\n[BTW, has anyone found that these kinds of test can be a real pain,\nespecially if the scenario represents behavior somewhere &quot;in the middle&quot;\nof a longer-running use case?  The set up can get complicated to make\nsure the system state is correct to start the test, and/or the tear down\ncan get complex to make sure we leave the system in a good state.  I&#39;ve\nseen suggestions to use mock objects that behave as if the system state\nis correct to get around some of this.  Comments?]\n\nThen there&#39;s another type of test.  If we take an object (class), and its\ncollection of methods, we can write tests that exercise each method.  If\nwe want complete coverage, we write tests that exercise all the code paths\nof each method, test for ranges of parameter values, etc.  These tests\naren&#39;t concerned with how the object works in a collaboration, just with\nhow the object works in relative isolation.  I consider these &quot;unit tests&quot;\nbut that&#39;s just my opinion.  Note that as we look at objects that represent\ncollaborations of objects (e.g., controllers, facades, etc.), their methods\nmay trigger or control an internal scenario, hence a unit test for them\nstarts to take on the flavor of the &quot;functional unit tests&quot; above.\n\nAs far as what tools you use to run the tests, it can be JUnit or another\ntesting tool ranging from hand built code to big testing tools like Segue\nSilk Test or some such.  JUnit is very good at writing tests that call\nJava methods and look for behavior that can be tested by calling Java\nmethods.  Tests that need to generate, for example, HTML posts and look\nat generated HTML output, may be better written with HTTPUnit or Silk\nTest, etc.  Tests that work against databases may need SQLUnit, etc.\n\nJust for the record, I&#39;m not at all claiming that anything written above\nis part of XP.  These are just some of our recent musings on unit testing,\nand we&#39;re probably over-analyzing things, but that keeps us off the\nstreets.  ;-)  Your post related to them, and it seemed as good a time as\nany to toss them out and see what happens.\n\nA question for the list:  How do you organize your tests, particularly\nif you write tests that are of both the functional scenario and single\nobject unit test varieties?  The common approach seems to be to gather\nall the tests for a given class in one test class.  What about the\nscenario type of tests?  Organized by use case?  What communicates\nbetter, especially if we want to use the tests as documentation?\n\nRegards,\n-Paul\n\n\n", 
    "subject": "Re: DoesJUnit support integration testing of multiple objects?"
}