{
    "numMessagesInTopic": 13, 
    "nextInTime": 13774, 
    "senderId": "IIsUIMD8LpG3MzQP7QTt0rlInij6FcujHOW0DsrLPAgi7K3GhSQxyOOTq6kITuuvn6a21iVpl0_m", 
    "systemMessage": false, 
    "subject": "Threshholds for (J)Unit Testing", 
    "from": "didoss@...", 
    "authorName": "didoss@comcast.net", 
    "msgSnippet": "[Hopefully, this will be another interesting thread for discussion,...] I m curious about threshholds for valuable (J)Unit Testing. There has been a lot of", 
    "msgId": 13773, 
    "profile": "dijdoss", 
    "topicId": 13773, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 180862158, 
    "messageBody": "<div id=\"ygrps-yiv-236360176\">[Hopefully, this will be another interesting thread for discussion,...]<br/>\nI&#39;m curious about threshholds for valuable (J)Unit Testing.<br/>\nThere has been a lot of discussion of 100 errors &#39;suddenly&#39; showing up, and most seem to think this to be a rare thing,...which led me and others to question the size of the development group or code base.<br/>\nSo, my first question, is what is a &#39;development team size&#39; threshhold for meaningful Unit Testing?  At what point do you think there are too many cooks in the kitchen,...or is there no threshhold, assuming that your team sticks to the tenets of TDD/XP/Agile/&#39;general good coding practices&#39;?<br/>\nAdditionally, my team has been struggling with maintaining our tests at green bar, so my second question is what is a &#39;code size (number of classes)&#39; threshhold for meaningful Unit Testing?<br/>\nWe have upwards of 10 developers working on ~1500 classes.  Our tests are a pain to maintain - takes too long to run completely in Eclipse before checking in; takes ~6 hours to run and report the nightlybuild (includes coverage testing); we&#39;re nowhere near green bar, so recognizing when there is something new (from yesterday) is near impossible, and possibly impractical (in a 40 hour work week).<br/>\nI&#39;m not necessarily looking for any answers,...but maybe someone has some insight - has been there before - or will just commisserate with me.  :)<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 13772, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1117652769", 
    "canDelete": false, 
    "nextInTopic": 13775, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDA2MDEyMDA1MTkwNi4yMDg2NC40MjlFMDcyMTAwMDNCQTNCMDAwMDUxODAyMjAwNzM0MDc2OUM5QzAxMEIwNzBCQGNvbWNhc3QubmV0Pg=="
    }
}