{
    "numMessagesInTopic": 1, 
    "nextInTime": 13795, 
    "senderId": "B6pwZpW5FoJKhWznnEjC0lh1tL5EFKgdOvknxqBgeFADBlRBXwx2sPkK24NNCIBcSHxKhClE_-_dg4SvmzQ8nw", 
    "systemMessage": true, 
    "subject": "Agile2005 discount extended to Friday 06/03", 
    "from": "&lt;alex_viggio@...&gt;", 
    "authorName": "alex_viggio@comcast.net", 
    "msgSnippet": "Registration for the Agile2005 Conference is on a record pace!  More than 200 registrants have already taken advantage of this special discount.  We have ", 
    "msgId": 13794, 
    "profile": "aviggio", 
    "topicId": 13794, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 217227167, 
    "messageBody": "<div id=\"ygrps-yiv-1751015873\">Registration for the Agile2005 Conference is on a record pace!  More than 200<br/>\nregistrants have already taken advantage of this special discount.  We have<br/>\ndecided to extend the super-early bird registration deadline.  The final<br/>\ndeadline for this savings opportunity is this Friday, June 3rd.<br/>\n<br/>\nThe Agile2005 Conference will be held at the Denver Marriott City Center July<br/>\n24-29. We are offering a special discounted rate of $1499 through the<br/>\nSuper-Early Bird date of June 3rd.  Members of the AgileAlliance, ACM, or IEEE<br/>\nare eligible for a rate of $1399.  The academic rate is $549 until June 3rd.<br/>\nPlease act quickly to ensure that you take advantage of these special rates, a<br/>\nsignificant savings over the Just-In-Time rate of $1799.<br/>\n<br/>\nThe merger of XP Agile Universe with the Agile Development Conference has<br/>\nresulted in a record number of submissions and a very strong program.  We have<br/>\nan excellent collection of tutorials, workshops, experience reports and research<br/>\npapers.  Some of the tutorial and workshop presenters include Jim Highsmith, Ken<br/>\nSchwaber, Ron Jeffries, Mary Poppendieck, Rebecca Wirfs-Brock and many more.<br/>\nBob Martin and Brian Marick will be giving a keynote presentation.  Our fellows<br/>\nthis year are Tim Lister, Ward Cunningham and Kent Beck.<br/>\n<br/>\nFor conference agenda, session descriptions and on-line registration go to<br/>\nwww.agile2005.org</div>", 
    "prevInTime": 13793, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1117695110", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDAwZWIwMWM1NjczZiQ4ZGNlMTEyMCQwNDAwYThjMEBnMS5jb20+"
    }
}