{
    "numMessagesInTopic": 32, 
    "nextInTime": 13859, 
    "senderId": "xnzaE5QUyD0mktdfJYZAXoDEQx-nIBsFTpaSLp0aCntShDNGHgjtPoB-3xZYAuwyzYI1IIFzXF5vTymimCA00pQgVsCiZRLhhwg", 
    "systemMessage": false, 
    "subject": "Re: [junit] One test class per class (was Testing multiple interfaces?)", 
    "from": "Chris Dollin &lt;kers@...&gt;", 
    "authorName": "Chris Dollin", 
    "msgSnippet": "... Eclipse. So that s new class . Copy. Fix layout. Fix suite(). Run tests. Delete tests. Run. Delete other tests in other class. Run. Check that the two ", 
    "msgId": 13858, 
    "profile": "anover_alias", 
    "topicId": 13795, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 88056088, 
    "messageBody": "<div id=\"ygrps-yiv-1610255505\">On Monday 06 June 2005 19:10, J. B. Rainsberger wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Chris Dollin wrote:<br/>\n&gt; &gt; On Friday 03 June 2005 18:07, J. B. Rainsberger wrote:<br/>\n&gt; &gt;  &gt; Yes. Even worse: two possibly overlapping, but often disjoint, sets of<br/>\n&gt; &gt;  &gt; test fixture objects in the same test case class. Some tests use<br/>\n&gt; &gt;  &gt; fixture A and others use fixture B. Why not put those in separate test<br/>\n&gt; &gt;  &gt; case classes for clarity?<br/>\n&gt; &gt;<br/>\n&gt; &gt; Because of the activation energy required to split off a new class, move<br/>\n&gt; &gt; the right methods into it, remember to link it into the next level up,<br/>\n&gt; &gt; add it to change control, fix the pesky layout infelicities the IDE likes<br/>\n&gt; &gt; to avoid providing a configure-out option for, refactor the class<br/>\n&gt; &gt; comments, etc?<br/>\n&gt; &gt;<br/>\n&gt; &gt; [Pairing is good. Would that I could.]<br/>\n&gt;<br/>\n&gt; It sounds more like quite a viscous environment (either the codebase,<br/>\n&gt; the IDE, or a combination of the two): it&#39;s easier to do a bad thing<br/>\n&gt; than a good thing.<br/>\n&gt;<br/>\n&gt; Which IDE, you poor soul? In Eclipse it&#39;s just &quot;new class, copy, run<br/>\n&gt; tests, delete, run tests, update, commit&quot;. Well, except for the class<br/>\n&gt; comments, I guess. For that you&#39;re on your own. :)<br/>\n<br/>\n </span></blockquote>Eclipse.<br/>\n<br/>\nSo that&#39;s &quot;new class&quot;. Copy. Fix layout. Fix suite(). Run tests. Delete<br/>\ntests. Run. Delete other tests in other class. Run. Check that the two<br/>\nclasses are a partition of the original class. (One *must* do this, so<br/>\nit&#39;s probably better to do moves than deletes.) Look for shared code<br/>\nand partition it or move it to a suitable (possibly new) superclass. <br/>\n(There&#39;s usually some helper code like this.) Link the suite() into<br/>\nthe parent suite. (Yes, we don&#39;t use the automatic recursive suite<br/>\ncreation. Close call: but sometimes being able to trivially comment<br/>\nout subsuites has made bug-tracking much much easier, since we do<br/>\nsometimes end up with context-sensitive problems. Perhaps we just <br/>\nhave too many global caches.) Run complete test suite. Stare hard <br/>\nat the new classname, rename to suitable, because now you have to <br/>\nintroduce it to CVS, and renaming it later is a pain. Perform <br/>\nintroduction. No, I don&#39;t want the file CVSed when it&#39;s created, since<br/>\nif I want to back it out later (when I realise I made a complete mess)<br/>\nI don&#39;t want dirty footprints in the repository. OK, everything works.<br/>\nCheck in. Wait forever for CVS to complete. Time passes. Maybe there&#39;s<br/>\nsome mail to read? Yes. Whoppee, CVS done. Change to paranoia window.<br/>\nCVS update. Wait forever for CVS to complete. Time passes. Mail already<br/>\nread, read news instead. CVS completes. ant build, run tests, all pass.<br/>\nHooray! Don&#39;t do this on a Friday afternoon, you&#39;ll likely miss your<br/>\ntrain or break the build.<br/>\n<br/>\nSomewhere in there I fixed the auto-layout. And did a CVS update (Wait.<br/>\nTime passes. Get tea.) before running the tests. <br/>\n<br/>\nWhat do you do that if I did it too I could do better? Apart from using<br/>\na faster CVS server, that is.<br/>\n<br/>\n-- <br/>\nChris &quot;electric hedgehog&quot; Dollin<br/>\nIt&#39;s called *extreme* programming, not *stupid* programming.</div>", 
    "prevInTime": 13857, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1118126948", 
    "canDelete": false, 
    "nextInTopic": 13860, 
    "prevInTopic": 13857, 
    "headers": {
        "inReplyToHeader": "PDQyQTQ5MTdFLjgwNjAwMDRAcm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PDIwMDUwNjA3MDc0OS4wODcwMS5rZXJzQGhwbGIuaHBsLmhwLmNvbT4=", 
        "referencesHeader": "PDQyOWZhZTUxLjFmNi4xYTJiLjI2ODE2QGludGVybm9kZS5vbi5uZXQ+IDwyMDA1MDYwNjA4MTcuNTIyNDIua2Vyc0BocGxiLmhwbC5ocC5jb20+IDw0MkE0OTE3RS44MDYwMDA0QHJvZ2Vycy5jb20+"
    }
}