{
    "numMessagesInTopic": 32, 
    "nextInTime": 13863, 
    "senderId": "aLsa6ntzNImFuNNzzYkdHJVUYkTXdFt8pFtV3u6JZu_f5fXdlj81lGoMHtjxF7nuRk4AU6mACwfO526N5wL1ShGYNTn9NB_i3PbGjP9uPyppUfZsMw", 
    "systemMessage": false, 
    "subject": "Re: [junit] Chris&#39; excellent test-splitting adventure", 
    "from": "&quot;Jeff Nielsen&quot; &lt;jeff.nielsen@...&gt;", 
    "authorName": "Jeff Nielsen", 
    "msgSnippet": "We do use CVS for all of our projects here and don t suffer from the kinds of issues Chris talks about either.  I can t imagine a simple checkin or update", 
    "msgId": 13862, 
    "profile": "jeffreymads", 
    "topicId": 13795, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 65487161, 
    "messageBody": "<div id=\"ygrps-yiv-1725298520\">We do use CVS for all of our projects here and don&#39;t suffer from the kinds <br/>\nof issues Chris talks about either.  I can&#39;t imagine a simple checkin or <br/>\nupdate taking long enough that you would have time to read mail or news.  We <br/>\nalso rename checked-in classes almost daily, and the only CVS issue there is <br/>\n&quot;losing&quot; easy access to the file&#39;s history.<br/>\n<br/>\nSurely the CVS slowness (is the server remote?) is one of the real issues to <br/>\nbe addressed in Chris&#39;s situation.  Interesting how a &quot;technical&quot; issue like <br/>\nthat can drive the kinds of refactorings people are willing/able to do.<br/>\n<br/>\nJeff Nielsen<br/>\nDigital Focus<br/>\nwww.digitalfocus.com<br/>\n<br/>\n<br/>\nFrom: &quot;J. B. Rainsberger&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jbrains@...\">jbrains@...</a>&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n&gt;&gt; So that&#39;s &quot;new class&quot;. Copy. Fix layout. Fix suite(). Run tests. Delete<br/>\n&gt;&gt; tests. Run. Delete other tests in other class. Run. Check that the two<br/>\n&gt;&gt; classes are a partition of the original class. (One *must* do this, so<br/>\n&gt;&gt; it&#39;s probably better to do moves than deletes.) Look for shared code<br/>\n&gt;&gt; and partition it or move it to a suitable (possibly new) superclass.<br/>\n&gt;&gt; (There&#39;s usually some helper code like this.) Link the suite() into<br/>\n&gt;&gt; the parent suite. (Yes, we don&#39;t use the automatic recursive suite<br/>\n&gt;&gt; creation. Close call: but sometimes being able to trivially comment<br/>\n&gt;&gt; out subsuites has made bug-tracking much much easier, since we do<br/>\n&gt;&gt; sometimes end up with context-sensitive problems. Perhaps we just<br/>\n&gt;&gt; have too many global caches.) Run complete test suite. Stare hard<br/>\n&gt;&gt; at the new classname, rename to suitable, because now you have to<br/>\n&gt;&gt; introduce it to CVS, and renaming it later is a pain. Perform<br/>\n&gt;&gt; introduction. No, I don&#39;t want the file CVSed when it&#39;s created, since<br/>\n&gt;&gt; if I want to back it out later (when I realise I made a complete mess)<br/>\n&gt;&gt; I don&#39;t want dirty footprints in the repository. OK, everything works.<br/>\n&gt;&gt; Check in. Wait forever for CVS to complete. Time passes. Maybe there&#39;s<br/>\n&gt;&gt; some mail to read? Yes. Whoppee, CVS done. Change to paranoia window.<br/>\n&gt;&gt; CVS update. Wait forever for CVS to complete. Time passes. Mail already<br/>\n&gt;&gt; read, read news instead. CVS completes. ant build, run tests, all pass.<br/>\n&gt;&gt; Hooray! Don&#39;t do this on a Friday afternoon, you&#39;ll likely miss your<br/>\n&gt;&gt; train or break the build.<br/>\n&gt;&gt;<br/>\n&gt;&gt; Somewhere in there I fixed the auto-layout. And did a CVS update (Wait.<br/>\n&gt;&gt; Time passes. Get tea.) before running the tests.<br/>\n&gt;&gt;<br/>\n&gt;&gt; What do you do that if I did it too I could do better? Apart from using<br/>\n&gt;&gt; a faster CVS server, that is.<br/>\n&gt;<br/>\n&gt; Well...<br/>\n&gt;<br/>\n&gt; 1. I use Subversion, so I don&#39;t have the same CVS issues you seem to<br/>\n&gt; have. It also looks like you have far too much stuff in a single CVS<br/>\n&gt; server or module. It looks like it&#39;s time to split them.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>&lt;snip&gt;<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; 6. I&#39;m not sure why renaming a recently-created class is such a pain,<br/>\n&gt; even in CVS: it hardly has any history to worry about, so I wouldn&#39;t<br/>\n&gt; worry about it.<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 13861, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1118170793", 
    "canDelete": false, 
    "nextInTopic": 13863, 
    "prevInTopic": 13861, 
    "headers": {
        "messageIdInHeader": "PDAyNzEwMWM1NmI5MyQxNmVhZmE3MCQyOTA3MDAwYUBsYXB0b3AxMDA+", 
        "referencesHeader": "PDQyOWZhZTUxLjFmNi4xYTJiLjI2ODE2QGludGVybm9kZS5vbi5uZXQ+IDwyMDA1MDYwNjA4MTcuNTIyNDIua2Vyc0BocGxiLmhwbC5ocC5jb20+IDw0MkE0OTE3RS44MDYwMDA0QHJvZ2Vycy5jb20+IDwyMDA1MDYwNzA3NDkuMDg3MDEua2Vyc0BocGxiLmhwbC5ocC5jb20+IDw0MkE1QkQ1MC4xMDUwNTA5QHJvZ2Vycy5jb20+"
    }
}