{
    "numMessagesInTopic": 47, 
    "nextInTime": 13908, 
    "senderId": "7pfcpvqzTmVd8bHft9vmsZStM-3MC36aIDp7NYUW8FjZMhNuSaxzZD-AIZ5PnoI9WFf7KiuiC6aOy3j4iFAXQrsbrhpL5se1", 
    "systemMessage": false, 
    "subject": "JUnit 4", 
    "from": "&quot;Kent Beck&quot; &lt;kentb@...&gt;", 
    "authorName": "Kent Beck", 
    "msgSnippet": "JUnit 4 has been available for some time on the Version4 branch of the SourceForge CVS repository. We didn t announce its availability widely until we thought", 
    "msgId": 13907, 
    "profile": "kentlbeck", 
    "topicId": 13907, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 173198504, 
    "messageBody": "<div id=\"ygrps-yiv-1590683066\">JUnit 4 has been available for some time on the Version4 branch of the<br/>\nSourceForge CVS repository. We didn&#39;t announce its availability widely until<br/>\nwe thought we had something useful. We have gotten early feedback from a<br/>\nhandful of developers, but we now have a release that we think can be used<br/>\nto write production tests.<br/>\n<br/>\nI understand that some people have been quoting our private to-do list out<br/>\nof context. Private communication between Erich and me will in future take<br/>\nplace more privately. It is too bad that it is not safe to let you all into<br/>\nour process. It is disturbing to find one&#39;s to-do-list quoted as promises<br/>\nbroken or ideas stolen. It was just an old  to-do list. Maybe it&#39;s time to<br/>\ninvest in an electron shredder :-)<br/>\n<br/>\nThe theme of JUnit 4 is to encourage more developers to write more tests by<br/>\nfurther simplifying JUnit. To this end, we have followed NUnit&#39;s lead in<br/>\nidentifying tests by annotation instead of subclassing and naming<br/>\nconventions. Tests can now live in any class. Tell JUnit they are there with<br/>\nthe @Test annotation:<br/>\n  @Test public void basicTransaction() {...<br/>\n<br/>\nThe assertion methods are in an Assert class which is most easily used<br/>\nthrough static import:<br/>\n  import static org.junit.Assert.assertEquals;<br/>\n  ...<br/>\n  @Test public void example() {...assertEquals(2, 2);...}<br/>\n<br/>\nSet up and tear down are handled with the @Before and @After annotations.<br/>\nYou can have as many @Befores and @Afters as you need. Inherited @Befores<br/>\nare executed before @Befores in subclasses and inherited @Afters are<br/>\nexecuted after @Afters in subclasses.<br/>\n<br/>\nShared setup is handled by @BeforeClass and @AfterClass. Methods with these<br/>\nannotations are executed once before (respectively after) all the tests in<br/>\nthe class run.<br/>\n<br/>\n@Ignore causes a test not to be run, but it is reported as ignored.<br/>\n<br/>\n@Test takes two optional parameters. A test annotated @Test(timeout=100)<br/>\nwill fail if the test takes longer than 100 milliseconds to complete. A test<br/>\nannotated @Test(expected=NullPointerException.class) will fail if a<br/>\nNullPointerException is not thrown and succeed if a NullPointerException is<br/>\nthrown.<br/>\n<br/>\nPreserving existing investment in tests has taken nearly half of our<br/>\ndevelopment effort. JUnit 4 is forward and backward compatible. You can run<br/>\nolder tests with the JUnit 4 test runner by passing them to the runner. You<br/>\ncan run JUnit 4 tests with older test runners by wrapping the JUnit 4 test<br/>\nclass in a compatibility class. The following method in a JUnit 4 test class<br/>\ncauses it to run correctly with the Eclipse test runner.<br/>\n  public static junit.framework.Test suite() {<br/>\n    return new JUnit4TestAdapter(AssertionTest.class);<br/>\n  }<br/>\n<br/>\nJUnit 4&#39;s command line interface can be invoked with:<br/>\n  java org.junit.runner.JUnitCore Test1 Test2<br/>\n<br/>\nThe same interface can be invoked programmatically with:<br/>\n  JUnitCore.run(Test1.class, Test2.class);<br/>\n<br/>\nIf you want to know more about the details of JUnit 4, you can browse the<br/>\ntests in org.junit.tests.*.<br/>\n<br/>\nErich and I will be participating on the JUnit lists to discuss further<br/>\nsimplification of JUnit 4, integration with test runners, and experiences<br/>\nusing it. Our experience with it (most of the tests were written JUnit 4<br/>\nstyle) has been very positive. The complexity of JUnit 3.x is like a tiny<br/>\npebble in a shoe. It doesn&#39;t seem like much until it is gone.<br/>\n<br/>\nGood testing,<br/>\n<br/>\nKent Beck<br/>\nThree Rivers Institute</div>", 
    "prevInTime": 13906, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1118725410", 
    "canDelete": false, 
    "nextInTopic": 13908, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDIwMDUwNjE0MDQ1NjE3LkRBNzNEOTlEQkBtYWlscmVsYXkudC1tb2JpbGUuY29tPg=="
    }
}