{
    "numMessagesInTopic": 5, 
    "nextInTime": 13904, 
    "senderId": "QvUT_lxrdWrlR1mVXDWQo6wuZGgYZvrvNXJ7i8T6rLuQfXcHItkBahjhHDKWVqlixNrTojPrmkMPqC0hYIkd7l3N3CraYWc1Pd2BgWzAQA", 
    "systemMessage": false, 
    "subject": "Re: [junit] Testing ugly broken code", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... Let me assume that I get to choose, meaning that no-one is exerting pressure on me to do one or the other. In that case, I prefer to fix the bugs/smells as", 
    "msgId": 13903, 
    "profile": "nails762", 
    "topicId": 13893, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-521052089\">Ray V wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m relatively new to JUnit, but I&#39;ve started to use<br/>\n&gt; it a bit, and now I&#39;m faced with a project where I<br/>\n&gt; think it could provide a lot of value.  I could use<br/>\n&gt; some advice.<br/>\n&gt; <br/>\n&gt; Some background: I&#39;ve come into a project that has no<br/>\n&gt; test coverage and has some pretty aggregious code...<br/>\n&gt; meanwhile new features are being slowly added.  The<br/>\n&gt; thing feels like it&#39;s on the verge of imploding, and<br/>\n&gt; this is the calm before the storm.<br/>\n&gt; <br/>\n&gt; I&#39;m going through the process right now of adding test<br/>\n&gt; cases, but as I write them I&#39;m constantly fighting the<br/>\n&gt; urge to fix stuff.  My question: is it better to write<br/>\n&gt; all the tests first, then go back to fixing what&#39;s<br/>\n&gt; broken, or to fix the bugs and &quot;smelly&quot; code as you go?<br/>\n<br/>\n </span></blockquote>Let me assume that I get to choose, meaning that no-one is exerting <br/>\npressure on me to do one or the other. In that case, I prefer to fix the <br/>\nbugs/smells as I go. Here&#39;s an example why:<br/>\n<br/>\nSuppose I have the same broken code in five places. It might not even be <br/>\nexactly the same code, but it&#39;s very similar. I&#39;ll use tests to help <br/>\nidentify the problem in one place, then fix it there. Later, I&#39;ll use <br/>\ntests to identify the same problem somewhere else, so I fix it there, <br/>\ntoo. Now I get a nagging feeling that the same problem is in multiple <br/>\nplaces. If I hunt them down and the code looks similar enough, I&#39;ll <br/>\nsprinkle the area with enough tests to be able to replace the broken <br/>\nduplicate code with a call to the new working code.<br/>\n<br/>\nIf I had just written all the tests first, I wouldn&#39;t have seen the <br/>\nshortcut of fixing the &quot;5 times&quot; problem only three times, where the <br/>\nthird time is &quot;once and for all&quot;.<br/>\n<br/>\nIn general, tidying up as you go, especially in code with a lot of <br/>\nduplication, takes longer to get going, but allows you to accelerate. <br/>\nBefore long you notice that code you thought you&#39;d have to fix can <br/>\nactually just be deleted! (That&#39;s the best way to fix code: remove it.)<br/>\n<br/>\nTHAT SAID, if someone is putting pressure on you to expose bugs, rather <br/>\nthan fix them, then I recommend just adding the tests and fixing things <br/>\nlater. You can /try/ to explain to the pressure-applier that the cost <br/>\nwill be roughly equal doing it either way, but let that person decide. <br/>\nThere&#39;s no point in contradicting that person and then making him look <br/>\nbad. :)<br/>\n-- <br/>\nJ. B. (Joe) Rainsberger<br/>\nDiaspar Software Services<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com\">http://www.diasparsoftware.com</a><br/>\nAuthor, JUnit Recipes: Practical Methods for Programmer Testing</div>", 
    "prevInTime": 13902, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1118686450", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 13898, 
    "headers": {
        "inReplyToHeader": "PDIwMDUwNjEwMTgwMzQzLjU1NDU5LnFtYWlsQHdlYjYwNzE2Lm1haWwueWFob28uY29tPg==", 
        "messageIdInHeader": "PDQyQURDQ0YyLjYwOTAzMDJAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDIwMDUwNjEwMTgwMzQzLjU1NDU5LnFtYWlsQHdlYjYwNzE2Lm1haWwueWFob28uY29tPg=="
    }
}