{
    "numMessagesInTopic": 47, 
    "nextInTime": 13927, 
    "senderId": "gBv-CBGx6HVDVyBxOSuaiTDtyYPWBimGfIJs7RRV5WPuWoPrWMNIdXhVswVLu3o1Nth7-l7_E6ZvuWAo1SQ2E66C2kkSEHsOLA", 
    "systemMessage": false, 
    "subject": "Re: [junit] JUnit 4", 
    "from": "Robert Watkins &lt;yahoo@...&gt;", 
    "authorName": "Robert Watkins", 
    "msgSnippet": "... Kent, It s not so much that I think it couldn t be done with the existing annotations, as that it would be more elegant if a decorator annotation was ", 
    "msgId": 13926, 
    "profile": "robertdw26", 
    "topicId": 13907, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 189784721, 
    "messageBody": "<div id=\"ygrps-yiv-448058712\">Kent Beck wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Robert,<br/>\n&gt; <br/>\n&gt; This is an interesting idea. It would be very powerful. I&#39;m having trouble<br/>\n&gt; understanding what you would use it for beyond what you can do with<br/>\n&gt; @Before/@After and @BeforeClass and @AfterClass, though. Do you have an<br/>\n&gt; example?<br/>\n<br/>\n </span></blockquote>Kent,<br/>\n<br/>\nIt&#39;s not so much that I think it couldn&#39;t be done with the existing <br/>\nannotations, as that it would be more elegant if a decorator annotation was <br/>\ndirectly available.<br/>\n<br/>\nAn example that I&#39;ve got right at hand is a decorator I used to set up the <br/>\nJNDI space with mock objects, so that the code-under-test had access to <br/>\nexpected resources. I used a decorator, rather than a base class, because I <br/>\nneeded this to be available across several different test hierarchies, some <br/>\nof which already extended from different sub-class of TestCase. An <br/>\nalternative would have been to use a duplicated setUp() method. But this <br/>\nwas ugly duplication... Another good example would be for using IoC <br/>\ntechniques on the test itself.<br/>\n<br/>\nWith the @Before/@After annotations, I could do something similar. But it <br/>\nwould still be duplication that would be annoying. With an annotation <br/>\ndecorator I&#39;d be able to reduce that duplication to a single declaration of <br/>\nintent.<br/>\n<br/>\nMore generally, however, I&#39;d like a way to extend JUnit without fighting <br/>\nit. There are some powerful techniques in JUnit 3.8 that I wouldn&#39;t want to <br/>\nlose, for example - one such is the ability to programatically create test <br/>\ncases (see <a rel=\"nofollow\" target=\"_blank\" href=\"http://twasink.net/blog/archives/2003/10/junit_and_datad.html\">http://twasink.net/blog/archives/2003/10/junit_and_datad.html</a> <br/>\nfor more on this - or Chapter 4.8 of JB Rainsberger&#39;s &quot;JUnit Recipes&quot;). In <br/>\nJUnit 4, there appears to be no way to do the same thing; I&#39;d be forced to <br/>\nhave a single test, which read the data file iteratively - needless to say, <br/>\nthis wouldn&#39;t give me the same level of granularity in reports.<br/>\n<br/>\nIn fact, in order to get the same level of flexibility in JUnit 4 as is in <br/>\nJUnit 3, you&#39;d need at the very least to give an equivalent of the suite() <br/>\nmethod - currently, there is no way to change the way that test instances <br/>\nare obtained. Perhaps a test class could define a TestFactory annotation, <br/>\nwhich would default to the TestInstropector?<br/>\n<br/>\n(Actually, for the ultimate in flexibility, you&#39;d need to provide a way to <br/>\nchange the runner strategy, too - but that&#39;s probably overkill)<br/>\n<br/>\nUltimately, what I would like to be able to do is have equivalents of <br/>\npopular JUnit extensions, such as DBUnit, ServletUnit, and JUnitPerf, which <br/>\nare configured using annotations rather than base classes. The annotations <br/>\ncurrently in JUnit 4 wouldn&#39;t allow this.<br/>\n<br/>\n(Cedric, if you&#39;re reading this... every one of these points applies to <br/>\nTestNG as well)<br/>\n<br/>\n-- <br/>\n                &quot;Software is too expensive to build cheaply&quot;<br/>\nRobert Watkins         <a rel=\"nofollow\" target=\"_blank\" href=\"http://twasink.net/\">http://twasink.net/</a>          <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robertdw@...\">robertdw@...</a></div>", 
    "prevInTime": 13925, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1118925349", 
    "canDelete": false, 
    "nextInTopic": 13927, 
    "prevInTopic": 13923, 
    "headers": {
        "inReplyToHeader": "PEUxRGlvTHYtMDAwNENsLVRWQHNtdHBhdXRoMDMubWFpbC5hdGwuZWFydGhsaW5rLm5ldD4=", 
        "messageIdInHeader": "PDQyQjE3MjI1LjgwMTA4QHR3YXNpbmsubmV0Pg==", 
        "referencesHeader": "PEUxRGlvTHYtMDAwNENsLVRWQHNtdHBhdXRoMDMubWFpbC5hdGwuZWFydGhsaW5rLm5ldD4="
    }
}