{
    "topicId": 1390, 
    "postDate": "991667869", 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "from": "Matt Caswell &lt;m.caswell@...&gt;", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "AUM467HVSuJz_r1wOgpyevzTCz4YHW0OrucfDn08F766DLHANu8C1ZHPPXt25azt_HxJ4Cvlq3rGBRYQ8mJqJNz-FG1eR3c6fF5le4VRSQ", 
    "nextInTime": 1394, 
    "userId": 0, 
    "prevInTime": 1392, 
    "prevInTopic": 1392, 
    "headers": {
        "messageIdInHeader": "PDI5Qzg0Q0YyNUQwM0Q1MTE5RkNGMDA5MDI3QjY3QjVBNzQwNzdGQEVYQ0hBTkdFMT4="
    }, 
    "authorName": "Matt Caswell", 
    "numMessagesInTopic": 9, 
    "msgSnippet": "I have never written Functional tests using JUnit. I have however written JUnit tests that drive a Swing GUI. In fact I have written a number of classes to", 
    "contentTrasformed": false, 
    "msgId": 1393, 
    "nextInTopic": 1394, 
    "systemMessage": false, 
    "rawEmail": "Return-Path: &lt;matt.caswell@...&gt;\r\nX-Sender: matt.caswell@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-7_1_3); 4 Jun 2001 15:18:03 -0000\r\nReceived: (qmail 54866 invoked from network); 4 Jun 2001 15:17:58 -0000\r\nReceived: from unknown (10.1.10.142) by l10.egroups.com with QMQP; 4 Jun 2001 15:17:58 -0000\r\nReceived: from unknown (HELO relay1.hughesrae.co.uk) (212.126.105.136) by mta3 with SMTP; 4 Jun 2001 15:17:58 -0000\r\nReceived: from exchange1.hughesrae.co.uk (mail.hughesrae.co.uk [10.121.202.3]) by relay1.hughesrae.co.uk (8.11.2/8.11.2) with ESMTP id f54FJnw13077; Mon, 4 Jun 2001 16:19:49 +0100\r\nReceived: by EXCHANGE1 with Internet Mail Service (5.5.2653.19) id &lt;LBPBQZBP&gt;; Mon, 4 Jun 2001 16:17:52 +0100\r\nMessage-ID: &lt;29C84CF25D03D5119FCF009027B67B5A74077F@EXCHANGE1&gt;\r\nReply-To: junit@yahoogroups.com\r\nTo: &quot;&#39;ghouston@... &#39;&quot; &lt;ghouston@...&gt;, &quot;&#39;junit@yahoogroups.com &#39;&quot; &lt;junit@yahoogroups.com&gt;\r\nSubject: RE: [junit] Functional Testing with JUnit\r\nDate: Mon, 4 Jun 2001 16:17:49 +0100 \r\nMIME-Version: 1.0\r\nX-Mailer: Internet Mail Service (5.5.2653.19)\r\nList-Unsubscribe: &lt;mailto:junit-unsubscribe@yahoogroups.com&gt;\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nX-eGroups-From: Matt Caswell &lt;matt.caswell@...&gt;\r\nFrom: Matt Caswell &lt;m.caswell@...&gt;\r\n\r\nI have never written &quot;Functional tests&quot; using JUnit. I have however written\nJUnit tests that drive a Swing GUI. In fact I have written a number of\nclasses to assist me in doing this.\n\nThere are three problems I discovered attempting to test a Swing GUI:\n\n1) Getting hold of a handle onto the components that your code has displayed\nto the user\n2) Interacting with the components once you have a handle\n3) Inspecting the results of your interactions without breaking the\nsingle-threaded nature of Swing/AWT\n\nTaking these individually:\n\n1) I started off by solving this using reflection, i.e. the class I was\ntesting would hold a reference to a Frame (for example). Typically this\nwould be held as a private instance variable. I would then use reflection to\nget hold of that reference. Unfortunately this approach fell down where I\nhad for various reasons not stored a handle to my component. For example\nwhen showing a dialog box. This sort of thing is typically transient, and\nyou don&#39;t always need to hold a permanent reference to it.\n\nThe solution I came up with was to effectively write a &quot;global listener&quot;. To\nlisten out for &quot;window open&quot; events. When a window open event occurred I\nwould record the handle for the window that was opened. This was implemented\nusing a custom EventQueue.\n\nOnce you have a handle on the window you can then &quot;search&quot; it for any\nsub-components that you want. I wrote some helper code that would enable me\nto perform searches like &quot;given this window, find me the button with the\ntext &quot;OK&quot; on it&quot;.\n\n\n2) Once you have a handle you then want to do stuff with it. E.g., click the\n&quot;OK&quot; button. Type in some text in a text box. etc. This is relatively easily\nimplemented by submitting dummy events to that handle. E.g. to click a\nbutton, send an event to enter that component, send an event to signal mouse\ndown, send an event to signal mouse up, send an event to leave the\ncomponent. The AWT/Swing event handling does the rest to raise higher level\nevents (e.g. action events) etc\n\n3) The single threaded nature of AWT/Swing, means that once a window is\nshown to the user it is effectively &quot;owned&quot; by the AWTThread. Your test\ncases must execute within this thread - otherwise (as I discovered!) you get\nspurious exceptions thrown. In addition you want to do write test sequences\nlike &quot;click this button, wait until the dialog shows, click this other\nbutton, wait for the dialog to disappear, fill in some text, wait\nagain...etc&quot;. In other words your test needs to be executing within the AWT\nThread, but it needs to hand back control every now and then for it to\nhandle the events that you have been raising.\n\nI implemented this by extending TestCase - I called it JFCTestCase. This\nhandles all the threading issues, and provides a helper method to\ntemporarily suspend the test, and allow the AWT Thread to continue with\nother stuff.\n\nIt has been my intention to send this code to the group once I had tidied\nthings up a bit. If anyone once to see an &quot;advance&quot; copy I can supply one\n(not currently on a machine where I can get to it though)\n\n\nHope that is of some interest\n\nMatt\n\n\n\n-----Original Message-----\nFrom: ghouston@...\nTo: junit@yahoogroups.com\nSent: 04/06/01 15:43\nSubject: [junit] Functional Testing with JUnit\n\n\nHas anyone tried to drive Functional Tests with JUnit?  How did you \naccomplish it?  In particular, how could you drive a Swing GUI?\n\nBy &quot;Functional Tests&quot;, I mean tests that check the entire application \nas a black-box (or very near to black-box testing).  It would launch \nthe appliction, drive the GUI, and interpret the output of the system.\n\nMy team has been very sucessful with Unit Testing, and we want to \nadvance to running Functional Tests.\n\n- Greg\n\n\n\nTo unsubscribe from this group, send an email to:\njunit-unsubscribe@yahoogroups.com\n \n\nYour use of Yahoo! Groups is subject to\nhttp://docs.yahoo.com/info/terms/ \n\n\n", 
    "subject": "RE: [junit] Functional Testing with JUnit"
}