{
    "numMessagesInTopic": 3, 
    "nextInTime": 14127, 
    "senderId": "VffIYDWormKd-rVQEyBSab0R_lR2gUA7NJUvO7Z15HTW3CigvdTlKNN_jm14wluW8pc2vH0FI-TC2GorTZxrx2E4A94", 
    "systemMessage": false, 
    "subject": "TDD Design advice on an HTTPClient-driven service", 
    "from": "&quot;etl_dan&quot; &lt;etl_dan@...&gt;", 
    "authorName": "etl_dan", 
    "msgSnippet": "Hi all, I m facing some design issues and I ve hit a mental roadblock that s left me dazed and pondering by the side of the road... (better crashed wondering", 
    "msgId": 14126, 
    "profile": "etl_dan", 
    "topicId": 14126, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 86431363, 
    "messageBody": "<div id=\"ygrps-yiv-999938807\">Hi all,<br/>\n<br/>\nI&#39;m facing some design issues and I&#39;ve hit a mental roadblock that&#39;s<br/>\nleft me dazed and pondering by the side of the road... (better crashed<br/>\nwondering how to TDD than how to solve a production bug, I suppose!) <br/>\nAny advice is appreciated!<br/>\n<br/>\nI&#39;m building a component which must support a few use cases where a<br/>\nseries of HTTP POST messages must be sent, received, and processed to<br/>\na server.  I created a prototype to prove that I can use Jakarta<br/>\nCommons HttpClient to handle multiple request/response interactions,<br/>\nand now I&#39;d like to start over with this knowledge and use TDD to<br/>\ndesign this service.  (Preferably most/all of the tests won&#39;t require<br/>\na live container).<br/>\n<br/>\nThe problem I&#39;m facing is that I can&#39;t figure out at what level to<br/>\nstart testing/designing. <br/>\n<br/>\nThe top level seems easiest; one method might be something like:<br/>\n<br/>\n  String getWorkDataAsXml(...) throws RuntimeException;<br/>\n<br/>\nwhere the method ultimately makes four HTTP requests to a server,<br/>\nformats the response and returns, or throws an exception if the server<br/>\nis unavailable.  <br/>\n<br/>\nHowever, I&#39;m not really sure how to break it down below that level -<br/>\nand still be testable.  I know that the four requests must happen in<br/>\nsequence, so that&#39;s a clue.  Another immediate test I can see here is<br/>\nensuring that each request is set up with the correct name/value<br/>\nparameters; so this implies to me that each request might be its own<br/>\nclass, or at least each request&#39;s parameter map generator is its own<br/>\nclass or a unique static method.<br/>\n<br/>\nBeyond this I start to get lost.  An HttpClient is a class with no<br/>\nimplemented interface, so perhaps I could wrap its core required<br/>\nfunctionality in an interface without actually exposing the<br/>\nHttpClient, then substitute a mock in for testing? (Such as described<br/>\nin Michael Feathers&#39; book)<br/>\n<br/>\nThank you,<br/>\n<br/>\nDan</div>", 
    "prevInTime": 14125, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1121395486", 
    "canDelete": false, 
    "nextInTopic": 14129, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGRiNzd1dSs5Z240QGVHcm91cHMuY29tPg=="
    }
}