{
    "numMessagesInTopic": 57, 
    "nextInTime": 1415, 
    "senderId": "IzSrOL2kgNkT-XgROvXKLFJ6W23zHXwAyeBdvK2fWiYk8hV5d3Zy-fEToTF2dUZljf99mHTO9_oBfKiMD-0Bs_bqy8LyUUeeSVjE", 
    "systemMessage": false, 
    "subject": "Re: [junit] Best Practice for Tests ?", 
    "from": "Kevin Mukhar &lt;kmukhar@...&gt;", 
    "authorName": "Kevin Mukhar", 
    "msgSnippet": "... That s what I do and it works extremely well. Sure, if you change the package of a class, you need to remember to change the package of the test class, but", 
    "msgId": 1414, 
    "topicId": 1411, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-465499455\"><blockquote><span title=\"ireply\">&gt; Steven Webster wrote:<br/>\n&gt; <br/>\n&gt; 1.    A separate directory tree with a root note of test, the package<br/>\n&gt; structure of which reflects that of the codebase; keep the tests <br/>\n&gt; completely isolated from production code, the downside being that if I <br/>\n&gt; refactor code around packages, I have to remember to move tests as well; <br/>\n&gt; also, removes my ability to test private and protected methods..<br/>\n<br/>\n </span></blockquote>That&#39;s what I do and it works extremely well. Sure, if you change the package<br/>\nof a class, you need to remember to change the package of the test class, but<br/>\nif you are very strict about test first development you should have no problem<br/>\nkeeping the tests and codebase packages in alignment. This technique does NOT<br/>\nremove the ability to test protected methods. Classes in the same package can<br/>\naccess package, protected, and public methods of each other.<br/>\n<br/>\nThere was a big discussion recently about how to test private methods. Read<br/>\nthe thread starting here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/junit/message/1267?threaded=1\">http://groups.yahoo.com/group/junit/message/1267?threaded=1</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 2.    A &#39;test&#39; directory in each package of the codebase, containing<br/>\n&gt; TestXXXX classes<br/>\n<br/>\n </span></blockquote>Yuck. This would work okay, but my personal preference is to keep test code<br/>\nseparate from production code. Same comment as above for protected and private<br/>\nmethods<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 3.    Actually make each class in the production code it&#39;s own test, ie put<br/>\n&gt; the JUnit testing code in the class itself.<br/>\n<br/>\n </span></blockquote>Double yuck for the same reason as 2, I prefer not to mix test source code and<br/>\nproduction source code. It actually wouldn&#39;t be that hard to separate the test<br/>\nclass from the production class; you would code the test class as an inner<br/>\nclass. If you follow a good naming convention, it would be relatively easy to<br/>\nseparate the test class files from the codebase class files. (It doesn&#39;t<br/>\nmatter whether or not you can easily separate the source, it&#39;s the class files<br/>\nthat matter). The only advantage to this is that it allows you test private<br/>\nmethods. Again, refer to the archives for the discussion of testing private<br/>\nmethods.</div>", 
    "prevInTime": 1413, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "991931178", 
    "canDelete": false, 
    "nextInTopic": 1415, 
    "prevInTopic": 1413, 
    "headers": {
        "messageIdInHeader": "PDNCMUZBQjJBLjhEN0ZDQkE2QGNvcnAudXNhLm5ldD4=", 
        "referencesHeader": "PDAxYmUwMWMwZWY2NCQzOGFhY2U2MCQ5YzAwMDAwYUBkZXNrdG9wMDc+"
    }
}