{
    "numMessagesInTopic": 1, 
    "nextInTime": 14220, 
    "senderId": "zzQfZ0DnuTZajLuGO6ZEZmXBZ5t1MY3DtKh7m7UfJNdSPncP85r6geC3_wDq0N-vjzA6s4tXW76MxOzOjfUH1QV4ohDgKBUwR3u4a7QzaA", 
    "systemMessage": true, 
    "subject": "XP Day in Washington DC - Saturday Sept. 24.", 
    "from": "&quot;nkhanna_01&quot; &lt;niraj@...&gt;", 
    "authorName": "nkhanna_01", 
    "msgSnippet": "Hello everyone! Diaspar Software, Digital Focus and ProjectSuccess would like to announce that we are co-hosting XP Day DC 2005, a 1-day eXtreme Programming", 
    "msgId": 14219, 
    "profile": "nkhanna_01", 
    "topicId": 14219, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 231521593, 
    "messageBody": "<div id=\"ygrps-yiv-560707884\">Hello everyone!<br/>\n<br/>\nDiaspar Software, Digital Focus and ProjectSuccess would like to<br/>\nannounce that we are co-hosting XP Day DC 2005, a 1-day eXtreme<br/>\nProgramming conference to be held in the Greater Washington DC area<br/>\nSeptember 24th, 2005.  For those who prefer browsing a website instead<br/>\nof reading plain text, visit: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.xpday.info\">http://www.xpday.info</a><br/>\n<br/>\nIf you are looking for an opportunity to learn more about Extreme<br/>\nProgramming without having to spend an entire week at a large<br/>\ninternational XP conference, XP Day DC fits the bill.  XP Day is a<br/>\none-day event with activities for anyone interested in Extreme<br/>\nProgramming, whether you&#39;re:<br/>\n<br/>\n* An executive wondering how XP can improve the contribution your<br/>\nsoftware organization makes to the bottom line.<br/>\n* A manager looking for ways to increase your team&#39;s effectiveness.<br/>\n* A skeptic, hoping to challenge the most experienced and outspoken XP<br/>\npractitioners.<br/>\n* A programmer itching to experience a real XP project room.<br/>\n* An experienced practitioner, hoping to share ideas with other<br/>\nexperienced practitioners.<br/>\n<br/>\nFor those of you who missed out on Agile 2005, this would be an<br/>\nexcellent opportunity to meet, attend tutorial sessions and even work<br/>\nwith some of the XP community&#39;s most notable practitioners.<br/>\n<br/>\nXP Day events are interactive!<br/>\n<br/>\n- Tutorials<br/>\n<br/>\nWe are fortunate to have respected leaders of the XP community<br/>\nproviding world-class instruction in the fundamentals of XP.<br/>\n<br/>\n* Bill Wake, keynote.<br/>\n* J. B. Rainsberger will provide an introduction to XP.<br/>\n* Jeff Nielsen will show you an XP approach to communicating<br/>\nrequirements.<br/>\n<br/>\n- Open Space<br/>\n<br/>\nYou can collaborate intensively with both local and invited advanced<br/>\npractitioners on issues that challenge you most. If the tutorials<br/>\ndon&#39;t cover it, you can work through your burning questions in Open<br/>\nSpace.<br/>\n<br/>\n- Panel Discussion<br/>\n<br/>\nWe are pleased to invite clients of Digital Focus to share their<br/>\nstories about How XP Has Changed Our Lives. To get a head start on<br/>\nyour company&#39;s transition to XP, or to find out more about the<br/>\nbenefits and pitfalls of adopting XP practices, ask those who have<br/>\nexperienced it!<br/>\n<br/>\n- Project Room<br/>\n<br/>\nIf you&#39;re looking to dive in and immerse yourself in XP, join the XP<br/>\nProject Room, where you&#39;ll have the opportunity to work on project<br/>\nwith respected experts. Not sure what&#39;s going on? No problem! Join the<br/>\nproject any time and someone will bring you up to speed quickly, just<br/>\nlike on a real XP project!<br/>\n<br/>\nIf you&#39;re looking for more information, visit our website:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.xpday.info\">http://www.xpday.info</a><br/>\n<br/>\nIf you have any questions with regards to this event, please don&#39;t<br/>\nhesitate to contact me at the email address listed above.<br/>\n<br/>\nHope to see you all there!<br/>\n<br/>\nNiraj.</div>", 
    "prevInTime": 14218, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1122429789", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGRjNnEwdCtxNHI3QGVHcm91cHMuY29tPg=="
    }
}