{
    "numMessagesInTopic": 57, 
    "nextInTime": 1433, 
    "senderId": "FnvMoaXfCpFuaFMX3GCI97vIs7h0CPubReWbzhlYi-c4ZaUjf_JPeKy93_sqeSExEaAC0KcNRVPSDbc", 
    "systemMessage": false, 
    "subject": "Re: Best Practice for Tests ?", 
    "from": "j.c.yip@...", 
    "authorName": "j.c.yip@computer.org", 
    "msgSnippet": "... I don t see how putting tests in the same directory optimizes mouse clicks.  Doesn t JBuilder allow opening multiple files?  With NetBeans, I can just use", 
    "msgId": 1432, 
    "topicId": 1411, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-2109758106\">--- In junit@y..., ghouston@i... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I&#39;ve used both the seperate directory approach and same directory <br/>\n&gt; approach.  Both worked fine, so use which ever you like.<br/>\n&gt; <br/>\n&gt; My preference is to put the test in the same directory as the <br/>\n&gt; class.  <br/>\n&gt; I like this because it reduces the number of clicks I have to make <br/>\n&gt; in my IDE (JBuilder) to get from production class to test class.  <br/>\n&gt; When you are developing in a test-first fashion, you will <br/>\n&gt; frequently switch between the test code and the production code.  <br/>\n&gt; By putting them in the same directory this makes it easier to <br/>\n&gt; navigate in the IDE.  Yes, this mixes production and test files <br/>\n&gt; together.  However it is very easy to seperate them in a build <br/>\n&gt; script (if you use a simple naming convention for test files).  <br/>\n&gt; Since you will spend more of your work day navigating between <br/>\n&gt; source files than seperating out test code, I chose to optimize the <br/>\n&gt; # of clicks I had to make in the IDE by putting files in the same <br/>\n&gt; directory.<br/>\n<br/>\n </span></blockquote>I don&#39;t see how putting tests in the same directory optimizes mouse <br/>\nclicks.  Doesn&#39;t JBuilder allow opening multiple files?  With <br/>\nNetBeans, I can just use a tabbed pane or pull out the file into a <br/>\nseparate window.  The Emacs folks (which there are apparently a lot <br/>\nof of around here) can split the window.  <br/>\n<br/>\nI prefer a separate test directory for purely aesthetic reasons.  I&#39;m <br/>\nam more and more inclined to support using the same package to allow <br/>\npackage/protected access simply because I&#39;d rather risk suboptimal <br/>\ndesigns than inhibit testing.  I don&#39;t test private methods directly <br/>\nbecause to me that is too strong a design smell to leave alone. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I use the following naming convention:<br/>\n&gt;   Someclass.java<br/>\n&gt;   SomeclassT.java // the unit test<br/>\n&gt;   SomeclassM.java // a mock object of Someclass<br/>\n<br/>\n </span></blockquote>It would seem clearer to use SomeClassTest, MockSomeClass.</div>", 
    "prevInTime": 1431, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "992028958", 
    "canDelete": false, 
    "nextInTopic": 1438, 
    "prevInTopic": 1429, 
    "headers": {
        "inReplyToHeader": "PDlmb3JuOCtyaDhuQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDlmcjlldSsxMDhhbkBlR3JvdXBzLmNvbT4="
    }
}