{
    "numMessagesInTopic": 12, 
    "nextInTime": 14418, 
    "senderId": "xsg1tghvtHZSZksCB0B5_IjIn-CXZzpC9nwLVTLo-4yKXoY9-plVEKgOZRwATtL57n6MDCCiCJBmyphtQ5kweSrFYV76V43g1JE56qW_", 
    "systemMessage": false, 
    "subject": "Re: [junit] Some questions about JUnit 4", 
    "from": "Jason Rogers &lt;jacaetevha@...&gt;", 
    "authorName": "Jason Rogers", 
    "msgSnippet": "... Fair enough... as I said I would just like to see a graphical runner easily available (on the junit.org site perhaps, as Todd Bradley suggested).  If I", 
    "msgId": 14417, 
    "profile": "jacaetev", 
    "topicId": 14259, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 109352929, 
    "messageBody": "<div id=\"ygrps-yiv-1211384209\">Kent Beck wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Jason and Andrew,<br/>\n&gt;<br/>\n&gt; Thank you for your perspective that JUnit should include a graphical test<br/>\n&gt; runner. I understand you to be saying that you don&#39;t use IDEs, at <br/>\n&gt; least not<br/>\n&gt; all the time, and you would like a friendlier presentation of test results<br/>\n&gt; than what is available from the textual test runner.<br/>\n&gt;<br/>\n&gt; Our thinking about the role of graphical runners in the base JUnit release<br/>\n&gt; evolved in a couple of steps. First, we noticed that JUnit depended on AWT<br/>\n&gt; and Swing classes even though those classes didn&#39;t seem central to the<br/>\n&gt; framework. This is an aesthetic point, but aesthetics often lead us in the<br/>\n&gt; right direction so we trust them. Breaking this dependency required <br/>\n&gt; breaking<br/>\n&gt; JUnit into two parts, core and UI. Once we had broken JUnit up we came to<br/>\n&gt; the second step of deciding who should be responsible for the UI. Ant and<br/>\n&gt; the IDEs already have their own user interface and represent the (vast?)<br/>\n&gt; majority of JUnit usage, so there is little value added by maintaining<br/>\n&gt; separate UIs. With our limited time to support JUnit, it didn&#39;t make sense<br/>\n&gt; to continue maintaining the graphical runners ourselves.<br/>\n&gt;<br/>\n&gt; We aren&#39;t against standalone runners in general. One of our goals with <br/>\n&gt; JUnit<br/>\n&gt; 4 is to make writing runners easier. However, we seldom have code in the<br/>\n&gt; JUnit distribution that we didn&#39;t write and there is a widely established<br/>\n&gt; community of JUnit extenders. Because of this we are comfortable <br/>\n&gt; letting go<br/>\n&gt; of the graphical runners and encouraging people to write and publish their<br/>\n&gt; own. If there is anything more we can do to aid in this endeavor, <br/>\n&gt; please let<br/>\n&gt; us know.<br/>\n<br/>\n </span></blockquote>Fair enough... as I said I would just like to see a graphical runner <br/>\neasily available (on the junit.org site perhaps, as Todd Bradley <br/>\nsuggested).  If I find time soon, I will write it myself and see about <br/>\npublishing it.  I completely understand about the unwillingness to <br/>\nmaintain such a thing as well as the Core of JUnit.<br/>\n<br/>\n-- <br/>\nJason Rogers<br/>\n<br/>\n&quot;I am crucified with Christ: nevertheless I live; yet not I,<br/>\nbut Christ liveth in me: and the life which I now live in <br/>\nthe flesh I live by the faith of the Son of God, who loved <br/>\nme, and gave himself for me.&quot;<br/>\n    Galatians 2:20</div>", 
    "prevInTime": 14416, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1124815675", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 14412, 
    "headers": {
        "inReplyToHeader": "PEUxRTdiazUtMDAwNGo1LURtQHNtdHBhdXRoMDUubWFpbC5hdGwuZWFydGhsaW5rLm5ldD4=", 
        "messageIdInHeader": "PDQzMEI1MzNCLjUwODAyQGZhc3QtbWFpbC5vcmc+", 
        "referencesHeader": "PEUxRTdiazUtMDAwNGo1LURtQHNtdHBhdXRoMDUubWFpbC5hdGwuZWFydGhsaW5rLm5ldD4="
    }
}