{
    "numMessagesInTopic": 29, 
    "nextInTime": 14432, 
    "senderId": "-znAKVCHAxzKS3ctKIe12FCO95TzpqNRVbM_0Tk7mUtI1u-pijHWBryF7xtK09Y0nkAXRGbwpqlngJ0tgmgdFhvuKTnOrY4cMw", 
    "systemMessage": true, 
    "subject": "RE: [junit] Preventing JUnit from stopping on failures.", 
    "from": "Raffael Housler &lt;RaffaDub@...&gt;", 
    "authorName": "Raffael Housler", 
    "msgSnippet": "I appreciate the input but I dont think I was clear enough... This is a large scale project in which it is completely unfeasible to find a single error per", 
    "msgId": 14431, 
    "profile": "raffadub", 
    "topicId": 14398, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 234673858, 
    "messageBody": "<div id=\"ygrps-yiv-751891286\">I appreciate the input but I dont think I was clear enough...<br/>\n<br/>\nThis is a large scale project in which it is completely unfeasible to find a single error per test, fix it, and run the test again. This is mainly because most of the things that are being tested are NOT DIRECTLY related. Let me give you a brief example:<br/>\n<br/>\nPrep: Robot Clicks &quot;Activate Thermoflater&quot; button<br/>\nAssert: Does textfield1 match textfield1.bmp<br/>\nAssert: Does textfield1 text match &quot;blah blah&quot;<br/>\nAssert: Does label1 match jlabel1.bmp<br/>\nAssert: Is popup visible<br/>\netc<br/>\n<br/>\nNow hopefully you understand why all assertions must be executed; otherwise if it fails on the first assertion, firstly there is not enough information pin point the problem on the jtextfield or the input mechanism etc and we would also not know if the rest of them are correct until this one was fixed, recompiled, and retested (very long time on large scale projects like this).<br/>\n<br/>\nSo the ideal is, it runs through it, lists all the failures and the problem can be diagnosed with much greater accuracy and speed (less time). Time is the key.<br/>\n<br/>\nThe tests become quite complex, and it would be possible to write a seperate test for each component, however there would be a huge excess of redundant code (lost time).<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 14430, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1124832942", 
    "canDelete": false, 
    "nextInTopic": 14432, 
    "prevInTopic": 14425, 
    "headers": {
        "messageIdInHeader": "PDIwMDUwODIzMjEzNTQyLkRXVUoxOTYyNy5mZWQxcm1tdGFvMDEuY294Lm5ldEBzbXRwLndlc3QuY294Lm5ldD4="
    }
}