{
    "numMessagesInTopic": 29, 
    "nextInTime": 14433, 
    "senderId": "Fu5FGu5GOCMctS79tkB0S-Po2vifQMaubVgRu2_mlfB0Hci9YCc_KYAfawiR-9yFmW-rYZqj2em_cGG-XggkOHMSzFSZXxFftKEY63NZ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Preventing JUnit from stopping on failures.", 
    "from": "Jason Rogers &lt;jacaetevha@...&gt;", 
    "authorName": "Jason Rogers", 
    "msgSnippet": "... It is focused on a small bit of functionality and the asserts are not related to each other.  The functionality is the application of a CreditMemo to an", 
    "msgId": 14432, 
    "profile": "jacaetev", 
    "topicId": 14398, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 109352929, 
    "messageBody": "<div id=\"ygrps-yiv-979724392\">Jim McMaster wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; On Tuesday, August 23, 2005 at 2:43 PM Jason Rogers said:<br/>\n&gt;      <br/>\n&gt; &gt; I&#39;d like to chime in on this discussion just to throw a wrench in the<br/>\n&gt; &gt; works. ;)<br/>\n&gt; &gt;<br/>\n&gt; &gt; First, I am of the notion that I don&#39;t generally want multiple failures<br/>\n&gt; &gt; per test.   However, there *seems* to be an assumption in this thread<br/>\n&gt; &gt; that multilpe asserts per test are somehow related to each other, such<br/>\n&gt; &gt; that if one fails and I fix it then the other possibly failing asserts<br/>\n&gt; &gt; would be fixed at the same time.  That is not always, and perhaps<br/>\n&gt; &gt; generally, not the case.<br/>\n&gt;<br/>\n&gt; I believe it is, if the test is focused on a small bit of functionality.<br/>\n<br/>\n </span></blockquote>It is focused on a small bit of functionality and the asserts are not <br/>\nrelated to each other.  The functionality is the application of a <br/>\nCreditMemo to an existing sale, for which there may or may not be <br/>\nrelated sales (eg. a purchased recurring sale, a recurring sale in <br/>\nnegotiation, one or more &quot;upsales&quot;, etc.).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is it necessary (or even desirable) to test both these things in the same<br/>\n&gt; test?  Could you perhaps do one test to show applying the CreditMemo to a<br/>\n&gt; Sale does the right thing, and a second to show applying it to a<br/>\n&gt; RecurringSale is correct?  If these two actions happen in different <br/>\n&gt; classes,<br/>\n&gt; why would you need to test them at the same time?<br/>\n<br/>\n </span></blockquote>But, that was the point.  Applying it to the sale has a cascade effect <br/>\non its related sales.  You could do a separate test for each thing but I <br/>\ntend to hate the duplication even more!  In the contrived example (based <br/>\non reality) there should be no need to directly apply the CreditMemo for <br/>\nan originatingSale to one of its related sales.  It happens behind the <br/>\nscenes.  The test is testing that the direct effect on the originating <br/>\nsale takes place as well as the behind-the-scenes effect on its related <br/>\nsales.<br/>\n<br/>\nMind you, also, that I am not truly advocating multiple failures per <br/>\ntest... I am playing &quot;devil&#39;s advocate&quot; in order to shine some light on <br/>\nwhat seems to be forgotten territory.<br/>\n<br/>\n-- <br/>\nJason Rogers<br/>\n<br/>\n&quot;I am crucified with Christ: nevertheless I live; yet not I,<br/>\nbut Christ liveth in me: and the life which I now live in <br/>\nthe flesh I live by the faith of the Son of God, who loved <br/>\nme, and gave himself for me.&quot;<br/>\n    Galatians 2:20</div>", 
    "prevInTime": 14431, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1124836559", 
    "canDelete": false, 
    "nextInTopic": 14433, 
    "prevInTopic": 14431, 
    "headers": {
        "inReplyToHeader": "PDIwMDUwODIzMjA1NzM1LkQxOUNFQzNGNDlEQG14Mi5tZXNzYWdpbmdlbmdpbmUuY29tPg==", 
        "messageIdInHeader": "PDQzMEJBNENGLjkwOTA2QGZhc3QtbWFpbC5vcmc+", 
        "referencesHeader": "PDIwMDUwODIzMjA1NzM1LkQxOUNFQzNGNDlEQG14Mi5tZXNzYWdpbmdlbmdpbmUuY29tPg=="
    }
}