{
    "numMessagesInTopic": 125, 
    "nextInTime": 14575, 
    "senderId": "aBpW7TN0L6HsmPOk7T50joZnh98pDoa7Gsj8nto1KKwiJ0YGqq_f4mRzGogoT4P825h4y0-w26_85TAD4_HS9YY9cg1SUHoA8wSfNpT8pncdz6w", 
    "systemMessage": true, 
    "subject": "Re: How to test private methods in a class.", 
    "from": "&quot;Jim Cakalic&quot; &lt;james.p.cakalic@...&gt;", 
    "authorName": "Jim Cakalic", 
    "msgSnippet": "... Elliotte, I agree that privates should be kept private, encapsulation should not be broken for the purpose of testing, and that the number of messages in", 
    "msgId": 14574, 
    "profile": "jim_cakalic", 
    "topicId": 14490, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 226509834, 
    "messageBody": "<div id=\"ygrps-yiv-1023263112\">Elliotte Harold wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Jim Cakalic wrote:<br/>\n&gt; <br/>\n&gt; &gt; 3. Determine whether Extract Class should be used to split the<br/>\n&gt; &gt; responsibilities of the class into two or more abstractions. If<br/>\n&gt; &gt; so, refactor and write unit tests for the public methods of the<br/>\n&gt; &gt; new classes. Return to step 1.<br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; I don&#39;t see this as a solution. If the method wasn&#39;t public before,<br/>\n&gt; it shouldn&#39;t be public now just because it moved to a different<br/>\n&gt; class.If the only reason it becomes public is because it moved to a<br/>\n&gt; different class, it would be better off as the original private<br/>\n&gt; method inside the one class. Public API should be kept to a minimum,<br/>\n&gt; especially if you expect anybody to use your API. If the API is<br/>\n&gt; purely for your app&#39;s own internal use, then this constraint can be<br/>\n&gt; relaxed a little, but you should still strive for the minimum<br/>\n&gt; exposure of class internals. This is one of the first principles of<br/>\n&gt; object oriented design, and test driven development doesn&#39;t really<br/>\n&gt; change it to any significant extent.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Elliotte,<br/>\n<br/>\nI agree that privates should be kept private, encapsulation should not<br/>\nbe broken for the purpose of testing, and that the number of messages<br/>\nin the protocol of a class should be minimized. I also agree that it<br/>\nwould be wrong to haphazardly create a new class and move a method<br/>\nthere /just/ so that the method could be public for testing.<br/>\n<br/>\nAs I stated in a previous post, my classes tend to have a lot of<br/>\nprivate methods because I refactor aggressively and try to keep<br/>\nmethods to only a few lines at the same level of abstraction. I don&#39;t<br/>\nfeel a need to test those private methods separately because I know<br/>\nwhy they are there and that the code is already being tested through<br/>\nthe public API. <br/>\n<br/>\nFirst please remember that this list was not intended as solutions to<br/>\nhaving private methods but as ideas about what alternatives might be<br/>\nconsidered prior to simply making a method public so that it can be<br/>\ntested. Sometimes -- perhaps not often -- there is a second<br/>\nabstraction hiding within the class. My suggestion was merely to<br/>\nconsider that as a possibility. It was low on the list; perhaps it<br/>\nshould be lower ...<br/>\n<br/>\nRegards,<br/>\nJim</div>", 
    "prevInTime": 14573, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1125599459", 
    "canDelete": false, 
    "nextInTopic": 14575, 
    "prevInTopic": 14573, 
    "headers": {
        "inReplyToHeader": "PDQzMTczOTIwLjgwODA4MDBAbWV0YWxhYi51bmMuZWR1Pg==", 
        "messageIdInHeader": "PGRmN2hkMytkMnRuQGVHcm91cHMuY29tPg=="
    }
}