{
    "numMessagesInTopic": 125, 
    "nextInTime": 14574, 
    "senderId": "N5ebEIOJt7UFvFpdUa_TR3wdUbxPVtLV5Uuax7E1r712mSDZRqyRy7CA1gj5Zuz2YmCKfKDKCdwA35A03ZjcRARjLOaY8gLWgZhIOT39R--PZsU", 
    "systemMessage": true, 
    "subject": "Re: How to test private methods in a class.", 
    "from": "&quot;Jim Cakalic&quot; &lt;james.p.cakalic@...&gt;", 
    "authorName": "Jim Cakalic", 
    "msgSnippet": "... David, This is the way I practice TDD as well -- test first. I ve been learning that not everyone is as disciplined as we are. Code coverage tools /can/ be", 
    "msgId": 14573, 
    "profile": "jim_cakalic", 
    "topicId": 14490, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 226509834, 
    "messageBody": "<div id=\"ygrps-yiv-1136136003\">David Jackman wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Actually, if you were really following TDD then you wouldn&#39;t have<br/>\n&gt; the private method unless it was already covered by tests.  At<br/>\n&gt; least that&#39;s the methodology I use (no change happens to my code<br/>\n&gt; until there&#39;s a failing test forcing the change, except for<br/>\n&gt; refactoring).  So the code coverage tool shouldn&#39;t be (as)<br/>\n&gt; necessary.  I&#39;ve found I only use them for those project where<br/>\n&gt; (someone else :) wrote the code without writing tests first.<br/>\n&gt; In that case, it helps to know the coverage, but also can give<br/>\n&gt; me a false sense of security.<br/>\n&gt;  <br/>\n<br/>\n </span></blockquote>David,<br/>\n<br/>\nThis is the way I practice TDD as well -- test first. I&#39;ve been<br/>\nlearning that not everyone is as disciplined as we are. Code coverage<br/>\ntools /can/ be a two-edged sword. I use it as an audit check for how<br/>\nwell I&#39;m adhering to TDD. Sometimes I can still slip and this helps me<br/>\nidentify my own backsliding ways early so I can correct the problem by<br/>\nadding the right tests. But you are correct, just because the code is<br/>\nbeing executed by a test does not mean that it is adequately tested.<br/>\n<br/>\nMy recommendation was that a coverage tool be used to provide<br/>\nconfidence that private methods are being executed by existing tests<br/>\nthrough the public API. The impluse that leads to making the private<br/>\nmethod public for testing might diminish if one could be shown that<br/>\nthere was no need. Do you think it would be preferable in that context<br/>\nto measure code coverage before making methods public?<br/>\n<br/>\nRegards,<br/>\nJim</div>", 
    "prevInTime": 14572, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1125600210", 
    "canDelete": false, 
    "nextInTopic": 14574, 
    "prevInTopic": 14572, 
    "headers": {
        "inReplyToHeader": "PDBFMEU5QUVDNjJEMUZDNDA4QjUwMjRCQ0ZEQTg4NkVBMjJFM0NEQHNsY2VzMDEuYWQuZmFzdC5ubz4=", 
        "messageIdInHeader": "PGRmN2k0aSs5OGdhQGVHcm91cHMuY29tPg=="
    }
}