{
    "numMessagesInTopic": 125, 
    "nextInTime": 14609, 
    "senderId": "DNH5f3Tsi9DouP9MTQHt9Nmwqh6d_RDi2HlTfEzdjrlBtM3S02WiJduMSovqHtUdpSv3IFvYQKkM-EWf22a2FmooODpzOCY8lQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] How to test private methods in a class.", 
    "from": "Robert Watkins &lt;yahoo@...&gt;", 
    "authorName": "Robert Watkins", 
    "msgSnippet": "... That s not strictly true, Elliotte. Firstly, if you ve got factories for your domain objects, you can verify that your factories are used correctly, via", 
    "msgId": 14608, 
    "profile": "robertdw26", 
    "topicId": 14490, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 189784721, 
    "messageBody": "<div id=\"ygrps-yiv-948950824\">Elliotte Harold wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Public interfaces.<br/>\n&gt;&gt; <br/>\n&gt;&gt; Public factories.<br/>\n&gt;&gt; <br/>\n&gt;&gt; Package-private implementations, in the package of the factory.<br/>\n&gt;&gt; <br/>\n&gt;  <br/>\n&gt;<br/>\n&gt;<br/>\n&gt;One more related problem with this: you&#39;ve basically thrown away final. <br/>\n&gt;It becomes possible to replace any component of the system, and in so <br/>\n&gt;doing to change the behavior of systems in unexpected and arbitrary <br/>\n&gt;ways. You can rely on nothing. You can no longer assume that objects do <br/>\n&gt;what you expect them to. Again, not all languages have this problem with <br/>\n&gt;interface-based designs; but Java does.  :-( <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>That&#39;s not strictly true, Elliotte.<br/>\n<br/>\nFirstly, if you&#39;ve got factories for your domain objects, you can verify <br/>\nthat your factories are used correctly, via coding conventions and <br/>\nanalysis tools (e.g. checkstyle). Testing your factories is pretty <br/>\nsimply, as a general rule. In general, factories tend to be safer to use <br/>\nthan constructors, anyway, so you actually gain from the factories.<br/>\n<br/>\nSecondly, you can&#39;t rely on objects to define behaviour in stone, <br/>\nanyway. Maybe someone came along and removed that pesky &quot;final&quot; keyword <br/>\n(either directly or via bytecode engineering). Or perhaps they&#39;ve simply <br/>\nswapped the class out with another one that matches the same interface. <br/>\nIn short, you can only rely on &quot;final&quot; to lock down behaviour if you&#39;re <br/>\nthe only one writing the source code.<br/>\n<br/>\nThirdly, interfaces define contracts. Implementations which do not <br/>\nconform to the contracts aren&#39;t socially responsible - you shouldn&#39;t <br/>\nbuild them that way. How do you make sure you build them right? Testing, <br/>\npeer reviews, and well-defined types.<br/>\n<br/>\nFinally: the very fact that you can change the implementation randomly <br/>\nis a benefit, not a problem. In particular, unit test code gains from <br/>\nbeing able to provide an arbitrary implementation of an interface that <br/>\nit just can&#39;t do with a class.<br/>\n<br/>\nIt sounds like you&#39;ve got some fairly serious trust issues about the <br/>\ncompetence and/or integrity of the developers you work with, if you&#39;re <br/>\ntrying to lock down their behaviour that tightly. Is that a fair assessment?<br/>\n<br/>\nRobert.</div>", 
    "prevInTime": 14607, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1125669270", 
    "canDelete": false, 
    "nextInTopic": 14609, 
    "prevInTopic": 14606, 
    "headers": {
        "inReplyToHeader": "PDExMjU2Njg0OTEuNzUzLjQzOTA1Lm0xOUB5YWhvb2dyb3Vwcy5jb20+", 
        "messageIdInHeader": "PDQzMTg1OTk2LjUwMDAxMDlAdHdhc2luay5uZXQ+", 
        "referencesHeader": "PDExMjU2Njg0OTEuNzUzLjQzOTA1Lm0xOUB5YWhvb2dyb3Vwcy5jb20+"
    }
}