{
    "numMessagesInTopic": 125, 
    "nextInTime": 14615, 
    "senderId": "7dI50o8CW84weRwAnKkTBnM9FeREQxc9Pk7vhKO5S4k9RyM8nwL15nK0cQ-U8GEI5KQPgoEv7gwG6MQuj9Uc_2rjT-Dj7BcyLRFZtUVjh9EWUbM", 
    "systemMessage": true, 
    "subject": "Re: How to test private methods in a class.", 
    "from": "&quot;Jim Cakalic&quot; &lt;james.p.cakalic@...&gt;", 
    "authorName": "Jim Cakalic", 
    "msgSnippet": "... Hmm. I assumed -- perhaps with the well-known and predictable result -- that the original question arose from a testing philosophy that was ", 
    "msgId": 14614, 
    "profile": "jim_cakalic", 
    "topicId": 14490, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 226509834, 
    "messageBody": "<div id=\"ygrps-yiv-823288363\">Ilja Preuss wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; I also agree that it would be wrong to haphazardly<br/>\n&gt; &gt; create a new class and move a method there /just/ <br/>\n&gt; &gt; so that the method could be public for testing.<br/>\n&gt; <br/>\n&gt; It&#39;s hard to disagree with that. As far as I know, noone <br/>\n&gt; proposed to do anything &quot;haphazardly&quot;.<br/>\n&gt; <br/>\n&gt; Again, what I would propose is to meditate deeply about <br/>\n&gt; the design, in the hope to find a better one where the method<br/>\n&gt; is public.<br/>\n&gt; <br/>\n&gt; A private method that is complex enough to need explicite<br/>\n&gt; testing *is* a hint that the design can be improved.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Hmm. I &quot;assumed&quot; -- perhaps with the well-known and predictable result<br/>\n-- that the original question arose from a testing philosophy that was<br/>\nmethod-oriented as opposed to design-intention-oriented. In other<br/>\nwords, the question arises because one&#39;s mental orientation is towards<br/>\nwriting tests for methods. Upon comparing the list of all methods on a<br/>\nclass and the test methods for the class, we find that there are<br/>\nnon-public methods that do not have a corresponding test. (It usually<br/>\neasiy to make this comparison with method-oriented tests because my<br/>\ntest method names are typically a concatenation of &quot;test&quot; and the<br/>\nclass&#39;s method name.) So, to write a test for the method, I make it<br/>\npublic. Voila! Testable! I&#39;d tend to call that haphazard because IMO<br/>\nit is not done with any particular concern about the design<br/>\nramifications of that decision. <br/>\n<br/>\nYes, yes, I know, legacy code. Different concern. Not what I thought<br/>\nthe question was about. Please don&#39;t blast me even though I probably<br/>\ndeserve it.<br/>\n<br/>\nAs for a private method being complex enough to need explicit testing,<br/>\nI&#39;ll return to my original platform -- private methods should only<br/>\nexist when they occur as part of the normal red/green/refactor cycle.<br/>\nI wouldn&#39;t normally write private methods in the red or green phases.<br/>\nI&#39;d likely create them as part of refactoring to eliminate code smells<br/>\nlike duplicated code, long method, and switch statements. I would<br/>\nextract methods to give short bits of code intention-revealing names.<br/>\nThe point of all this refactoring and private-method-begetting is to<br/>\nchange the class &quot;in such a way that it does not alter the external<br/>\nbehavior of the code yet improves its internal structure.&quot; -- Fowler,<br/>\n/Refactoring/. Since my tests ought to be written to verify the<br/>\nexternally visible behavior, and all I&#39;ve done is change the structure<br/>\nin a way that does not alter that behavior, then it shouldn&#39;t matter<br/>\n/how/ complex the private method is. It is already tested. At least as<br/>\nlong as I haven&#39;t betrayed myself and implemented new functionality at<br/>\nthe same time :-o<br/>\n<br/>\nI agree with &quot;meditate deeply about the design.&quot; I can&#39;t agree at this<br/>\npoint that what I should be meditating on is how to find a better way<br/>\nto make the method public.<br/>\n<br/>\nRegards,<br/>\nJim</div>", 
    "prevInTime": 14613, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1125669502", 
    "canDelete": false, 
    "nextInTopic": 14615, 
    "prevInTopic": 14612, 
    "headers": {
        "inReplyToHeader": "PDAwMjMwMWM1YWY4YiQ3ZjI1ZGQzMCQ3MDY0YThjMEBkaXN5Lm5ldD4=", 
        "messageIdInHeader": "PGRmOWxwdSs2ZG9oQGVHcm91cHMuY29tPg=="
    }
}