{
    "topicId": 14490, 
    "postDate": "1125673743", 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "from": "Elliotte Harold &lt;elharo@...&gt;", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "lSKEmAfKOnyIjarUX_Ryul-3abJlYRt3zJ7Aaulgy1qA3Tm28r0-G2KPiGrKtffoNNWxIv2og0v74HLRsImdBP2BAN_rmC-bICgs-g4nrQ", 
    "nextInTime": 14617, 
    "userId": 12653864, 
    "prevInTime": 14615, 
    "prevInTopic": 14615, 
    "headers": {
        "inReplyToHeader": "PDQzMTg1OTk2LjUwMDAxMDlAdHdhc2luay5uZXQ+", 
        "messageIdInHeader": "PDQzMTg2QjBGLjMwMTAyQG1ldGFsYWIudW5jLmVkdT4=", 
        "referencesHeader": "PDExMjU2Njg0OTEuNzUzLjQzOTA1Lm0xOUB5YWhvb2dyb3Vwcy5jb20+IDw0MzE4NTk5Ni41MDAwMTA5QHR3YXNpbmsubmV0Pg=="
    }, 
    "authorName": "Elliotte Harold", 
    "numMessagesInTopic": 125, 
    "msgSnippet": "... None of which prevents somebody from writing their own implementation of the interface, instantiating it and bypassing the factories completely. ... The", 
    "contentTrasformed": false, 
    "msgId": 14616, 
    "nextInTopic": 14617, 
    "systemMessage": false, 
    "rawEmail": "Return-Path: &lt;elharo@...&gt;\r\nX-Sender: elharo@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 54427 invoked from network); 2 Sep 2005 15:10:07 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m35.grp.scd.yahoo.com with QMQP; 2 Sep 2005 15:10:07 -0000\r\nReceived: from unknown (HELO mail27.sea5.speakeasy.net) (69.17.117.29)\n  by mta3.grp.scd.yahoo.com with SMTP; 2 Sep 2005 15:10:07 -0000\r\nReceived: (qmail 31817 invoked from network); 2 Sep 2005 15:09:06 -0000\r\nReceived: from dsl254-067-087.nyc1.dsl.speakeasy.net (HELO [192.168.254.100]) (elharo@[216.254.67.87])\n          (envelope-sender &lt;elharo@...&gt;)\n          by mail27.sea5.speakeasy.net (qmail-ldap-1.03) with AES256-SHA encrypted SMTP\n          for &lt;junit@yahoogroups.com&gt;; 2 Sep 2005 15:09:06 -0000\r\nMessage-ID: &lt;43186B0F.30102@...&gt;\r\nDate: Fri, 02 Sep 2005 11:09:03 -0400\r\nUser-Agent: Mozilla Thunderbird 1.0+ (Macintosh/20050712)\r\nMIME-Version: 1.0\r\nTo: junit@yahoogroups.com\r\nReferences: &lt;1125668491.753.43905.m19@yahoogroups.com&gt; &lt;43185996.5000109@...&gt;\r\nIn-Reply-To: &lt;43185996.5000109@...&gt;\r\nContent-Type: text/plain; charset=UTF-8; format=flowed\r\nContent-Transfer-Encoding: 8bit\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: Elliotte Harold &lt;elharo@...&gt;\r\nSubject: Re: [junit] How to test private methods in a class.\r\nX-Yahoo-Group-Post: member; u=12653864; y=CSZtaGsq6hw8Pfs9h351D3PxWXhzw6E7KR36JeY5MI0DdqqZ\r\n\r\nRobert Watkins wrote:\n\n&gt; Firstly, if you&#39;ve got factories for your domain objects, you can verify \n&gt; that your factories are used correctly, via coding conventions and \n&gt; analysis tools (e.g. checkstyle). Testing your factories is pretty \n&gt; simply, as a general rule. In general, factories tend to be safer to use \n&gt; than constructors, anyway, so you actually gain from the factories.\n\nNone of which prevents somebody from writing their own implementation of \nthe interface, instantiating it and bypassing the factories completely.\n\n&gt; Secondly, you can&#39;t rely on objects to define behaviour in stone, \n&gt; anyway. Maybe someone came along and removed that pesky &quot;final&quot; keyword \n&gt; (either directly or via bytecode engineering). Or perhaps they&#39;ve simply \n&gt; swapped the class out with another one that matches the same interface. \n&gt; In short, you can only rely on &quot;final&quot; to lock down behaviour if you&#39;re \n&gt; the only one writing the source code.\n\n\nThe source (or byte) code can always be forked. At that point it&#39;s out \nof my hands, and not really my responsibility. But they can&#39;t just swap \nout my class for a different one, if I&#39;ve written the implementation to \ndepend on classes rather than interfaces. That&#39;s pretty much the point.\n\n&gt; Thirdly, interfaces define contracts. Implementations which do not \n&gt; conform to the contracts aren&#39;t socially responsible - you shouldn&#39;t \n&gt; build them that way. How do you make sure you build them right? Testing, \n&gt; peer reviews, and well-defined types.\n\nAll good ideas, but if this were sufficient we never would have needed \naccess protection in the first place.\n\n&gt; Finally: the very fact that you can change the implementation randomly \n&gt; is a benefit, not a problem. In particular, unit test code gains from \n&gt; being able to provide an arbitrary implementation of an interface that \n&gt; it just can&#39;t do with a class.\n\nIn other words, you can write an implementation that passes the test \neven if the real implementation doesn&#39;t. How does that help?\n\n&gt; It sounds like you&#39;ve got some fairly serious trust issues about the \n&gt; competence and/or integrity of the developers you work with, if you&#39;re \n&gt; trying to lock down their behaviour that tightly. Is that a fair assessment?\n\nThe developers I work with are everyone who downloads my code. Some of \nthem I trust. Some of them I don&#39;t. They range in skill levels from \nextremely experienced, wise, knowledgeable developers like Michael Kay \nto random undergraduates and unreconstructed COBOL hacks. However one \nthing they all have in common is that they&#39;re using my code because they \nimplicitly or explicitly trust me and my library(s). I promise that the \nlibrary behaves in a certain way under certain conditions and \naccomplishes certain tasks. I can do this only because my libraries are \ndesigned around concrete classes. Were the library designed around \ninterfaces instead, I could no no longer make such promises. Even my own \ncode that I trust could be compromised were someone to inject a \nmisbehaving implementation they themselves had written. Few classes \noperate in isolation. I code my FOO class under the assumption that the \nBAR class behaves in a certain way. If someone replaces the BAR class \nwith a misbehaving version, then not just BAR but also FOO and \neverything else that depends on it could be compromised.\n\n-- \n﻿Elliotte Rusty Harold  elharo@...\nXML in a Nutshell 3rd Edition Just Published!\nhttp://www.cafeconleche.org/books/xian3/\nhttp://www.amazon.com/exec/obidos/ISBN=0596007647/cafeaulaitA/ref=nosim\n\n", 
    "subject": "Re: [junit] How to test private methods in a class."
}