{
    "numMessagesInTopic": 57, 
    "nextInTime": 1466, 
    "senderId": "o9NSJ6NgmNhMVaoqiQP4vD63EDJgeyFCADpyC93jKT6BBGODYds1fE6CffJ1tVR6GkUzmub4d7YgdBw03IAj5XSJeGqYNulxR57UOTZei0ScnuM", 
    "systemMessage": false, 
    "subject": "RE: RE: [junit] Best Practice for Tests ?", 
    "from": "&quot;Jason Rogers&quot; &lt;jason.rogers@...&gt;", 
    "authorName": "Jason Rogers", 
    "msgSnippet": "... Why do you say that?  I think this is pure speculation, but if you have some actual metrics I would be interested in seeing them. ... Again, I am baffled", 
    "msgId": 1465, 
    "topicId": 1411, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-2030564395\"><blockquote><span title=\"ireply\">&gt; Lurker here, but I thought I&#39;d chime in to agree with<br/>\n    &gt; Vladimir on this.  In an ideal world, test cases might<br/>\n    &gt; stay separate, but the first hurdle is often just<br/>\n    &gt; getting developers to write them, and that&#39;s a lot<br/>\n    &gt; easier to manage when the test case lives in the same<br/>\n    &gt; package as their code.<br/>\n<br/>\n </span></blockquote>Why do you say that?  I think this is pure speculation, but if you have some<br/>\nactual metrics I would be interested in seeing them.<br/>\n<br/>\n<blockquote><span title=\"ireply\">     &gt; Co-mingling increases the chances that they&#39;ll use the<br/>\n    &gt; test case for all of their incremental testing<br/>\n    &gt; (instead of writing little mini-clients or main()<br/>\n    &gt; methods to test/debug), and helps make unit testing<br/>\n    &gt; seem like part of the development process instead of a<br/>\n    &gt; post-coding chore.  <br/>\n<br/>\n </span></blockquote>Again, I am baffled at your logic, but if you have actual results please<br/>\nshare them.<br/>\n <br/>\n<blockquote><span title=\"ireply\">     &gt; We can always auto-repackage stuff later, <br/>\n<br/>\n </span></blockquote>This is a burden on the process.  If tests are going to be split out anyway,<br/>\nand there is no good design reason why they should be with production code,<br/>\nthen initially put them where they are intended to be.  Also, depending on<br/>\nyour source control system, this could be somewhat detrimental to your<br/>\ncompany&#39;s history markers and metrics.  Moving a class out of one package to<br/>\nanother (which we must do from time to time) will cause another root to be<br/>\nformed in the new package and an orphaned leaf in the old.  You could lose<br/>\nvaluable history.  Not to mention that in distributed team environments<br/>\nothers may be expecting for your class(es) to be &quot;in the same ol&#39; place&quot; and<br/>\nif you move them, you cause some degree of hassle.  Sometimes this is<br/>\nunavoidable, but I think it is a bad practice to get into.<br/>\n<br/>\n<blockquote><span title=\"ireply\">     &gt; but in my<br/>\n    &gt; experience, it&#39;s not always easy to get people to go<br/>\n    &gt; back and write test cases when there&#39;s more<br/>\n    &gt; interesting work to be done.<br/>\n<br/>\n </span></blockquote>That is a fault of not doing test-first which you will face no matter where<br/>\nthe test cases live.  The thought in my mind is that tests are an integral<br/>\npart of the system, they drive the design for us (in XP).  They are not some<br/>\nspecial case group of bastardized objects that can be taken or not.  They<br/>\nare essential.  Don Wells once said (I believe it was Don, if anyone knows<br/>\ndifferently please correct me), &quot;Throw away my code, but never throw away my<br/>\ntests.&quot;  Point being that he would be able to rebuild the system again from<br/>\nscratch if he had the tests.  If you threw away the tests and gave him the<br/>\nproduction code, he would be floundering in agony to reproduce all of those<br/>\ntests.<br/>\n<br/>\nTests are not simply obilgatory objects that satisfy some requirements from<br/>\nmanagement... they are the life-sustaining power of the code, in my opinion!<br/>\n<br/>\n-Jason</div>", 
    "prevInTime": 1464, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "992346026", 
    "canDelete": false, 
    "nextInTopic": 1466, 
    "prevInTopic": 1464, 
    "headers": {
        "messageIdInHeader": "PDg3RUU2QjIxQzYyNEQ1MTFCNzI0MDAxMDRCQ0YxRUIwMUY2MDJDQGV4Y2g+"
    }
}