{
    "numMessagesInTopic": 125, 
    "nextInTime": 14672, 
    "senderId": "pA4XpjqU3Q8J-D1CCDVUkTOLWsAgHbIUSXPN81SBxo_aPq8Igt8WhOjgDPlQeFzii0snlNIMs9HWkYyCQ78_dMw5gCC5eKHS2DMyZf9GEg", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: How to test private methods in a class.", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... I m not in the business of using code to protect people from their own carelessness. I provide good documentation in the form of a roadmap, some Javadoc", 
    "msgId": 14671, 
    "profile": "nails762", 
    "topicId": 14490, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-815623310\">Elliotte Harold wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; J. B. Rainsberger wrote:<br/>\n&gt; <br/>\n&gt;  &gt; private is not the only way, nor necessarily the best way, to hide<br/>\n&gt;  &gt; implementation details. I use interfaces instead.<br/>\n&gt; <br/>\n&gt; With a lot of care this would work in some situations. If you made the<br/>\n&gt; classes the that implemented the interfaces non-public, and provided<br/>\n&gt; access to them through some sort of factory, it might work.  It&#39;s more<br/>\n&gt; complex but doable. You need to be careful not to expose the<br/>\n&gt; implementation classes or people will use them in preference to the<br/>\n&gt; interfaces, either deliberately or out of carelessness. If they write<br/>\n&gt; their own implementations then you&#39;re virtually guaranteed they&#39;ll code<br/>\n&gt; to the class rather than the interface. I see this all the time.<br/>\n<br/>\n </span></blockquote>I&#39;m not in the business of using code to protect people from their own <br/>\ncarelessness. I provide good documentation in the form of a roadmap, <br/>\nsome Javadoc and tests. If, after all that, they insist on being <br/>\ncareless or lazy, then they deserve whatever they get.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The real problem though is that Java is not designed to work this way.<br/>\n&gt; Interfaces are not meant to replace classes. In particular, the lack of<br/>\n&gt; method preconditions and postconditions means that you can no longer<br/>\n&gt; make any promises about what a given method accepts or returns beyond<br/>\n&gt; the simple return type. The reason we have access protection as a<br/>\n&gt; language feature is because we cannot rely on programmer convention to<br/>\n&gt; enforce rules. Using interfaces instead of classes reduces us to using<br/>\n&gt; programmer convention to enforce constraints that should be enforced in<br/>\n&gt; code. There are languages where preconditions and postconditions are<br/>\n&gt; part of the method signature, and in these languages, using interfaces<br/>\n&gt; instead of classes is feasible. However, Java is not such a language. :-(<br/>\n<br/>\n </span></blockquote>I agree that we cannot always rely on programmer convention to enforce <br/>\nrules; but I disagree that access protection is a desired solution, so I <br/>\ndon&#39;t use it. Tests help. Other documentation helps. Even so, the market <br/>\nfor my APIs doesn&#39;t include the terminally stupid. I realize that&#39;s <br/>\nharsh, but it&#39;s how I really feel. If I&#39;m writing code that the rest of <br/>\nthe team will use, then I can simply tell them where to look to find out <br/>\nhow it works, and be prepared to field questions. If I&#39;m writing code <br/>\nthat the rest of the world will use, then I write a roadmap, publish the <br/>\ntests and include my e-mail address. It&#39;s working so far.<br/>\n-- <br/>\nJ. B. (Joe) Rainsberger<br/>\nDiaspar Software Services<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com\">http://www.diasparsoftware.com</a><br/>\n2005 Gordon Pask Award Winner for contribution to Agile practice<br/>\nAuthor, JUnit Recipes: Practical Methods for Programmer Testing</div>", 
    "prevInTime": 14670, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1125664549", 
    "canDelete": false, 
    "nextInTopic": 14673, 
    "prevInTopic": 14670, 
    "headers": {
        "inReplyToHeader": "PDQzMTgyRTdCLjQwMjA3MDVAbWV0YWxhYi51bmMuZWR1Pg==", 
        "messageIdInHeader": "PDQzMTg0NzI1LjEwNDA5MDdAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PGRmNzRtZSt1ZmN0QGVHcm91cHMuY29tPiA8NDMxNzM5MjAuODA4MDgwMEBtZXRhbGFiLnVuYy5lZHU+IDw0MzE3Qjk3Qi4yMDkwNTA4QHJvZ2Vycy5jb20+IDw0MzE4MkU3Qi40MDIwNzA1QG1ldGFsYWIudW5jLmVkdT4="
    }
}