{
    "numMessagesInTopic": 125, 
    "nextInTime": 14674, 
    "senderId": "1p8gKPtJcECatAGJ-ASfwv45cyRCtBnnWPFwIvYE2fOaLGp9XWmbVQpWdRiqrjMOTvwxNuuqO0RMmK1DW7xyVPehrsdKU52AhBJujgPPUSvpcYw", 
    "systemMessage": true, 
    "subject": "Re: How to test private methods in a class.", 
    "from": "&quot;Jim Cakalic&quot; &lt;james.p.cakalic@...&gt;", 
    "authorName": "Jim Cakalic", 
    "msgSnippet": "... Hmm. Sounds like you have your Designer hat on. That wasn t what I understood to be the context of the question. How do I test a private method is a", 
    "msgId": 14673, 
    "profile": "jim_cakalic", 
    "topicId": 14490, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 226509834, 
    "messageBody": "<div id=\"ygrps-yiv-1093408842\">Ilja Preuss wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt; The trick is to refactor it so that it moves to a different class<br/>\n&gt; &gt;&gt; where it *should* be public. And in my experience, that&#39;s very<br/>\n&gt; &gt;&gt; likely always possible, in a way that makes the design more<br/>\n&gt; &gt;&gt; flexible and the behaviour more reusable. <br/>\n&gt; &gt;&gt; <br/>\n&gt; &gt;&gt; Does that sound reasonable?<br/>\n&gt; &gt; <br/>\n&gt; &gt; 1. Are you doing this /just/ so that you can test the method<br/>\n&gt; &gt; by external invocation? If so then my answer is no. 2. Is the<br/>\n&gt; &gt; method already tested through the public API of the class? If<br/>\n&gt; &gt; yes then my answer is no. 3. Does the system (code plus<br/>\n&gt; &gt; tests) clearly communicate everything that needs to be<br/>\n&gt; &gt; communicated at this time? If it does then my answer is no.<br/>\n&gt; &gt; 4. Is the flexibility and reusability that you refer to<br/>\n&gt; &gt; needed now or is it speculative? If the latter then my answer<br/>\n&gt; &gt; is no. 5. Was my answer no to the previous questions and<br/>\n&gt; &gt; there are more stories needing to be implemented this iteration?<br/>\n&gt; &gt; Then heck no! <br/>\n&gt; <br/>\n&gt; I&#39;m not doing this &quot;just&quot; for one thing. In my experience moving a<br/>\n&gt; complex method to a place where it wants to be public both<br/>\n&gt; <br/>\n&gt; - makes the code more expressive,<br/>\n&gt; - makes the code easier to test,<br/>\n&gt; - makes the code more flexible, and thereby<br/>\n&gt; - helps me to maintain a high velocity.<br/>\n&gt; <br/>\n&gt; Also keep in mind that moving the method often is only a first step,<br/>\n&gt; an enabler for further simplifying refactorings.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Hmm. Sounds like you have your &quot;Designer&quot; hat on. That wasn&#39;t what I<br/>\nunderstood to be the context of the question. &quot;How do I test a private<br/>\nmethod&quot; is a question someone wearing their &quot;Tester&quot; hat would ask.<br/>\nGiven that context, my mind hasn&#39;t changed. If the private method is<br/>\nalready tested through an existing public method then you don&#39;t need<br/>\nto do anything. In fact, exposing the method and writing an explicit<br/>\ntest against it is duplication.<br/>\n<br/>\nDoes that mean I believe Extract Class and Move Method are never used.<br/>\nOf course not! But I don&#39;t think they provide a solution, per se, to<br/>\n&quot;How do I test a private method&quot; unless the context includes &quot;This<br/>\nwasn&#39;t developed TDD and I don&#39;t have any confidence in it.&quot;<br/>\n<br/>\nMaybe I&#39;m wrong about this, but I tend to view each of the<br/>\nrefactorings as a mini-pattern: a solution to a problem in a context.<br/>\nEach refactoring describes a motivation which includes the context.<br/>\nFor example, the motivation for Extract Class as described in<br/>\n/Refactoring/ is that the class has too many responsibilities and has<br/>\nlost cohesion. I don&#39;t see anything there about using the refactoring<br/>\nto expose private methods of the class for testing. Likewise, the<br/>\nmotivation for Move Method doesn&#39;t include not being able to test a<br/>\nmethod because of access restrictions. <br/>\n<br/>\nMaybe Martin Fowler wasn&#39;t wearing his Tester hat at the time. Maybe<br/>\nhe was and wanted to write a book about how to produce better designs,<br/>\nnot about solving problems with unit tests. So, third maybe in a row,<br/>\nmaybe refactorings shouldn&#39;t be viewed as ways to solve problems with<br/>\nyour the test suite? Or, maybe it would be an interesting topic to<br/>\nwrite an article on -- how to apply refactorings when your focus is<br/>\ntesting and not design.<br/>\n<br/>\nRegards,<br/>\nJim</div>", 
    "prevInTime": 14672, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1125942726", 
    "canDelete": false, 
    "nextInTopic": 14677, 
    "prevInTopic": 14671, 
    "headers": {
        "inReplyToHeader": "PDAwNzAwMWM1YjFlZCQ1NzU3MWVlMCQ3MDY0YThjMEBkaXN5Lm5ldD4=", 
        "messageIdInHeader": "PGRmaTBrNitqdmJqQGVHcm91cHMuY29tPg=="
    }
}