{
    "numMessagesInTopic": 125, 
    "nextInTime": 14682, 
    "senderId": "HmZLj-iELEB-Y7DnfFS2kMcG37ujSEE_LIlyBt-r1qWuVkyq3wq6sd8C7pXt6DOQSUL2TewAFzmu1IZK2qjIBwYGxCj_xg", 
    "systemMessage": false, 
    "subject": "RE: [junit] Re: How to test private methods in a class.", 
    "from": "&quot;Ilja Preuss&quot; &lt;preuss@...&gt;", 
    "authorName": "Ilja Preuss", 
    "msgSnippet": "... I find that writing tests helps me a lot thinking about the design, so I m not a fan of switching my design brain off while writing tests. I m not sure why", 
    "msgId": 14681, 
    "profile": "ipreussde", 
    "topicId": 14490, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 96623270, 
    "messageBody": "<div id=\"ygrps-yiv-1988296859\"><blockquote><span title=\"ireply\">&gt; Hmm. Sounds like you have your &quot;Designer&quot; hat on. That wasn&#39;t<br/>\n&gt; what I understood to be the context of the question. &quot;How do<br/>\n&gt; I test a private method&quot; is a question someone wearing their<br/>\n&gt; &quot;Tester&quot; hat would ask.<br/>\n<br/>\n </span></blockquote>I find that writing tests helps me a lot thinking about the design, so I&#39;m<br/>\nnot a fan of switching my design brain off while writing tests. I&#39;m not sure<br/>\nwhy you would want to do that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Given that context, my mind hasn&#39;t<br/>\n&gt; changed. If the private method is already tested through an<br/>\n&gt; existing public method then you don&#39;t need to do anything. In<br/>\n&gt; fact, exposing the method and writing an explicit test against it is<br/>\n&gt; duplication. <br/>\n<br/>\n </span></blockquote>Unless the tests of the already existing public method can be simplified in<br/>\nconsequence.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Does that mean I believe Extract Class and Move Method are<br/>\n&gt; never used. Of course not! But I don&#39;t think they provide a<br/>\n&gt; solution, per se, to &quot;How do I test a private method&quot; unless<br/>\n&gt; the context includes &quot;This wasn&#39;t developed TDD and I don&#39;t have any<br/>\n&gt; confidence in it.&quot; <br/>\n<br/>\n </span></blockquote>I&#39;m confused, because TDD is much more a design practice than a testing<br/>\npractice. Anyway, I don&#39;t think I proposed anything as &quot;a solution per se&quot;,<br/>\nbut said that it would be one of the first things I&#39;d think about, and that<br/>\nI very often find that I find a solution I like when I do so.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe I&#39;m wrong about this, but I tend to view each of the<br/>\n&gt; refactorings as a mini-pattern: a solution to a problem in a<br/>\n&gt; context. Each refactoring describes a motivation which<br/>\n&gt; includes the context. For example, the motivation for Extract<br/>\n&gt; Class as described in /Refactoring/ is that the class has too<br/>\n&gt; many responsibilities and has lost cohesion. I don&#39;t see<br/>\n&gt; anything there about using the refactoring to expose private<br/>\n&gt; methods of the class for testing. Likewise, the motivation<br/>\n&gt; for Move Method doesn&#39;t include not being able to test a<br/>\n&gt; method because of access restrictions.<br/>\n<br/>\n </span></blockquote>A private method that is complex enough to need explicite testing simply is<br/>\na hint to a class that has too many responsibilities and has lost cohesion.<br/>\nA class that has just one responsibility is quite unlikely to be complex,<br/>\nlet alone have complex private methods.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe Martin Fowler wasn&#39;t wearing his Tester hat at the<br/>\n&gt; time. Maybe he was and wanted to write a book about how to<br/>\n&gt; produce better designs, not about solving problems with unit<br/>\n&gt; tests.<br/>\n<br/>\n </span></blockquote>If I remember correctly, he put a chapter about Code Smells in the book -<br/>\nabout hints in the code that you should refactor. Well, I think that a<br/>\nprivate method that needs explicite testing is such a smell.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, third maybe in a row, maybe refactorings shouldn&#39;t<br/>\n&gt; be viewed as ways to solve problems with your the test suite?<br/>\n<br/>\n </span></blockquote>If your design is in the way while writing tests, it looks like a design<br/>\nproblem to me. So I don&#39;t see why we should exclude refactoring as a viable<br/>\nsolution.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Or, maybe it would be an interesting topic to write an<br/>\n&gt; article on -- how to apply refactorings when your focus is testing<br/>\n&gt; and not design. <br/>\n<br/>\n </span></blockquote>I really have problems following this whole notion of &quot;focus on testing&quot; as<br/>\nsomething that excludes thinking about design. It&#39;s just not the way I work,<br/>\nI guess.<br/>\n<br/>\nCheers, Ilja</div>", 
    "prevInTime": 14680, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1125996518", 
    "canDelete": false, 
    "nextInTopic": 14684, 
    "prevInTopic": 14678, 
    "headers": {
        "inReplyToHeader": "PGRmaTBrNitqdmJqQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDAwMGYwMWM1YjJiZiRjNjcyNjJkMCQ3MDY0YThjMEBkaXN5Lm5ldD4="
    }
}