{
    "numMessagesInTopic": 125, 
    "nextInTime": 14697, 
    "senderId": "ef2bx24nDkdObk5IllJsAW36DS0IgmgXEpWOhwYV5kkWG5l25S4Put-lD8PXbrWJ05feczoFbt1UTw2oNI4e7D368TdR8czeVoNx-yfU-ZCfBCA", 
    "systemMessage": false, 
    "subject": "Re: How to test private methods in a class.", 
    "from": "&quot;Jim Cakalic&quot; &lt;james.p.cakalic@...&gt;", 
    "authorName": "Jim Cakalic", 
    "msgSnippet": "... so I m ... not sure ... I didn t. Somebody else did when they asked the question that started this thread. But I would contend that there must be something", 
    "msgId": 14696, 
    "rawEmail": "Return-Path: &lt;james.p.cakalic@...&gt;\r\nX-Sender: james.p.cakalic@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 36024 invoked from network); 6 Sep 2005 15:53:56 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m7.grp.scd.yahoo.com with QMQP; 6 Sep 2005 15:53:56 -0000\r\nReceived: from unknown (HELO n2a.bulk.scd.yahoo.com) (66.94.237.36)\n  by mta4.grp.scd.yahoo.com with SMTP; 6 Sep 2005 15:53:56 -0000\r\nComment: DomainKeys? See http://antispam.yahoo.com/domainkeys\r\nReceived: from [66.218.69.6] by n2.bulk.scd.yahoo.com with NNFMP; 06 Sep 2005 15:53:05 -0000\r\nReceived: from [66.218.66.72] by mailer6.bulk.scd.yahoo.com with NNFMP; 06 Sep 2005 15:53:05 -0000\r\nDate: Tue, 06 Sep 2005 15:53:04 -0000\r\nTo: junit@yahoogroups.com\r\nMessage-ID: &lt;dfke10+snfh@...&gt;\r\nIn-Reply-To: &lt;000f01c5b2bf$c67262d0$7064a8c0@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 4033\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: &quot;Jim Cakalic&quot; &lt;james.p.cakalic@...&gt;\r\nSubject: Re: How to test private methods in a class.\r\nX-Yahoo-Group-Post: member; u=226509834; y=_mp9J7pC_UHgp79tfLH9c8nm4IQxTbVEtdUE4QpLRTBmjcvuCD4\r\nX-Yahoo-Profile: jim_cakalic\r\n\r\n--- In junit@yahoogroups.com, &quot;Ilja Preuss&quot; &lt;preuss@d...&gt; wrote:\n&gt; \n&gt; I find that writing tests helps me a lot thinking about the design,\nso I&#39;m\n&gt; not a fan of switching my design brain off while writing tests. I&#39;m\nnot sure\n&gt; why you would want to do that.\n&gt; \n\nI didn&#39;t. Somebody else did when they asked the question that started\nthis thread. But I would contend that there must be something wrong\nwith the practice of TDD that leads to the conclusion that the tests\ndo not adequately cover the code and the only way to get adequate\ncoverage is to make methods public.\n\n&gt; &gt; Given that context, my mind hasn&#39;t\n&gt; &gt; changed. If the private method is already tested through an\n&gt; &gt; existing public method then you don&#39;t need to do anything. In\n&gt; &gt; fact, exposing the method and writing an explicit test against it is\n&gt; &gt; duplication. \n&gt; \n&gt; Unless the tests of the already existing public method can be\nsimplified in\n&gt; consequence.\n\nThe duplication is that there will now be two tests for exactly the\nsame thing. One through the original public method (which you will\nstill want to test, no?) and another for the originally private\nmethod. The method (nee private) is now tested twice.\n\n&gt; I&#39;m confused, because TDD is much more a design practice than a testing\n&gt; practice. Anyway, I don&#39;t think I proposed anything as &quot;a solution\nper se&quot;,\n&gt; but said that it would be one of the first things I&#39;d think about,\nand that\n&gt; I very often find that I find a solution I like when I do so.\n\nI agree that TDD is more about design than testing. My point is that\nworking TDD I wouldn&#39;t think about this at all because I wouldn&#39;t\nwrite any code without a test. I wouldn&#39;t refactor until I got to\ngreen. Private methods wouldn&#39;t exist unless they were born through\nrefactoring. I don&#39;t implement new features while refactoring. As a\nresult I don&#39;t spend time thinking about how to test private methods\nunless I&#39;m responding to threads on the JUnit Yahoo! group. ;-)\n\n&gt; A private method that is complex enough to need explicite testing\nsimply is\n&gt; a hint to a class that has too many responsibilities and has lost\ncohesion.\n&gt; A class that has just one responsibility is quite unlikely to be\ncomplex,\n&gt; let alone have complex private methods.\n\nAs I said, this doesn&#39;t seem to happen to me. I&#39;m not sure where we&#39;re\ndoing things differently. Maybe it&#39;s more a hint that the developer is\ntaking steps that are too big? I don&#39;t think %LOC in private methods\nis a decent metric for measuring cohesion. But then I haven&#39;t read\nMichael Feather&#39;s blog yet.\n\n&gt; &gt; Maybe Martin Fowler wasn&#39;t wearing his Tester hat at the\n&gt; &gt; time. Maybe he was and wanted to write a book about how to\n&gt; &gt; produce better designs, not about solving problems with unit\n&gt; &gt; tests.\n&gt; \n&gt; If I remember correctly, he put a chapter about Code Smells in the\nbook -\n&gt; about hints in the code that you should refactor. Well, I think that a\n&gt; private method that needs explicite testing is such a smell.\n\nWhich one(s)?\n\n&gt; &gt; So, third maybe in a row, maybe refactorings shouldn&#39;t\n&gt; &gt; be viewed as ways to solve problems with your the test suite?\n&gt; \n&gt; If your design is in the way while writing tests, it looks like a design\n&gt; problem to me. So I don&#39;t see why we should exclude refactoring as a\nviable\n&gt; solution.\n\nI&#39;m not convinced it&#39;s a design problem. How can the design be in the\nway while writing tests if there *is* no design until you write the\ntests? How is it your design and implementation exist *before* the tests? \n\n&gt; &gt; Or, maybe it would be an interesting topic to write an\n&gt; &gt; article on -- how to apply refactorings when your focus is testing\n&gt; &gt; and not design. \n&gt; \n&gt; I really have problems following this whole notion of &quot;focus on\ntesting&quot; as\n&gt; something that excludes thinking about design. It&#39;s just not the way\nI work,\n&gt; I guess.\n\nConversely, I have problems following the notion that practicing TDD I\ncould get to place that was so bad in my design that I start\nrefactoring just so that I can test properly. Unless the code exists\nwhen I start writing the tests ...\n\nJim\n\n\n\n", 
    "profile": "jim_cakalic", 
    "topicId": 14490, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 226509834, 
    "prevInTime": 14695, 
    "contentTrasformed": false, 
    "postDate": "1126021984", 
    "canDelete": false, 
    "nextInTopic": 14700, 
    "prevInTopic": 14691, 
    "headers": {
        "inReplyToHeader": "PDAwMGYwMWM1YjJiZiRjNjcyNjJkMCQ3MDY0YThjMEBkaXN5Lm5ldD4=", 
        "messageIdInHeader": "PGRma2UxMCtzbmZoQGVHcm91cHMuY29tPg=="
    }
}