{
    "numMessagesInTopic": 57, 
    "nextInTime": 1470, 
    "senderId": "_v8hU9DlMlkuGZhsgaNdxXsoZDw02tXlo87MeLVW745RILk18j49KFAikbmZqYrlkcbGe7KHWMixNP77rPxIDi5uaTW-ff7dnZ-6pHV9KNKpGXg", 
    "systemMessage": false, 
    "subject": "RE: [junit] Best Practice for Tests ?", 
    "from": "&quot;Jason Rogers&quot; &lt;jason.rogers@...&gt;", 
    "authorName": "Jason Rogers", 
    "msgSnippet": "... It isn t a question of being favorable or not.  It is a question of Do you want to automate the testing of your GUI with JUnit?  And if so, to what ", 
    "msgId": 1469, 
    "topicId": 1411, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1893436754\"><blockquote><span title=\"ireply\">&gt; Thank you. Well, most probably I was not clear. I&#39;m sorry <br/>\n    &gt; for that. I&#39;ll try<br/>\n    &gt; again:<br/>\n    &gt; <br/>\n    &gt; After testing the model, I like to do integration tests <br/>\n    &gt; for model, control<br/>\n    &gt; and view. I do this by checking the view. But as the view <br/>\n    &gt; is used by users<br/>\n    &gt; only, there is no need to know state, at least for <br/>\n    &gt; programm components other<br/>\n    &gt; than the tests. This approach is (Did I get you right <br/>\n    &gt; now?) not favorable in<br/>\n    &gt; your eyes? Which would be your favorable approach?<br/>\n<br/>\n </span></blockquote>It isn&#39;t a question of being favorable or not.  It is a question of &quot;Do you<br/>\nwant to automate the testing of your GUI with JUnit?  And if so, to what<br/>\ngranularity?&quot;  I think testing the GUI is always good, but there are<br/>\nlimitations for JUnit to do this.  If there is pertinent state information<br/>\nthat you want to capture (which it doesn&#39;t sound like there is) you can use<br/>\nthe approach I mentioned before.  If you simply want to test the overall<br/>\nlook, a one-eyed inspection is fine.  If you want to programmatically test<br/>\nthe overall look, something like SilkTest would probably be a good way to<br/>\ngo.  I think that having state inspectors on every GUI component is<br/>\noverkill!  If there is some meta-state that your controller gets from the<br/>\nview to effect a change on your model, then write an inspector on your<br/>\ncontroller for that, but not just for testing.  The test should reflect (to<br/>\nsome degree) the usage.  Again, this isn&#39;t a silver bullet, it&#39;s just one<br/>\nexample.<br/>\n<br/>\nMVC can be difficult.  If it is done improperly it offers many traps!!  But<br/>\ndone rightly, it&#39;s a wonderful tool.  Testing is easier, refactoring is<br/>\neasier, etc.<br/>\n<br/>\n-Jason</div>", 
    "prevInTime": 1468, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "992351757", 
    "canDelete": false, 
    "nextInTopic": 1470, 
    "prevInTopic": 1468, 
    "headers": {
        "messageIdInHeader": "PDg3RUU2QjIxQzYyNEQ1MTFCNzI0MDAxMDRCQ0YxRUIwMUY2MDMwQGV4Y2g+"
    }
}