{
    "numMessagesInTopic": 125, 
    "nextInTime": 14703, 
    "senderId": "hs3byQnkWpRn7esslBDlx4ODVjz7w_Py2Zuawrorhr5SLadP1_FlIz-_GzbV_avgw177zx22BYliFXi_xEpp550ERlBoag", 
    "systemMessage": false, 
    "subject": "RE: [junit] Re: How to test private methods in a class.", 
    "from": "&quot;Ilja Preuss&quot; &lt;preuss@...&gt;", 
    "authorName": "Ilja Preuss", 
    "msgSnippet": "... I don t remember the original poster stating that he didn t want to think about the design. Anyway, if he did, my answer would be but you *should*! ... I", 
    "msgId": 14702, 
    "profile": "ipreussde", 
    "topicId": 14490, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 96623270, 
    "messageBody": "<div id=\"ygrps-yiv-1729029356\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;Ilja Preuss&quot; &lt;preuss@d...&gt; wrote:<br/>\n&gt;&gt; <br/>\n&gt;&gt; I find that writing tests helps me a lot thinking about the design,<br/>\n&gt;&gt; so I&#39;m not a fan of switching my design brain off while writing<br/>\n&gt;&gt; tests. I&#39;m not sure why you would want to do that.<br/>\n&gt;&gt; <br/>\n&gt; <br/>\n&gt; I didn&#39;t. Somebody else did when they asked the question that<br/>\n&gt; started this thread.<br/>\n<br/>\n </span></blockquote>I don&#39;t remember the original poster stating that he didn&#39;t want to think<br/>\nabout the design. Anyway, if he did, my answer would be &quot;but you *should*!&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But I would contend that there must be<br/>\n&gt; something wrong with the practice of TDD that leads to the<br/>\n&gt; conclusion that the tests do not adequately cover the code<br/>\n&gt; and the only way to get adequate coverage is to make methods public.<br/>\n<br/>\n </span></blockquote>I agree that TDD is unlikely to lead to private methods that need explicite<br/>\ntesting, if done well. That doesn&#39;t change my advice once it led to that<br/>\nsituation, though.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; Given that context, my mind hasn&#39;t<br/>\n&gt;&gt;&gt; changed. If the private method is already tested through an existing<br/>\n&gt;&gt;&gt; public method then you don&#39;t need to do anything. In fact, exposing<br/>\n&gt;&gt;&gt; the method and writing an explicit test against it is duplication.<br/>\n&gt;&gt; <br/>\n&gt;&gt; Unless the tests of the already existing public method can be<br/>\n&gt;&gt; simplified in consequence.<br/>\n&gt; <br/>\n&gt; The duplication is that there will now be two tests for<br/>\n&gt; exactly the same thing.<br/>\n<br/>\n </span></blockquote>Not necessarily. One way to the simplify the existing tests could be to mock<br/>\nthe formerly private behaviour, for example.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I&#39;m confused, because TDD is much more a design practice than a<br/>\n&gt;&gt; testing practice. Anyway, I don&#39;t think I proposed anything as &quot;a<br/>\n&gt;&gt; solution<br/>\n&gt; per se&quot;,<br/>\n&gt;&gt; but said that it would be one of the first things I&#39;d think about,<br/>\n&gt;&gt; and that I very often find that I find a solution I like when I do<br/>\n&gt;&gt; so. <br/>\n&gt; <br/>\n&gt; I agree that TDD is more about design than testing. My point<br/>\n&gt; is that working TDD I wouldn&#39;t think about this at all<br/>\n&gt; because I wouldn&#39;t write any code without a test. I wouldn&#39;t<br/>\n&gt; refactor until I got to green. Private methods wouldn&#39;t exist<br/>\n&gt; unless they were born through refactoring. I don&#39;t implement<br/>\n&gt; new features while refactoring. As a result I don&#39;t spend<br/>\n&gt; time thinking about how to test private methods unless I&#39;m<br/>\n&gt; responding to threads on the JUnit Yahoo! group. ;-)<br/>\n<br/>\n </span></blockquote>One way such a question could come up when using TDD is when the tests for<br/>\nthe public method become very complex. You could start to think &quot;my tests<br/>\ncould be much more simple if I just could test this private method in<br/>\nisolation&quot;. My answer to that would be &quot;your class probably is doing too<br/>\nmuch.&quot;<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; A private method that is complex enough to need explicite testing<br/>\n&gt;&gt; simply is a hint to a class that has too many responsibilities and<br/>\n&gt;&gt; has lost cohesion. A class that has just one responsibility is quite<br/>\n&gt;&gt; unlikely to be complex, let alone have complex private methods.<br/>\n&gt; <br/>\n&gt; As I said, this doesn&#39;t seem to happen to me.<br/>\n<br/>\n </span></blockquote>Cool. Now what should someone do to whom it does happen?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m not sure<br/>\n&gt; where we&#39;re doing things differently. Maybe it&#39;s more a hint<br/>\n&gt; that the developer is taking steps that are too big?<br/>\n<br/>\n </span></blockquote>I didn&#39;t say that it happens to me when I practice TDD. As far as I<br/>\nremember, you brought up TDD, didn&#39;t you?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t<br/>\n&gt; think %LOC in private methods is a decent metric for<br/>\n&gt; measuring cohesion.<br/>\n<br/>\n </span></blockquote>I&#39;m sure it is a strong hint. Cohesive classes simply are small classes.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; Maybe Martin Fowler wasn&#39;t wearing his Tester hat at the time. Maybe<br/>\n&gt;&gt;&gt; he was and wanted to write a book about how to produce better<br/>\n&gt;&gt;&gt; designs, not about solving problems with unit tests.<br/>\n&gt;&gt; <br/>\n&gt;&gt; If I remember correctly, he put a chapter about Code Smells in the<br/>\n&gt;&gt; book - about hints in the code that you should refactor. Well, I<br/>\n&gt;&gt; think that a private method that needs explicite testing is such a<br/>\n&gt;&gt; smell. <br/>\n&gt; <br/>\n&gt; Which one(s)?<br/>\n<br/>\n </span></blockquote>The &quot;private method needs explicite testing&quot; smell. But I guess I didn&#39;t<br/>\nunderstand your question...<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; So, third maybe in a row, maybe refactorings shouldn&#39;t<br/>\n&gt;&gt;&gt; be viewed as ways to solve problems with your the test suite?<br/>\n&gt;&gt; <br/>\n&gt;&gt; If your design is in the way while writing tests, it looks like a<br/>\n&gt;&gt; design problem to me. So I don&#39;t see why we should exclude<br/>\n&gt;&gt; refactoring as a<br/>\n&gt; viable<br/>\n&gt;&gt; solution.<br/>\n&gt; <br/>\n&gt; I&#39;m not convinced it&#39;s a design problem. How can the design<br/>\n&gt; be in the way while writing tests if there *is* no design<br/>\n&gt; until you write the tests? How is it your design and<br/>\n&gt; implementation exist *before* the tests?<br/>\n<br/>\n </span></blockquote>Again, I don&#39;t remember that the original question was asked in the context<br/>\nof TDD.<br/>\n<br/>\nAnyway, already the second the test is written in the presence of the design<br/>\nthat was driven by the first, so if the second test is hard to write, I&#39;d<br/>\nthink (besides other thinks) about wether a different design might improve<br/>\nthings.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Conversely, I have problems following the notion that<br/>\n&gt; practicing TDD I could get to place that was so bad in my<br/>\n&gt; design that I start refactoring just so that I can test<br/>\n&gt; properly. Unless the code exists when I start writing the tests ...<br/>\n<br/>\n </span></blockquote>I&#39;m not sure wether you could. I&#39;m sure that I typically don&#39;t. I can<br/>\nimagine a beginner to end up there.<br/>\n<br/>\nCheers, Ilja</div>", 
    "prevInTime": 14701, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1126025621", 
    "canDelete": false, 
    "nextInTopic": 14703, 
    "prevInTopic": 14701, 
    "headers": {
        "inReplyToHeader": "PGRma2UxMCtzbmZoQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDAwMzcwMWM1YjMwMyQ4OTQ3OTIxMCQ3MDY0YThjMEBkaXN5Lm5ldD4="
    }
}