{
    "numMessagesInTopic": 18, 
    "nextInTime": 14706, 
    "senderId": "trJQAZdlclh5Kk-6A8zqWF19uGNO74OQCZiw7LaHcvPFgBbX7912ubJZYICu1jQ2h5hE6rurU0l8", 
    "systemMessage": false, 
    "subject": "RE: [junit] [OT] coverage plugins for eclipse?", 
    "from": "didoss@...", 
    "authorName": "didoss@comcast.net", 
    "msgSnippet": "Yes, in the ideal world, the numbers would be small, so wading through them to find the cause of the failure would be relatively trivial.  Unfortunately, my", 
    "msgId": 14705, 
    "profile": "dijdoss", 
    "topicId": 14581, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 180862158, 
    "messageBody": "<div id=\"ygrps-yiv-1573311105\">Yes, in the ideal world, the numbers would be small, so &quot;wading through them&quot; to find the cause of the failure would be relatively trivial.  Unfortunately, my world is not ideal, and there are lots of coverage failures and still some real failures.  In order to focus on the real failures, instead of allowing people to hide behind the false belief (or wish) that the new failures are just coverage, we had to pull hansel out.  Currently, we run Emma on the nightly build, so that our results are more clear.  And we are trying to work out the right approach to running Emma from within eclipse, so that we can get the immediate and easy feedback for an individual test.<br/>\n<br/>\n-------------- Original message -------------- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Yes, Hansel worked very well for us at the individual test<br/>\n&gt; level, within Eclipse.  The major drawback that we had was<br/>\n&gt; that the results were included with the actual test results.<br/>\n&gt; So, when we looked at our overall test results (from our<br/>\n&gt; nightlybuild) it was difficult to easily see what failures<br/>\n&gt; were due to code, and which were just due to lack of coverage<br/>\n&gt; (had to dig into each package and class).<br/>\n<br/>\n </span></blockquote>I&#39;d rather see that as a drawback of not running the tests often enough, but<br/>\nthat might just be me... ;)<br/>\n<br/>\nCheers, Ilja<br/>\n<br/>\n<br/>\n<br/>\nSPONSORED LINKS Basic programming language C programming language Computer programming languages <br/>\nThe c programming language C programming language List of programming languages <br/>\n<br/>\n<br/>\n<br/>\nYAHOO! GROUPS LINKS <br/>\n<br/>\n Visit your group &quot;junit&quot; on the web.<br/>\n  <br/>\n To unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n  <br/>\n Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 14704, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1126029648", 
    "canDelete": false, 
    "nextInTopic": 14711, 
    "prevInTopic": 14697, 
    "headers": {
        "messageIdInHeader": "PDA5MDYyMDA1MTgwMC4yOTEyOS40MzFERDk1MDAwMDNDRTIyMDAwMDcxQzkyMjA5MjI5OTI3OUM5QzAxMEIwNzBCQGNvbWNhc3QubmV0Pg=="
    }
}