{
    "numMessagesInTopic": 57, 
    "nextInTime": 1471, 
    "senderId": "3ZgTNwcNpLEdQPTHpu8OERP2Yn4Q0c5K92HduswbyQssZYQsuRSDn0Kq1cjBa_BlfXbpsNOiFWI3P_HWjuSbtGbsSXiBRhmqVhlgUlMg", 
    "systemMessage": false, 
    "subject": "Re: [junit] Best Practice for Tests ?", 
    "from": "&quot;Mike Duffy&quot; &lt;mike.duffy@cci-triad.com&gt;", 
    "authorName": "Mike Duffy", 
    "msgSnippet": "I agree with the comments of Vladimir Bossicard:  The main goal of JUnit is to write unit tests. From the developer s perspective, every method is a unit", 
    "msgId": 1470, 
    "topicId": 1411, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1509632326\">I agree with the comments of Vladimir Bossicard:  &quot;The main goal of JUnit is to write unit tests.&quot;<br/>\n<br/>\nFrom the developer&#39;s perspective, every method is a unit that requires a unit test case as part of the development<br/>\nprocess.  Even the high level functional methods or methods within a public API require a unit test case.<br/>\n<br/>\nFrom the QA perspective, the methods within the public API are the functional methods and these methods require a<br/>\nfunctional test written by the QA team.  This means that there is double coverage on testing the methods in the public<br/>\nAPI and developers are not simply checking themselves.<br/>\n<br/>\nThe next level of testing involves system integration and load testing.<br/>\n<br/>\nDoes anyone know of a good product for system level testing, especially load testing a server app.<br/>\n<br/>\nWe have a public API running on a Java application server which we are hitting through JSP pages.  We would like to hit<br/>\nthe methods of the public API directly in some sort of multi-threaded heavy load stress simulation.<br/>\n<br/>\nDoes anyone have any suggestions?<br/>\n<br/>\nThank you for your consideration.<br/>\n<br/>\nMike<br/>\n<br/>\n<br/>\n<br/>\nVladimir Bossicard wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; If you test classes, you write unit tests.<br/>\n&gt; If you test subsystems, you write black-box or white-box tests (or<br/>\n&gt; integration tests).<br/>\n&gt;<br/>\n&gt; The main goal of JUnit is to write unit tests.  Although JUnit can be<br/>\n&gt; used to write integration tests, it is not its main goal.  With JUnit,<br/>\n&gt; you have problems if you want to test the user interaction or really<br/>\n&gt; complexe systems (-&gt; use of mock objects).<br/>\n&gt;<br/>\n&gt; But I agree, the borderline between unit and integration tests can be<br/>\n&gt; really thin (when does an unit really stop?).<br/>\n&gt;<br/>\n&gt; A developer should be able to test what he&#39;s writing (in X-programming,<br/>\n&gt; test code is written before the production code).  If you have two<br/>\n&gt; separate packages for the test and the production code, the programmer<br/>\n&gt; _cannot_ test everything (his protected methods).  If the developer<br/>\n&gt; feels more confident if he writes tests to validate his work: fine!<br/>\n&gt;<br/>\n&gt; If you want to test a subsystem (the public interface), someone<br/>\n&gt; (normally the QA - the developer should not validate his work) has to<br/>\n&gt; write another set of tests in another package (and not in the same<br/>\n&gt; package of course).<br/>\n&gt;<br/>\n&gt; In resume:  my unit tests are placed in the same package and my<br/>\n&gt; white-box tests in another one.<br/>\n&gt;<br/>\n&gt; My 2c<br/>\n&gt;<br/>\n&gt; -Vladimir<br/>\n&gt;<br/>\n&gt; --<br/>\n&gt; Neu: sunrise hat jetzt noch günstigere Surfpreise!<br/>\n&gt; Sofort profitieren!  <a rel=\"nofollow\" target=\"_blank\" href=\"http://go.sunrise.ch/de/promo1\">http://go.sunrise.ch/de/promo1</a><br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a> </span></blockquote></div>", 
    "prevInTime": 1469, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "992358052", 
    "canDelete": false, 
    "nextInTopic": 1471, 
    "prevInTopic": 1469, 
    "headers": {
        "messageIdInHeader": "PDNCMjYyRUE0LjEyOENENkQ0QGNjaS10cmlhZC5jb20+", 
        "referencesHeader": "PDk5MjMwNDIyMi53ZWJleHByZXNzZFYzLjEuZkBzbXRwLmZyZWVzdXJmLmNoPg=="
    }
}