{
    "numMessagesInTopic": 125, 
    "nextInTime": 14718, 
    "senderId": "YNGXc4Qq2D3kAvQwtzaAlzjdu_LIfJAgkMZH4IncEZDs0mwLFczk3SdNFG8m-GitTfanpFhp_W5bKcrWpsXpNvn0TPlnFx8kfQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] How to test private methods in a class.", 
    "from": "Robert Watkins &lt;yahoo@...&gt;", 
    "authorName": "Robert Watkins", 
    "msgSnippet": "... Not necessarily true. Consider this: I m using TDD. I write some tests and code in the usual cycle. I now have a new feature I want to write a test for. I", 
    "msgId": 14717, 
    "profile": "robertdw26", 
    "topicId": 14490, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 189784721, 
    "messageBody": "<div id=\"ygrps-yiv-278095723\">Jim Cakalic wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; Thirdly: if it&#39;s not tested enough, then exposing the method and<br/>\n&gt;&gt;&gt; writing new tests is not duplication - in fact, it can significantly<br/>\n&gt;&gt;&gt; reduce duplication by removing the need to duplicate extraneous setup<br/>\n&gt;&gt;&gt; work.<br/>\n&gt;&gt;    <br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;3) I disagree. It&#39;s a symptom that TDD discipline is breaking down.<br/>\n&gt;Code has been written before a test that needed it. Now&#39;s the time to<br/>\n&gt;back away from the current implementation, write the test you /really/<br/>\n&gt;want, and then get to green. <br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>Not necessarily true. Consider this: I&#39;m using TDD. I write some tests <br/>\nand code in the usual cycle.<br/>\n<br/>\nI now have a new feature I want to write a test for. I look at the code, <br/>\nnotice that there is a private method that does that work - that&#39;s where <br/>\nthe new code will go. I can write a perfectly adequate test focused on <br/>\nthat private method alone - but I can&#39;t test private methods. So I <br/>\nrefactor to extract the method to an appropriate class (possibly new). I <br/>\nrun existing tests. I then write the test I _really_ want against the <br/>\nnewly exposed public method.<br/>\n<br/>\nThat&#39;s the sort of thing _I_ mean when I say it&#39;s not tested enough: it <br/>\nmeans that there are tests I want to write which would be convenient to <br/>\nwrite if I can target them better.<br/>\n<br/>\nI&#39;ll reuse my String-to-Calendar example. I want to do some work with a <br/>\ndate, but I have a String. So I write a test that passes in the <br/>\ndate-string, and sees that it the work is done. Then I want to do some <br/>\nerror handling, so I write a test that passes in an invalid date-string, <br/>\nand I see the appropriate exception get passed out.<br/>\n<br/>\nNow I want to handle the twenty five thousand different ways that users <br/>\ntype in dates. I&#39;ve already extracted the String-to-Calendar conversion <br/>\nto a method. Because I&#39;m using whitebox testing, I know I don&#39;t have to <br/>\ntest the earlier method with the twenty five thousand ways of entering a <br/>\ndate - that would just be silly and result in a lot of extra test work. <br/>\nInstead, I take that method and I move it to a DateUtil class. I then <br/>\nwrite the tests for the tweny five thousand ways of entering a date <br/>\nagainst _that_ class instead. I would probably have also extracted a <br/>\nmethod with the same name as the earlier one, but with a Calendar <br/>\nargument instead of a String - I would probably make that method public <br/>\non the same class.<br/>\n<br/>\nThis sort of work is exactly how I do my TDD work, and nearly always <br/>\nwhat I see when I look at a private method someone else wants to test.<br/>\n<br/>\nRobert.<br/>\n<br/>\n-- <br/>\n               &quot;Software is too expensive to build cheaply&quot;<br/>\nRobert Watkins         <a rel=\"nofollow\" target=\"_blank\" href=\"http://twasink.net/\">http://twasink.net/</a>          <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robertdw@...\">robertdw@...</a></div>", 
    "prevInTime": 14716, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1126050608", 
    "canDelete": false, 
    "nextInTopic": 14720, 
    "prevInTopic": 14716, 
    "headers": {
        "inReplyToHeader": "PDExMjYwNDA4OTQuMzQyNi43MTcwNi5tNkB5YWhvb2dyb3Vwcy5jb20+", 
        "messageIdInHeader": "PDQzMUUyQjMwLjQwMzAzMDNAdHdhc2luay5uZXQ+", 
        "referencesHeader": "PDExMjYwNDA4OTQuMzQyNi43MTcwNi5tNkB5YWhvb2dyb3Vwcy5jb20+"
    }
}