{
    "topicId": 14490, 
    "postDate": "1126053956", 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "from": "Elliotte Harold &lt;elharo@...&gt;", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "3XBjk8UZe0AXt7TlnpXWCpDQF-0gjiiw-_k_uclUYoHGUwBfAU-oCAWXUrHk7_6-w7JtJzivI_L-ciDMSKe67qrbIxIHpl8qe-3-yVEC1A", 
    "nextInTime": 14721, 
    "userId": 12653864, 
    "prevInTime": 14719, 
    "prevInTopic": 14717, 
    "headers": {
        "inReplyToHeader": "PDQzMUUyQjMwLjQwMzAzMDNAdHdhc2luay5uZXQ+", 
        "messageIdInHeader": "PDQzMUUzODQ0LjQwNzAxMDhAbWV0YWxhYi51bmMuZWR1Pg==", 
        "referencesHeader": "PDExMjYwNDA4OTQuMzQyNi43MTcwNi5tNkB5YWhvb2dyb3Vwcy5jb20+IDw0MzFFMkIzMC40MDMwMzAzQHR3YXNpbmsubmV0Pg=="
    }, 
    "authorName": "Elliotte Harold", 
    "numMessagesInTopic": 125, 
    "msgSnippet": "... One thing strikes me about the arguments for making methods public. They re very much about the I or occasionally the We . In other words, it s about", 
    "contentTrasformed": false, 
    "msgId": 14720, 
    "nextInTopic": 14721, 
    "systemMessage": false, 
    "rawEmail": "Return-Path: &lt;elharo@...&gt;\r\nX-Sender: elharo@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 28456 invoked from network); 7 Sep 2005 00:45:59 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m31.grp.scd.yahoo.com with QMQP; 7 Sep 2005 00:45:59 -0000\r\nReceived: from unknown (HELO mail27.sea5.speakeasy.net) (69.17.117.29)\n  by mta3.grp.scd.yahoo.com with SMTP; 7 Sep 2005 00:45:59 -0000\r\nReceived: (qmail 2506 invoked from network); 7 Sep 2005 00:45:58 -0000\r\nReceived: from dsl254-067-087.nyc1.dsl.speakeasy.net (HELO [192.168.254.100]) (elharo@[216.254.67.87])\n          (envelope-sender &lt;elharo@...&gt;)\n          by mail27.sea5.speakeasy.net (qmail-ldap-1.03) with AES256-SHA encrypted SMTP\n          for &lt;junit@yahoogroups.com&gt;; 7 Sep 2005 00:45:57 -0000\r\nMessage-ID: &lt;431E3844.4070108@...&gt;\r\nDate: Tue, 06 Sep 2005 20:45:56 -0400\r\nUser-Agent: Mozilla Thunderbird 1.0+ (Macintosh/20050712)\r\nMIME-Version: 1.0\r\nTo: junit@yahoogroups.com\r\nReferences: &lt;1126040894.3426.71706.m6@yahoogroups.com&gt; &lt;431E2B30.4030303@...&gt;\r\nIn-Reply-To: &lt;431E2B30.4030303@...&gt;\r\nContent-Type: text/plain; charset=UTF-8; format=flowed\r\nContent-Transfer-Encoding: 8bit\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: Elliotte Harold &lt;elharo@...&gt;\r\nSubject: Re: [junit] How to test private methods in a class.\r\nX-Yahoo-Group-Post: member; u=12653864; y=NFW_xvCEvecKwSOJFuaBc6QyR4BDC53HXz8Q4dwW5UZ7ugAr\r\n\r\nRobert Watkins wrote:\n\n&gt; I now have a new feature I want to write a test for. I look at the code, \n&gt; notice that there is a private method that does that work - that&#39;s where \n&gt; the new code will go. I can write a perfectly adequate test focused on \n&gt; that private method alone - but I can&#39;t test private methods. So I \n&gt; refactor to extract the method to an appropriate class (possibly new). I \n&gt; run existing tests. I then write the test I _really_ want against the \n&gt; newly exposed public method.\n\nOne thing strikes me about the arguments for making methods public. \nThey&#39;re very much about the &quot;I&quot; or occasionally the &quot;We&quot;. In other \nwords, it&#39;s about convenience for the programmer doing the coding and \nwriting the class library. By their role, this developer sees and needs \nto see everything in the classes, private and public. Because the class \nprogrammer&#39;s view of the class includes everything, the public-private \ndistinction seems fairly unimportant.\n\nSwitch gears for a moment though, and consider the &quot;them&quot;. In other \nwords, think about the client programmer who uses the class but did not \nwrite it and doesn&#39;t want to write it.  What&#39;s important to them is that \nthe class do what it promises to do in a straight-forward and obvious \nway. The more cluttered the class or library is with public methods, the \nharder it is to understand and use the class. The class user doesn&#39;t \ncare if the code inside the class repeats itself or not. They don&#39;t care \nhow difficult it was to test all the private methods. They only care if \nthe class works in an intelligible way.\n\nEvery public method added to a class expands the complexity of the class \nmore than linearly. Every public class added to a library expands the \ncomplexity of the library more than linearly. Usable APIs need to place \nthe needs of the user ahead of the needs of the original developer. \nSimplicity is golden. Useful, usable APIs do one thing and do it well. \nThey have a laserlike focus on a particular domain. They are not mere \nagglomerations of random utilities one programmer developed at one time \nor another throughout their career. For a practical example, XOM is a \nlibrary for manipulating XML. Internally it&#39;s got a lot of code for \nhandling URLs and URIs that was necessary to accomplish various XML \ntasks. However, none of this code is exposed in the public API because \nit&#39;s not about processing XML. Furthermore because it&#39;s not exposed it \ncan take shortcuts and avoid edge conditions a fully general library \nwould have to handle. It&#39;s faster and simpler because it does just what \nXOM needs and no more. A fully general URI library wouldn&#39;t have that \nadvantage.\n\nThere&#39;s a real trade-off between making life easy for the developer or \neasy for the user, even when the user is a fellow developer. As the \nnumber of users grows relative to the number of developers, the \ncost-benefit ratio swings very much on the side of people writing the \nlibrary doing more work so people merely using the library can do less.\n\nPackage private access is sometimes a reasonable compromise position. It \nlets the API-writer reuse their own code without making it public. \nTaking full advantage of package private in Java 5 and earlier requires \nnot going overboard on package separation. In particular any sort of \ninternal package that clients aren&#39;t supposed to touch is a code smell. \nAlmost always the classes in these packages can and should be moved into \nnon-public classes in the external packages.\n\n-- \n﻿Elliotte Rusty Harold  elharo@...\nXML in a Nutshell 3rd Edition Just Published!\nhttp://www.cafeconleche.org/books/xian3/\nhttp://www.amazon.com/exec/obidos/ISBN=0596007647/cafeaulaitA/ref=nosim\n\n", 
    "subject": "Re: [junit] How to test private methods in a class."
}