{
    "numMessagesInTopic": 125, 
    "nextInTime": 14740, 
    "senderId": "3fRLkBlPGBFlC54FNC06Mmw6RefP4EqoqNzXYzr9G5XzYlB4RC0ZdmZjBtJczgTXTcS70vD1EP-bt4j1Yxp1wld3B2t1EJEjbYXro6dpjA", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: How to test private methods in a class.", 
    "from": "Elliotte Harold &lt;elharo@...&gt;", 
    "authorName": "Elliotte Harold", 
    "msgSnippet": "... OK. Two of those I know intimately (Xerces and Jaxen) and one partially (Ant). The two I know intimately don t behave as you claim. The distinction between", 
    "msgId": 14739, 
    "topicId": 14490, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 12653864, 
    "messageBody": "<div id=\"ygrps-yiv-272580164\">Robert Watkins wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Well, there&#39;s the one I was learning yesterday: XMLBeans from the Apache <br/>\n&gt; project. There&#39;s newer versions of Weblogic (the old ones had the <br/>\n&gt; kitchen-sink JAR from hell). The xml-apis.jar and xercesImpl.jar from <br/>\n&gt; the Xerces project. The way Ant 1.6 has the optional jars split up. <br/>\n&gt; Jaxen. Every JDBC driver I&#39;ve ever used. Hibernate.<br/>\n<br/>\n </span></blockquote>OK. Two of those I know intimately (Xerces and Jaxen) and one partially <br/>\n(Ant). The two I know intimately don&#39;t behave as you claim. The <br/>\ndistinction between xercesImpl.jar and xml-apis.jar is not between <br/>\npublic and published. It is between standard, cross-parser APIs and <br/>\nXerces specific APIs. xercesImpl.jar contains both external code with <br/>\nstable APIs and internal code whose API may change.<br/>\n<br/>\nJaxen is not divided at all. I&#39;ve actually been meaning to divide the <br/>\nJaxen single JAR archive for awhile now, but along very different lines. <br/>\nPerhaps an older version of Jaxen split off Saxpath and Jaxen itself <br/>\ninto two JARs, (both of which were public and published) but they are <br/>\nnow distributed as a single JAR containing all the Jaxen classes. There <br/>\nare definitely too many public classes in Jaxen , and I&#39;d like to make <br/>\nmany of them non-public. However, legacy issues keep me from pulling the <br/>\ntrigger.<br/>\n<br/>\nAnt I&#39;m not as familiar with at the code level, but my impression is <br/>\nthat the distribution in many jar files has everything to do with the <br/>\nplugin architecture and little-to-nothing to do with distinguishing <br/>\nbetween public and published.<br/>\n<br/>\nThe others you mention, I&#39;ll just have to take your word on. However, <br/>\njust because a project distributes multiple jar archives, even ones as <br/>\nsuggestively named as foo-apis.jar and fooImpl.jar, does not prove that <br/>\none contains published APIs and the other does not. Xerces is a clear <br/>\ncounterexample to this assumption.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t see it as the duty of an API designer to protect people who <br/>\n&gt; deliberately go out of their way to inflict pain and suffering on <br/>\n&gt; themselves. Making a clear distinction to the client programmer is all <br/>\n&gt; that&#39;s called for.<br/>\n<br/>\n </span></blockquote>I do, however, see it as the duty of the API designer to not design an <br/>\nAPI in such a way that people using it are likely to choose the most <br/>\npain-free, correct mode of operation. In a good API the right thing <br/>\nshould be obvious and easy. The wrong thing should be difficult to <br/>\nimpossible. The API should be designed in such a way that people have to <br/>\ngo out of their way to inflict pain and suffering on themselves. It <br/>\nshould be designed such that they don&#39;t inflict pain and suffering by <br/>\naccident. Too many APIs make inflicting pain and suffering just as easy <br/>\nor easier as a painfree experience. That&#39;s just wrong.<br/>\n<br/>\nThe argument here reminds me of the old saw that it&#39;s the user&#39;s <br/>\nresponsibility to read the manual, and that any poorly designed <br/>\ninterface that&#39;s virtually certain to confuse and be misused is OK, as <br/>\nlong as it&#39;s documented in 10-point type on p. 345 of a telephone book <br/>\nsized manual.  It wasn&#39;t true for user interfaces 20 years ago, and it <br/>\nisn&#39;t true for programming interfaces today. Good interfaces, be they <br/>\nGUIs or APIs, follow the fundamental principles of human computer <br/>\ninteraction. Good interfaces are natural, intuitive, and easy to use. <br/>\nBad ones aren&#39;t, documentation or no.<br/>\n<br/>\n-- <br/>\n﻿Elliotte Rusty Harold  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elharo@...\">elharo@...</a><br/>\nXML in a Nutshell 3rd Edition Just Published!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafeconleche.org/books/xian3/\">http://www.cafeconleche.org/books/xian3/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/exec/obidos/ISBN=0596007647/cafeaulaitA/ref=nosim\">http://www.amazon.com/exec/obidos/ISBN=0596007647/cafeaulaitA/ref=nosim</a></div>", 
    "prevInTime": 14738, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1126097807", 
    "canDelete": false, 
    "nextInTopic": 14740, 
    "prevInTopic": 14738, 
    "headers": {
        "inReplyToHeader": "PDQzMUVEODFGLjYwODAxMDVAdHdhc2luay5uZXQ+", 
        "messageIdInHeader": "PDQzMUVFMzhGLjcwMjAzMDZAbWV0YWxhYi51bmMuZWR1Pg==", 
        "referencesHeader": "PGRmbWRpNCtwNWhtQGVHcm91cHMuY29tPiA8NDMxRUNCMDAuNTA4MDIwM0BtZXRhbGFiLnVuYy5lZHU+IDw0MzFFRDgxRi42MDgwMTA1QHR3YXNpbmsubmV0Pg=="
    }
}