{
    "numMessagesInTopic": 125, 
    "nextInTime": 14738, 
    "senderId": "ybT-9VeScFzuB_OKvVy9dm_KjqFF1l7IuyEL59RpO49AEgMeNpRYzg1nIbhs-P1QLT1Zt4V2NmX0KLIaTtit_2oj_Tx25vwpbQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: How to test private methods in a class.", 
    "from": "Robert Watkins &lt;yahoo@...&gt;", 
    "authorName": "Robert Watkins", 
    "msgSnippet": "... Well, there s the one I was learning yesterday: XMLBeans from the Apache project. There s newer versions of Weblogic (the old ones had the kitchen-sink JAR", 
    "msgId": 14737, 
    "profile": "robertdw26", 
    "topicId": 14490, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 189784721, 
    "messageBody": "<div id=\"ygrps-yiv-262049556\">Elliotte Harold wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;It might help, but as with some other suggestions on this thread, I&#39;d <br/>\n&gt;consider it more seriously if I&#39;d once actually encountered a project <br/>\n&gt;that did it. It seems to me that techniques that so obscure they&#39;re only <br/>\n&gt;known to the cognoscenti indicate there&#39;s something missing somewhere.<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>Well, there&#39;s the one I was learning yesterday: XMLBeans from the Apache <br/>\nproject. There&#39;s newer versions of Weblogic (the old ones had the <br/>\nkitchen-sink JAR from hell). The xml-apis.jar and xercesImpl.jar from <br/>\nthe Xerces project. The way Ant 1.6 has the optional jars split up. <br/>\nJaxen. Every JDBC driver I&#39;ve ever used. Hibernate.<br/>\n<br/>\nAnd those are just the ones on my home machine.<br/>\n<br/>\nAnd if it&#39;s an obscure solution, which would actually work, why not <br/>\npromote it more? We&#39;re discussing the code _you_ can write, which _you_ <br/>\ncan control - if you want to have a runtime and API jar, only you are <br/>\nstopping you.<br/>\n<br/>\nAlso, note the list. It&#39;s discussing the JUnit framework. Now, this may <br/>\nbe shocking to you... but the majority of developers still do not write <br/>\nunit tests. I still come across Java developers, some with considerable <br/>\nexperience, who haven&#39;t heard of JUnit. There is no technique so widely <br/>\nknown that there aren&#39;t droves of developers who don&#39;t know about it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;You keep missing the distinction between &quot;public&quot; and &quot;published&quot;:<br/>\n&gt;&gt;&quot;published&quot; is a social convention enforced by social contracts.<br/>\n&gt;&gt;Providing a runtime JAR, to be available at _runtime_, and not<br/>\n&gt;&gt;_compile time_, is an excellent way of enforcing these conventions.<br/>\n&gt;&gt;    <br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;I&#39;ve already argued this one to death in this thread; and don&#39;t have <br/>\n&gt;anything more to add at this point; but I will try to rephrase. There <br/>\n&gt;may be a distinction between public and published in the original <br/>\n&gt;developer&#39;s mind, but it starts and stops there. For the client <br/>\n&gt;programmer, public == published; and wishing otherwise ain&#39;t going to <br/>\n&gt;make it so. The distinction that exists in Java is between public and <br/>\n&gt;package-private. That&#39;s what you need to work with. Perhaps other <br/>\n&gt;languages have clearer distinctions between public and published, but <br/>\n&gt;Java doesn&#39;t.<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>Except that if you package the published classes seperately, and only <br/>\nprovide Javadoc for the published classes, then people are not going to <br/>\n&quot;stumble over&quot; the non-published classes. We&#39;ve argued that point to <br/>\ndeath as well.<br/>\n<br/>\nI don&#39;t see it as the duty of an API designer to protect people who <br/>\ndeliberately go out of their way to inflict pain and suffering on <br/>\nthemselves. Making a clear distinction to the client programmer is all <br/>\nthat&#39;s called for.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Similarly, excluding packages from JavaDoc works well.<br/>\n&gt;&gt;    <br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;That helps. Unlike runtime/API separation I&#39;ve actually seen this done. <br/>\n&gt;I&#39;d estimate I&#39;ve seen it about as frequently as I&#39;ve seen API docs that <br/>\n&gt;include package-private and private methods.  It would help more, if it <br/>\n&gt;were more common. For instance, why are the junit.samples and <br/>\n&gt;junit.tests packages published in the JavaDoc on the JUnit web site at <br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.junit.org/junit/javadoc/3.8.1/index.htm\">http://www.junit.org/junit/javadoc/3.8.1/index.htm</a> ?<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>I don&#39;t know - ask the ObjectMentor folks who set junit.org up. <br/>\nHowever... if you _download_ JUnit 3.8.1, and look at the _distributed_ <br/>\nJavadoc, the only packages covered are junit.framework and junit.extensions.<br/>\n<br/>\nRobert.<br/>\n<br/>\n-- <br/>\n               &quot;Software is too expensive to build cheaply&quot;<br/>\nRobert Watkins         <a rel=\"nofollow\" target=\"_blank\" href=\"http://twasink.net/\">http://twasink.net/</a>          <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robertdw@...\">robertdw@...</a></div>", 
    "prevInTime": 14736, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1126094879", 
    "canDelete": false, 
    "nextInTopic": 14738, 
    "prevInTopic": 14736, 
    "headers": {
        "inReplyToHeader": "PDQzMUVDQjAwLjUwODAyMDNAbWV0YWxhYi51bmMuZWR1Pg==", 
        "messageIdInHeader": "PDQzMUVEODFGLjYwODAxMDVAdHdhc2luay5uZXQ+", 
        "referencesHeader": "PGRmbWRpNCtwNWhtQGVHcm91cHMuY29tPiA8NDMxRUNCMDAuNTA4MDIwM0BtZXRhbGFiLnVuYy5lZHU+"
    }
}