{
    "topicId": 1411, 
    "postDate": "992366948", 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "from": "David Herron &lt;davidh@...&gt;", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "VGrPMkT5pIC8Xxcd9tIFAZPMXTRVrytBOpn7n5m4kdJz8TMAOCaVhakHEO-13z3rCjqIVkZdHU59C6DoK3_3ftvBHdwc", 
    "nextInTime": 1477, 
    "userId": 0, 
    "prevInTime": 1475, 
    "prevInTopic": 1475, 
    "headers": {
        "inReplyToHeader": "PDg3RUU2QjIxQzYyNEQ1MTFCNzI0MDAxMDRCQ0YxRUIwMUY2MDMwQGV4Y2g+", 
        "messageIdInHeader": "PHAwNTEwMDMwNWI3NGJmZmM1NzkxYUBbMTkyLjE2OC4xMjMuMTk2XT4=", 
        "referencesHeader": "PDg3RUU2QjIxQzYyNEQ1MTFCNzI0MDAxMDRCQ0YxRUIwMUY2MDMwQGV4Y2g+"
    }, 
    "authorName": "David Herron", 
    "numMessagesInTopic": 57, 
    "msgSnippet": "I ve only just begun to look at using JUnit, however I have a lot of experience with automating GUI tests. I should introduce myself a little - I work for the", 
    "contentTrasformed": false, 
    "msgId": 1476, 
    "nextInTopic": 1477, 
    "systemMessage": false, 
    "rawEmail": "Return-Path: &lt;davidh@...&gt;\r\nX-Sender: davidh@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-7_1_3); 12 Jun 2001 17:28:48 -0000\r\nReceived: (qmail 38855 invoked from network); 12 Jun 2001 17:28:46 -0000\r\nReceived: from unknown (10.1.10.26) by l8.egroups.com with QMQP; 12 Jun 2001 17:28:46 -0000\r\nReceived: from unknown (HELO femail1.sdc1.sfba.home.com) (24.0.95.81) by mta1 with SMTP; 12 Jun 2001 17:28:45 -0000\r\nReceived: from [192.168.123.196] ([65.3.220.60]) by femail1.sdc1.sfba.home.com (InterMail vM.4.01.03.20 201-229-121-120-20010223) with ESMTP id &lt;20010612172845.SFSW1677.femail1.sdc1.sfba.home.com@[192.168.123.196]&gt; for &lt;junit@yahoogroups.com&gt;; Tue, 12 Jun 2001 10:28:45 -0700\r\nMime-Version: 1.0\r\nMessage-Id: &lt;p05100305b74bffc5791a@[192.168.123.196]&gt;\r\nIn-Reply-To: &lt;87EE6B21C624D511B72400104BCF1EB01F6030@exch&gt;\r\nReferences: &lt;87EE6B21C624D511B72400104BCF1EB01F6030@exch&gt;\r\nDate: Tue, 12 Jun 2001 10:29:08 -0700\r\nTo: junit@yahoogroups.com\r\nSubject: RE: [junit] Best Practice for Tests ?\r\nContent-Type: multipart/alternative; boundary=&quot;============_-1219755547==_ma============&quot;\r\nFrom: David Herron &lt;davidh@...&gt;\r\n\r\n\r\n--============_-1219755547==_ma============\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot; ; format=&quot;flowed&quot;\r\n\r\n\nI&#39;ve only just begun to look at using JUnit, however I have a lot of \nexperience with automating GUI tests.\n\nI should introduce myself a little - I work for the Java SW Division \nof Sun (or whatever the official name for Javasoft is nowadays), \ndeveloping test tools and test suites in the group that tests the \n&quot;client aspects&quot; of J2SE (the software package previously known as \n&quot;The JDK&quot;).  I had a hand in creating the java.awt.Robot class (this \nemail address is my personal email).\n\nIn our team we widely use Robot for GUI automation.  We do, though, \nhave different requirements than most since we are testing the JDK as \nit is being developed, rather than testing an application built using \nthe shipping JDK.  I gave a brief talk last week at a JavaOne BOF \nabout what we&#39;re doing for GUI test automation.\n\nThe glance I&#39;ve taken at JUnit so far tells me it&#39;s a framework to \nhelp creating test cases, and that there&#39;s nothing in it to aid GUI \nautomation.  We&#39;ve created a few different similar frameworks in our \ntest suites here, and I can tell you that at the level I see JUnit \noperating, that use of Robot fits in very well.  Also, that if you \nchoose to use Robot, that you will need to develop some higher level \ncode to provide higher level functionality.\n\nWe have gotten a lot of mileage out of validation through looking at \ninternal state.  Primarily this boils down to listening to listener \ninterfaces, and saying that the test passes if the right listeners \nare called.\n\n- David Herron\n\n&gt;\n&gt;It isn&#39;t a question of being favorable or not.  It is a question of &quot;Do you\n&gt;want to automate the testing of your GUI with JUnit?  And if so, to what\n&gt;granularity?&quot;  I think testing the GUI is always good, but there are\n&gt;limitations for JUnit to do this.  If there is pertinent state information\n&gt;that you want to capture (which it doesn&#39;t sound like there is) you can use\n&gt;the approach I mentioned before.  If you simply want to test the overall\n&gt;look, a one-eyed inspection is fine.  If you want to programmatically test\n&gt;the overall look, something like SilkTest would probably be a good way to\n&gt;go.  I think that having state inspectors on every GUI component is\n&gt;overkill!  If there is some meta-state that your controller gets from the\n&gt;view to effect a change on your model, then write an inspector on your\n&gt;controller for that, but not just for testing.  The test should reflect (to\n&gt;some degree) the usage.  Again, this isn&#39;t a silver bullet, it&#39;s just one\n&gt;example.\n&gt;\n&gt;MVC can be difficult.  If it is done improperly it offers many traps!!  But\n&gt;done rightly, it&#39;s a wonderful tool.  Testing is easier, refactoring is\n&gt;easier, etc.\n&gt;\n&gt;-Jason\n&gt;\n\n-- \r\n--============_-1219755547==_ma============\r\nContent-Type: text/html; charset=&quot;us-ascii&quot;\r\n\r\n&lt;!doctype html public &quot;-//W3C//DTD W3 HTML//EN&quot;&gt;\n&lt;html&gt;&lt;head&gt;&lt;style type=&quot;text/css&quot;&gt;&lt;!--\nblockquote, dl, ul, ol, li { padding-top: 0 ; padding-bottom: 0 }\n --&gt;&lt;/style&gt;&lt;title&gt;RE: [junit] Best Practice for Tests\n?&lt;/title&gt;&lt;/head&gt;&lt;body&gt;\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;\n&lt;div&gt;I&#39;ve only just begun to look at using JUnit, however I have a lot\nof experience with automating GUI tests.&lt;/div&gt;\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;\n&lt;div&gt;I should introduce myself a little - I work for the Java SW\nDivision of Sun (or whatever the official name for Javasoft is\nnowadays), developing test tools and test suites in the group that\ntests the &quot;client aspects&quot; of J2SE (the software package\npreviously known as &quot;The JDK&quot;).&nbsp; I had a hand in\ncreating the java.awt.Robot class (this email address is my personal\nemail).&lt;/div&gt;\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;\n&lt;div&gt;In our team we widely use Robot for GUI automation.&nbsp; We do,\nthough, have different requirements than most since we are testing the\nJDK as it is being developed, rather than testing an application built\nusing the shipping JDK.&nbsp; I gave a brief talk last week at a\nJavaOne BOF about what we&#39;re doing for GUI test automation.&lt;/div&gt;\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;\n&lt;div&gt;The glance I&#39;ve taken at JUnit so far tells me it&#39;s a framework\nto help creating test cases, and that there&#39;s nothing in it to aid GUI\nautomation.&nbsp; We&#39;ve created a few different similar frameworks in\nour test suites here, and I can tell you that at the level I see JUnit\noperating, that use of Robot fits in very well.&nbsp; Also, that if\nyou choose to use Robot, that you will need to develop some higher\nlevel code to provide higher level functionality.&lt;/div&gt;\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;\n&lt;div&gt;We have gotten a lot of mileage out of validation through looking\nat internal state.&nbsp; Primarily this boils down to listening to\nlistener interfaces, and saying that the test passes if the right\nlisteners are called.&lt;/div&gt;\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;\n&lt;div&gt;- David Herron&lt;/div&gt;\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;\n&lt;blockquote type=&quot;cite&quot; cite&gt;&lt;tt&gt;&lt;br&gt;\nIt isn&#39;t a question of being favorable or not.&nbsp; It is a question\nof &quot;Do you&lt;br&gt;\nwant to automate the testing of your GUI with JUnit?&nbsp; And if so,\nto what&lt;br&gt;\ngranularity?&quot;&nbsp; I think testing the GUI is always good, but\nthere are&lt;br&gt;\nlimitations for JUnit to do this.&nbsp; If there is pertinent state\ninformation&lt;br&gt;\nthat you want to capture (which it doesn&#39;t sound like there is) you\ncan use&lt;br&gt;\nthe approach I mentioned before.&nbsp; If you simply want to test the\noverall&lt;br&gt;\nlook, a one-eyed inspection is fine.&nbsp; If you want to\nprogrammatically test&lt;br&gt;\nthe overall look, something like SilkTest would probably be a good way\nto&lt;br&gt;\ngo.&nbsp; I think that having state inspectors on every GUI component\nis&lt;br&gt;\noverkill!&nbsp; If there is some meta-state that your controller gets\nfrom the&lt;br&gt;\nview to effect a change on your model, then write an inspector on\nyour&lt;br&gt;\ncontroller for that, but not just for testing.&nbsp; The test should\nreflect (to&lt;br&gt;\nsome degree) the usage.&nbsp; Again, this isn&#39;t a silver bullet, it&#39;s\njust one&lt;br&gt;\nexample.&lt;br&gt;\n&lt;br&gt;\nMVC can be difficult.&nbsp; If it is done improperly it offers many\ntraps!!&nbsp; But&lt;br&gt;\ndone rightly, it&#39;s a wonderful tool.&nbsp; Testing is easier,\nrefactoring is&lt;br&gt;\neasier, etc.&lt;/tt&gt;&lt;br&gt;\n&lt;tt&gt;&lt;/tt&gt;&lt;/blockquote&gt;\n&lt;blockquote type=&quot;cite&quot; cite&gt;&lt;tt&gt;-Jason&lt;/tt&gt;&lt;br&gt;\n&lt;tt&gt;&lt;/tt&gt;&lt;/blockquote&gt;\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;\n&lt;x-sigsep&gt;&lt;pre&gt;-- \n&lt;/pre&gt;&lt;/x-sigsep&gt;\n&lt;/body&gt;\n&lt;/html&gt;\r\n--============_-1219755547==_ma============--\r\n\n", 
    "subject": "RE: [junit] Best Practice for Tests ?"
}