{
    "numMessagesInTopic": 3, 
    "nextInTime": 14765, 
    "senderId": "ZfqIuiLo33Qu3yGH8Grftp-wvhYPfauwWZ_gpP3L50L97mdKDc_LZtX2Dud74Wdiq07Xh2WaBgrpxkDmpz81WSc_zeu7", 
    "systemMessage": true, 
    "subject": "How to test a JCA coonector?", 
    "from": "&quot;Patrick&quot; &lt;despeedo@...&gt;", 
    "authorName": "Patrick", 
    "msgSnippet": "hi folks, I have some serious doubts about how to test a JCA connector. The company I work for has developed this connector to an EIS written in C/C++. This", 
    "msgId": 14764, 
    "profile": "pcropalato", 
    "topicId": 14764, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 192911730, 
    "messageBody": "<div id=\"ygrps-yiv-1488350301\">hi folks,<br/>\n<br/>\nI have some serious doubts about how to test a JCA connector. The<br/>\ncompany I work for has developed this connector to an EIS written in<br/>\nC/C++. This JCA connector uses the Command design pattern in order to<br/>\nget/send and validate information on the EIS. <br/>\n<br/>\nNow they have added two new commands to this connector and I&#39;m<br/>\nsupposed to test them. As it&#39;s legacy code, there are no junit tests<br/>\nand I will be the first one to write them but only for those new<br/>\ncommands. My idea is to test the JCA connector out of the container<br/>\nand have a mock EIS since testing inside the container and connecting<br/>\nto the real EIS seems really painfull to me. :)  <br/>\n<br/>\nHowever, I have no clue how to do that cause the code under test does<br/>\nnot offer a way of receiving a mock object. This code instanciates all<br/>\nit needs within the Command method execute. <br/>\n<br/>\nIs there any framework that could help me in this challenging<br/>\nsituation? Something like simulating a fake container and EIS. I did<br/>\nsome googling over the internet and also searched over this group but<br/>\ncouldn&#39;t find anything :( Any ideas?<br/>\n<br/>\nregards,<br/>\nPatrick</div>", 
    "prevInTime": 14763, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1126275602", 
    "canDelete": false, 
    "nextInTopic": 14768, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGRmczVtaStsZ3ZpQGVHcm91cHMuY29tPg=="
    }
}