{
    "numMessagesInTopic": 3, 
    "nextInTime": 14777, 
    "senderId": "lOsQZbJaVednNDebYWWTjQ1RtnW72rX3qFPGojQ5A8sBjBtq0CzGXYAdiynLvfxMBotdcR6yLIUxXxVLak_Ve96IqqcTCvPC", 
    "systemMessage": false, 
    "subject": "RE: [junit] JUnit 4 API layers for IDE support and test-flavor developers", 
    "from": "&quot;Kent Beck&quot; &lt;kentb@...&gt;", 
    "authorName": "Kent Beck", 
    "msgSnippet": "Wes, I ve read your message several times. I get the feeling that if I understood it, I would be in a much better position to finish JUnit 4. It would help me ", 
    "msgId": 14776, 
    "rawEmail": "Return-Path: &lt;kentb@...&gt;\r\nX-Sender: kentb@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 55725 invoked from network); 13 Sep 2005 05:23:05 -0000\r\nReceived: from unknown (66.218.66.166)\n  by m31.grp.scd.yahoo.com with QMQP; 13 Sep 2005 05:23:05 -0000\r\nReceived: from unknown (HELO smtpauth03.mail.atl.earthlink.net) (209.86.89.63)\n  by mta5.grp.scd.yahoo.com with SMTP; 13 Sep 2005 05:23:05 -0000\r\nReceived: from [67.131.9.243] (helo=T42)\n\tby smtpauth03.mail.atl.earthlink.net with asmtp (Exim 4.34)\n\tid 1EF3G4-0004LC-Fn\n\tfor junit@yahoogroups.com; Tue, 13 Sep 2005 01:23:04 -0400\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nDate: Mon, 12 Sep 2005 22:22:52 -0700\r\nMIME-Version: 1.0\r\nContent-Type: text/plain;\n\tcharset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Mailer: Microsoft Office Outlook, Build 11.0.5510\r\nThread-Index: AcV14gZglU3A2e6ERQ6UimOFbTTztw/wuaRg\r\nX-MimeOLE: Produced By Microsoft MimeOLE V6.00.2900.2180\r\nIn-Reply-To: &lt;d90urt+i91r@...&gt;\r\nMessage-ID: &lt;E1EF3G4-0004LC-Fn@...&gt;\r\nX-ELNK-Trace: 6d780abf06d998e474bf435c0eb9d478fed25d3098752d295e06def62958498c7d2b90b9811d7098350badd9bab72f9c350badd9bab72f9c350badd9bab72f9c\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: &quot;Kent Beck&quot; &lt;kentb@...&gt;\r\nSubject: RE: [junit] JUnit 4 API layers for IDE support and test-flavor developers\r\nX-Yahoo-Group-Post: member; u=173198504; y=Pp0Ap40eO4ekHcoRIGQhhmXtbH--FuTd9fD70jaU5thNdube\r\nX-Yahoo-Profile: kentlbeck\r\n\r\nWes,\n\nI&#39;ve read your message several times. I get the feeling that if I understood\nit, I would be in a much better position to finish JUnit 4. It would help me\nif you would go through your steps below and make concrete proposals where\nyou can. The problem we are grappling with at the moment is specifying\nsuites of tests. We&#39;d like the specification to be in source code, be\ndeclarative if possible, compose nicely, and communicate their intent\nclearly. We tried attaching annotations to packages (via package-info.java),\nbut the annotations don&#39;t seem to be available if the compiled code is\nstored in files and directories instead of a JAR file, so that won&#39;t work.\n\nSincerely yours,\n\nKent Beck\nThree Rivers Institute\n\n&gt; -----Original Message-----\n&gt; From: junit@yahoogroups.com [mailto:junit@yahoogroups.com] On \n&gt; Behalf Of wesisberg\n&gt; Sent: Saturday, June 18, 2005 4:00 AM\n&gt; To: junit@yahoogroups.com\n&gt; Subject: [junit] JUnit 4 API layers for IDE support and \n&gt; test-flavor developers\n&gt; \n&gt; Hi all (and Kent in particular) -\n&gt; \n&gt; Kent has said in the original JUnit 4 thread:\n&gt; \n&gt; &gt; The theme of JUnit 4 is to encourage more developers \n&gt; &gt; to write more tests by further simplifying JUnit.\n&gt; \n&gt; and \n&gt; \n&gt; &gt; AFAIK, IDEs look for subclasses of TestCase or classes implementing\n&gt; a static\n&gt; &gt; suite() method to identify tests.\n&gt; \n&gt; imho, that&#39;s a problem: IDE&#39;s are trying to support JUnit tests\n&gt; directly.  As another design goal for JUnit 4, I&#39;d recommend making \n&gt; it easy for IDE support developers and test flavor developers as\n&gt; well as for test developers.  That means getting IDE&#39;s out of the\n&gt; business of running tests directly.\n&gt; \n&gt; In nearly every job I encounter pressure to make tests runnable\n&gt; under JUnit because of the pervasive IDE and build support \n&gt; JUnit enjoys.  Because of the assumptions about test classes and\n&gt; tests being methods, I&#39;ve even had to generate classes using \n&gt; bytecode toolkits to trick the harness into working.  And using\n&gt; any variant of test generation entails enforcing code standards \n&gt; about what happens in static suite() methods.  \n&gt; \n&gt; I understand that you&#39;re really only concerned with making things\n&gt; easier for the test developer, but at this point with JUnit being\n&gt; the de facto standard, making it easier for domain-specific test\n&gt; flavors to run as JUnit tests would probably increase the amount\n&gt; of testing that gets done.\n&gt; \n&gt; You&#39;ve already asked for a concrete proposal for an API for\n&gt; dynamically generated tests (fair enough), but I wanted to check\n&gt; whether you really did want to be in the business of creating\n&gt; API layers for IDE/test runner support and test-flavor developers.\n&gt; You already have the layers, but they&#39;re not orthogonal because\n&gt; of shared assumptions about test identifiers, tests as methods, etc.\n&gt; \n&gt; In process order:\n&gt; \n&gt; - {Harness}: to gather test specifications, direct and track testing\n&gt;   (IDE/Ant/... support developer, command-line test deployer)\n&gt;   Without this, IDE&#39;s assume a flavor of test, the JUnit one.\n&gt; \n&gt; - {TestGatherer}: to select and order tests \n&gt;   (test deployer as user, test flavor developer as provider)\n&gt;   Without this, harness has to make test-flavor-specific assumptions\n&gt;   about test attributes/metadata and suite composition.\n&gt; \n&gt; - TestRunner/Test: to create and run each test\n&gt;   (test developer as user, test flavor developer as provider)\n&gt;   Where different flavors of tests can be adapted.\n&gt; \n&gt; - Test/TestCase: for each flavor of test \n&gt;   (test developer)\n&gt;   Here&#39;s where the JUnit model (test == Method) is but one.\n&gt; \n&gt; One harness I&#39;ve developed is in open source in the AspectJ tree.  It\n&gt; concretizes some abstractions that might be relevant:\n&gt; \n&gt; - Test specification: this describes a test (for harness selection,\n&gt; preflight, and display), and can be used by a factory to create the\n&gt; test.  Among other things, you can create data- or\n&gt; specification-driven tests and need only create one test at a time,\n&gt; which makes it easier to have suites with thousands of generated\n&gt; tests.  \n&gt; \n&gt; - Test identifier: In the AspectJ tree, we use the test title as a\n&gt; test identifier for identifying fixes (failed, now pass) or\n&gt; regressions (passed, now fail).  This would have to be a first-class\n&gt; abstraction to avoid knowing too much about test flavors.  (When\n&gt; generating tests I found it hard to map data-driven identifiers to\n&gt; method names in generated classes.  And assuming that all tests \n&gt; are always passing results in failing-test limbo: ignored\n&gt; by comment or annotation, rather than being visible and managed.)\n&gt; \n&gt; - A test run is a composite test composed of sub-runs.  The\n&gt; distinction between &quot;suite&quot; and &quot;test&quot; is collapsed.  It makes it easy\n&gt; to write standard test flavors.  For the AspectJ domain, runs are\n&gt; things like compile, weave, and run, and tests are composed of these\n&gt; steps.  Put another way, it&#39;s tests all the way down (rather than\n&gt; suite{, suite..}, test.., assert..).  This is also where\n&gt; decorators can work, since a parent can act as around advice.\n&gt; \n&gt; - Messages are associated with each run, and are ways to pass signals\n&gt; around.  The default behavior can be like JUnit asserts (abort on fail\n&gt; message), but the more useful behavior is for the parent to interpret\n&gt; expected and actual messages.  This makes it easier to reuse steps\n&gt; (e.g., database lookup - normal; database lookup (broken pipe)), and\n&gt; to have endemic logging.  (One critique I have of JUnit is that it\n&gt; assumes the developer is evaluating a test failure and can re-run the\n&gt; test (or that the stack trace is sufficient); messages make it easy\n&gt; for another developer or for build folks to identify things like setup\n&gt; failures.)\n&gt; \n&gt; - keywords are simply text associated with a test (cf JavaTest). \n&gt; These make it very easy to self-name and anoint tests, and to select\n&gt; tests based on unions, intersections, etc.  Annotations can be one\n&gt; source for these. \n&gt; \n&gt; - Sandbox is a place for temporary junk, encoding good TDD practice.\n&gt; (In the AspectJ harness it also provides shared state, so, e.g., the\n&gt; compiler can set the classpath used when running the class). \n&gt; However...)\n&gt; \n&gt; (This is by no means to say the AspectJ harness is a model for JUnit;\n&gt; it&#39;s feature-driven and not for general use.)\n&gt; \n&gt; Two other things not in the harness:\n&gt; \n&gt; - World (in the weaver). For expressly-shared state.  \n&gt; \n&gt; - a thread&#39;s current messages, sandbox, test (i.e., chain of tests),\n&gt; and world might all be accessible via a threadlocal, so IDE/harnesses\n&gt; can provide real-time or snapshot information.  Elsewhere I&#39;ve called\n&gt; variants of this the test context.\n&gt; \n&gt; This is  a more ambitious project than upgrading JUnit to simplify \n&gt; the test developer&#39;s work using annotations and static imports, so\n&gt; I&#39;m assuming you&#39;re not interested in all of it, but might be \n&gt; interested in concrete/code proposals for categories/keywords and\n&gt; factories.  However, I figured now&#39;s the time to ask!\n&gt; \n&gt; Wes\n\n\n", 
    "profile": "kentlbeck", 
    "topicId": 13980, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 173198504, 
    "prevInTime": 14775, 
    "contentTrasformed": false, 
    "postDate": "1126588972", 
    "canDelete": false, 
    "nextInTopic": 14781, 
    "prevInTopic": 13980, 
    "headers": {
        "inReplyToHeader": "PGQ5MHVydCtpOTFyQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PEUxRUYzRzQtMDAwNExDLUZuQHNtdHBhdXRoMDMubWFpbC5hdGwuZWFydGhsaW5rLm5ldD4="
    }
}