{
    "numMessagesInTopic": 57, 
    "nextInTime": 1478, 
    "senderId": "Zl5IdhBarns3BSSZaCs5Idi40yqk7tGRBs1Y_8mM-cKZlAgR0H_-gDUCTU4x75khGJOWDxcOiqu2a2wNkpy9-QQI8BPrtdBMC1Mdw4joaTKErCA", 
    "systemMessage": false, 
    "subject": "RE: [junit] Best Practice for Tests ?", 
    "from": "&quot;Jason Rogers&quot; &lt;jason.rogers@...&gt;", 
    "authorName": "Jason Rogers", 
    "msgSnippet": "Thanks a bunch David.  Do you by any chance have a video copy of that presentation or write-up? -Jason ... From: David Herron [mailto:davidh@7gen.com] Sent:", 
    "msgId": 1477, 
    "topicId": 1411, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-2114099019\">Thanks a bunch David.  Do you by any chance have a video copy of that<br/>\npresentation or write-up?<br/>\n<br/>\n-Jason<br/>\n-----Original Message-----<br/>\nFrom: David Herron [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:davidh@...\">davidh@...</a>]<br/>\nSent: Tuesday, June 12, 2001 1:29 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSubject: RE: [junit] Best Practice for Tests ?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI&#39;ve only just begun to look at using JUnit, however I have a lot of<br/>\nexperience with automating GUI tests.<br/>\n<br/>\n<br/>\nI should introduce myself a little - I work for the Java SW Division of Sun<br/>\n(or whatever the official name for Javasoft is nowadays), developing test<br/>\ntools and test suites in the group that tests the &quot;client aspects&quot; of J2SE<br/>\n(the software package previously known as &quot;The JDK&quot;).  I had a hand in<br/>\ncreating the java.awt.Robot class (this email address is my personal email).<br/>\n<br/>\n<br/>\nIn our team we widely use Robot for GUI automation.  We do, though, have<br/>\ndifferent requirements than most since we are testing the JDK as it is being<br/>\ndeveloped, rather than testing an application built using the shipping JDK.<br/>\nI gave a brief talk last week at a JavaOne BOF about what we&#39;re doing for<br/>\nGUI test automation.<br/>\n<br/>\n<br/>\nThe glance I&#39;ve taken at JUnit so far tells me it&#39;s a framework to help<br/>\ncreating test cases, and that there&#39;s nothing in it to aid GUI automation.<br/>\nWe&#39;ve created a few different similar frameworks in our test suites here,<br/>\nand I can tell you that at the level I see JUnit operating, that use of<br/>\nRobot fits in very well.  Also, that if you choose to use Robot, that you<br/>\nwill need to develop some higher level code to provide higher level<br/>\nfunctionality.<br/>\n<br/>\n<br/>\nWe have gotten a lot of mileage out of validation through looking at<br/>\ninternal state.  Primarily this boils down to listening to listener<br/>\ninterfaces, and saying that the test passes if the right listeners are<br/>\ncalled.<br/>\n<br/>\n<br/>\n- David Herron<br/>\n<br/>\n<br/>\n<br/>\nIt isn&#39;t a question of being favorable or not.  It is a question of &quot;Do you<br/>\nwant to automate the testing of your GUI with JUnit?  And if so, to what<br/>\ngranularity?&quot;  I think testing the GUI is always good, but there are<br/>\nlimitations for JUnit to do this.  If there is pertinent state information<br/>\nthat you want to capture (which it doesn&#39;t sound like there is) you can use<br/>\nthe approach I mentioned before.  If you simply want to test the overall<br/>\nlook, a one-eyed inspection is fine.  If you want to programmatically test<br/>\nthe overall look, something like SilkTest would probably be a good way to<br/>\ngo.  I think that having state inspectors on every GUI component is<br/>\noverkill!  If there is some meta-state that your controller gets from the<br/>\nview to effect a change on your model, then write an inspector on your<br/>\ncontroller for that, but not just for testing.  The test should reflect (to<br/>\nsome degree) the usage.  Again, this isn&#39;t a silver bullet, it&#39;s just one<br/>\nexample.<br/>\n<br/>\nMVC can be difficult.  If it is done improperly it offers many traps!!  But<br/>\ndone rightly, it&#39;s a wonderful tool.  Testing is easier, refactoring is<br/>\neasier, etc.<br/>\n<br/>\n-Jason<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor<br/>\n<br/>\n<br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service.</div>", 
    "prevInTime": 1476, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "992368238", 
    "canDelete": false, 
    "nextInTopic": 1480, 
    "prevInTopic": 1476, 
    "headers": {
        "messageIdInHeader": "PDg3RUU2QjIxQzYyNEQ1MTFCNzI0MDAxMDRCQ0YxRUIwMUY2MDM2QGV4Y2g+"
    }
}