{
    "numMessagesInTopic": 5, 
    "nextInTime": 14814, 
    "senderId": "5263jtkZ5DUwNdM6-yoiMqTaLj_-Ur1WzMsZ1s0qNAtkN5HM6e4zJpe-OdKQbMK8hglb50nLMQ8MejbFI3umgpQ8drWQt5-qcRPALhj1_dak6DWkWu8", 
    "systemMessage": true, 
    "subject": "Initailizing Objects in Test Cases from a TestSuite", 
    "from": "&quot;Nathaniel Troutman&quot; &lt;locutusofbeira@...&gt;", 
    "authorName": "Nathaniel Troutman", 
    "msgSnippet": "Hello all, I m a Sophmore in College and have been programming for several years in various languages. This semester I m in Data Structures and our first", 
    "msgId": 14813, 
    "profile": "nathaniel_troutman", 
    "topicId": 14813, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 101042287, 
    "messageBody": "<div id=\"ygrps-yiv-1763752629\">Hello all,<br/>\n<br/>\nI&#39;m a Sophmore in College and have been programming for several years<br/>\nin various languages. This semester I&#39;m in Data Structures and our<br/>\nfirst project is to write implementations of a List. Our classes<br/>\nimplement a ListADT interface, but we have to write three different<br/>\nimplementations, one using Fixed Arrays, on that can &quot;Dynamically&quot;<br/>\nresize arrays, and a Link List. We also have to write a tests to<br/>\nensure our list implementations are good. Having heard of JUnit I<br/>\nthought this would be a good time to learn it. So far it has worked<br/>\nfine for testing a single implementation. I have several TestCase<br/>\nclasses testing different aspects of the list, and have added them to<br/>\na sutie so that they can be all be run at once. However, I want to be<br/>\nable to test all three implementations at once in on fell swoop, with<br/>\nout having to write three sets of test cases and three test suites.<br/>\n<br/>\nI have abstracted out the creation of lists to a utility class, so<br/>\nthat my TestCases call methods of the Utility class for a new list,<br/>\nthis way I only have to change the constructors in one class, when I<br/>\nwant to use my other implementations of the list. I would like to be<br/>\nable to pass my test cases the object to use for creating lists so<br/>\nthat I can have a different untility class for each impelmentation. So<br/>\nI need to be able to pass a untility object to each test case before<br/>\nit runs any of the tests. So far I haven&#39;t found a way to do this JUnit.</div>", 
    "prevInTime": 14812, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1126816086", 
    "canDelete": false, 
    "nextInTopic": 14816, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGRnY2xnbStlNTgwQGVHcm91cHMuY29tPg=="
    }
}