{
    "numMessagesInTopic": 1, 
    "nextInTime": 14847, 
    "senderId": "hrjnpiRDuNYVlWLrz0VKkN0LXRJvdsBlH4kPfWr2ZAj1LvSMVhMZod2j6d5oVkR6ReLe_SPmWaDjOo2o8aSA1GXKAPFreRlyKi2sLV7hUl6AEYNAEGNx49GyqlntwA", 
    "systemMessage": true, 
    "subject": "Testing Documentum", 
    "from": "&quot;Rutherford, Michael  &quot; &lt;michael.rutherford@...&gt;", 
    "authorName": "Rutherford, Michael", 
    "msgSnippet": "I ve been looking at an existing Documentum web application. No tests exist. As part of maintaining the app I ve been wanting to create JUnit test cases to", 
    "msgId": 14846, 
    "profile": "mrutherfurd", 
    "topicId": 14846, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 229542016, 
    "messageBody": "<div id=\"ygrps-yiv-1042753746\">I&#39;ve been looking at an existing Documentum web application. No tests exist.<br/>\nAs part of maintaining the app I&#39;ve been wanting to create JUnit test cases<br/>\nto document current behaviour prior to making changes. Unfortunately the<br/>\nDocumentum object model is so integral to practically everything that I<br/>\nhaven&#39;t been able to create tests for anything substantial.<br/>\n<br/>\nHas anyone had previous experience with testing this product?<br/>\n<br/>\nMichael Rutherfurd<br/>\n<br/>\n<br/>\n**************   IMPORTANT MESSAGE  **************<br/>\nThis e-mail message is intended only for the addressee(s) and contains information which may be confidential. <br/>\nIf you are not the intended recipient please advise the sender by return email, do not use or disclose the contents, and delete the message and any attachments from your system. Unless specifically indicated, this email does not constitute formal advice or commitment by the sender or the Commonwealth Bank of Australia (ABN 48 123 123 124) or its subsidiaries. <br/>\nWe can be contacted through our web site: commbank.com.au. <br/>\nIf you no longer wish to receive commercial electronic messages from us, please reply to this e-mail by typing Unsubscribe in the subject line.<br/>\n***************************************************************</div>", 
    "prevInTime": 14845, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1127096564", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDIzNkYyOTlFRkM2QTg4NDE5MEE3NzA0OTA2RkFDMDZFMDM5QjBEMDNAYzIwNTk2MHMxNj4="
    }
}