{
    "topicId": 1485, 
    "postDate": "992374765", 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "from": "Keith Ray &lt;keith.ray@...&gt;", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "Yxsy85sG5oUAahzZL04YYOn59Agx7lYvE7f_lONk4-mP3SsDfLQQw2QPhEM3ZJiJkTe1LSoYwVqNPBCuve50AbAi-TM", 
    "nextInTime": 1486, 
    "userId": 0, 
    "prevInTime": 1484, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PEQ5RjZCOURBQkE0Q0FFNEI5Mjg1MDI1MkM1MjM4M0FCMDEwMUY2RTdAZXgtZW5nLWNvcnA+"
    }, 
    "authorName": "Keith Ray", 
    "numMessagesInTopic": 1, 
    "msgSnippet": "[I m quoting many people here... please don t flame the lack of attributions.] ... You seem to be advocating black box testing. The XP approach is test", 
    "contentTrasformed": false, 
    "msgId": 1485, 
    "nextInTopic": 0, 
    "systemMessage": false, 
    "rawEmail": "Return-Path: &lt;Keith.Ray@...&gt;\r\nX-Sender: Keith.Ray@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-7_1_3); 12 Jun 2001 19:40:55 -0000\r\nReceived: (qmail 73656 invoked from network); 12 Jun 2001 19:39:32 -0000\r\nReceived: from unknown (10.1.10.27) by l7.egroups.com with QMQP; 12 Jun 2001 19:39:32 -0000\r\nReceived: from unknown (HELO EX-IMC3-CORP.efi.com) (192.68.228.4) by mta2 with SMTP; 12 Jun 2001 19:39:31 -0000\r\nReceived: by EX-IMC3-CORP.efi.com with Internet Mail Service (5.5.2653.19) id &lt;MNRVG5SS&gt;; Tue, 12 Jun 2001 12:39:29 -0700\r\nMessage-ID: &lt;D9F6B9DABA4CAE4B92850252C52383AB0101F6E7@ex-eng-corp&gt;\r\nTo: &quot;&#39;junit@yahoogroups.com&#39;&quot; &lt;junit@yahoogroups.com&gt;\r\nSubject: RE: Best Practice for Tests \r\nDate: Tue, 12 Jun 2001 12:39:25 -0700\r\nMIME-Version: 1.0\r\nX-Mailer: Internet Mail Service (5.5.2653.19)\r\nContent-Type: multipart/alternative; boundary=&quot;----_=_NextPart_001_01C0F377.631FF370&quot;\r\nFrom: Keith Ray &lt;keith.ray@...&gt;\r\n\r\n\r\n------_=_NextPart_001_01C0F377.631FF370\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\n\r\n[I&#39;m quoting many people here... please don&#39;t flame the lack of\nattributions.]\n\n&gt;I guess I disagree here.  I am not convinced that package-potected methods\n&gt;are part of a public interface.  If they are used that way I would question\n&gt;whether some refactoring needed to take place.  But that&#39;s just my opinion.\n&gt;I don&#39;t want to seem like I am picking on your design decisions.\n\nYou seem to be advocating &quot;black box&quot; testing. \n\nThe XP approach is &quot;test everything that could possibly break&quot;. My approach\n*includes* testing classes by subclassing and by calling protected methods.\nIf a &quot;private&quot; method needs to be tested, I make it &#39;package-protected&#39;.\n\nOther XPers say that if there are several &quot;private&quot; methods that need to be\ntested, they refactor them into another class - where they become public,\nand that class is used as a private member of the original class.\n\nPackage-protected is the Java equivalent of C++ &quot;friend&quot;, and yes I know\nthat &quot;friend&quot;ship can be a sign of &quot;bad design&quot;, but on rare occasions, it\nis the best design.\n\n--\n\n&gt;A perspective that has worked well for me is that protected methods are\n&gt;private to the framework but not within it. So you set a method as\nprotected\n&gt;if it is not part of the public interface that the framework provides but\nit\n&gt;does provide services to other classes within the framework or to\nextensions\n&gt;to the framework (i.e. subclasses).\n&gt;\n&gt;So if you are testing a framework as a &#39;black box&#39; service provider, you\n&gt;don&#39;t necessarily need to test protected methods, but if you are testing a\n&gt;framework at a deeper level, then you might find yourself doing just that.\n\nAgree. \n\n&quot;Black Box&quot; testing is appropriate for XP Acceptance tests. Unit testing is\n&quot;White Box&quot; testing.\n\n&gt;The real issue of this sub-thread is in where to locate tests and why.  The\n&gt;original quote (paraphrased) was that &quot;we put tests in the same package as\n&gt;production code to make it easier to test protected interfaces of our\n&gt;objects.&quot;  I don&#39;t see where this fits in to good design or good testing\n&gt;practices.  The virtue of public/protected/private/default is not what I\nwas\n&gt;questioning.  I wanted to point out the potential flaws of design and\n&gt;testing that could otherwise be missed when you put tests in the same\n&gt;package as production code.  The production code should be tested in the\n&gt;same fashion it would be used by a client.  A test is a client in some\n&gt;degree.  In most cases clients exist outside of the package.\n\nThat would be &quot;black box testing&quot;. XP unit testing is &quot;white box&quot;. I am my\nown client, most classes in my application are in the same package, so most\ntests should also be in the same package.\n\n&gt; but this is turning into a thread on Java design issues, maybe we should\n&gt; take it elsewhere.\n\nTest-first-programming enabled by JUnit is a design technique. Do a google\nsearch on &quot;test-first-design&quot;.\n\nThe XP mailing list could use some on-topic postings...\n\n--\n\n&gt;1. Code coverage analysis should be your guide in making decisions about\n&gt;whether testing through public APIs provide thorough enough test coverage\n&gt;(80%? 95%?, depending on the quality you&#39;re shooting for and (relevant to\n&gt;that) the industry you&#39;re in).  Naturally, coverage analysis will inform\n&gt;your testing decisions, which in turn will likely inform your design\n&gt;decisions.\n\nAgree\n\n&gt;2. In the &quot;real world&quot; of non-ideal engineering situations, a QA team or\n&gt;engineer may well be tasked with, among other things, unit testing code or\n&gt;working with a team of engineers who do not do unit testing and cannot be\n&gt;convinced to do so.  In this case, the powerful benefit of the coding-unit\n&gt;testing feedback loop is mostly lost and severely diluted, but the QA team\n&gt;must do its best to test whatever craziness comes its way.  The values of\n&gt;unit testing are diminished, but by no means entirely, even if only the QA\n&gt;team does it. Ditto for testing legacy systems over which one had no design\n&gt;control for historical reasons.\n&gt;\n&gt;Scott Stirling\n&gt;JRun QA\n&gt;Macromedia\n\nAgree. (Is Macromedia hiring, BTW?)\n\n--\n\n&gt;If you test classes, you write unit tests.\n&gt;If you test subsystems, you write black-box or white-box tests (or \n&gt;integration tests).\n&gt;\nThe main goal of JUnit is to write unit tests.  Although JUnit can be \n&gt;used to write integration tests, it is not its main goal.  With JUnit, \n&gt;you have problems if you want to test the user interaction or really \n&gt;complex systems (-&gt; use of mock objects).\n\nAgree\n\n--\n\n&gt;Lurker here, but I thought I&#39;d chime in to agree with\n&gt;Vladimir on this.  In an ideal world, test cases might\n&gt;stay separate, but the first hurdle is often just\n&gt;getting developers to write them, and that&#39;s a lot\n&gt;easier to manage when the test case lives in the same\n&gt;package as their code.\n&gt;\n&gt;Co-mingling increases the chances that they&#39;ll use the\n&gt;test case for all of their incremental testing\n&gt;(instead of writing little mini-clients or main()\n&gt;methods to test/debug), and helps make unit testing\n&gt;seem like part of the development process instead of a\n&gt;post-coding chore.  \n&gt;\n&gt;We can always auto-repackage stuff later, but in my\n&gt;experience, it&#39;s not always easy to get people to go\n&gt;back and write test cases when there&#39;s more\n&gt;interesting work to be done.\n\nI agree. People have my company have done things both ways. I think we get\nMORE unit tests and more testing in general when the unit test source files\nare in the same directory as the code-under-test-source-files. Looking a\ndirectory, it is easy to see which classes are not tested.\n\nclass-under-test file name == class-under-test-name + &quot;.java&quot;\nTest source file name == class-under-test-name + &quot;Test.java&quot;\n\nIn Metrowerks CodeWarrior, it is VERY EASY to make a &#39;testing&#39; target and a\n&#39;release&#39; target, and to leave the all of test sources out of the release\ntarget. Each target produces a different jar file, and you can flip between\ntargets with one mouse-click, and run the app or the tests with one more\nmouse-click.\n\n[referring to &quot;mingling...helps make unit testing...part of the... process]\n&gt;Why do you say that?  I think this is pure speculation, but if you have\nsome\n&gt;actual metrics I would be interested in seeing them.\n\n&quot;Metrics, we don&#39;t need no stinking metrics!&quot;  Why do you assume this is\nspeculation? In my case, it is observation. It may be observation by the\noriginal poster, too.\n\n&gt;Again, I am baffled at your logic, but if you have actual results please\n&gt;share them.\n\nI have shared MY results... but I&#39;m not going to get in an accountant in to\n&quot;certify&quot; them. This isn&#39;t the academy awards or a scientific study...\n\n[referring to &quot;auto-repackage later...&quot;]\n&gt;This is a burden on the process.  \n\nNo it isn&#39;t! (This is the argument office, right? :-) see above.)\n\n&gt;Also, depending on\n&gt;your source control system, this could be somewhat detrimental to your\n&gt;company&#39;s history markers and metrics.  Moving a class out of one package\nto\n&gt;another (which we must do from time to time) will cause another root to be\n&gt;formed in the new package and an orphaned leaf in the old.  You could lose\n&gt;valuable history.  Not to mention that in distributed team environments\n&gt;others may be expecting for your class(es) to be &quot;in the same ol&#39; place&quot;\nand\n&gt;if you move them, you cause some degree of hassle.  Sometimes this is\n&gt;unavoidable, but I think it is a bad practice to get into.\n\nThis refactoring/moving argument applies equally to keeping the tests in the\nsame directory as well as to keeping the tests in a separate directory. By\nkeeping the tests in a different directory, it is slightly more likely to\nget left behind and forgotten, when someone moves a class but not its\ntest-class.\n\nI have moved class + test around without ill effects.\n\n&gt;That is a fault of not doing test-first which you will face no matter where\n&gt;the test cases live.  The thought in my mind is that tests are an integral\n&gt;part of the system, they drive the design for us (in XP).  They are not\nsome\n&gt;special case group of bastardized objects that can be taken or not.  They\n&gt;are essential.\n\nAgree.\n\n&gt;Don Wells once said (I believe it was Don, if anyone knows\n&gt;differently please correct me), &quot;Throw away my code, but never throw away\nmy\n&gt;tests.&quot;  Point being that he would be able to rebuild the system again from\n&gt;scratch if he had the tests.  If you threw away the tests and gave him the\n&gt;production code, he would be floundering in agony to reproduce all of those\n&gt;tests.\n&gt;\n&gt;Tests are not simply obilgatory objects that satisfy some requirements from\n&gt;management... they are the life-sustaining power of the code, in my\nopinion!\n\nAgree.\n\n&gt;Again, why?  No one has yet given me one concrete answer as to why this\n&gt;should be.  It&#39;s all been ambiguous speculation.\n\nAnswer these questions: is this base-class robust enough for me and anyone\nelse to subclass? Do the protected methods that are called by the\nsubclasses/other-classes-in-this-package work? Is making this function\nprivate going to cause hard-ship to the subclasser, unit-test-class, or\nother-classes-in-this-package? Is this un-tested legacy code really doing\nwhat it is supposed to be doing? (What the heck IS this un-tested legacy\ncode doing?)\n\nFinding the answers to these questions is why I sometimes test\nprotected/&quot;private&quot; methods.\n\n&gt;After testing the model, I like to do integration tests for model, control\n&gt;and view. I do this by checking the view. But as the view is used by users\n&gt;only, there is no need to know state, at least for programm components\nother\n&gt;than the tests. This approach is (Did I get you right now?) not favorable\nin\n&gt;your eyes? Which would be your favorable approach?\n\nYou can test the view without testing the model by using a mock object in\nplace of the model.\n\nI sometimes test a view class by directly calling the methods that would\nnormally be indirectly called by buttons, etc., and then seeing that the\nmodel has the correct state. I don&#39;t &quot;simulate&quot; AWT/Swing events, I just\ncall functions of the class. I don&#39;t call the anonymous-class-methods that\nare listening for events because those are one-line methods that call an\neasily-tested method in the view class.\n\nFor &quot;view&quot;, see the design pattern &quot;mediator&quot;.\n\n&gt;MVC can be difficult.  If it is done improperly it offers many traps!!  But\n&gt;done rightly, it&#39;s a wonderful tool.  Testing is easier, refactoring is\n&gt;easier, etc.\n\nAgree.\n\n&gt;From the QA perspective, the methods within the public API are the \n&gt;functional methods and these methods require a\n&gt;functional test written by the QA team.  This means that there is \n&gt;double coverage on testing the methods in the public\n&gt;API and developers are not simply checking themselves.\n\nAgree.\n\n&gt;We have gotten a lot of mileage out of validation through looking at\n&gt;internal state.  Primarily this boils down to listening to listener\n&gt;interfaces, and saying that the test passes if the right listeners are\n&gt;called.\n\nGood separate of GUI class testing from the model testing...\n\n\r\n------_=_NextPart_001_01C0F377.631FF370\r\nContent-Type: text/html;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 3.2//EN&quot;&gt;\n&lt;HTML&gt;\n&lt;HEAD&gt;\n&lt;META HTTP-=\r\nEQUIV=3D&quot;Content-Type&quot; CONTENT=3D&quot;text/html; charset=3Diso-8859-1&quot;&gt;\n&lt;META N=\r\nAME=3D&quot;Generator&quot; CONTENT=3D&quot;MS Exchange Server version 5.5.2653.12&quot;&gt;\n&lt;TITL=\r\nE&gt;RE: Best Practice for Tests &lt;/TITLE&gt;\n&lt;/HEAD&gt;\n&lt;BODY&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;[I=\r\n&#39;m quoting many people here... please don&#39;t flame the lack of attributions.=\r\n]&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;&gt;I guess I disagree here.&nbsp; I am no=\r\nt convinced that package-potected methods&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;are=\r\n part of a public interface.&nbsp; If they are used that way I would questi=\r\non&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;whether some refactoring needed to take pl=\r\nace.&nbsp; But that&#39;s just my opinion.&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;I don&#39;=\r\nt want to seem like I am picking on your design decisions.&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;=\r\n&lt;FONT SIZE=3D2&gt;You seem to be advocating &quot;black box&quot; testing. &lt;/F=\r\nONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;The XP approach is &quot;test everything that =\r\ncould possibly break&quot;. My approach *includes* testing classes by subcl=\r\nassing and by calling protected methods. If a &quot;private&quot; method ne=\r\neds to be tested, I make it &#39;package-protected&#39;.&lt;/FONT&gt;&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=\r\n=3D2&gt;Other XPers say that if there are several &quot;private&quot; methods =\r\nthat need to be tested, they refactor them into another class - where they =\r\nbecome public, and that class is used as a private member of the original c=\r\nlass.&lt;/FONT&gt;&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;Package-protected is the Java equivalen=\r\nt of C++ &quot;friend&quot;, and yes I know that &quot;friend&quot;ship can=\r\n be a sign of &quot;bad design&quot;, but on rare occasions, it is the best=\r\n design.&lt;/FONT&gt;&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;--&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;&g=\r\nt;A perspective that has worked well for me is that protected methods are&lt;/=\r\nFONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;private to the framework but not within it. So=\r\n you set a method as protected&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;if it is not p=\r\nart of the public interface that the framework provides but it&lt;/FONT&gt;\n&lt;BR&gt;&lt;=\r\nFONT SIZE=3D2&gt;&gt;does provide services to other classes within the framewo=\r\nrk or to extensions&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;to the framework (i.e. su=\r\nbclasses).&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;So =\r\nif you are testing a framework as a &#39;black box&#39; service provider, you&lt;/FONT=\r\n&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;don&#39;t necessarily need to test protected methods, =\r\nbut if you are testing a&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;framework at a deepe=\r\nr level, then you might find yourself doing just that.&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FON=\r\nT SIZE=3D2&gt;Agree. &lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;&quot;Black Box&quot; tes=\r\nting is appropriate for XP Acceptance tests. Unit testing is &quot;White Bo=\r\nx&quot; testing.&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;&gt;The real issue of this =\r\nsub-thread is in where to locate tests and why.&nbsp; The&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT =\r\nSIZE=3D2&gt;&gt;original quote (paraphrased) was that &quot;we put tests in th=\r\ne same package as&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;production code to make it =\r\neasier to test protected interfaces of our&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;ob=\r\njects.&quot;&nbsp; I don&#39;t see where this fits in to good design or good te=\r\nsting&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;practices.&nbsp; The virtue of public/p=\r\nrotected/private/default is not what I was&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;qu=\r\nestioning.&nbsp; I wanted to point out the potential flaws of design and&lt;/F=\r\nONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;testing that could otherwise be missed when you=\r\n put tests in the same&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;package as production =\r\ncode.&nbsp; The production code should be tested in the&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SI=\r\nZE=3D2&gt;&gt;same fashion it would be used by a client.&nbsp; A test is a cli=\r\nent in some&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;degree.&nbsp; In most cases clien=\r\nts exist outside of the package.&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;That would =\r\nbe &quot;black box testing&quot;. XP unit testing is &quot;white box&quot;.=\r\n I am my own client, most classes in my application are in the same package=\r\n, so most tests should also be in the same package.&lt;/FONT&gt;&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SI=\r\nZE=3D2&gt;&gt; but this is turning into a thread on Java design issues, maybe =\r\nwe should&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt; take it elsewhere.&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P=\r\n&gt;&lt;FONT SIZE=3D2&gt;Test-first-programming enabled by JUnit is a design techniq=\r\nue. Do a google search on &quot;test-first-design&quot;.&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;F=\r\nONT SIZE=3D2&gt;The XP mailing list could use some on-topic postings...&lt;/FONT&gt;=\r\n\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;--&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;&gt;1. Code cove=\r\nrage analysis should be your guide in making decisions about&lt;/FONT&gt;\n&lt;BR&gt;&lt;FO=\r\nNT SIZE=3D2&gt;&gt;whether testing through public APIs provide thorough enough=\r\n test coverage&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;(80%? 95%?, depending on the q=\r\nuality you&#39;re shooting for and (relevant to&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;t=\r\nhat) the industry you&#39;re in).&nbsp; Naturally, coverage analysis will infor=\r\nm&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;your testing decisions, which in turn will =\r\nlikely inform your design&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;decisions.&lt;/FONT&gt;\n&lt;=\r\n/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;Agree&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;&gt;2. In the &=\r\nquot;real world&quot; of non-ideal engineering situations, a QA team or&lt;/FO=\r\nNT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;engineer may well be tasked with, among other th=\r\nings, unit testing code or&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;working with a tea=\r\nm of engineers who do not do unit testing and cannot be&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SI=\r\nZE=3D2&gt;&gt;convinced to do so.&nbsp; In this case, the powerful benefit of =\r\nthe coding-unit&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;testing feedback loop is most=\r\nly lost and severely diluted, but the QA team&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt=\r\n;must do its best to test whatever craziness comes its way.&nbsp; The value=\r\ns of&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;unit testing are diminished, but by no m=\r\neans entirely, even if only the QA&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;team does =\r\nit. Ditto for testing legacy systems over which one had no design&lt;/FONT&gt;\n&lt;B=\r\nR&gt;&lt;FONT SIZE=3D2&gt;&gt;control for historical reasons.&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=\r\n=3D2&gt;&gt;&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;Scott Stirling&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZ=\r\nE=3D2&gt;&gt;JRun QA&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;Macromedia&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;=\r\n&lt;FONT SIZE=3D2&gt;Agree. (Is Macromedia hiring, BTW?)&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SI=\r\nZE=3D2&gt;--&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;&gt;If you test classes, you write=\r\n unit tests.&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;If you test subsystems, you writ=\r\ne black-box or white-box tests (or &lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;integrati=\r\non tests).&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;The mai=\r\nn goal of JUnit is to write unit tests.&nbsp; Although JUnit can be &lt;/FONT&gt;=\r\n\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;used to write integration tests, it is not its main=\r\n goal.&nbsp; With JUnit, &lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;you have problems i=\r\nf you want to test the user interaction or really &lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D=\r\n2&gt;&gt;complex systems (-&gt; use of mock objects).&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SI=\r\nZE=3D2&gt;Agree&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;--&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=\r\n=3D2&gt;&gt;Lurker here, but I thought I&#39;d chime in to agree with&lt;/FONT&gt;\n&lt;BR&gt;&lt;=\r\nFONT SIZE=3D2&gt;&gt;Vladimir on this.&nbsp; In an ideal world, test cases mig=\r\nht&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;stay separate, but the first hurdle is oft=\r\nen just&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;getting developers to write them, and=\r\n that&#39;s a lot&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;easier to manage when the test =\r\ncase lives in the same&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;package as their code.=\r\n&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;Co-mingling i=\r\nncreases the chances that they&#39;ll use the&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;tes=\r\nt case for all of their incremental testing&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;(=\r\ninstead of writing little mini-clients or main()&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;=\r\n&gt;methods to test/debug), and helps make unit testing&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SI=\r\nZE=3D2&gt;&gt;seem like part of the development process instead of a&lt;/FONT&gt;\n&lt;B=\r\nR&gt;&lt;FONT SIZE=3D2&gt;&gt;post-coding chore.&nbsp; &lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&g=\r\nt;&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;We can always auto-repackage stuff later, =\r\nbut in my&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;experience, it&#39;s not always easy to=\r\n get people to go&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;back and write test cases w=\r\nhen there&#39;s more&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;interesting work to be done.=\r\n&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;I agree. People have my company have done t=\r\nhings both ways. I think we get MORE unit tests and more testing in general=\r\n when the unit test source files are in the same directory as the code-unde=\r\nr-test-source-files. Looking a directory, it is easy to see which classes a=\r\nre not tested.&lt;/FONT&gt;&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;class-under-test file name =3D=\r\n=3D class-under-test-name + &quot;.java&quot;&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;Tes=\r\nt source file name =3D=3D class-under-test-name + &quot;Test.java&quot;&lt;/FO=\r\nNT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;In Metrowerks CodeWarrior, it is VERY EASY to m=\r\nake a &#39;testing&#39; target and a &#39;release&#39; target, and to leave the all of test=\r\n sources out of the release target. Each target produces a different jar fi=\r\nle, and you can flip between targets with one mouse-click, and run the app =\r\nor the tests with one more mouse-click.&lt;/FONT&gt;&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;[refe=\r\nrring to &quot;mingling...helps make unit testing...part of the... process]=\r\n&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;Why do you say that?&nbsp; I think this is p=\r\nure speculation, but if you have some&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;actual =\r\nmetrics I would be interested in seeing them.&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D=\r\n2&gt;&quot;Metrics, we don&#39;t need no stinking metrics!&quot;&nbsp; Why do you =\r\nassume this is speculation? In my case, it is observation. It may be observ=\r\nation by the original poster, too.&lt;/FONT&gt;&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;&gt;Again,=\r\n I am baffled at your logic, but if you have actual results please&lt;/FONT&gt;\n&lt;=\r\nBR&gt;&lt;FONT SIZE=3D2&gt;&gt;share them.&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;I have sha=\r\nred MY results... but I&#39;m not going to get in an accountant in to &quot;cer=\r\ntify&quot; them. This isn&#39;t the academy awards or a scientific study...&lt;/FO=\r\nNT&gt;&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;[referring to &quot;auto-repackage later...&quot=\r\n;]&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;This is a burden on the process.&nbsp; &lt;/F=\r\nONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;No it isn&#39;t! (This is the argument office, rig=\r\nht? :-) see above.)&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;&gt;Also, depending on&lt;/=\r\nFONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;your source control system, this could be some=\r\nwhat detrimental to your&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;company&#39;s history ma=\r\nrkers and metrics.&nbsp; Moving a class out of one package to&lt;/FONT&gt;\n&lt;BR&gt;&lt;F=\r\nONT SIZE=3D2&gt;&gt;another (which we must do from time to time) will cause an=\r\nother root to be&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;formed in the new package an=\r\nd an orphaned leaf in the old.&nbsp; You could lose&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=\r\n=3D2&gt;&gt;valuable history.&nbsp; Not to mention that in distributed team en=\r\nvironments&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;others may be expecting for your c=\r\nlass(es) to be &quot;in the same ol&#39; place&quot; and&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=\r\n=3D2&gt;&gt;if you move them, you cause some degree of hassle.&nbsp; Sometimes=\r\n this is&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;unavoidable, but I think it is a bad=\r\n practice to get into.&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;This refactoring/movi=\r\nng argument applies equally to keeping the tests in the same directory as w=\r\nell as to keeping the tests in a separate directory. By keeping the tests i=\r\nn a different directory, it is slightly more likely to get left behind and =\r\nforgotten, when someone moves a class but not its test-class.&lt;/FONT&gt;&lt;/P&gt;\n\n&lt;=\r\nP&gt;&lt;FONT SIZE=3D2&gt;I have moved class + test around without ill effects.&lt;/FON=\r\nT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;&gt;That is a fault of not doing test-first whic=\r\nh you will face no matter where&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;the test case=\r\ns live.&nbsp; The thought in my mind is that tests are an integral&lt;/FONT&gt;\n&lt;=\r\nBR&gt;&lt;FONT SIZE=3D2&gt;&gt;part of the system, they drive the design for us (in =\r\nXP).&nbsp; They are not some&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;special case gro=\r\nup of bastardized objects that can be taken or not.&nbsp; They&lt;/FONT&gt;\n&lt;BR&gt;&lt;=\r\nFONT SIZE=3D2&gt;&gt;are essential.&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;Agree.&lt;/FON=\r\nT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;&gt;Don Wells once said (I believe it was Don, i=\r\nf anyone knows&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;differently please correct me)=\r\n, &quot;Throw away my code, but never throw away my&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=\r\n=3D2&gt;&gt;tests.&quot;&nbsp; Point being that he would be able to rebuild th=\r\ne system again from&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;scratch if he had the tes=\r\nts.&nbsp; If you threw away the tests and gave him the&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZ=\r\nE=3D2&gt;&gt;production code, he would be floundering in agony to reproduce al=\r\nl of those&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;tests.&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&=\r\ngt;&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;Tests are not simply obilgatory objects t=\r\nhat satisfy some requirements from&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;management=\r\n... they are the life-sustaining power of the code, in my opinion!&lt;/FONT&gt;\n&lt;=\r\n/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;Agree.&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;&gt;Again, why=\r\n?&nbsp; No one has yet given me one concrete answer as to why this&lt;/FONT&gt;\n&lt;=\r\nBR&gt;&lt;FONT SIZE=3D2&gt;&gt;should be.&nbsp; It&#39;s all been ambiguous speculation.=\r\n&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;Answer these questions: is this base-class =\r\nrobust enough for me and anyone else to subclass? Do the protected methods =\r\nthat are called by the subclasses/other-classes-in-this-package work? Is ma=\r\nking this function private going to cause hard-ship to the subclasser, unit=\r\n-test-class, or other-classes-in-this-package? Is this un-tested legacy cod=\r\ne really doing what it is supposed to be doing? (What the heck IS this un-t=\r\nested legacy code doing?)&lt;/FONT&gt;&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;Finding the answers=\r\n to these questions is why I sometimes test protected/&quot;private&quot; m=\r\nethods.&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;&gt;After testing the model, I like =\r\nto do integration tests for model, control&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;an=\r\nd view. I do this by checking the view. But as the view is used by users&lt;/F=\r\nONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;only, there is no need to know state, at least =\r\nfor programm components other&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;than the tests.=\r\n This approach is (Did I get you right now?) not favorable in&lt;/FONT&gt;\n&lt;BR&gt;&lt;F=\r\nONT SIZE=3D2&gt;&gt;your eyes? Which would be your favorable approach?&lt;/FONT&gt;\n=\r\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;You can test the view without testing the model by =\r\nusing a mock object in place of the model.&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;I=\r\n sometimes test a view class by directly calling the methods that would nor=\r\nmally be indirectly called by buttons, etc., and then seeing that the model=\r\n has the correct state. I don&#39;t &quot;simulate&quot; AWT/Swing events, I ju=\r\nst call functions of the class. I don&#39;t call the anonymous-class-methods th=\r\nat are listening for events because those are one-line methods that call an=\r\n easily-tested method in the view class.&lt;/FONT&gt;&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;For =\r\n&quot;view&quot;, see the design pattern &quot;mediator&quot;.&lt;/FONT&gt;\n&lt;/P&gt;\n=\r\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;&gt;MVC can be difficult.&nbsp; If it is done improperly=\r\n it offers many traps!!&nbsp; But&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;done rightl=\r\ny, it&#39;s a wonderful tool.&nbsp; Testing is easier, refactoring is&lt;/FONT&gt;\n&lt;B=\r\nR&gt;&lt;FONT SIZE=3D2&gt;&gt;easier, etc.&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;Agree.&lt;/FO=\r\nNT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;&gt;From the QA perspective, the methods within=\r\n the public API are the &lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;functional methods a=\r\nnd these methods require a&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;functional test wr=\r\nitten by the QA team.&nbsp; This means that there is &lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=\r\n=3D2&gt;&gt;double coverage on testing the methods in the public&lt;/FONT&gt;\n&lt;BR&gt;&lt;F=\r\nONT SIZE=3D2&gt;&gt;API and developers are not simply checking themselves.&lt;/FO=\r\nNT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;Agree.&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;&gt;We ha=\r\nve gotten a lot of mileage out of validation through looking at&lt;/FONT&gt;\n&lt;BR&gt;=\r\n&lt;FONT SIZE=3D2&gt;&gt;internal state.&nbsp; Primarily this boils down to liste=\r\nning to listener&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;interfaces, and saying that =\r\nthe test passes if the right listeners are&lt;/FONT&gt;\n&lt;BR&gt;&lt;FONT SIZE=3D2&gt;&gt;ca=\r\nlled.&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;P&gt;&lt;FONT SIZE=3D2&gt;Good separate of GUI class testing fro=\r\nm the model testing...&lt;/FONT&gt;\n&lt;/P&gt;\n\n&lt;/BODY&gt;\n&lt;/HTML&gt;\r\n------_=_NextPart_001_01C0F377.631FF370--\r\n\n", 
    "subject": "RE: Best Practice for Tests"
}