{
    "numMessagesInTopic": 19, 
    "nextInTime": 14904, 
    "senderId": "NqblFRmFPrWVuZiXrAEKlNb48B31d6wEcjVvW0x8CIvX9sNDsAkz0vwLCABqgmzGz2P67OZD4bYUDL65oIvo0_in-1NBydxzFSq11Yr7HuAh", 
    "systemMessage": true, 
    "subject": "RE: [junit] splitting this list", 
    "from": "&quot;Bradley, Todd&quot; &lt;todd.bradley@...&gt;", 
    "authorName": "Bradley, Todd", 
    "msgSnippet": "... I can t get my brain around that statement.  How can asking a question (which must include a 2nd party) be helping yourself (which cannot include a 2nd", 
    "msgId": 14903, 
    "profile": "todd404", 
    "topicId": 14895, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 184154431, 
    "messageBody": "<div id=\"ygrps-yiv-438595377\">Jason Rogers wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; But, you fail to consider that for some people (especially in <br/>\n&gt; different<br/>\n&gt; cultures) the first way to help yourself may be to ask a <br/>\n&gt; question.  <br/>\n<br/>\n </span></blockquote>I can&#39;t get my brain around that statement.  How<br/>\ncan &quot;asking a question&quot; (which must include a 2nd <br/>\nparty) be &quot;helping yourself&quot; (which cannot include a <br/>\n2nd party)?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You have also failed to consider that in some <br/>\n&gt; countries Google is not necessarily a buzz-word, so the <br/>\n&gt; question may not be directed there.<br/>\n<br/>\n </span></blockquote>That&#39;s true - I didn&#39;t really consider that.  Maybe<br/>\nI&#39;m being close-minded, but it&#39;s hard to fathom that <br/>\na person can find a website to sign up for an email <br/>\nlist, but then be unable to do a web search.  Heck,<br/>\nthe JUnit web page itself has two different web search <br/>\nfields on it - one for the web in general, and one <br/>\nto search for content of prior messages.  If this<br/>\nlist was about learning basic computing skills, I<br/>\nmight believe what you wrote.  But everyone here is<br/>\nin the software development field.  How do you get <br/>\nto be a practicing software development professional<br/>\n(or student) in the 21st century without knowing how <br/>\nto do a web search?  (That question isn&#39;t totally <br/>\nrhetorical.  If there really is a way, I&#39;d love to <br/>\nhear about it.)<br/>\n<br/>\n<br/>\nSimon Chappell wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; That does take a few minutes, but it&#39;s the nicest way to deal <br/>\n&gt; with that sort of person that I&#39;ve seen. This list is very <br/>\n&gt; friendly and helpful and populated by some fine people, so <br/>\n&gt; the last thing we want to do is to seem judgemental or rude. <br/>\n<br/>\n </span></blockquote>Whoa!  I definitely didn&#39;t mean to imply that I<br/>\nrecommend being rude or judgmental to anyone.  I <br/>\nwould hope that a separate beginner&#39;s list would <br/>\ncontinue to be just as polite and helpful as this<br/>\nlist is today.<br/>\n<br/>\n <br/>\nJ.B. Rainsberger wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Todd, I appreciate your concern and have raised that myself, <br/>\n&gt; in the past. <br/>\n<br/>\n </span></blockquote>Yes, I know we&#39;ve discussed it here.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I would find it difficult to stay on this list <br/>\n&gt; myself, if it weren&#39;t so low traffic. Also take into <br/>\n&gt; consideration the number of posts we already reject, because <br/>\n&gt; the questions are too basic. <br/>\n<br/>\n </span></blockquote>Wow, I did not realize that there are posts getting<br/>\nactively rejected!  If this is a moderated list,<br/>\nit seems like the moderators could easily reply<br/>\nto the &quot;whats junit&quot; type of questions with a link <br/>\nto the FAQ and never pass those on to the rest of <br/>\nthe group.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If we don&#39;t encourage the <br/>\n&gt; general public to post their questions, then who will we have <br/>\n&gt; to discuss interesting topics with in a few years?<br/>\n<br/>\n </span></blockquote>Perhaps I&#39;m self-centered, because I expect others<br/>\nto take the same general approach to learning a new<br/>\ntechnology that I do, which is:  read what I can<br/>\nabout it until I get stuck, then read more from a<br/>\ndifferent author, and if I&#39;m still stuck, then ask<br/>\nfor help.  I believe that the people who do NOT take<br/>\nthat approach aren&#39;t likely to be here to discuss<br/>\nthe interesting topics in a few years.  I believe<br/>\nthat the people who ask the obvious FAQs get just<br/>\nenough info to complete their homework assignment<br/>\nor placate their boss or whatever, and then disappear <br/>\nand don&#39;t participate in further discussions.  But<br/>\nthat&#39;s just a hunch.  Maybe I should do a random <br/>\nsurvey of &quot;not-smart&quot; questions from 2 years ago to <br/>\nsee if those people are the ones now actively con-<br/>\ntributing to the discussion here.<br/>\n<br/>\n<br/>\nMike wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; As a newbie user/lurker myself I don&#39;t recall reading the <br/>\n&gt; FAQ, but have made a note to look it up now...  <br/>\n<br/>\n </span></blockquote>Just today I unsubscribed and then resubscribed,<br/>\nto confirm that the FAQ is automatically emailed <br/>\nto new members.  I wonder if the auto mailer <br/>\ndoesn&#39;t work for everyone.<br/>\n<br/>\n<br/>\nTodd.</div>", 
    "prevInTime": 14902, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1127336194", 
    "canDelete": false, 
    "nextInTopic": 14904, 
    "prevInTopic": 14902, 
    "headers": {
        "messageIdInHeader": "PDc0Mjk3QzVBNkY5MzBCNENCNDBEMzNCRDEyN0U4ODJBNzdFQkUzQFdTVEVYQ0gwMC53ZXN0bWluc3Rlci5wb2x5Y29tLmNvbT4="
    }
}