{
    "numMessagesInTopic": 19, 
    "nextInTime": 14918, 
    "senderId": "q2YnonQHO22FlZ7TiaOqaPYIQ2Efqek9QNIukgYdm1CttgbG8yoKwARYk0Yx1DbAOZlTfPjm_dw13HuWfXqHbO1MCdFsPghuYm3VzVquhg", 
    "systemMessage": false, 
    "subject": "Re: [junit] splitting this list", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... Are you volunteering to moderate? We already reject job offers for Indian companies, a majority of What s X? questions as well as completely off-topic", 
    "msgId": 14917, 
    "profile": "nails762", 
    "topicId": 14895, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-362794047\">Bradley, Todd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; I would find it difficult to stay on this list<br/>\n&gt;  &gt; myself, if it weren&#39;t so low traffic. Also take into<br/>\n&gt;  &gt; consideration the number of posts we already reject, because<br/>\n&gt;  &gt; the questions are too basic.<br/>\n&gt; <br/>\n&gt; Wow, I did not realize that there are posts getting<br/>\n&gt; actively rejected!  If this is a moderated list,<br/>\n&gt; it seems like the moderators could easily reply<br/>\n&gt; to the &quot;whats junit&quot; type of questions with a link<br/>\n&gt; to the FAQ and never pass those on to the rest of<br/>\n&gt; the group.<br/>\n<br/>\n </span></blockquote>Are you volunteering to moderate? We already reject job offers for <br/>\nIndian companies, a majority of &quot;What&#39;s X?&quot; questions as well as <br/>\ncompletely off-topic things like dating services and pictures of naked <br/>\nwomen. You could certainly help, if you like.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; If we don&#39;t encourage the<br/>\n&gt;  &gt; general public to post their questions, then who will we have<br/>\n&gt;  &gt; to discuss interesting topics with in a few years?<br/>\n&gt; <br/>\n&gt; Perhaps I&#39;m self-centered, because I expect others<br/>\n&gt; to take the same general approach to learning a new<br/>\n&gt; technology that I do, which is:  read what I can<br/>\n&gt; about it until I get stuck, then read more from a<br/>\n&gt; different author, and if I&#39;m still stuck, then ask<br/>\n&gt; for help.  I believe that the people who do NOT take<br/>\n&gt; that approach aren&#39;t likely to be here to discuss<br/>\n&gt; the interesting topics in a few years.  I believe<br/>\n&gt; that the people who ask the obvious FAQs get just<br/>\n&gt; enough info to complete their homework assignment<br/>\n&gt; or placate their boss or whatever, and then disappear<br/>\n&gt; and don&#39;t participate in further discussions.  But<br/>\n&gt; that&#39;s just a hunch.  Maybe I should do a random<br/>\n&gt; survey of &quot;not-smart&quot; questions from 2 years ago to<br/>\n&gt; see if those people are the ones now actively con-<br/>\n&gt; tributing to the discussion here.<br/>\n<br/>\n </span></blockquote>I can&#39;t tell whether this response is genuine or facetious. I&#39;ll assume <br/>\nit&#39;s genuine.<br/>\n<br/>\nIf you can really tell which of those stupid question-askers isn&#39;t just <br/>\nsome smart, but desperate person who needs a quick answer, then that&#39;s <br/>\ngreat. I can&#39;t.<br/>\n<br/>\nMore to the point, I&#39;ve dealt with those people both ways, and I find <br/>\nthat I&#39;m getting better results doing what I&#39;m doing now, rather than <br/>\ndoing what I was doing before (one-liner RTFM kind of responses).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Mike wrote:<br/>\n&gt;  &gt; As a newbie user/lurker myself I don&#39;t recall reading the<br/>\n&gt;  &gt; FAQ, but have made a note to look it up now... <br/>\n&gt; <br/>\n&gt; Just today I unsubscribed and then resubscribed,<br/>\n&gt; to confirm that the FAQ is automatically emailed<br/>\n&gt; to new members.  I wonder if the auto mailer<br/>\n&gt; doesn&#39;t work for everyone.<br/>\n<br/>\n </span></blockquote>It&#39;s possible. It&#39;s also possible that we don&#39;t read what looks like <br/>\nnoise. Human nature, that.<br/>\n<br/>\nTake care.<br/>\n-- <br/>\nJ. B. (Joe) Rainsberger<br/>\nDiaspar Software Services<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com\">http://www.diasparsoftware.com</a><br/>\n2005 Gordon Pask Award Winner for contribution to Agile practice<br/>\nAuthor, JUnit Recipes: Practical Methods for Programmer Testing</div>", 
    "prevInTime": 14916, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1127407229", 
    "canDelete": false, 
    "nextInTopic": 14919, 
    "prevInTopic": 14914, 
    "headers": {
        "inReplyToHeader": "PDc0Mjk3QzVBNkY5MzBCNENCNDBEMzNCRDEyN0U4ODJBNzdFQkUzQFdTVEVYQ0gwMC53ZXN0bWluc3Rlci5wb2x5Y29tLmNvbT4=", 
        "messageIdInHeader": "PDQzMzJERTdELjMwODAyMDFAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDc0Mjk3QzVBNkY5MzBCNENCNDBEMzNCRDEyN0U4ODJBNzdFQkUzQFdTVEVYQ0gwMC53ZXN0bWluc3Rlci5wb2x5Y29tLmNvbT4="
    }
}