{
    "numMessagesInTopic": 3, 
    "nextInTime": 14942, 
    "senderId": "ZsIzJPURA0LAGeVX8j4Rj5Tim52hCKm1Do9DkjBjYwjOfURaTqiQrz33vs631ubrA2Oz1cCS8qufZOeHUNmW8lM9zn5HUwLzMhO-3Cn6hQAvD9Hn", 
    "systemMessage": false, 
    "subject": "Testing Frameworks Configuration (Hibernate)", 
    "from": "&quot;Mariano Cortesi (Cono)&quot; &lt;mcortesi@...&gt;", 
    "authorName": "Mariano Cortesi (Cono)", 
    "msgSnippet": "Hi!!! I m rather new in the junit world, and there is a question that has been running through my head for some time... Are the configuration files of", 
    "msgId": 14941, 
    "profile": "marianocortesi", 
    "topicId": 14941, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 230298226, 
    "messageBody": "<div id=\"ygrps-yiv-1719829979\">Hi!!!<br/>\n<br/>\nI&#39;m rather new in the junit world, and<br/>\nthere is a question that has been running through my head for some time...<br/>\n<br/>\nAre the configuration files of frameworks we use everyday needed to be tested?<br/>\n<br/>\nI think they are. Quite a lot of bugs come from typos, or little<br/>\nmistakes in xml files.<br/>\nAnd using a DTD doesn&#39;t completely address the problem.<br/>\nFor example we have Hibernate hbm mapping files.<br/>\nThere&#39;s a lot of reflection configuration there, and no dtd will check that.<br/>\n<br/>\nMy concrete problem is that I want to test hibernate configuration.<br/>\nI have two ideas on how to do this:<br/>\n<br/>\n1. Use dbunit, hsqldb to make some basic operations over my<br/>\npersistent classes. This way I&#39;m pretty sure they are correctly mapped.<br/>\n2. I somehow manage to test the configuration files.<br/>\n<br/>\nI&#39;ve already tried the first one, but it seems to me like a lot of<br/>\nwork, and It feels like testing two things: hibernate and my config<br/>\nfiles when I only want to test the files.<br/>\n<br/>\nTherefore, I want to follow the second approach because it looks more<br/>\naccuratet to me; but I don&#39;t know how, or if there is something out<br/>\nthere that does that job for me (It looks like a common problem).<br/>\n<br/>\nMaybe I&#39;m wrong, and the common thing is not testing the config files,<br/>\nbecause integration tests will do that for me. Is this true?!<br/>\n<br/>\nWell, any link or google searchphrase will be appreciated.. :D<br/>\n<br/>\nThanks in advance,<br/>\nMariano Cortesi</div>", 
    "prevInTime": 14940, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1127685848", 
    "canDelete": false, 
    "nextInTopic": 14943, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDY3YzRkYmYxMDUwOTI1MTUwNDY0MzJkOTk3QG1haWwuZ21haWwuY29tPg=="
    }
}