{
    "numMessagesInTopic": 3, 
    "nextInTime": 14944, 
    "senderId": "scjYu6zcFdUY5r2fok0YVePA3bV9RPVTsGxrC1WPGwqXz7XJ0hTkNUglk3AYAmhNPZFbvjYDTqQ3op9HfWbLjQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Testing Frameworks Configuration (Hibernate)", 
    "from": "David Saff &lt;saff@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "... Lately, I have been trying to do so.  My framework of interest currently is Eclipse.  I use test-driven development, and my current rule is that if I have", 
    "msgId": 14943, 
    "profile": "dsaff", 
    "topicId": 14941, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 139771899, 
    "messageBody": "<div id=\"ygrps-yiv-1782411876\">Mariano Cortesi (Cono) wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Are the configuration files of frameworks we use everyday needed to be <br/>\n&gt; tested?<br/>\n<br/>\n </span></blockquote>Lately, I have been trying to do so.  My framework of interest currently <br/>\nis Eclipse.  I use test-driven development, and my current rule is that <br/>\nif I have to change a configuration file to get a system test to work, <br/>\nI&#39;ll write a unit test for that configuration file change.  I&#39;ve found <br/>\nthe resulting tests most useful for regression testing--the most common <br/>\nconfiguration bugs, in my experience so far, are not ignorant human <br/>\nchanges, but source control misuse or other mistakes that result in <br/>\nout-of-date configuration files.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My concrete problem is that I want to test hibernate configuration.<br/>\n&gt; I have two ideas on how to do this:<br/>\n&gt;<br/>\n&gt; 1. Use dbunit, hsqldb to make some basic operations over my<br/>\n&gt; persistent classes. This way I&#39;m pretty sure they are correctly mapped.<br/>\n&gt; 2. I somehow manage to test the configuration files.<br/>\n<br/>\n </span></blockquote>I&#39;ve been using option #2.  Rather than write my own XML-parsing code, I <br/>\nfigured out how to drive the tests using the lowest 1.5 layers of <br/>\nEclipse&#39;s own configuration parsing code.   This has the strong <br/>\nadvantage that my tests see the configuration files the way Eclipse <br/>\ndoes.  If I tested closer to the actual XML, I would insulate myself <br/>\nfrom bugs in Eclipse, but I&#39;ve found a lot more bugs in recently-changed <br/>\nconfiguration files than in Eclipse&#39;s parsing code.  If I tested further <br/>\nback (closer to your option #1), I&#39;d be getting closer to integration <br/>\ntests, which would make it harder to figure out whether failures were <br/>\ndue to the configuration, or some aspect of the things being configured.<br/>\n<br/>\nThe big downside is the up-front cost of this approach.  It took the <br/>\nbetter part of a day to understand the Eclipse parsing code well enough <br/>\nto reuse it, and I had to resort to some evil-looking tricks, because <br/>\nthe parser has an astounding number of dependencies on the rest of <br/>\nEclipse that I had to stub out.  Once I&#39;d written two tests, though, the <br/>\nrest have come fast and furious.<br/>\n<br/>\nThe other downside is a bit of cognitive dissonance.  It feels like I <br/>\ncould get to the point where I was basically writing the same thing in <br/>\ntwo places, first in the test, then in the configuration file itself.  <br/>\nSo far, I don&#39;t feel that fear has born itself out, so I try to ignore it.<br/>\n<br/>\nShare and Enjoy,<br/>\n<br/>\n    David Saff</div>", 
    "prevInTime": 14942, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1127739791", 
    "canDelete": false, 
    "nextInTopic": 14980, 
    "prevInTopic": 14941, 
    "headers": {
        "inReplyToHeader": "PDY3YzRkYmYxMDUwOTI1MTUwNDY0MzJkOTk3QG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PDQzMzdGMThGLjEwMzAxMDVAbWl0LmVkdT4=", 
        "referencesHeader": "PDY3YzRkYmYxMDUwOTI1MTUwNDY0MzJkOTk3QG1haWwuZ21haWwuY29tPg=="
    }
}