{
    "numMessagesInTopic": 5, 
    "nextInTime": 15034, 
    "senderId": "V_NOiGNKQV_9RHiRIT4WE-9nURlkVHreA78MlNEYXs9HkHkDewQlp4Pi3zki9KtWttFRp4WKt-Zb2VprfRwKWg5Hvsn8q1GGjBUQOtx9FpIABoPi", 
    "systemMessage": false, 
    "subject": "RE: [junit] Query on estimation", 
    "from": "&quot;Rakesh Patel&quot; &lt;rakesh.patel@...&gt;", 
    "authorName": "Rakesh Patel", 
    "msgSnippet": "well put! Rakesh ... From:\tjunit@yahoogroups.com on behalf of David Jackman Sent:\tFri 9/30/2005 3:53 PM To:\tjunit@yahoogroups.com Cc: Subject:\tRE: [junit]", 
    "msgId": 15033, 
    "rawEmail": "Return-Path: &lt;Rakesh.Patel@...&gt;\r\nX-Sender: Rakesh.Patel@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 54771 invoked from network); 30 Sep 2005 14:58:27 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m25.grp.scd.yahoo.com with QMQP; 30 Sep 2005 14:58:27 -0000\r\nReceived: from unknown (HELO mailsweeper2.sharepeople.co.uk) (213.86.137.195)\n  by mta4.grp.scd.yahoo.com with SMTP; 30 Sep 2005 14:58:26 -0000\r\nReceived: from aesp6003.sharepeople.co.uk (unverified) by mailsweeper2.sharepeople.co.uk\n (Content Technologies SMTPRS 4.2.5) with ESMTP id &lt;T73b429eceaac16326c3d8@...&gt; for &lt;junit@yahoogroups.com&gt;;\n Fri, 30 Sep 2005 15:58:05 +0100\r\nContent-Class: urn:content-classes:message\r\nMIME-Version: 1.0\r\nX-MimeOLE: Produced By Microsoft Exchange V6.0.6603.0\r\nDate: Fri, 30 Sep 2005 15:58:05 +0100\r\nMessage-ID: &lt;F6E2F121756BA94CB99212D650D46AC382B7DF@...&gt;\r\nX-MS-Has-Attach:\r\nX-MS-TNEF-Correlator:\r\nThread-Topic: [junit] Query on estimation\r\nThread-Index: AcXFde6GTuACG5xdQiebdr4Hwkw9sAAEzzcwABA3ZIAAAVKpXg==\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: &quot;Rakesh Patel&quot; &lt;rakesh.patel@...&gt;\r\nSubject: RE: [junit] Query on estimation\r\nX-Yahoo-Group-Post: member; u=239144956; y=kM-t6zSx_aljHMk1WswhsE6cWwhoxjsJuZtZS5pTQDxnPNA\r\nX-Yahoo-Profile: patelr08\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\n\r\nwell put!\n\nRakesh\n\n\n-----Original Message-----\nFrom:\tjunit@yahoogroups.com on behalf of David Jackman\nSent:\tFri 9/30/2005 3:53 PM\nTo:\tjunit@yahoogroups.com\nCc:\t\nSubject:\tRE: [junit] Query on estimation\nI&#39;ve been doing unit testing for years now on projects, and I&#39;ve found\nthat there just isn&#39;t a good formula to use when attempting to estimate\nhow much time to factor in for unit testing.  In my experience, most\npeople estimate the time to design and code their module and then want\nto add an estimate for writing tests for that module once the design and\ncoding are finished.  I&#39;ve found two major drawbacks to this approach:\n    1) It will take longer to write the tests after the design and\ncoding are finished than it does to write the unit tests at the same\ntime design and coding are happening.  This is because the module isn&#39;t\nnecessarily designed with tests in mind so it&#39;s harder to write tests\nfor portions of the code in isolation (i.e. the design doesn&#39;t allow\nthat code to be isolated).  Another reason that writing tests takes\nlonger here is because there are naturally bugs in the design and coding\nof the module that will be discovered when the tests are finally\nwritten.  This means that the time designated as &quot;unit testing&quot; in the\nestimate will also be spent re-designing and re-coding.  This highlights\nthe problem with testing only after the coding is finished (and the\nreason testing as-you-go takes less time): the time spent coding to a\nbad design is wasted time.  It is better to discover the design flaw as\nsoon as possible so very little time is wasted on coding to the bad\ndesign.  Many design flaws aren&#39;t apparent until you start writing code\nthat calls your module (and the unit tests are the first thing that does\nthis), so it&#39;s better to have the tests going as early in the process as\npossible.\n    2) There&#39;s a tendency for developers to view the time allocated for\ntesting as a schedule pad (since they didn&#39;t really want to spend time\ntesting anyway).  When this happens, they allow the design and coding\nportion of their schedule to take a bit longer then catch up by spending\nless time writing tests.  This is a problem for obvious reasons.\n \nThat said, you still have the issue of how best to estimate the schedule\nfor building your great product.  For someone who is not already\nexperienced in unit testing and test driven development (TDD) practices,\nI would recommend estimating the time to complete a module to be twice\nwhat they would estimate taking without doing testing.  This seems like\na lot of extra time, but it really isn&#39;t when you look at the entire\nprocess for getting a product finished and out the door.  In my\nexperience, developers estimating their time to complete a module\nconsider the time to design and code the module, and their estimate ends\nthere.  In reality, once they&#39;ve &quot;finished&quot; the module they will\ncontinue to spend time coming back to the module to fix bugs found in\nsome QA process, which means the total time spent to build the module\nincludes their design+code time as well as all of the bug fixes.  By\ndoubling the traditional estimate (which would have been just the\ndesign+code time), you&#39;re allowing for the extra time to write the tests\nand fix the bugs found by those tests.  It will also allow some\nadditional time to learn about how best to do unit testing, which won&#39;t\nhappen with every project.  Once a developer has completed a couple of\nprojects with testing, they will be better able to come up with\nestimates that include the testing effort (which can be as accurate as\nestimates can be for this sort of thing, and we all know there&#39;s a lot\nof uncertainty here).\n \nI would definitely recommend taking the time to train and convince your\nteam the best practices for writing tests and doing test driven\ndevelopment.  This includes the technical aspects of the testing\nframework (JUnit) as well as the theoretical aspects of the discipline.\nIn my experience, some developers have a hard time with this and it\ntakes time for them to realize that you really can finish a project\nfaster when following these practices.\n \nWell, that was rather long-winded.  Hope the information you really\nwanted is in there somewhere.\n..David..\n \n \n\n________________________________\n\nFrom: junit@yahoogroups.com [mailto:junit@yahoogroups.com] On Behalf Of\nRakesh Patel\nSent: Friday, September 30, 2005 12:39 AM\nTo: junit@yahoogroups.com\nSubject: RE: [junit] Query on estimation\n\n\nHi,\n\nI have read more about unit testing than actually doing it so bear that\nin mind - apparently, once the developers have got used to writing unit\ntests, the time taken to write code+unit tests is shorter than just\nwriting the code. The reason being that you end up writing &#39;just enough&#39;\nto get the job done because you have tests.\n\nAlso, it is not recommended to split estimates into 2 parts like that.\nUnit testing and code-writing are one task.\n\nHopefully, someone with more experience will back these comments up.\n\nCheers\n\nRakesh\n\n-----Original Message-----\nFrom: junit@yahoogroups.com [mailto:junit@yahoogroups.com] On Behalf Of\nsachin.dholakia@...\nSent: 29 September 2005 09:31\nTo: junit@yahoogroups.com\nSubject: [junit] Query on estimation\n\n\n\nDear all,\n\nI would like to use JUnits for a development project. Can somebody guide\n\nhow to estimate for unit testing using JUnits. There are 3 team members \nout of 6 who aren&#39;t aware of JUnits.\n\n\nThanks & Regards,\nSachin Dholakia\n\n\nNotice: The information contained in this e-mail message and/or\nattachments to it may contain confidential or privileged information.\nIf you are not the intended recipient, any dissemination, use, review,\ndistribution, printing or copying of the information contained in this\ne-mail message and/or attachments to it are strictly prohibited.   If\nyou have received this communication in error, please notify us by reply\ne-mail or telephone and immediately and permanently delete the message\nand any attachments.  Thank you\n\n[Non-text portions of this message have been removed]\n\n\n\n\n\n\n\nYahoo! Groups Links\n\n\n\n\n\n\n\n\nAmerican Express Investments and American Express Independent Financial\nAdvisers are marketing names for American Express Financial Services\nEurope Limited, a separate corporation within the American Express group\nof companies.  American Express Financial Services Europe Limited is\nauthorised and regulated by, and is entered into the register (No.\n190853 www.fsa.gov.uk/register/) of, the Financial Services Authority\nand a member of the London Stock Exchange. Registered in England No.\n3614902. Registered address: 230 Blackfriars Road, London SE1 8NW. Vat\nNo. 740 4143 68. \n\nThe information in this email and any attachments is confidential and\nintended solely for the attention and use of the named addressee(s). It\nmay be subject to legal, professional or other privilege and further\ndistribution of it is strictly prohibited without our authority.  If you\nare not the intended recipient, you are not authorised to and must not\ndisclose, copy, distribute, or retain this message or any part of it,\nand should notify us immediately.\n\n\n\n\nSPONSORED LINKS \nBasic programming language\n&lt;http://groups.yahoo.com/gads?t=ms&k=Basic+programming+language&w1=Basic\n+programming+language&w2=C+programming+language&w3=Computer+programming+\nlanguages&w4=The+c+programming+language&w5=C+++programming+language&w6=L\nist+of+programming+languages&c=6&s=193&.sig=aLlETYEcZKW67uFZnuZPPw&gt;\nC programming language\n&lt;http://groups.yahoo.com/gads?t=ms&k=C+programming+language&w1=Basic+pro\ngramming+language&w2=C+programming+language&w3=Computer+programming+lang\nuages&w4=The+c+programming+language&w5=C+++programming+language&w6=List+\nof+programming+languages&c=6&s=193&.sig=n4wEVXDpIBKogo8e_G77cw&gt;\nComputer programming languages\n&lt;http://groups.yahoo.com/gads?t=ms&k=Computer+programming+languages&w1=B\nasic+programming+language&w2=C+programming+language&w3=Computer+programm\ning+languages&w4=The+c+programming+language&w5=C+++programming+language&\nw6=List+of+programming+languages&c=6&s=193&.sig=KFl1CeQi7jrKmsK4WD6ygQ&gt;\n\nThe c programming language\n&lt;http://groups.yahoo.com/gads?t=ms&k=The+c+programming+language&w1=Basic\n+programming+language&w2=C+programming+language&w3=Computer+programming+\nlanguages&w4=The+c+programming+language&w5=C+++programming+language&w6=L\nist+of+programming+languages&c=6&s=193&.sig=lU9w7-4UlGPB4LjDy84c2Q&gt;\nC programming language\n&lt;http://groups.yahoo.com/gads?t=ms&k=C+++programming+language&w1=Basic+p\nrogramming+language&w2=C+programming+language&w3=Computer+programming+la\nnguages&w4=The+c+programming+language&w5=C+++programming+language&w6=Lis\nt+of+programming+languages&c=6&s=193&.sig=dtKotXT1Ne2N9AO_aEbPFQ&gt;\nList of programming languages\n&lt;http://groups.yahoo.com/gads?t=ms&k=List+of+programming+languages&w1=Ba\nsic+programming+language&w2=C+programming+language&w3=Computer+programmi\nng+languages&w4=The+c+programming+language&w5=C+++programming+language&w\n6=List+of+programming+languages&c=6&s=193&.sig=0shmxLBHwrZWcSjC3QvZAA&gt;\n\n\n________________________________\n\nYAHOO! GROUPS LINKS \n\n\n\t\n*\t Visit your group &quot;junit &lt;http://groups.yahoo.com/group/junit&gt; &quot;\non the web.\n\t  \n*\t To unsubscribe from this group, send an email to:\n\t junit-unsubscribe@yahoogroups.com\n&lt;mailto:junit-unsubscribe@yahoogroups.com?subject=Unsubscribe&gt; \n\t  \n*\t Your use of Yahoo! Groups is subject to the Yahoo! Terms of\nService &lt;http://docs.yahoo.com/info/terms/&gt; . \n\n\n________________________________\n\n\n\n\n[Non-text portions of this message have been removed]\n\n\n\n\n \nYahoo! Groups Links\n\n\n\n \n\n\n\n\n\n\n\n\n\nAmerican Express Investments and American Express Independent Financial Advisers are marketing names for American Express Financial Services Europe Limited, a separate corporation within the American Express group of companies.  American Express Financial Services Europe Limited is authorised and regulated by, and is entered into the register (No. 190853 www.fsa.gov.uk/register/) of, the Financial Services Authority and a member of the London Stock Exchange. Registered in England No. 3614902. Registered address: 230 Blackfriars Road, London SE1 8NW. Vat No. 740 4143 68. \n\nThe information in this email and any attachments is confidential and intended solely for the attention and use of the named addressee(s). It may be subject to legal, professional or other privilege and further distribution of it is strictly prohibited without our authority.  If you are not the intended recipient, you are not authorised to and must not disclose, copy, distribute, or retain this message or any part of it, and should notify us immediately.\n\n\n\n[Non-text portions of this message have been removed]\n\n\n", 
    "profile": "patelr08", 
    "topicId": 15024, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 239144956, 
    "prevInTime": 15032, 
    "contentTrasformed": false, 
    "postDate": "1128092285", 
    "canDelete": false, 
    "nextInTopic": 15045, 
    "prevInTopic": 15032, 
    "headers": {
        "messageIdInHeader": "PEY2RTJGMTIxNzU2QkE5NENCOTkyMTJENjUwRDQ2QUMzODJCN0RGQGFlc3A2MDAzLnNoYXJlcGVvcGxlLmNvLnVrPg=="
    }
}