{
    "numMessagesInTopic": 5, 
    "nextInTime": 15031, 
    "senderId": "P45G8dYcsL2H2lxzPMwke6TO3woxZEbInURpgdWpcPk1zz-q4lSFdELXLClRea7B6Hp2ByFdTbt_WPGHiI-azkct82XuObxYr_Mb-4yi5hxiTnda", 
    "systemMessage": false, 
    "subject": "RE: [junit] Query on estimation", 
    "from": "&quot;Rakesh Patel&quot; &lt;rakesh.patel@...&gt;", 
    "authorName": "Rakesh Patel", 
    "msgSnippet": "Hi, I have read more about unit testing than actually doing it so bear that in mind - apparently, once the developers have got used to writing unit tests, the", 
    "msgId": 15030, 
    "profile": "patelr08", 
    "topicId": 15024, 
    "spamInfo": {
        "reason": "4", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 239144956, 
    "messageBody": "<div id=\"ygrps-yiv-2094229333\">Hi,<br/>\n<br/>\nI have read more about unit testing than actually doing it so bear that<br/>\nin mind - apparently, once the developers have got used to writing unit<br/>\ntests, the time taken to write code+unit tests is shorter than just<br/>\nwriting the code. The reason being that you end up writing &#39;just enough&#39;<br/>\nto get the job done because you have tests.<br/>\n<br/>\nAlso, it is not recommended to split estimates into 2 parts like that.<br/>\nUnit testing and code-writing are one task.<br/>\n<br/>\nHopefully, someone with more experience will back these comments up.<br/>\n<br/>\nCheers<br/>\n<br/>\nRakesh<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>] On Behalf Of<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sachin.dholakia@...\">sachin.dholakia@...</a><br/>\nSent: 29 September 2005 09:31<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSubject: [junit] Query on estimation<br/>\n<br/>\n<br/>\n<br/>\nDear all,<br/>\n<br/>\nI would like to use JUnits for a development project. Can somebody guide<br/>\n<br/>\nhow to estimate for unit testing using JUnits. There are 3 team members <br/>\nout of 6 who aren&#39;t aware of JUnits.<br/>\n<br/>\n<br/>\nThanks & Regards,<br/>\nSachin Dholakia<br/>\n<br/>\n<br/>\nNotice: The information contained in this e-mail message and/or<br/>\nattachments to it may contain confidential or privileged information.<br/>\nIf you are not the intended recipient, any dissemination, use, review,<br/>\ndistribution, printing or copying of the information contained in this<br/>\ne-mail message and/or attachments to it are strictly prohibited.   If<br/>\nyou have received this communication in error, please notify us by reply<br/>\ne-mail or telephone and immediately and permanently delete the message<br/>\nand any attachments.  Thank you<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nAmerican Express Investments and American Express Independent Financial Advisers are marketing names for American Express Financial Services Europe Limited, a separate corporation within the American Express group of companies.  American Express Financial Services Europe Limited is authorised and regulated by, and is entered into the register (No. 190853 www.fsa.gov.uk/register/) of, the Financial Services Authority and a member of the London Stock Exchange. Registered in England No. 3614902. Registered address: 230 Blackfriars Road, London SE1 8NW. Vat No. 740 4143 68. <br/>\n<br/>\nThe information in this email and any attachments is confidential and intended solely for the attention and use of the named addressee(s). It may be subject to legal, professional or other privilege and further distribution of it is strictly prohibited without our authority.  If you are not the intended recipient, you are not authorised to and must not disclose, copy, distribute, or retain this message or any part of it, and should notify us immediately.</div>", 
    "prevInTime": 15029, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1128062347", 
    "canDelete": false, 
    "nextInTopic": 15032, 
    "prevInTopic": 15024, 
    "headers": {
        "messageIdInHeader": "PEY2RTJGMTIxNzU2QkE5NENCOTkyMTJENjUwRDQ2QUMzQzg5QkFFQGFlc3A2MDAzLnNoYXJlcGVvcGxlLmNvLnVrPg=="
    }
}