{
    "numMessagesInTopic": 7, 
    "nextInTime": 15109, 
    "senderId": "9KkBjSO9FyM0BbxPjTEGlrefOO0QE2atwxjQ6zgJUiX-d5AajwRQmgAuMxBZGA_B2WBM0MYKaPb9XK9ehsjXGwsyfRXsyeU3ZaA", 
    "systemMessage": false, 
    "subject": "Re: [junit] Test Suites in HTML output", 
    "from": "James Abley &lt;james.abley@...&gt;", 
    "authorName": "James Abley", 
    "msgSnippet": "... Hi Barry, This has been discussed here . I m not sure how much help that will be for your particular", 
    "msgId": 15108, 
    "profile": "taboozizi", 
    "topicId": 15101, 
    "spamInfo": {
        "reason": "13", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 212683928, 
    "messageBody": "<div id=\"ygrps-yiv-2040293157\">On 06/10/05, barry_j_evans &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:barry_j_evans@...\">barry_j_evans@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  I&#39;ve got a number of TestSuites for a system I development; each<br/>\n&gt; TestSuite represents a different layer on the system. I use Ant Junit<br/>\n&gt; tasks to execute and create the HTML reports.<br/>\n&gt; The problem I have is that if I have the HTML produced doesn&#39;t reflect<br/>\n&gt; the nested TestSuite structure I used.<br/>\n&gt; For example if I have 3 layer a, B & C with each an appropriate Test<br/>\n&gt; Suite I&#39;d want teh top-level HTML to show the results of TestSuite A<br/>\n&gt; which consolidates the results from B & C. Essentially some similiar<br/>\n&gt; to the tree structure that the Swing JUnit runner produced in the tree<br/>\n&gt; panel.<br/>\n&gt; At the moment all the TestCases are expanded into a single page in the<br/>\n&gt; HTML under the main top-level TestSuite and with a total of over 700<br/>\n&gt; tests it is difficult to use.<br/>\n<br/>\n<br/>\n </span></blockquote>Hi Barry,<br/>\n<br/>\nThis has been discussed<br/>\nhere&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/junit/message/14389\">http://groups.yahoo.com/group/junit/message/14389</a>&gt;.<br/>\nI&#39;m not sure how much help that will be for your particular case.<br/>\n<br/>\nThat&#39;s the third time that I&#39;ve seen this come up, and JUnit 4 is still in<br/>\ngestation, so I&#39;d like to take this opportunity to ask anyone involved with<br/>\ndeveloping it on their thoughts on this problem. I do prefix this with the<br/>\ncaveat that I haven&#39;t yet looked at JUnit4 or Java5 beyond reading Elliotte<br/>\nRusty Harold&#39;s developerworks article, so please be gentle with me.<br/>\n<br/>\nMy solution essentially involved adding startSuite and endSuite method<br/>\nsignatures to TestListener and then modifying TestResult to accept Observers<br/>\nthat implemented this new interface and report when the particular lifecycle<br/>\nevents occured. The implementation was just a first draft and could<br/>\ndoubtless be made more robust - my tests were just enough to get it up and<br/>\nrunning.<br/>\n<br/>\nI&#39;m aware of Kent&#39;s stated intent that JUnit should be the intersection of<br/>\ntest tool functionality rather than the union (somewhat paraphrased!), but<br/>\nI&#39;d be interested in hearing everyone&#39;s views about where this functionality<br/>\nshould live. Presumably the logic to maintain a hierarchy of TestSuites must<br/>\nbe reimplemented by all tool vendors interested in displaying a tree of the<br/>\nresults, rather than a core part of JUnit. Is that the right place for it?<br/>\nAs a counter argument, I can see that if a vendor implemented a<br/>\nmultithreaded TestRunner for running TestSuites concurrently, then<br/>\nmaintaining a hierarchy might be a little interesting using my simplistic<br/>\nimplementation.<br/>\n<br/>\nJames<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 15107, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1128944085", 
    "canDelete": false, 
    "nextInTopic": 15119, 
    "prevInTopic": 15101, 
    "headers": {
        "inReplyToHeader": "PGRpM2hhaStqNHNuQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDIzZmNlOGU2MDUxMDEwMDQzNHExZWRlNDRlOW9AbWFpbC5nbWFpbC5jb20+", 
        "referencesHeader": "PGRpM2hhaStqNHNuQGVHcm91cHMuY29tPg=="
    }
}