{
    "numMessagesInTopic": 3, 
    "nextInTime": 15101, 
    "senderId": "IziQpQ8fJ0lLJYoKKT31i4nKzvUQ34dVTbvn6ZKxTDI8eYOSWmqTcdlyGiBFStK9F1_-TJBEopGq9pGNgkvLHGg", 
    "systemMessage": false, 
    "subject": "Re: testing dir structure", 
    "from": "&quot;miked&quot; &lt;mike@...&gt;", 
    "authorName": "miked", 
    "msgSnippet": "Actually we re not distributing the SW, we offer it as a hosted service and hold all software internally.  We do an accounting app that tracks royalty streams,", 
    "msgId": 15100, 
    "profile": "mrmikehead", 
    "topicId": 15075, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 175699578, 
    "messageBody": "<div id=\"ygrps-yiv-266569734\">Actually we&#39;re not distributing the SW, we offer it as a hosted<br/>\nservice and hold all software internally.  We do an accounting app<br/>\nthat tracks royalty streams, the current market that we&#39;re working on<br/>\nis the music industry where we track royalty income payments to<br/>\nartists from labels and other income sources and then split the money<br/>\nwithin the band.  Abit like  hearding cats...  We&#39;re looking forward<br/>\nto other licensee-licensor markets (books, toys, IP, semiconductor,<br/>\nclothings, etc) and hoping that they&#39;ll be abit more straightfwd.<br/>\n<br/>\nWith that said we are trying to position ourselves to get the SW<br/>\nmiddle/back end ready to license as an API, and if that ends up<br/>\nhappening then I&#39;d see value in providing a test suite for the backend<br/>\nalong with the API binaries.  We&#39;d see doing this in order to allow<br/>\nother programmers to view tests, experiment with params, see high and<br/>\nlow values, etc in order to help them come up to speed on our API. <br/>\nProvides customer confidence that API works as advertised  -- as well<br/>\nas providing us a known good line in the sand, so that if they<br/>\nmis-impement the API we can point them back to the tests as a means of<br/>\nestablishing a baseline level of API functionality.  Helps keep us out<br/>\nof finger pointing situations with misunderstandings about what<br/>\nfunctinality the API provides.  <br/>\n<br/>\nBut right now we&#39;re (read: me) trying to get a test suite together,<br/>\nrather get it setup as &quot;right&quot; as I can and avoid refactoring later<br/>\n<br/>\nEnjoying the book, well written, working well for me. Slow reading but<br/>\nthats probably more of a pilot error on this end...<br/>\n<br/>\nMike<br/>\n<br/>\nJoe wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;J. B. Rainsberger&quot; &lt;jbrains@r...&gt; wrote:<br/>\n<br/>\n&gt; Forget whether it&#39;s a test/ directory for a moment. You either have<br/>\nJava <br/>\n&gt; classes for testing or JSPs for testing, or both. Put them in the <br/>\n&gt; appropriate J2EE-mandated location in your directory structure,<br/>\npossibly <br/>\n&gt; in a subdirectory with test in the name.<br/>\n&gt; <br/>\n&gt; /jsp/market/app1/test/&lt;test JSPs&gt;<br/>\n&gt; /jsp/WEB-INF/classes/com/company/application/module/test/&lt;test classes&gt;<br/>\n&gt; <br/>\n&gt; I&#39;m curious, though: why are you shipping your tests with your <br/>\n&gt; application? I like the idea, but not many people do it. Why are you <br/>\n&gt; doing it? </span></blockquote></div>", 
    "prevInTime": 15099, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1128701447", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 15096, 
    "headers": {
        "inReplyToHeader": "PDQzNDU2OUNBLjIwODA4MDdAcm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PGRpNjZtNyt2bG9rQGVHcm91cHMuY29tPg=="
    }
}