{
    "numMessagesInTopic": 6, 
    "nextInTime": 15105, 
    "senderId": "3blozEoxpEykzwlEHZEPvBx-u7i6lLdKxJ2VQVG1gy-ZqprnHn5kNNx6DYDvbLze_7-poulc6I-svxxHtnTILP-93YqxnfKPwZhLOA", 
    "systemMessage": true, 
    "subject": "Boxes Full of Mud (Untested Monolith, Eclipse, SWT, and Database questions)", 
    "from": "David Brady &lt;junit_list@...&gt;", 
    "authorName": "David Brady", 
    "msgSnippet": "Hi All, I ve just been plopped into a ball of mud project: it s poorly isolated, has little or no class hierarchy/organization, everything depends on", 
    "msgId": 15104, 
    "topicId": 15104, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 240009991, 
    "messageBody": "<div id=\"ygrps-yiv-131530133\">Hi All,<br/>\n<br/>\nI&#39;ve just been plopped into a &quot;ball of mud&quot; project: it&#39;s poorly <br/>\nisolated, has little or no class hierarchy/organization, everything <br/>\ndepends on everything else, and it has no tests.  It&#39;s a Java SWT <br/>\napplication, developed with heavy dependence on Eclipse.  (I&#39;m not even <br/>\nsure anyone inhouse knows how to build the project outside of Eclipse.)  <br/>\nI am a long-time lover of unit testing, having used phpUnit and Ruby&#39;s <br/>\nTest::Unit, though I am hardly an expert.  I am new to Eclipse, Java, <br/>\nSWT and JUnit.<br/>\n<br/>\nThanks to the lovely wizards in Eclipse, I have been able to establish a <br/>\nset of beachhead tests that run and report good data on a small handful <br/>\nof classes.  I&#39;m not trying to refactor everything at once, so a lot of <br/>\nwhat I&#39;ve done is &quot;take a ball of mud, slice it in two and put the <br/>\nhalves in clean boxes.&quot;  End result is I am getting more and more boxes <br/>\nfull of mud.  :-)  One or two boxes, however, are small, and those are <br/>\nthe ones under test, so they&#39;re pretty clean.  I hope to work my way <br/>\nthrough the rest of the application this way.  Two months from now it <br/>\nwill all be under test, neatly divided, building and running integration <br/>\ntests nightly.  (Or else it won&#39;t.  But I&#39;m moderately confident as the <br/>\nproject is only 10k LOC, and the team has so far been open to my unit <br/>\ntesting sermons.)<br/>\n<br/>\nBecause our application was written monolithically, one box of mud is <br/>\nthe startup code.  Everything depends on everything else.  To get JUnit <br/>\nworking, for the nonce I made the decision to just wad all the startup <br/>\ncode into setUp().  Pushed that up into a new superclass, and all of our <br/>\nTestCases now inherit from it.  Seems to work fine.<br/>\n<br/>\nEnter a new wrinkle: the ball of mud in setUp includes some code from <br/>\nApplicationStartup.main().  That method has a CommandLineParser that <br/>\nreads the option to change databases, e.g. &quot;-d localhost&quot; or &quot;-d <br/>\n&lt;remote_server_name&gt;&quot;.  Our setUp() method just picks one as a hardcode <br/>\nand uses that.  It&#39;s now come time where I am actually bringing the <br/>\ndatabase classes under test, and I need to be able to tell the unit test <br/>\nframework to switch databases.<br/>\n<br/>\nI mentioned my general newness to JUnit, and that this is a &quot;divide the <br/>\nball of mud&quot; approach.  I have only ever written TestCases, I haven&#39;t <br/>\neven written a TestSuite or any kind of TestRunner.  Apologies if these <br/>\nare stupid questions:<br/>\n<br/>\n1. Is there a good way to catch command-line args when running JUnit?<br/>\n<br/>\n1.1. If I write a TestSuite and/or TestRunner, will this become apparent?<br/>\n<br/>\n1.2. Is this a bad question entirely?  I.e. Am I in a state of sin for <br/>\nwanting to switch around my unit tests from a command line?<br/>\n<br/>\n1.3. I am doing this to cut the database object code free of the ball of <br/>\nmud, so I can test those objects.  Should I just be mocking the Db stuff <br/>\noutright?<br/>\n<br/>\n1.4. One of our remote servers is VERY remote, such that accessing it is <br/>\nvery slow.  We need to be able to switch over to that server to test <br/>\nperformance over slow networks.  So I do think I need to be able to <br/>\nswitch the db server somehow.<br/>\n<br/>\n1.4.1. I overheard something about a performance testing tool for <br/>\nJUnit.  I confess I haven&#39;t Googled hard for it, though.  Anyone know of <br/>\na good tool for this that integrates cleanly with JUnit?<br/>\n<br/>\n2. Is there a good way to test SWT?<br/>\n<br/>\nGoogle so far says &#39;not really&#39;.  I&#39;ve made some painful conclusions and <br/>\ndesign decisions from this.  Chief among them has been, &quot;if you need to <br/>\ntest the UI, you&#39;ve probably got model code in your view classes.  Fix <br/>\nthat first.&quot;  This approach so far has worked, but it&#39;s difficult <br/>\nbecause I have to refactor the code BEFORE I can test.  Ideally I would <br/>\nlike to be able to grab the UI, fill in some boxes and click some <br/>\nbuttons, then test the UI changes.  This would allow the model/view <br/>\nrefactorings to proceed under test.<br/>\n<br/>\nThank you in advance for any advice or input you might provide.  I am <br/>\nopen to a discussion of why my entire approach may be wrong.<br/>\n<br/>\nCheers,<br/>\n<br/>\n-dB<br/>\n--<br/>\nDavid Brady<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit_list@...\">junit_list@...</a><br/>\nSometimes you gotta break a few eggs to make the chickens pay the <br/>\nprotection money.</div>", 
    "prevInTime": 15103, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1128698366", 
    "canDelete": false, 
    "nextInTopic": 15106, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDQzNDY5MUZFLjgwMzA0QHNoaW55Yml0LmNvbT4="
    }
}