{
    "numMessagesInTopic": 47, 
    "nextInTime": 15129, 
    "senderId": "-qro-vMcVjH5Asdg8aZs5Jn4hzS-fe2tvXQvuvijrjh2YGFbRn0-jlUnDDzWRPXsDvyFt1exBdCejfJv-BBIUqcO6GARCA", 
    "systemMessage": false, 
    "subject": "RE: [junit] Proposed parameterized test syntax for JUnit 4", 
    "from": "&quot;Ilja Preuss&quot; &lt;preuss@...&gt;", 
    "authorName": "Ilja Preuss", 
    "msgSnippet": "... I d think that wether the Facade should be broken down is an orthogonal issue to wether the test class should be broken down into several classes. ... It", 
    "msgId": 15128, 
    "profile": "ipreussde", 
    "topicId": 14820, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 96623270, 
    "messageBody": "<div id=\"ygrps-yiv-2064068216\"><blockquote><span title=\"ireply\">&gt;    Let me give an example. Imagine you have a statefull facade under<br/>\n&gt; test with has 5 methods: first one take no params, second - one param,<br/>\n&gt; third - two params, etc.<br/>\n&gt; <br/>\n&gt;    Should we follow your rules and break this facade into 5 classes?<br/>\n&gt; Should we then write separate unit test class for each of those new<br/>\n&gt; classes? <br/>\n<br/>\n </span></blockquote>I&#39;d think that wether the Facade should be broken down is an orthogonal<br/>\nissue to wether the test class should be broken down into several classes.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;    The way I see it: there should be single test class with several<br/>\n&gt; parameterized test cases (so several parm generators) and test case<br/>\n&gt; would test a single test.<br/>\n<br/>\n </span></blockquote>It seems to me that everyone understands that this is your position.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;    I don&#39;t quite agree with this. Tests should be simple enough to<br/>\n&gt; require no refactorings at all. Applying OOP patters to the tests may<br/>\n&gt; lead to fragile test code that will require too much maintenance,<br/>\n&gt; especially if code under test is being structurally changed.<br/>\n<br/>\n </span></blockquote>Is that your experience? Mine is quite the opposite: as with production<br/>\ncode, it is merciless refactoring that simplifies the test code to the point<br/>\nthat it becomes less fragile and reduces the amount of maintenance they<br/>\nneed.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;    Can you then run ALL tests you found in a search view?<br/>\n&gt;    Can these results guarantee that changed method under test didn&#39;t<br/>\n&gt; affected other methods and you don&#39;t have to run all tests for them<br/>\n&gt; too? <br/>\n<br/>\n </span></blockquote>I don&#39;t think *any* approach can *guarantee* this.<br/>\n<br/>\nThe strategy I use is to seperate projects into modules which are highly<br/>\ncohesive and typically small enough that running all of a single modules<br/>\ntests isn&#39;t much of an issue.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt; To say that JUnit supports or doesn&#39;t support this way of<br/>\n&gt;&gt;&gt;&gt; organizing tests sounds odd to me. I don&#39;t organize my tests a<br/>\n&gt;&gt;&gt;&gt; certain way; I refactor the tests, and that&#39;s where they tend to<br/>\n&gt;&gt;&gt;&gt; end up.<br/>\n&gt;&gt;&gt; <br/>\n&gt;&gt;&gt;   By the way, I believe that such freely-organized test cases will<br/>\n&gt;&gt;&gt; be affected a lot when doing massive code refactorings and/or moving<br/>\n&gt;&gt;&gt; things around classses. So, I&#39;d say it is always a tread off and has<br/>\n&gt;&gt;&gt; to be considered in a case by case base.<br/>\n<br/>\n </span></blockquote>Why would that be the case???<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; You /believe/ this? or it&#39;s your experience? In my /experience/ it<br/>\n&gt;&gt; just isn&#39;t that much of an issue.<br/>\n&gt; <br/>\n&gt;    It could be not an issue for unit testing of the isolated classes,<br/>\n&gt; but it is quite different if those classes have more or less complex<br/>\n&gt; dependencies (e.g. those that may be injected by IoC container in real<br/>\n&gt; app, but mocked or stubbed in a test time). That perhaps problem with<br/>\n&gt; the toolset because such testing usually introduces lot of dynamic<br/>\n&gt; dependencies only resolved or even generated in the runtime.<br/>\n<br/>\n </span></blockquote>I don&#39;t understand how this is affected by having one or more test case<br/>\nclasses per production class.<br/>\n<br/>\nConfused, Ilja</div>", 
    "prevInTime": 15127, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1129188644", 
    "canDelete": false, 
    "nextInTopic": 15132, 
    "prevInTopic": 15126, 
    "headers": {
        "inReplyToHeader": "PDQzNERERDIwLjEwNzA2QG1kLnBwLnJ1Pg==", 
        "messageIdInHeader": "PDAwNDcwMWM1Y2ZjOCQwNTc5NmRhMCQ3MDY0YThjMEBkaXN5Lm5ldD4="
    }
}