{
    "numMessagesInTopic": 47, 
    "nextInTime": 15133, 
    "senderId": "0kZB-k-wHbjzwOtbiyfeU1B0qVDBIGTmL-B9ZhAbALhmQ3xjPafitNvlGvklo8VPj8nVwgdl7sZ2X_Pnubh6kWkHRpvrQtTnKelqx63NdA", 
    "systemMessage": false, 
    "subject": "Re: [junit] Proposed parameterized test syntax for JUnit 4", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... I still don t see the connection yet, so let me ask a question: do these 5 methods (among other things) initialize the same set of fields in the stateful", 
    "msgId": 15132, 
    "rawEmail": "Return-Path: &lt;jbrains@...&gt;\r\nX-Sender: jbrains@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 35641 invoked from network); 13 Oct 2005 12:11:42 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m32.grp.scd.yahoo.com with QMQP; 13 Oct 2005 12:11:42 -0000\r\nReceived: from unknown (HELO smtp104.rog.mail.re2.yahoo.com) (206.190.36.82)\n  by mta6.grp.scd.yahoo.com with SMTP; 13 Oct 2005 12:11:41 -0000\r\nReceived: (qmail 45842 invoked from network); 13 Oct 2005 12:11:37 -0000\r\nReceived: from unknown (HELO ?192.168.1.112?) (srainsberger5790@...@208.255.117.67 with plain)\n  by smtp104.rog.mail.re2.yahoo.com with SMTP; 13 Oct 2005 12:11:36 -0000\r\nMessage-ID: &lt;434E4F50.10703@...&gt;\r\nDate: Thu, 13 Oct 2005 08:13:04 -0400\r\nUser-Agent: Mozilla Thunderbird 0.9 (Macintosh/20041103)\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: junit@yahoogroups.com\r\nReferences: &lt;E1ENGSY-0004ww-AA@...&gt; &lt;4344461D.3050703@...&gt; &lt;4344644B.404@...&gt; &lt;43453771.9070509@...&gt; &lt;434D355E.7060402@...&gt; &lt;434DD3D0.1050901@...&gt; &lt;434DDD20.10706@...&gt;\r\nIn-Reply-To: &lt;434DDD20.10706@...&gt;\r\nContent-Type: text/plain; charset=UTF-8; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: &quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;\r\nSubject: Re: [junit] Proposed parameterized test syntax for JUnit 4\r\nX-Yahoo-Group-Post: member; u=127224993; y=H2tVsuw0Z5IKYVc-sb9iCpx1uaICku84g7Lqft5L2xBiXjs\r\nX-Yahoo-Profile: nails762\r\n\r\nEugene Kuleshov wrote:\n&gt; J. B. Rainsberger wrote:\n&gt; \n&gt;  &gt;&gt;   For instance, if you look at typical facade pattern, it is quite\n&gt;  &gt;&gt;often that it would change different parts of the internal state but\n&gt;  &gt;&gt;we still need to test it as a single entity. I am pretty sure that\n&gt;  &gt;&gt;facade is not only case for this.\n&gt;  &gt;\n&gt;  &gt; I have to admit that I can&#39;t make the connection between this paragraph\n&gt;  &gt; and the subject of this thread.\n&gt; \n&gt;    Let me give an example. Imagine you have a statefull facade under\n&gt; test with has 5 methods: first one take no params, second - one param,\n&gt; third - two params, etc.\n&gt; \n&gt;    Should we follow your rules and break this facade into 5 classes?\n&gt; Should we then write separate unit test class for each of those new classes?\n\nI still don&#39;t see the connection yet, so let me ask a question: do these \n5 methods (among other things) initialize the same set of fields in the \nstateful bean? or completely different fields?\n\nIf the answer is &quot;the same set of fields&quot;, then I&#39;d keep them on the \nsame stateful bean class. This is the same as having 5 test cases that \nuse the same fixture objects.\n\nIf the answer is &quot;completely different fields&quot;, then I absolutely would \nput them on separate stateful bean classes. I would think that was \nobvious. This is the same as having 5 test cases that use completely \ndifferent fixture objects (and want them to be fields--that part is \nimportant).\n\n&gt;    The way I see it: there should be single test class with several\n&gt; parameterized test cases (so several parm generators) and test case\n&gt; would test a single test. In order to keep such construction compact you\n&gt; can move most of the code into the declarative test definition, like how\n&gt; input should look like and what to assert on the output, then test code\n&gt; itself could just iterate trough the rules for each given test case\n&gt; (before and then after test). Unfortunately this leads to soft-typed\n&gt; dynamic bindings and evaluation and as a result practically usable only\n&gt; in completely generated tests.\n\nThat surprises me, since I have been using this technique successfully \nfor five years with completely hand-written tests. I must be missing \nsomething you&#39;re trying to tell me.\n\nIt seems like you really want a single test case per production code \nclass. I have never wanted that, and I doubt I&#39;ll be able to convince \nyou about why that&#39;s a bad idea. I suppose you benefit from it in a way \nthat I don&#39;t. I doubt arguing over it will get us anywhere, so I&#39;m \noffering you a draw on that topic.\n\n&gt;  &gt; My point is pretty straightforward: we have these refactoring rules we\n&gt;  &gt; often follow and we usually say that we should refactor tests like we\n&gt;  &gt; refactor production code, so why wouldn&#39;t we apply these refactoring\n&gt;  &gt; rules to tests?\n&gt; \n&gt;    I don&#39;t quite agree with this. Tests should be simple enough to\n&gt; require no refactorings at all. Applying OOP patters to the tests may\n&gt; lead to fragile test code that will require too much maintenance,\n&gt; especially if code under test is being structurally changed.\n\nThis is /very/ interesting.\n\n&quot;Applying OOP patterns to test may lead to fragile test code that will \nrequire too much maintenance.&quot;\n\nShouldn&#39;t we then conclude that\n\n&quot;Applying OOP patterns to any system may lead to fragile code that will \nrequire too much maintenance&quot;?\n\nAre you saying that refactoring makes systems more fragile?\n\n(After all, please remember that test code is still just code.)\n\n&gt;  &gt;&gt; &gt; Why wouldn&#39;t we follow those rules with JUnit test case classes? The\n&gt;  &gt;&gt; &gt; first rule extracts common setup code into setUp() and fixture \n&gt; objects.\n&gt;  &gt;&gt; &gt; The second splits test case classes that have multiple fixtures into\n&gt;  &gt;&gt; &gt; separate test case classes. This leads to test case classes organized\n&gt;  &gt;&gt; &gt; around fixtures.\n&gt;  &gt;&gt; &gt;\n&gt;  &gt;&gt; &gt; As for one test case per model class, that&#39;s a natural place to start,\n&gt;  &gt;&gt; &gt; because it&#39;s simple, but once that test case class becomes complex,\n&gt;  &gt;&gt; &gt; refactor as usual.\n&gt;  &gt;&gt;\n&gt;  &gt;&gt;   That usually would lead to confusion and will require special tools\n&gt;  &gt;&gt;to track down all the test cases for given class.\n&gt;  &gt;\n&gt;  &gt; I have /never/, /ever/ wanted to track down all the tests for a given\n&gt;  &gt; class. I /have/ wanted to track down all the tests for a given /method/,\n&gt;  &gt; which is dirt simple in any decent IDE. (In Eclipse, I hit Ctrl+Shift+G.)\n&gt; \n&gt;    Can you then run ALL tests you found in a search view?\n\nYes. I run all the tests, which includes all the tests I found in that \nsearch view. I run all the tests all the time.\n\n&gt;    Can these results guarantee that changed method under test didn&#39;t\n&gt; affected other methods and you don&#39;t have to run all tests for them too?\n\nI suppose not, because I don&#39;t care about that: I run all the tests anyway.\n\nLet me ask you: how does keeping one test case class per production cod \nclass &quot;guarantee that changed method under test didn&#39;t affect other \nmethods without running all the tests for them too&quot;? How do you know the \nsystem-wide impact of a change without running all the tests for the \nentire system? (I don&#39;t think the way we organize tests helps us at all \nhere.)\n\n&gt;  &gt; You /believe/ this? or it&#39;s your experience? In my /experience/ it just\n&gt;  &gt; isn&#39;t that much of an issue.\n&gt; \n&gt;    It could be not an issue for unit testing of the isolated classes,\n&gt; but it is quite different if those classes have more or less complex\n&gt; dependencies (e.g. those that may be injected by IoC container in real\n&gt; app, but mocked or stubbed in a test time). That perhaps problem with\n&gt; the toolset because such testing usually introduces lot of dynamic\n&gt; dependencies only resolved or even generated in the runtime.\n\nI notice you didn&#39;t answer my question, even though you wrote this \ndirectly underneath my question. :) I used to have a lot of very \npassionate opinions until I started following a simple rule: Don&#39;t claim \nX is better than Y until you&#39;ve done both for a while and can measure \nthe difference.\n\nTake care.\n-- \nJ. B. (Joe) Rainsberger\nDiaspar Software Services\nhttp://www.diasparsoftware.com\n2005 Gordon Pask Award Winner for contribution to Agile practice\nAuthor, JUnit Recipes: Practical Methods for Programmer Testing\n\n", 
    "profile": "nails762", 
    "topicId": 14820, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "prevInTime": 15131, 
    "contentTrasformed": false, 
    "postDate": "1129205584", 
    "canDelete": false, 
    "nextInTopic": 15138, 
    "prevInTopic": 15128, 
    "headers": {
        "inReplyToHeader": "PDQzNERERDIwLjEwNzA2QG1kLnBwLnJ1Pg==", 
        "messageIdInHeader": "PDQzNEU0RjUwLjEwNzAzQHJvZ2Vycy5jb20+", 
        "referencesHeader": "PEUxRU5HU1ktMDAwNHd3LUFBQHNtdHBhdXRoMDUubWFpbC5hdGwuZWFydGhsaW5rLm5ldD4gPDQzNDQ0NjFELjMwNTA3MDNAbWQucHAucnU+IDw0MzQ0NjQ0Qi40MDRAbWV0YWxhYi51bmMuZWR1PiA8NDM0NTM3NzEuOTA3MDUwOUByb2dlcnMuY29tPiA8NDM0RDM1NUUuNzA2MDQwMkBtZC5wcC5ydT4gPDQzNEREM0QwLjEwNTA5MDFAcm9nZXJzLmNvbT4gPDQzNERERDIwLjEwNzA2QG1kLnBwLnJ1Pg=="
    }
}