{
    "numMessagesInTopic": 1, 
    "nextInTime": 15142, 
    "senderId": "4vjvkfIQJUxF0AbsM5VdHHBvu-gCYYwogXyKNmgqEwc2kFT3jSwncoJdZzOZlRaA_LyqlYxa9AXpa7WR5wo53DNgaxKQfBWP9A", 
    "systemMessage": false, 
    "subject": "Survey on corporate uses of wikis", 
    "from": "Dirk Riehle &lt;yahoo.com@...&gt;", 
    "authorName": "Dirk Riehle", 
    "msgSnippet": "Ann Majchrzak (University of Southern California) and Christian Wagner (City University of Hong Kong) are asking for your help in assessing corporate uses of", 
    "msgId": 15141, 
    "profile": "dirkriehle", 
    "topicId": 15141, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 74987654, 
    "messageBody": "<div id=\"ygrps-yiv-528766629\">Ann Majchrzak (University of Southern California) and Christian <br/>\nWagner (City University of Hong Kong) are asking for your help in <br/>\nassessing corporate uses of wikis. Please see their survey request below.<br/>\n<br/>\nDirk Riehle<br/>\n<br/>\n--------<br/>\n<br/>\nCORPORATE WIKI USERS - THIS IS FOR YOU. WIN AN iPOD NANO!<br/>\n<br/>\nIf you are an active user/contributor to a company wiki, consider <br/>\ntaking this survey and have your name entered into a raffle for an iPod Nano!<br/>\n<br/>\nhttps://emarshall2.usc.edu/ultimatesurvey/takeSurvey.asp?surveyID=419<br/>\n<br/>\nTake a moment and read these questions:<br/>\n<br/>\n* Have you thought about how your use of corporate wikis compare to <br/>\nother people using corporate wikis?<br/>\n<br/>\n* Have you wondered if other people contribute to their company&#39;s <br/>\nwiki for the same reasons you do?<br/>\n<br/>\n* Have you wondered why some people are comfortable editing others&#39; <br/>\nstuff on wikis and others are not comfortable doing it?<br/>\n<br/>\n* Is there anything about your company&#39;s use of wikis that bothers you?<br/>\n<br/>\n* Have you ever been interested in contributing to research that is <br/>\ngoing to help identify lessons learned about how to enhance corporate <br/>\nuse of wikis?<br/>\n<br/>\n* Do you have any interest in winning an iPod Nano?<br/>\n<br/>\nIf you answered any of these questions &quot;yes&quot;, then consider taking <br/>\nthis survey and be entered into a drawing for a free iPod Nano. Why <br/>\nnot give it a try?<br/>\n<br/>\nThis survey is being conducted by Dr. Ann Majchrzak, Marshall School <br/>\nof Business, University of Southern California and Dr. Christian <br/>\nWagner, City University of Hong Kong. We&#39;ve been asked by the Society <br/>\nfor Information Management&#39;s Advanced Practices Council (a <br/>\nprofessional society of Chief Information Officers in the U.S. (see <br/>\nhttp://simnet.org)) to conduct a survey of active (contributing) <br/>\ncorporate wiki users. We will use your responses to identify lessons <br/>\nlearned about how to enhance corporate use of wikis. By corporate <br/>\nwiki, we mean a wiki used in a company to further the goals of that <br/>\norganization. Such a wiki might be used for tasks including R&D, <br/>\nproject management, helpdesk activities or knowledge sharing.<br/>\n<br/>\nThank you for your time!<br/>\n<br/>\nAnn Majchrzak<br/>\nProfessor of Information Systems<br/>\nMarshall School of Business<br/>\nUniversity of Southern California<br/>\nLos Angeles, CA  90089<br/>\nmajchrza@...</div>", 
    "prevInTime": 15140, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1129245181", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDYuMi4zLjQuMi4yMDA1MTAxMzE2MTI1OS4wM2UyZDE3OEBwb3AuZ21haWwuY29tPg=="
    }
}