{
    "numMessagesInTopic": 79, 
    "nextInTime": 15155, 
    "senderId": "kwAaj30k_0eVdQGy7cZ5yQoxt_3vrNy5HmBoNyN77HXFjl4AlLD7MQG_1BH3oYyp_R3W_qZVjUjhS6PUECdOT0Bnp5rIE-3U", 
    "systemMessage": false, 
    "subject": "JUnit 4 restructuring", 
    "from": "&quot;Kent Beck&quot; &lt;kentb@...&gt;", 
    "authorName": "Kent Beck", 
    "msgSnippet": "The architecture of JUnit 4 seems to be settling down, but we have made some changes in naming and packaging to reflect our new understanding of what we have.", 
    "msgId": 15154, 
    "profile": "kentlbeck", 
    "topicId": 15154, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 173198504, 
    "messageBody": "<div id=\"ygrps-yiv-1485169241\">The architecture of JUnit 4 seems to be settling down, but we have made some<br/>\nchanges in naming and packaging to reflect our new understanding of what we<br/>\nhave. Here is an overview of the packages and classes as they stand now.<br/>\n<br/>\nPackages in JUnit 4:<br/>\n* org.junit -- published classes related to writing tests<br/>\n  * runner -- published classes related to running tests<br/>\n    * runner.extensions -- examples of new Runners<br/>\n    * runner.internal -- implementation details of running tests<br/>\n  * samples -- sample tests<br/>\n  * tests -- the tests for JUnit<br/>\n<br/>\nPublished classes in JUnit 4:<br/>\n* org.junit<br/>\n  * Before -- annotation for methods to be run before each test method<br/>\n  * BeforeClass -- annotation for methods to be run before all tests in a<br/>\nclass<br/>\n  * After -- annotation for methods to be run after each test method<br/>\n  * AfterClass -- annotation for methods to be run after all tests in a<br/>\nclass<br/>\n  * Ignore -- annotation for test methods that are temporarily not to be run<br/>\n  * Test -- annotation for methods that are to be run as tests<br/>\n  * Assert -- assertion methods, expected to be used via static import<br/>\n<br/>\n* org.junit.runner<br/>\n  * Failure -- represents a problem while running a test<br/>\n  * JUnitCore -- sets up listeners and runs tests (half of the old Runner<br/>\nfunctionality is here)<br/>\n  * Result -- summary of the results of running tests (this is the other<br/>\nhalf of the old Runner functionality)<br/>\n  * RunListener -- interface for objects wanting to be updated as tests run<br/>\n(was called TestListener)<br/>\n  * Runner -- interface for custom ways of running tests (JUnit 4 tests and<br/>\npre-JUnit 4 tests are handled automatically) (was called RunnerStrategy)<br/>\n  * RunWith -- class annotation directing JUnit 4 to use a customer runner<br/>\n(was called Factory)<br/>\n<br/>\nOther classes in JUnit 4:<br/>\n* org.junit.runner.extensions<br/>\n  * AllTests -- runner for use in running JUnit 3.x AllTests classes (those<br/>\nthat only implement a static Test suite() method)<br/>\n  * Parameterized -- runner for use in running experimental parameterized<br/>\ntests<br/>\n  * Parameters -- annotation used to identify data source for parameterized<br/>\ntests<br/>\n<br/>\nWe would appreciate feedback for this naming scheme. We would also like to<br/>\nsee examples of new runners. We have found this a very powerful mechanism.<br/>\nWe expect it to be useful for those writing JUnit add-ons.<br/>\n<br/>\nThe remaining functionality we need to add is a way to specify test suites<br/>\nthat is represented in source code and works with automated refactoring<br/>\ntools. Once that is in place we will javadoc everything, package it, and<br/>\ndeploy.<br/>\n<br/>\nSincerely yours,<br/>\n<br/>\nKent Beck<br/>\nThree Rivers Institute<br/>\n<br/>\nErich Gamma<br/>\nIBM<br/>\n<br/>\nDavid Saff<br/>\nMIT</div>", 
    "prevInTime": 15153, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1129306086", 
    "canDelete": false, 
    "nextInTopic": 15157, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PEUxRVFTNkwtMDAwM3p0LVFvQHNtdHBhdXRoMDcubWFpbC5hdGwuZWFydGhsaW5rLm5ldD4="
    }
}