{
    "numMessagesInTopic": 55, 
    "nextInTime": 15219, 
    "senderId": "URvU8dTg1yjX0Aqr95xrXpp84VXk1sjimj6l2U5yGgi2IFsXdvB8HKlYl5KxnBZEOrHgen-kzJ57ej3I8KnzBA", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Test Names and rerunning Test instances for Parameterized Tests", 
    "from": "David Saff &lt;saff@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "... I m not saying that it s impossible to make improvement, but that it s impossible to handle every conceiveable situation, so we need a concrete example of", 
    "msgId": 15218, 
    "profile": "dsaff", 
    "topicId": 15110, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 139771899, 
    "messageBody": "<div id=\"ygrps-yiv-433261830\">Eugene Kuleshov wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; David Saff wrote:<br/>\n&gt;<br/>\n&gt; &gt; I&#39;m a little uncomfortable calling it a bug.  Since JUnit 3 allows <br/>\n&gt; fully<br/>\n&gt; &gt; dynamic test tree generation, it can be undecidable in advance <br/>\n&gt; whether a<br/>\n&gt; &gt; given test case will even be included in the suite that is run, and <br/>\n&gt; more<br/>\n&gt; &gt; difficult than that to actually dynamically reconstruct the test case<br/>\n&gt; &gt; alone without running the rest of the suite.<br/>\n&gt;<br/>\n&gt;    That is true, but from other hand you don&#39;t really have to _run_<br/>\n&gt; tests to see that test cases will be included into suite. Note that I<br/>\n&gt; am not talking about completely random suites and in 99.9% suite()<br/>\n&gt; method will return the same set od test cases. So, IDE or other test<br/>\n&gt; runner could of kept these instances alive or even easier - recreate<br/>\n&gt; only this instance using number of the test in the suite as a key.<br/>\n<br/>\n </span></blockquote>I&#39;m not saying that it&#39;s impossible to make improvement, but that it&#39;s <br/>\nimpossible to handle every conceiveable situation, so we need a concrete <br/>\nexample of the situation we&#39;re trying to address.  See below.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Eclipse will work correctly rerunning tests on suites made up of<br/>\n&gt; &gt; TestCases and TestSuites constructed in the usual way, such as<br/>\n&gt; &gt; suite.addTestCase(MyTest.class).  This seems to be a good way to cover<br/>\n&gt; &gt; 80% of what users want.  Is there another JUnit 3 pattern so prevalent<br/>\n&gt; &gt; that addressing it would up that coverage to 90%?<br/>\n&gt;<br/>\n&gt;    Heh. Most of the users don&#39;t even run tests from the IDE (those run<br/>\n&gt; on continuous integration server using Ant or Maven). That may quite<br/>\n&gt; change the estimate you gave before. <br/>\n<br/>\n </span></blockquote>That feels irrelevant to me.  I&#39;m thinking about the integration between <br/>\nJUnit and the IDE (something I do a lot of these days).  People who use <br/>\nthese products integrated are the only ones I&#39;m hoping to please right <br/>\nnow.  Or did I misunderstand?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In any case where did you get<br/>\n&gt; such numbers anyways? :-)<br/>\n<br/>\n </span></blockquote>Same place as your 99.9% above  :)  I was serious about my question, <br/>\nthough--if any of the users on this list are right now frustrated by a <br/>\ntest suite that they often use in Eclipse, and can&#39;t rerun individual <br/>\ntests in, that&#39;s a good starting point for a guess as to the next kind <br/>\nof test suites that Eclipse should handle.  Please log a bug in Eclipse, <br/>\nand CC the list (I&#39;m currently spending some time on Eclipse/JUnit patches).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; One cool thing about JUnit 4 is that while you should be able to do<br/>\n&gt; &gt; arbitrary test-creation cleverness using the @RunWith annotation, this<br/>\n&gt; &gt; is a static annotation that IDE&#39;s can easily check.  So version 17.1 of<br/>\n&gt; &gt; some IDE might be able to rerun tests run with TestClassRunner (JUnit 4<br/>\n&gt; &gt; default) and OldTestClassRunner (JUnit 3 default), and if it turns <br/>\n&gt; out a<br/>\n&gt; &gt; lot of people are using Parameterized, 17.2 could add support for that.<br/>\n&gt;<br/>\n&gt;    It seems violating the concept of annotations. You should not<br/>\n&gt; annotate the behaviour, but rather define enough metadata that can be<br/>\n&gt; used by the tool to decide how to behave. <br/>\n<br/>\n </span></blockquote>Tricky, maybe, but violating is a strong word.  :)  Can you give an <br/>\nexample of how using annotations to identify the Runner that should be <br/>\nused by a particular class might be a problem?  Thanks,<br/>\n<br/>\n    David Saff</div>", 
    "prevInTime": 15217, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1129749090", 
    "canDelete": false, 
    "nextInTopic": 15219, 
    "prevInTopic": 15217, 
    "headers": {
        "inReplyToHeader": "PDQzNTY5NkI4LjEwMzA3MDBAbWQucHAucnU+", 
        "messageIdInHeader": "PDQzNTY5QTYyLjkwNDA5MDlAbWl0LmVkdT4=", 
        "referencesHeader": "PGRqNjFpbitrN3UzQGVHcm91cHMuY29tPiA8NDM1NjkyMzIuMTA1MDcwOUBtaXQuZWR1PiA8NDM1Njk2QjguMTAzMDcwMEBtZC5wcC5ydT4="
    }
}