{
    "numMessagesInTopic": 79, 
    "nextInTime": 15275, 
    "senderId": "GU3xWANcsdo5V3Vi26tfiyOwT8RL9hytAeI3e5SvxUad833l8eDiFPada_rif6n8l_WW38JumA6BZ-YMt8ZM8jee6dq4o3QFj-yx8CjTYA", 
    "systemMessage": false, 
    "subject": "Re: [junit] JUnit 4 restructuring", 
    "from": "Elliotte Harold &lt;elharo@...&gt;", 
    "authorName": "Elliotte Harold", 
    "msgSnippet": "... Extensibility is hard and does not come without cost. Every published method you add to a class increases the difficulty of learning that class more than", 
    "msgId": 15274, 
    "topicId": 15154, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 12653864, 
    "messageBody": "<div id=\"ygrps-yiv-1944428273\">Cédric Beust ♔ wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Basic real world:  you can never anticipate how future users will use your<br/>\n&gt; software, so don&#39;t make their lives too difficult.<br/>\n<br/>\n </span></blockquote>Extensibility is hard and does not come without cost. Every published <br/>\nmethod you add to a class increases the difficulty of learning that <br/>\nclass more than linearly. Giving everyone everything they might possibly <br/>\nneed creates baroque APIs that are extremely difficult to learn and use. <br/>\nKISS applies.<br/>\n<br/>\nIf someone presents a valid, not-too-weird use case that requires <br/>\nexposing a protected method, then by all means make the method <br/>\nprotected. But don&#39;t make everything protected just because you think <br/>\nsomeone, somewhere might one day want to use it. If the sheer size of <br/>\nthe resulting classes doesn&#39;t seem reason enough, then consider that you <br/>\nprobably haven&#39;t designed the method correctly for extension in the <br/>\nfirst place. Methods provided in advance of an actual use case are <br/>\nunlikely to fit the use cases that do arise.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; While I sympathize with the idea of keeping as much private as possible, I<br/>\n&gt; am also a bit bothered by the patronizing feeling behind it.   Developers<br/>\n&gt; don&#39;t need baby-sitting and a lot of them are very capable to know the<br/>\n&gt; consequences of their decisions.  Reusing a protected method is dangerous --<br/>\n&gt; especially if this method has been documented with a lot of warnings -- but<br/>\n&gt; this doesn&#39;t mean it should be banned altogether.<br/>\n<br/>\n </span></blockquote>Libraries are by their nature patronizing. If the people designing a <br/>\nlibrary don&#39;t know more about the subject than the users of the library, <br/>\nthen why should anyone use it in the first place? We can&#39;t all be <br/>\nexperts in everything. We are all novices in some areas we need to work <br/>\nin. This is why we use libraries: so we can benefit from the wisdom of <br/>\npeople who know more in that particular field than we do. Some of that <br/>\nwisdom includes telling people what&#39;s dangerous and what isn&#39;t. It also <br/>\nincludes not exposing dangerous functionality by default without <br/>\ncarefully considering whether and how much it&#39;s needed.<br/>\n<br/>\nWhile some developers don&#39;t need baby-sitting, most do. In fact, let me <br/>\ndequalify that: All developers need to be baby sat. However we more <br/>\npolitely call it &quot;mentoring&quot;, &quot; code review&quot;, and &quot;pair programming&quot; <br/>\nrather than baby sitting. The agile truth is, babysitting works. Of <br/>\ncourse we end up babysitting each other at some point, which is fine. <br/>\nThe intelligence of the group often exceeds that of the sum of the <br/>\nindividual members.<br/>\n<br/>\nAgile programming is based on a humble attitude. Agility accepts that we <br/>\ndon&#39;t know everything, we can&#39;t predict the future, we don&#39;t get <br/>\nanything right the first time, and we will make mistakes. It endeavors <br/>\nto minimize the damage caused by these natural aspects of being human.<br/>\n<br/>\nThe dangerous arrogance is that of the programmer who believes he&#39;s god <br/>\nand can do no wrong; that he should be immediately allowed to do <br/>\nanything he wants to to do. (I use the masculine pronoun deliberately <br/>\nhere. I&#39;ve yet to meet a female programmer with this particular <br/>\npersonality defect, but it&#39;s epidemic among male programmers, and <br/>\nperhaps a little more common among younger ones who haven&#39;t yet had <br/>\nenough time to build a large personal catalog of really impressive <br/>\nfailures.)<br/>\n<br/>\n-- <br/>\n﻿Elliotte Rusty Harold  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elharo@...\">elharo@...</a><br/>\nXML in a Nutshell 3rd Edition Just Published!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafeconleche.org/books/xian3/\">http://www.cafeconleche.org/books/xian3/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/exec/obidos/ISBN=0596007647/cafeaulaitA/ref=nosim\">http://www.amazon.com/exec/obidos/ISBN=0596007647/cafeaulaitA/ref=nosim</a></div>", 
    "prevInTime": 15273, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1130754245", 
    "canDelete": false, 
    "nextInTopic": 15275, 
    "prevInTopic": 15273, 
    "headers": {
        "inReplyToHeader": "PGI4NmI2YTljMDUxMDMxMDAyMHA3MmNkY2NlOHNiY2Q1ZjgwYzI4NGRhZWUwQG1haWwuZ29vZ2xlLmNvbT4=", 
        "messageIdInHeader": "PDQzNjVGMEM1LjcwMzA1MDhAbWV0YWxhYi51bmMuZWR1Pg==", 
        "referencesHeader": "PEUxRVQ4aVMtMDAwMjM0LURyQHNtdHBhdXRoMDYubWFpbC5hdGwuZWFydGhsaW5rLm5ldD4JIDw0MzY1QzBBOS45MDIwOUBtZXRhbGFiLnVuYy5lZHU+IDxiODZiNmE5YzA1MTAzMTAwMjBwNzJjZGNjZThzYmNkNWY4MGMyODRkYWVlMEBtYWlsLmdvb2dsZS5jb20+"
    }
}