{
    "numMessagesInTopic": 79, 
    "nextInTime": 15273, 
    "senderId": "DH4PYeBRYexjd9H6H6GjG-R6E7pg4QuGyttgBkDeMS_HmSQFG3LH_3jnBlV_4g2tnq-EdRcv-DargBPadmPz5s222BaHYd2fnhUob5WQBg", 
    "systemMessage": false, 
    "subject": "Re: [junit] JUnit 4 restructuring", 
    "from": "Elliotte Harold &lt;elharo@...&gt;", 
    "authorName": "Elliotte Harold", 
    "msgSnippet": "... I read this just before I went away on vacation and almost fell out of my chair. I gave myself ten days to cool off and then came back to it, and it still", 
    "msgId": 15272, 
    "topicId": 15154, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 12653864, 
    "messageBody": "<div id=\"ygrps-yiv-976193150\">Kent Beck wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In general, I prefer to make all non-externally-visible methods protected,<br/>\n&gt; since I don&#39;t know a priori which ones will prove useful as hooks for<br/>\n&gt; further extension.<br/>\n<br/>\n </span></blockquote>I read this just before I went away on vacation and almost fell out of <br/>\nmy chair. I gave myself ten days to cool off and then came back to it, <br/>\nand it still shocked me. I&#39;ve heard claims like this before, but I&#39;m <br/>\nastounded to hear it from the co-author of Extreme Programming. This is <br/>\na horrible coding practice that flies in the face of good agile <br/>\ndevelopment practices and basic object oriented principles.<br/>\n<br/>\nBasic OOP: keep everything as private as you possibly can. This gives <br/>\nyou maximum flexibility for future development and change. Anything that <br/>\nis private can be refactored or changed as needed for any reason that <br/>\narises. Once you publish an interface as either protected or public <br/>\nyou&#39;re stuck with it. You can&#39;t change it later for performance or <br/>\nchanging requirements or to fix a mistake. People may be depending on <br/>\nit. This mandates that you don&#39;t put anything into your interfaces <br/>\nunless you&#39;re really, really sure it&#39;s right. If you leave something out <br/>\nfor which a use case is later demonstrated, you can always put it in. <br/>\nYou can almost always change a method from private to protected without <br/>\nbreaking anyone&#39;s code. However, you cannot go the other way.<br/>\n<br/>\nBasic Agile: You Ain&#39;t Going to Need It (YAGNI). Why make the effort to <br/>\ncreate a protected method that more than likely will never be used or <br/>\nwill be used so rarely it won&#39;t even pay back the complexity cost of the <br/>\nextra JavaDoc? Designing for subclassing is hard. It takes roughly three <br/>\ntimes as much effort as designing a final class, maybe more. Most <br/>\nnon-final classes in the wild are fundamentally broken. Of course <br/>\nsometimes you do need subclasses, but don&#39;t go adding extension points <br/>\nwilly-nilly until you&#39;re ready to design them properly, document them <br/>\nfully, consider their implications for other dependent methods, and do <br/>\nall the other hard work required to create a truly extensible class. <br/>\nJava erred by not making final the default, but there&#39;s no reason we <br/>\nhave to repeat its mistakes.<br/>\n<br/>\n-- <br/>\n﻿Elliotte Rusty Harold  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elharo@...\">elharo@...</a><br/>\nXML in a Nutshell 3rd Edition Just Published!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafeconleche.org/books/xian3/\">http://www.cafeconleche.org/books/xian3/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/exec/obidos/ISBN=0596007647/cafeaulaitA/ref=nosim\">http://www.amazon.com/exec/obidos/ISBN=0596007647/cafeaulaitA/ref=nosim</a></div>", 
    "prevInTime": 15271, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1130741929", 
    "canDelete": false, 
    "nextInTopic": 15273, 
    "prevInTopic": 15268, 
    "headers": {
        "inReplyToHeader": "PEUxRVQ4aVMtMDAwMjM0LURyQHNtdHBhdXRoMDYubWFpbC5hdGwuZWFydGhsaW5rLm5ldD4=", 
        "messageIdInHeader": "PDQzNjVDMEE5LjkwMjA5QG1ldGFsYWIudW5jLmVkdT4=", 
        "referencesHeader": "PEUxRVQ4aVMtMDAwMjM0LURyQHNtdHBhdXRoMDYubWFpbC5hdGwuZWFydGhsaW5rLm5ldD4="
    }
}