{
    "numMessagesInTopic": 79, 
    "nextInTime": 15289, 
    "senderId": "xFhYfEXuWrRvpw401fyT35coD-8XHCjH1sNBzGfpFUG_kfY-TZrZepRm6tJpEOK_dVdU9rMPHkMd6iT8YX4NjA", 
    "systemMessage": false, 
    "subject": "Re: [junit] JUnit 4 restructuring", 
    "from": "David Saff &lt;saff@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "Elliotte, Just as a few months ago, I m going to agree to disagree on this point. As an extender (most often of Eclipse), I find myself often wanting extension", 
    "msgId": 15288, 
    "profile": "dsaff", 
    "topicId": 15154, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 139771899, 
    "messageBody": "<div id=\"ygrps-yiv-1821215257\">Elliotte,<br/>\n<br/>\nJust as a few months ago, I&#39;m going to agree to disagree on this point.  <br/>\nAs an extender (most often of Eclipse), I find myself often wanting <br/>\nextension hooks for things that were hard-coded.  Now, if I were to ask <br/>\nthe Eclipse framework writers to think about, document, publish, and <br/>\nguarantee to all the world for all time an API for what I&#39;m requesting, <br/>\nit would be too much to ask.  A middle ground seems the fair solution: <br/>\nthey open the door, with documentation that it&#39;s in an internal package, <br/>\nor only for people who know what they&#39;re doing, and I promise to know <br/>\nwhat I&#39;m doing. <br/>\n<br/>\nAs an extender, I don&#39;t want there to be only published and committed <br/>\nfor all the world, and private to everyone.  To use an online publishing <br/>\nmetaphor, I&#39;m willing to pay the cost for a premium subscription, in <br/>\nreading undocumented source code and risk of future breakage.  :)  And <br/>\nwhen that premium subscription is offered without my asking, then I can <br/>\nget my extension to market quicker, which makes me happier about <br/>\nEclipse, and Eclipse a more useful and used platform.<br/>\n<br/>\nThat&#39;s just my experience.  Some clarification on terminology, and then <br/>\nI&#39;m done:<br/>\n<br/>\nElliotte Harold wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; David Saff wrote:<br/>\n&gt;<br/>\n&gt; &gt; My experience is that it is best to allow a gradient to your users and<br/>\n&gt; &gt; extenders.  There should be public, javadoc&#39;ed, committed, released <br/>\n&gt; API,<br/>\n&gt; &gt; but there should also be some beta API&#39;s, protected methods without<br/>\n&gt; &gt; commitment, public implementation classes in packages marked internal. <br/>\n&gt; &gt; Is it necessary that the presence of the latter should interfere at all<br/>\n&gt; &gt; with the comprehensibility or quality of the former?<br/>\n&gt;<br/>\n&gt; Beta APIs should not be part of an official release. They should be part<br/>\n&gt; of clearly marked beta releases where users know hat they&#39;re getting<br/>\n&gt; into before they use them.<br/>\n<br/>\n </span></blockquote>Of course.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Protected methods are part of the published API and there&#39;s no reason to<br/>\n&gt; expect users not to rely on them. marking something &quot;protected&quot; only<br/>\n&gt; reflects its access protection. It doesn&#39;t mean it&#39;s more or less likely<br/>\n&gt; to change in the future. Overloading the word &quot;protected&quot; in this way<br/>\n&gt; can only serve to confuse users.<br/>\n<br/>\n </span></blockquote>Sorry.  I meant &quot;without commitment&quot; meaning &quot;documented as possibly <br/>\nunstable&quot;, not that all protected methods were automatically to be <br/>\nunderstood as implicitly so documented.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Packages documented internal are a code smell, and should be avoided.<br/>\n&gt; Usually these can be made genuinely non-public in an existing package<br/>\n&gt; instead.<br/>\n<br/>\n </span></blockquote>I agree to disagree.<br/>\n<br/>\n    David Saff</div>", 
    "prevInTime": 15287, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1130771547", 
    "canDelete": false, 
    "nextInTopic": 15289, 
    "prevInTopic": 15287, 
    "headers": {
        "inReplyToHeader": "PDQzNjYyRTVBLjUwMzAwMDBAbWV0YWxhYi51bmMuZWR1Pg==", 
        "messageIdInHeader": "PDQzNjYzNDVCLjQwMDAzMDBAbWl0LmVkdT4=", 
        "referencesHeader": "PEUxRVQ4aVMtMDAwMjM0LURyQHNtdHBhdXRoMDYubWFpbC5hdGwuZWFydGhsaW5rLm5ldD4JIDw0MzY1QzBBOS45MDIwOUBtZXRhbGFiLnVuYy5lZHU+IDxiODZiNmE5YzA1MTAzMTAwMjBwNzJjZGNjZThzYmNkNWY4MGMyODRkYWVlMEBtYWlsLmdvb2dsZS5jb20+IDw0MzY1RjFGMy44MDQwNTA4QG1ldGFsYWIudW5jLmVkdT4gPDQzNjYxRjYzLjMwOEBjc2FpbC5taXQuZWR1PiA8NDM2NjJFNUEuNTAzMDAwMEBtZXRhbGFiLnVuYy5lZHU+"
    }
}