{
    "numMessagesInTopic": 20, 
    "nextInTime": 15314, 
    "senderId": "JQStCJsqRAJnaZXsjo8pkbBNJKxxASgCqWzCIQ-CLMCORyPwRGoN6APOoeuqptaYIcGxBP5SW69nVY_n2GR7WtYZj6feHuHaK4PbLCTVsA", 
    "systemMessage": false, 
    "subject": "Re: [junit] Private method throws an exception", 
    "from": "Elliotte Harold &lt;elharo@...&gt;", 
    "authorName": "Elliotte Harold", 
    "msgSnippet": "... If I have a failing test that fails because an exception is thrown out of a private method, I debug it. First off I eyeball the code both in the private", 
    "msgId": 15313, 
    "topicId": 15264, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 12653864, 
    "messageBody": "<div id=\"ygrps-yiv-45235993\">J. B. Rainsberger wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you have a failing test, but you aren&#39;t sure why it fails, and you <br/>\n&gt; suspect the problem is in a private method, what do you generally do?<br/>\n<br/>\n </span></blockquote>If I have a failing test that fails because an exception is thrown out <br/>\nof a private method, I debug it. First off I eyeball the code both in <br/>\nthe private method and the public method being tested. Most of the time <br/>\nthe reason for the failure is obvious. If it&#39;s not, I&#39;ll generally set a <br/>\nbreakpoint or two and step through the code in the debugger and watch <br/>\nwhat actually happens. This is a lot more productive than guessing at <br/>\nwhat the problem might be. If I could guess right, then I wouldn&#39;t need <br/>\nto step through it.<br/>\n<br/>\nIt used to be common in quality code to do a code review by stepping <br/>\nthrough the entire program in a debugger. This tended to reveal a lot of <br/>\nsurprises about how the code was really working. This technique has <br/>\nfallen out of favor as applications grew larger. It&#39;s really impractical <br/>\ntoday. However, when something is going wrong in a known piece of code <br/>\nnothing beats single stepping through it in a debugger. This almost <br/>\nalways points me to the exact statement where what I think the code is <br/>\ndoing diverges from what the code is actually doing.<br/>\n<br/>\nThis requires that the bug is consistently reproducible and I have a <br/>\ntest that reproduces it. However, once I&#39;ve got that I&#39;m good to go. <br/>\nWriting hypothetical tests for what I think the bug might be only works <br/>\nif the bug is so obvious that I can eyeball it in the first place. The <br/>\ntricky bugs are the ones where everything looks like it should work and <br/>\nI can&#39;t see why it doesn&#39;t. That&#39;s when I need to isolate the problem <br/>\nmore closely than a test method can. I need to find out which statement <br/>\nis failing, not which method is failing. I already know the answer to <br/>\nthe latter question.<br/>\n<br/>\nIf the bug proves to be deep inside another piece of code, then I might <br/>\nlater add a second test that aims more closely at the bug. However, <br/>\nthat&#39;s only done after I&#39;ve identified the bug, and often I don&#39;t even <br/>\nbother to do that. After all, there&#39;s already at least one test for the <br/>\nissue.<br/>\n<br/>\n-- <br/>\n﻿Elliotte Rusty Harold  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elharo@...\">elharo@...</a><br/>\nXML in a Nutshell 3rd Edition Just Published!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafeconleche.org/books/xian3/\">http://www.cafeconleche.org/books/xian3/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/exec/obidos/ISBN=0596007647/cafeaulaitA/ref=nosim\">http://www.amazon.com/exec/obidos/ISBN=0596007647/cafeaulaitA/ref=nosim</a></div>", 
    "prevInTime": 15312, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1130807461", 
    "canDelete": false, 
    "nextInTopic": 15315, 
    "prevInTopic": 15312, 
    "headers": {
        "inReplyToHeader": "PDQzNjY4QzJCLjYwOTA1MDlAcm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PDQzNjZDMEE1LjYwNjA5MDVAbWV0YWxhYi51bmMuZWR1Pg==", 
        "referencesHeader": "PGRqdDlwMytyNzNpQGVHcm91cHMuY29tPiA8NDM2NUJENUQuNjA5MDQwN0BtZXRhbGFiLnVuYy5lZHU+IDw0MzY2NUZERi43MDUwOTAzQHJvZ2Vycy5jb20+IDw0MzY2NzUwNy42MDYwNDAwQG1ldGFsYWIudW5jLmVkdT4gPDQzNjY4QzJCLjYwOTA1MDlAcm9nZXJzLmNvbT4="
    }
}