{
    "numMessagesInTopic": 79, 
    "nextInTime": 15335, 
    "senderId": "HQdCEoBPMIhhq_vPm9W6En1wdMli-R9W7qjcV4Nr5lrV7Dfqd74rqf7JbmS7UGHoZjcc_ymN0r1RWfs9BC-QqiQI7F2tjAXCinrqfJ7UDluIMfi9GhusjichAWgH7keONenq", 
    "systemMessage": false, 
    "subject": "Re: [junit] JUnit 4 restructuring", 
    "from": "=?UTF-8?Q?C=C3=A9dric_Beust_=E2=99=94_?= &lt;cbeust@...&gt;", 
    "authorName": "Cédric Beust ♔", 
    "msgSnippet": "Hi Elliotte, All good points, and I m in general agreement with everything you say below. Again, all I was trying to do was to fight against the dogmatic", 
    "msgId": 15334, 
    "profile": "cbeust", 
    "topicId": 15154, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 199443513, 
    "messageBody": "<div id=\"ygrps-yiv-1827210996\">Hi Elliotte,<br/>\n<br/>\nAll good points, and I&#39;m in general agreement with everything you say below.<br/>\n<br/>\nAgain, all I was trying to do was to fight against the dogmatic &quot;never<br/>\nexpose a protected method if you don&#39;t have to&quot;. As you rightfully point out<br/>\nin your message below, this mailing-list is comprised of experts who have a<br/>\ngood grasp of the compromises involved in making such decisions, and if one<br/>\nof them decides that there is some potential to be gained by exposing a<br/>\nprotected method, they should follow their instinct and go ahead, even if<br/>\nthat potential is unseen at the time of writing and, more importantly, even<br/>\nif it goes again the Agile Principles.<br/>\n<br/>\nThat&#39;s called intuition, and listening to it once in a while is a duty,<br/>\nalong with questioning absolute statements such as &quot;YAGNI&quot;.<br/>\n<br/>\n--<br/>\nCedric<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://testng.org\">http://testng.org</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 11/2/05, Elliotte Rusty Harold &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elharo@...\">elharo@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; Cédric Beust ♔ wrote:<br/>\n&gt;<br/>\n&gt; &gt; You don&#39;t know that, because you never heard from them. And for all you<br/>\n&gt; &gt; know, all these potential users chose to use a different library than<br/>\n&gt; yours<br/>\n&gt; &gt; because they had more freedom there.<br/>\n&gt;<br/>\n&gt; Perhaps, but I don&#39;t think so. I not only pay pretty close attention to<br/>\n&gt; what users are asking me. I listen to what users are asking from my<br/>\n&gt; competition. (fringe benefit of open source and open development).<br/>\n&gt; Unless they&#39;re a lot of people working on their own XML frameworks in<br/>\n&gt; their basements, there&#39;s just not that much need for extending the<br/>\n&gt; framework beyond what I provide. Even in frameworks that allow a lot<br/>\n&gt; more extensibility of this type (DOM comes to mind) people don&#39;t<br/>\n&gt; actually seem to take advantage of that possibility.<br/>\n&gt;<br/>\n&gt; Inheritance is vastly overrated. The number of people who actually want<br/>\n&gt; to change a class&#39;s behavior is extremely small in most cases.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; And even if you could know this number for sure, just accept that other<br/>\n&gt; &gt; people have different experiences than you do (among which, most of the<br/>\n&gt; &gt; people who are participating in this thread, it seems).<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Actually, I&#39;d turn that back on you. Different people have different<br/>\n&gt; experiences and different needs, but these experiences and needs are not<br/>\n&gt; equal in numbers or importance. The programmers who hang out on mailing<br/>\n&gt; lists like this one (especially this one) are a very highly<br/>\n&gt; self-selected group. They are in many ways much more theoretically and<br/>\n&gt; abstractly inclined than 90% of working developers. Most programmers who<br/>\n&gt; write books about programming and who design and publish libraries are<br/>\n&gt; really way beyond the typical working developer. Not a surprise: some<br/>\n&gt; programmers are experts in programming and some are experts in insurance<br/>\n&gt; or financial derivatives or shock wave modeling or something else. We<br/>\n&gt; can&#39;t all be experts in everything. But these mailing lists attract the<br/>\n&gt; meta-programmers: the programmers who are experts in programming.<br/>\n&gt;<br/>\n&gt; Guess what? We&#39;re weird, even among programmers. We are much more<br/>\n&gt; comfortable with abstraction than even other typical programmers. Design<br/>\n&gt; patterns, factory methods, interfaces, inheritance, polymorphism, and<br/>\n&gt; anything beyond simple data encapsulation is way beyond the comfort<br/>\n&gt; level of most actual programmers. A library designed for ease of use by<br/>\n&gt; a typical programmer needs to focus on the 90% rather than the 10%. If<br/>\n&gt; you gauge the audience for a tool by the programmers who hang out in<br/>\n&gt; forums like this one, you&#39;re going to miss the vast body of programmers<br/>\n&gt; who don&#39;t.<br/>\n&gt;<br/>\n&gt; What you are in effect arguing is that you don&#39;t want to be held back by<br/>\n&gt; the needs of the many. You can safely use extra extension points, and<br/>\n&gt; therefore they should be there. But most programmers don&#39;t feel this<br/>\n&gt; way. Most of them can at least safely ignore the extra methods. They<br/>\n&gt; probably won&#39;t shoot themselves in the foot even if we give them plenty<br/>\n&gt; of bullets. However the sheer complexity of adding all these extra<br/>\n&gt; extension points make the classes so much harder to use that the cost to<br/>\n&gt; the many outweighs the benefits to the few.<br/>\n&gt;<br/>\n&gt; Sometimes we do need subclassing and extra extension points, but not<br/>\n&gt; that many and not that often; even when considering only the most<br/>\n&gt; abstractly inclined of programmers. Extension points are not without<br/>\n&gt; cost. There&#39;s is or should be a significant hurdle to be jumped before<br/>\n&gt; adding a new published method. Even if the method is inherently useful<br/>\n&gt; and has no corresponding problems, it still needs to be useful enough.<br/>\n&gt; It&#39;s not enough that one or a few people might use a method. It needs to<br/>\n&gt; be pretty clear that large percentage of a library&#39;s users are going to<br/>\n&gt; take advantage of the feature, or that it be extremely important to a<br/>\n&gt; smaller but still sizeable percentage.<br/>\n&gt;<br/>\n&gt; We can argue about exactly where to put the line: how useful to how many<br/>\n&gt; people does a method need to be before we add it. However that number is<br/>\n&gt; quite a bit higher then 1. It is certainly higher than 0. That a feature<br/>\n&gt; might someday be used by someone, but we aren&#39;t quite sure who or when,<br/>\n&gt; is not sufficient grounds to include it. There needs to be a positive<br/>\n&gt; decision that a feature will be useful before it&#39;s added. Featuritis is<br/>\n&gt; as damaging to APIs as it is to applications.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --<br/>\n&gt; Elliotte Rusty Harold <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elharo@...\">elharo@...</a><br/>\n&gt; XML in a Nutshell 3rd Edition Just Published!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafeconleche.org/books/xian3/\">http://www.cafeconleche.org/books/xian3/</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/exec/obidos/ISBN=0596007647/cafeaulaitA/ref=nosim\">http://www.amazon.com/exec/obidos/ISBN=0596007647/cafeaulaitA/ref=nosim</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n--<br/>\nCédric<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 15333, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1130948725", 
    "canDelete": false, 
    "nextInTopic": 15335, 
    "prevInTopic": 15332, 
    "headers": {
        "inReplyToHeader": "PDQzNjhERTA5LjgwMTAzMDdAbWV0YWxhYi51bmMuZWR1Pg==", 
        "messageIdInHeader": "PGI4NmI2YTljMDUxMTAyMDgyNXI0NDY0NDQ0Mm1lZTNhNmVjODVhNmE3M2QzQG1haWwuZ29vZ2xlLmNvbT4=", 
        "referencesHeader": "PEUxRVQ4aVMtMDAwMjM0LURyQHNtdHBhdXRoMDYubWFpbC5hdGwuZWFydGhsaW5rLm5ldD4JIDw0MzY1QzBBOS45MDIwOUBtZXRhbGFiLnVuYy5lZHU+CSA8Yjg2YjZhOWMwNTEwMzEwMDIwcDcyY2RjY2U4c2JjZDVmODBjMjg0ZGFlZTBAbWFpbC5nb29nbGUuY29tPgkgPDQzNjVGMEM1LjcwMzA1MDhAbWV0YWxhYi51bmMuZWR1PiA8NDM2NjIyNDIuNjAxMDgwMkBjc2FpbC5taXQuZWR1PgkgPDQzNjYyOTRGLjEwNTAxMDJAbWV0YWxhYi51bmMuZWR1PgkgPGI4NmI2YTljMDUxMDMxMDY0NG0zYWE3YzY4NWo1ZGQ5ODY5NTk5ZDIyYmFjQG1haWwuZ29vZ2xlLmNvbT4JIDw0MzY2MzIyNy40MDQwMDA3QG1ldGFsYWIudW5jLmVkdT4JIDxiODZiNmE5YzA1MTAzMTA4MjdyMzViMzgyNjBrZmVlY2MyNjkyMDcwM2Y2MUBtYWlsLmdvb2dsZS5jb20+CSA8NDM2OERFMDkuODAxMDMwN0BtZXRhbGFiLnVuYy5lZHU+"
    }
}