{
    "numMessagesInTopic": 7, 
    "nextInTime": 1544, 
    "senderId": "I9AUsK4L3oO_Q8EkrtuRgHZaTZmhbmlvzblWagZYSK3LBUecr6UU83BDVOw41furTtSjQTZFN-IV4PEMm8uBb6kNmUrIL_o", 
    "systemMessage": false, 
    "subject": "Re: Has someone done Servlet JUnit tests?", 
    "from": "Paul Hodgetts &lt;prh@...&gt;", 
    "authorName": "Paul Hodgetts", 
    "msgSnippet": "... You can use HTTPUnit to run tests against the servlet.  The problem, however, as you point out, is that you only have limited visibility into the servlet,", 
    "msgId": 1543, 
    "topicId": 1539, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1718642316\">Peter Qi wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt; I need to create some JUnit tests for a Servlet.  But because the<br/>\n &gt; doGet(HttpServletRequest, HttpServletResponse) and<br/>\n &gt; doPost(HttpServletRequest, HttpServletResponse) methods have no returns,<br/>\n &gt; and HttpServletRequest and HttpServletResponse are generated by the<br/>\n &gt; system, I could not create JUnit tests for them.  Does anyone have some<br/>\n &gt; experience?  Thanks a lot for the help.<br/>\n<br/>\n </span></blockquote>You can use HTTPUnit to run tests against the servlet.  The<br/>\nproblem, however, as you point out, is that you only have<br/>\nlimited visibility into the servlet, since you can only check<br/>\nthe returned HTTP response to the web client.  It&#39;s gets even<br/>\nmore fun when you&#39;re trying to test the behavior of session<br/>\ntime outs, security and log in checks, etc.<br/>\n<br/>\nWhat we&#39;ve discussed doing is to make our servlets (and JSPs<br/>\nvia tag libraries) very thin layers that take the incoming<br/>\nrequests and just delegate to our presentation helper classes.<br/>\nIn many cases, we&#39;ll end up just passing the request and<br/>\nsession objects along, but we now have a point where we can<br/>\ncreate the request or session objects in particular states<br/>\n(like expired session), so we can much more easily test the<br/>\ninterface&#39;s behavior, plus we can use JUnit.<br/>\n<br/>\nThis isn&#39;t a silver bullet or anything, because there are<br/>\nstill cases where you want to test the actual returned HTML,<br/>\nand sometimes HTTPUnit tests are the best way to do that.<br/>\nBut it seems like it will make our life a bit easier for some<br/>\nother classes of presentation layer testing.<br/>\n<br/>\nAnyone else try this?<br/>\n<br/>\n-Paul Hodgetts</div>", 
    "prevInTime": 1542, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "992799570", 
    "canDelete": false, 
    "nextInTopic": 1547, 
    "prevInTopic": 1542, 
    "headers": {
        "inReplyToHeader": "PDk5Mjc4NzI5Ni40NzUuNDIwNDYubDEwQHlhaG9vZ3JvdXBzLmNvbT4=", 
        "messageIdInHeader": "PDQuMi4yLjIwMDEwNjE3MTAyODUxLjAwYzIxZTUwQG1haWwuenp5enh0ZWsuY29tPg=="
    }
}