{
    "numMessagesInTopic": 32, 
    "nextInTime": 15454, 
    "senderId": "rtk-2rL8x9fNHKkVgOV1JOMhEQ_PMUyTinAEWdhdicUUQPc3qp3s1jKq1rwdHH_TrSGiJcyOa2ReIL2mW_yl6v6rFJU", 
    "systemMessage": false, 
    "subject": "Re: [junit] coverage testing", 
    "from": "Eugene Kuleshov &lt;eu@...&gt;", 
    "authorName": "Eugene Kuleshov", 
    "msgSnippet": "... I have to completely disagree with this. First of all we are talking about unit tests, which suppose to work with isolated components. I ll leave aside", 
    "msgId": 15453, 
    "profile": "ekuleshov", 
    "topicId": 15403, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 150395705, 
    "messageBody": "<div id=\"ygrps-yiv-697412404\">Robert Watkins wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Nobody disputes that 100% code coverage is a good thing, it&#39;s just that it<br/>\n&gt;&gt;becomes impossibly hard to achieve as your code base becomes more complex.<br/>\n&gt;&gt;You just need to make sure you don&#39;t hit the point of diminishing return<br/>\n&gt;&gt;when trying to hit a balance between &quot;more code coverage&quot;, &quot;more tests&quot;,<br/>\n&gt;&gt;&quot;bug fixes&quot; and &quot;more features&quot;.<br/>\n&gt;&gt;    <br/>\n&gt;&gt;<br/>\n&gt;The other part, of course, is that 100% code coverage still doesn&#39;t<br/>\n&gt;mean you&#39;ve tested everything... there will still be logic paths<br/>\n&gt;through the code that are not exercised, and in any large enough<br/>\n&gt;program (say, above 10000 lines), these paths rapidly approach<br/>\n&gt;infiinty.<br/>\n&gt;<br/>\n&gt;Bob Glass&#39; &quot;Facts and Fallacies&quot; has a good write-up on this.<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>  I have to completely disagree with this.<br/>\n<br/>\n  First of all we are talking about unit tests, which suppose to work <br/>\nwith isolated components. I&#39;ll leave aside discussion that you can&#39;t <br/>\nalways isolate components from the infrastructure because it is a <br/>\nseparate topic and in fact quite achievable in my opinion.<br/>\n<br/>\n  Now, for each isolated unit of code we have an unit test. When <br/>\napplication size grows complexity of unit tests would grow linearly and <br/>\nnot exponential and as a result close to 100% test coverage is not any <br/>\nmore difficult to achieve for large codebase then for a small codebase.<br/>\n<br/>\n  Last thing I want to point out is that in many cases folks talk about <br/>\ntest coverage based on the percent of covered lines. This is one of the <br/>\neasies coverage methodologies and also the one of the least <br/>\nrepresentative. There are more meaningful coverage techniques that would <br/>\ngive better representation of the tested logic paths. It also seems very <br/>\nlogical to me to assume that well designed code will not have infinite <br/>\nnumber of logical branches for any given code unit.<br/>\n  I agree that there could be some code patterns that doesn&#39;t make sense <br/>\nto test explicitly, but coverage tool can actually exclude such patterns <br/>\nfrom the analysis.<br/>\n<br/>\n  For those who curious about coverage analysis methodologies I can <br/>\nsuggest a good summary at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bullseye.com/coverage.html\">http://www.bullseye.com/coverage.html</a><br/>\n<br/>\n  regards,<br/>\n  Eugene<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 15452, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1132159106", 
    "canDelete": false, 
    "nextInTopic": 15454, 
    "prevInTopic": 15451, 
    "headers": {
        "inReplyToHeader": "PGU5MTJlOTQ2MDUxMTE2MDU0NW43OGI1ZTRlMXhAbWFpbC5nbWFpbC5jb20+", 
        "messageIdInHeader": "PDQzN0I2MDgyLjIwODA1MDlAbWQucHAucnU+", 
        "referencesHeader": "PDQzNzlFNENCLjkwMzAzMDZAcm9nZXJzLmNvbT4JIDxPRjRGMEU3NUQ5LjE0NzYzODVELU9ONjUyNTcwQkIuMDAyMERBODItNjUyNTcwQkIuMDAyMTJBQjdAdGNzLmNvbT4JIDxiODZiNmE5YzA1MTExNjA1MzRxMjI4NzE1Zjh2ZTgwN2FmMmUxMTAxOWFlMkBtYWlsLmdvb2dsZS5jb20+IDxlOTEyZTk0NjA1MTExNjA1NDVuNzhiNWU0ZTF4QG1haWwuZ21haWwuY29tPg=="
    }
}