{
    "numMessagesInTopic": 14, 
    "nextInTime": 15468, 
    "senderId": "aWNXNyNARJmcERk4N1ojB-ZwNGHQaTpiqmhopiLBgqhH9VyDrcg-MLh9yLhI1Cw1CnpQ3godKyMkruXYVoKLCFbmo_fH1bgnHebYcm2fnhHA", 
    "systemMessage": false, 
    "subject": "Clarifying how to use unit tests", 
    "from": "Rakesh Patel &lt;rakesh.mailgroups@...&gt;", 
    "authorName": "Rakesh Patel", 
    "msgSnippet": "Hi I don t have much experience with unit testing and JUnit but recently I needed to build my own authentication component for a project i was working on. I", 
    "msgId": 15467, 
    "profile": "patelr08", 
    "topicId": 15467, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 217486622, 
    "messageBody": "<div id=\"ygrps-yiv-1248408823\">Hi<br/>\n<br/>\nI don&#39;t have much experience with unit testing and JUnit but recently I <br/>\nneeded to build my own authentication component for a project i was <br/>\nworking on. I decided to try unit testing.<br/>\n<br/>\nSo, I started with an obvious class and started to build the methods i <br/>\nthought it needed and the accompanying test class with methods that <br/>\ntested the respective methods of the class under test. As the code base <br/>\ngrew I found refactoring quite a burden. Perhaps I had my intial design <br/>\nincorrect.<br/>\n<br/>\nThen i decided to try TDD. Wow! Suddenly i was writing code to satisfy <br/>\nmy tests (a client) and things seemed a lot more natural. Productivity <br/>\nincreased and i built only what i needed. I think this is how <br/>\ndevelopment should happen (I have since hit a wall with testing <br/>\nnon-POJOs that I am still grappling with).<br/>\n<br/>\nHowever, the tests that result from TDD are NOT unti tests. They are <br/>\nactually quite high-level. I found dropping out of TDD into unit testing <br/>\nquite hard and unnatural. Even though the resulting tests are important <br/>\nto have, i couldn&#39;t help feeling that by not writing the lower-level <br/>\nunit tests (against say a private method) I was not doing the right thing.<br/>\n<br/>\nDoes anyone understand what I mean? Have i misunderstood unit testing <br/>\nand TDD?<br/>\n<br/>\nThanks<br/>\n<br/>\nRakesh</div>", 
    "prevInTime": 15466, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1132515017", 
    "canDelete": false, 
    "nextInTopic": 15468, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDQzODBDRUM5LjYwMDA3MDRAZ21haWwuY29tPg=="
    }
}