{
    "numMessagesInTopic": 14, 
    "nextInTime": 15497, 
    "senderId": "Pa-PWpFge4sVcItPa5WOojWGIQUfV_FugLM8u_PK8tHvd12lUdXHdED-fCaqOkmmvg24sHU-iAvzH0PnjbUhxKjQKb1UmUSt79i0OKCf-lGN", 
    "systemMessage": false, 
    "subject": "Re: [junit] Clarifying how to use unit tests", 
    "from": "Rakesh Patel &lt;rakesh.mailgroups@...&gt;", 
    "authorName": "Rakesh Patel", 
    "msgSnippet": "Thank you both for your replies. You both completely understood my situation. Yes, I am a top-down design sorta guy. Especially as in most projects I work on", 
    "msgId": 15496, 
    "profile": "patelr08", 
    "topicId": 15467, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 217486622, 
    "messageBody": "<div id=\"ygrps-yiv-470533\">Thank you both for your replies. You both completely understood my <br/>\nsituation.<br/>\n<br/>\nYes, I am a top-down design sorta guy. Especially as in most projects I <br/>\nwork on there is very little upfront technical design (no UML, <br/>\nRequirements specs, etc). Thats why i liked TDD, I could start from the <br/>\n&#39;front-end&#39; and the design just fell out natuarlly because I was always <br/>\nthinking about the use of the code.<br/>\n<br/>\nJB calls it &quot;Story Test-Driven Development&quot;. Apart from the obvious Kent <br/>\nBeck/XP books is their any more info on this?<br/>\n<br/>\nThanks again,<br/>\n<br/>\nRakesh<br/>\n<br/>\nJ. B. Rainsberger wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;Rakesh Patel wrote:<br/>\n&gt;  <br/>\n&gt;<br/>\n&gt;&gt;Hi<br/>\n&gt;&gt;<br/>\n&gt;&gt;I don&#39;t have much experience with unit testing and JUnit but recently I<br/>\n&gt;&gt;needed to build my own authentication component for a project i was<br/>\n&gt;&gt;working on. I decided to try unit testing.<br/>\n&gt;&gt;<br/>\n&gt;&gt;So, I started with an obvious class and started to build the methods i<br/>\n&gt;&gt;thought it needed and the accompanying test class with methods that<br/>\n&gt;&gt;tested the respective methods of the class under test. As the code base<br/>\n&gt;&gt;grew I found refactoring quite a burden. Perhaps I had my intial design<br/>\n&gt;&gt;incorrect.<br/>\n&gt;&gt;<br/>\n&gt;&gt;Then i decided to try TDD. Wow! Suddenly i was writing code to satisfy<br/>\n&gt;&gt;my tests (a client) and things seemed a lot more natural. Productivity<br/>\n&gt;&gt;increased and i built only what i needed. I think this is how<br/>\n&gt;&gt;development should happen (I have since hit a wall with testing<br/>\n&gt;&gt;non-POJOs that I am still grappling with).<br/>\n&gt;&gt;<br/>\n&gt;&gt;However, the tests that result from TDD are NOT unti tests. They are<br/>\n&gt;&gt;actually quite high-level. I found dropping out of TDD into unit testing<br/>\n&gt;&gt;quite hard and unnatural. Even though the resulting tests are important<br/>\n&gt;&gt;to have, i couldn&#39;t help feeling that by not writing the lower-level<br/>\n&gt;&gt;unit tests (against say a private method) I was not doing the right thing.<br/>\n&gt;&gt;<br/>\n&gt;&gt;Does anyone understand what I mean? Have i misunderstood unit testing<br/>\n&gt;&gt;and TDD?<br/>\n&gt;&gt;    <br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;It sounds like your TDD tests were more of &quot;integration tests&quot; than of <br/>\n&gt;&quot;unit tests&quot;. I&#39;ll guess that you like to take a top-down approach to <br/>\n&gt;design. If you do, then take care to examine how many different objects <br/>\n&gt;participate in a test. If it&#39;s more than one, then you should consider <br/>\n&gt;what behavior you need from each object, then test-driving (performing <br/>\n&gt;TDD on) each object in isolation. When you think you&#39;ve built the <br/>\n&gt;behavior you need from each object, you can put them together to pass <br/>\n&gt;the original integration test you wrote.<br/>\n&gt;<br/>\n&gt;This is very close to Story Test-Driven Development, so you haven&#39;t <br/>\n&gt;misunderstood TDD, but rather have noticed that one can practise TDD at <br/>\n&gt;different levels of the design.<br/>\n&gt;  <br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 15495, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1132743858", 
    "canDelete": false, 
    "nextInTopic": 15500, 
    "prevInTopic": 15487, 
    "headers": {
        "inReplyToHeader": "PDQzODM0QjgxLjEwNjA1MDhAcm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PDQzODQ0Q0IyLjEwNDAzQGdtYWlsLmNvbT4=", 
        "referencesHeader": "PDQzODBDRUM5LjYwMDA3MDRAZ21haWwuY29tPiA8NDM4MzRCODEuMTA2MDUwOEByb2dlcnMuY29tPg=="
    }
}