{
    "numMessagesInTopic": 3, 
    "nextInTime": 15510, 
    "senderId": "PNxtvXsu5M0YnTFVAt-fkNm1NHLcTqyaQdyFHbAgmIDAmlZjbrSAxI5WyFsLUP-M8joCW-QGsh2ESen4SvMGovJIDBc-pDDsZ2x6CvY", 
    "systemMessage": true, 
    "subject": "JUnit4 extension mechanism concerns", 
    "from": "&quot;Jon Skeet&quot; &lt;jon.skeet@...&gt;", 
    "authorName": "Jon Skeet", 
    "msgSnippet": "From what I ve seen of JUnit4, the main extension mechanism is to use the RunWith annotation, and this replaces the normal use of TestClassRunner with the", 
    "msgId": 15509, 
    "profile": "jskeetuk", 
    "topicId": 15509, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 246518675, 
    "messageBody": "<div id=\"ygrps-yiv-1598458500\">From what I&#39;ve seen of JUnit4, the main extension mechanism is to use<br/>\nthe RunWith annotation, and this replaces the &quot;normal&quot; use of<br/>\nTestClassRunner with the specified runner.<br/>\n<br/>\nUnfortunately, this means that all the work done by TestClassRunner is<br/>\nthen wasted. As a very concrete example of this problem, I can see great<br/>\nbenefits in using parameterised tests (more on that in another mail) but<br/>\nI could easily want to use them in conjunction with<br/>\n@BeforeClass/@AfterClass (whether another &quot;level&quot; of setup/teardown,<br/>\ntaking place after all the tests for a particular parameter set would be<br/>\ngood or not is an open question in my mind). Additionally, I can see<br/>\nthere potentially being other extensions which I&#39;d want to use in<br/>\nconjunction with each other.<br/>\n<br/>\nI can&#39;t see a neat way round this without being prescriptive about the<br/>\nkinds of extensions which are available (at which point you could chain<br/>\ncertain types together - introspectors which found or removed possible<br/>\ntests, for example). I thought I&#39;d raise it as a concern though. (I<br/>\nadmit I&#39;m less concerned than I was before I saw that @Before, @After,<br/>\nexpected exceptions and timed tests are all handled by TestMethodRunner<br/>\nrather than TestClassRunner.)<br/>\n<br/>\nAny thoughts?<br/>\n<br/>\nJon Skeet<br/>\nSenior Software Engineer<br/>\nCLEARSWIFT<br/>\nThe MIMEsweeper Company<br/>\n<br/>\nDDI:               +44 (0) 1189  038  109<br/>\nMobile:           +44 (0) 7970 158 865<br/>\nSwitchboard:   +44 (0) 1189  038  903 <br/>\nFax:               +44 (0) 1189  039  000      <br/>\nWeb: www.clearswift.com <br/>\n<br/>\n<br/>\n<br/>\nClearswift monitors, controls and protects all its messaging traffic in compliance with its corporate email policy using Clearswift products.<br/>\nFind out more about Clearswift, its solutions and services at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.clearswift.com\">http://www.clearswift.com</a><br/>\n<br/>\nThis communication is confidential and may contain privileged information intended solely for the named addressee(s). It may not be used or disclosed except for the purpose for which it has been sent. If you are not the intended recipient, you must not copy, distribute or take any action in reliance on it. Unless expressly stated, opinions in this message are those of the individual sender and not of Clearswift. If you have received this communication in error, please notify Clearswift by emailing <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:support@...\">support@...</a> quoting the sender and delete the message and any attached documents. Clearswift accepts no liability or responsibility for any onward transmission or use of emails and attachments having left the Clearswift domain.<br/>\n<br/>\nThis footnote confirms that this email message has been swept by MIMEsweeper for Content Security threats, including computer viruses.</div>", 
    "prevInTime": 15508, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1132820404", 
    "canDelete": false, 
    "nextInTopic": 15592, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDZFQUE4QUQ4MkQ3RUJGNDc4Q0NFMjYyRkEzMkM2QzY0MDFCNTY5QjRAR0VNSU5JLkVVUk9QRS5DTEVBUlNXSUZULkNPTT4="
    }
}