{
    "numMessagesInTopic": 4, 
    "nextInTime": 15536, 
    "senderId": "qXeiQ4mxiIWGRm_xXSR67pSJV3zBnUj5clwWgKgrZ5nD7XpPkajbu6jSyuI-kM9jbnohuCRPsjUe", 
    "systemMessage": false, 
    "subject": "Re: [junit] Rant: assertEquals(String, String) -- strdiff&#39;ing is a bad idea", 
    "from": "didoss@...", 
    "authorName": "didoss@comcast.net", 
    "msgSnippet": "I prefer this type of error to the ubiquitous NPE,...at least here, I know that I can go into Eclipse, and run that test, and doubleclick on the error, to", 
    "msgId": 15535, 
    "profile": "dijdoss", 
    "topicId": 15523, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 180862158, 
    "messageBody": "<div id=\"ygrps-yiv-1336340236\">I prefer this type of error to the ubiquitous NPE,...at least here, I know that I can go into Eclipse, and run that test, and doubleclick on the error, to bring me to the line that called it and compare my strings manually - and it is usually an easy fix,...again, versus the NPE, which usually occurred n-steps earlier when something didn&#39;t get set up properly.<br/>\n<br/>\nBut, yes, I find it humorous and sometimes annoying to see that type of output in the test results from the nightlybuild.  Maybe it could made into some sort of configuration, so that you could toggle whether you want verbose comparisonFailures or succinct comparisonFailures?<br/>\n<br/>\n-------------- Original message -------------- <br/>\nIt is often the case that when something breaks, several<br/>\nlong strings are programatically passed to assertEquals(),<br/>\none of which is off by one character, sometimes a<br/>\nwhitespace character.<br/>\n<br/>\nThe code which tries to be clever and do a diff basically<br/>\nmakes the error message quite useless, because it is<br/>\nimpossible to tell which line caused the error, or where<br/>\nthe error is.<br/>\n<br/>\ne.g.<br/>\n<br/>\nString TESTIN= { ...<br/>\n&quot;Junit can get too clever for its own good&quot;<br/>\n...};<br/>\n<br/>\nString TESTOUT= { ...<br/>\n&quot;Junit can get too  clever for its own good&quot;<br/>\n...};<br/>\n<br/>\n<br/>\n[...]<br/>\nfor (int i=0; i&lt;TESTIN.length; i++) {<br/>\n  assertEquals(TESTIN[i], TESTOUT[i]);<br/>\n}<br/>\n<br/>\n=&gt;  junit.framework.ComparisonFailure: expected:&lt;... ...&gt; but was:&lt;......&gt;<br/>\n<br/>\nThere&#39;s no way to see what really happened now.<br/>\nIf the simple approach of just printing out the<br/>\nentire message was retained, it makes it more<br/>\nusable.<br/>\n<br/>\nYes, I could always append the actual and expected<br/>\nstrings to the message and do it that way -- but<br/>\nthat&#39;s just a pointlessly unpleasant way to do it :)<br/>\n<br/>\n-kb<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nSPONSORED LINKS Basic programming language C programming language Computer programming languages <br/>\nThe c programming language C programming language List of programming languages <br/>\n<br/>\n<br/>\n<br/>\nYAHOO! GROUPS LINKS <br/>\n<br/>\n Visit your group &quot;junit&quot; on the web.<br/>\n  <br/>\n To unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n  <br/>\n Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 15534, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1133195748", 
    "canDelete": false, 
    "nextInTopic": 15553, 
    "prevInTopic": 15529, 
    "headers": {
        "messageIdInHeader": "PDExMjgyMDA1MTYzNS4yODg4OC40MzhCMzFFMzAwMDZGQjlBMDAwMDcwRDgyMjA3MzAwMDMzOUM5QzAxMEIwNzBCQGNvbWNhc3QubmV0Pg=="
    }
}