{
    "numMessagesInTopic": 16, 
    "nextInTime": 15540, 
    "senderId": "Q361QPkiYAHmu1_5wKOc40VHtDZwkwetysTMdYdP_4UOEWITaoc9Y6CSb8_g63XAgqjWed7kxN0l", 
    "systemMessage": false, 
    "subject": "Re: [junit] Finding all the tests for a class?", 
    "from": "didoss@...", 
    "authorName": "didoss@comcast.net", 
    "msgSnippet": "My problem is usually along the lines of: I make changes to classA, which is used in classB, which is used in classC, which is tested by testC.  So, I have", 
    "msgId": 15539, 
    "rawEmail": "Return-Path: &lt;didoss@...&gt;\r\nX-Sender: didoss@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 35216 invoked from network); 28 Nov 2005 18:19:03 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m29.grp.scd.yahoo.com with QMQP; 28 Nov 2005 18:19:03 -0000\r\nReceived: from unknown (HELO rwcrmhc12.comcast.net) (216.148.227.154)\n  by mta1.grp.scd.yahoo.com with SMTP; 28 Nov 2005 18:19:03 -0000\r\nReceived: from rmailcenter03.comcast.net ([204.127.197.113])\n          by comcast.net (rwcrmhc14) with SMTP\n          id &lt;2005112817182701400228i9e&gt;; Mon, 28 Nov 2005 17:18:27 +0000\r\nReceived: from [139.177.224.128] by rmailcenter03.comcast.net;\n\tMon, 28 Nov 2005 17:18:27 +0000\r\nTo: junit@yahoogroups.com\r\nDate: Mon, 28 Nov 2005 17:18:27 +0000\r\nMessage-Id: &lt;112820051718.22802.438B3BE2000B90390000591222007456729C9C010B070B@...&gt;\r\nX-Mailer: AT&T Message Center Version 1 (Dec 17 2004)\r\nX-Authenticated-Sender: ZGlkb3NzQGNvbWNhc3QubmV0\r\nMIME-Version: 1.0\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: didoss@...\r\nSubject: Re: [junit] Finding all the tests for a class?\r\nX-Yahoo-Group-Post: member; u=180862158; y=xMrwvrvjuQ20u9ECgWydv3Cp4J6Xi5Uh8k1C_i2MAu9rLA\r\nX-Yahoo-Profile: dijdoss\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\n\r\nMy problem is usually along the lines of: I make changes to classA, which is used in classB, which is used in classC, which is tested by testC.  So, I have modified testA, which directly tests classA, but don&#39;t realize that I have broken something in testC.  My solution is that we run nightlybuilds, and I check the errors/failures the next morning to see if my code changes could have caused any of them.\n\nIt would be nice to be a little more proactive, though,...being able to (easily) find all the tests that are ultimately affected by my code change (iterating through the workspace references until I terminate at all classes that start with &quot;Test&quot;, or that are in my test branch).  I know that I can do this manually through Eclipse, but it is not fun - and therefore doesn&#39;t get done.\n\n-------------- Original message -------------- \nEveryone:\n\nI&#39;ve heard for years people talking about the importance of being able \nto find all the tests for a given class. I have never cared about this, \nso I&#39;m surprised when so many other people do care about it. Either \nthey&#39;re missing something simple, or I&#39;m missing something simple.\n\nLet&#39;s say I want to know which tests cover a given production code \nmethod. To do that, I go to the method, then hit Shift+Ctrl+G in \nEclipse, searching the workspace for references to that method. It&#39;s \nusually pretty easy to scan the list of search results and separate the \ntest case classes (which have the word &quot;Test&quot; in them) from the \nproduction code classes (which don&#39;t have the word &quot;Test&quot; in them). This \ntechnique has never posed a serious enough problem for me to want to do \nit a different way.\n\nI have used the same technique with IntelliJ IDEA, so it&#39;s not just an \nEclipse thing.\n\nI can also do the same thing if I want to see which tests use the \n/class/, but I can&#39;t remember the last time I wanted to know that. I \ntypically want to know which tests are using a /method/, not a class.\n\nSo would anyone like to tell us a story of when they needed to search \nfor the tests that cover a given production code class, and how \norganizing their tests their way made that easy? I&#39;d like to learn what \nthe big issues are.\n\nThanks.\n-- \nJ. B. (Joe) Rainsberger :: http://www.jbrains.info\nYour guide to software craftsmanship\nJUnit Recipes: Practical Methods for Programmer Testing\n2005 Gordon Pask Award for contribution Agile Software Practice\n\n\n\nSPONSORED LINKS Basic programming language C programming language Computer programming languages \nThe c programming language C programming language List of programming languages \n\n\n\nYAHOO! GROUPS LINKS \n\n Visit your group &quot;junit&quot; on the web.\n  \n To unsubscribe from this group, send an email to:\n junit-unsubscribe@yahoogroups.com\n  \n Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. \n\n[Non-text portions of this message have been removed]\n\n\n", 
    "profile": "dijdoss", 
    "topicId": 15527, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 180862158, 
    "prevInTime": 15538, 
    "contentTrasformed": false, 
    "postDate": "1133198307", 
    "canDelete": false, 
    "nextInTopic": 15543, 
    "prevInTopic": 15527, 
    "headers": {
        "messageIdInHeader": "PDExMjgyMDA1MTcxOC4yMjgwMi40MzhCM0JFMjAwMEI5MDM5MDAwMDU5MTIyMjAwNzQ1NjcyOUM5QzAxMEIwNzBCQGNvbWNhc3QubmV0Pg=="
    }
}