{
    "numMessagesInTopic": 9, 
    "nextInTime": 15596, 
    "senderId": "0KxiXc_wqaFhTemOVwtucybWAz0fSQIyT3ubI0XcEw3u9-Nzg3kSXKFWpwWCqJeovjJv-hPyOICa1-npErykwmqbJobmpwEheA6R6tw", 
    "systemMessage": false, 
    "subject": "RE: [junit] Parameterisation of tests in JUnit4", 
    "from": "&quot;Jon Skeet&quot; &lt;jon.skeet@...&gt;", 
    "authorName": "Jon Skeet", 
    "msgSnippet": "... Righto. I ll refetch the vanilla version from CVS and start off with a new annotation. From what I remember from my previous look (I confess the whole", 
    "msgId": 15595, 
    "profile": "jskeetuk", 
    "topicId": 15506, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 246518675, 
    "messageBody": "<div id=\"ygrps-yiv-869245625\">Kent wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; We intend only to provide basic parameterized test cases in <br/>\n&gt; our distribution. However, @RunWith provides a nice place to <br/>\n&gt; plug in a more flexible style of parameterized tests. If this <br/>\n&gt; would benefit you, it seems reasonable for you to write it <br/>\n&gt; and later see if it generally useful. <br/>\n<br/>\n </span></blockquote>Righto. I&#39;ll refetch the &quot;vanilla&quot; version from CVS and start off with a<br/>\nnew annotation.<br/>\n<br/>\nFrom what I remember from my previous look (I confess the whole thing&#39;s<br/>\ngetting slightly confusing at the moment as I&#39;m also looking at the<br/>\nTestNG source code, and how hard it would be to implement the same<br/>\nfunctionality there), there are a few members which are currently<br/>\nprivate but which would make life a lot easier if they were protected:<br/>\n<br/>\nTestMethodRunner.addFailure<br/>\nTestMethodRunner.fTest<br/>\nTestMethodRunner.fNotifier<br/>\n<br/>\nI&#39;m sure there was another one somewhere, but I can&#39;t find it at the<br/>\nmoment.<br/>\n<br/>\nI&#39;ll write my extension assuming these have been made protected, then<br/>\nsubmit patches to the CVS tree to see whether that would be acceptable.<br/>\n<br/>\nJon<br/>\n<br/>\n<br/>\nClearswift monitors, controls and protects all its messaging traffic in compliance with its corporate email policy using Clearswift products.<br/>\nFind out more about Clearswift, its solutions and services at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.clearswift.com\">http://www.clearswift.com</a><br/>\n<br/>\nThis communication is confidential and may contain privileged information intended solely for the named addressee(s). It may not be used or disclosed except for the purpose for which it has been sent. If you are not the intended recipient, you must not copy, distribute or take any action in reliance on it. Unless expressly stated, opinions in this message are those of the individual sender and not of Clearswift. If you have received this communication in error, please notify Clearswift by emailing <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:support@...\">support@...</a> quoting the sender and delete the message and any attached documents. Clearswift accepts no liability or responsibility for any onward transmission or use of emails and attachments having left the Clearswift domain.<br/>\n<br/>\nThis footnote confirms that this email message has been swept by MIMEsweeper for Content Security threats, including computer viruses.</div>", 
    "prevInTime": 15594, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1133340258", 
    "canDelete": false, 
    "nextInTopic": 15597, 
    "prevInTopic": 15591, 
    "headers": {
        "messageIdInHeader": "PDZFQUE4QUQ4MkQ3RUJGNDc4Q0NFMjYyRkEzMkM2QzY0MDFCNTZBQTZAR0VNSU5JLkVVUk9QRS5DTEVBUlNXSUZULkNPTT4="
    }
}