{
    "numMessagesInTopic": 9, 
    "nextInTime": 15600, 
    "senderId": "GtXwrCZcOhA_bvsy4OhAe-83y59V0gHAhZ9X9L-UKquf9N_UvMBmsx9FMgLUWHSYGnMYahqcpnEwix5w9HnpgTq6i6XzZHrRSd3Y53I", 
    "systemMessage": false, 
    "subject": "RE: [junit] Parameterisation of tests in JUnit4", 
    "from": "&quot;Jon Skeet&quot; &lt;jon.skeet@...&gt;", 
    "authorName": "Jon Skeet", 
    "msgSnippet": "... Fair enough. (It shouldn t actually end up being too complicated, to be honest.) I just hope it s easy to apply those extensions when running in Eclipse. ", 
    "msgId": 15599, 
    "profile": "jskeetuk", 
    "topicId": 15506, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 246518675, 
    "messageBody": "<div id=\"ygrps-yiv-1658518247\">David Saff wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Jon Skeet wrote:<br/>\n&gt; &gt; I&#39;ve had a look at the Parameterized runner in JUnit4 (current CVS) <br/>\n&gt; &gt; and I have a few suggestions.<br/>\n&gt; <br/>\n&gt; Thanks a lot for the suggestions.  I worked with Kent and <br/>\n&gt; Erich on the parameterized support, so here&#39;s my utterly <br/>\n&gt; non-binding thoughts:<br/>\n&gt; <br/>\n&gt; In general, I&#39;m a fan of the Kent and Erich&#39;s plan to keep <br/>\n&gt; JUnit 4.0 as simple as possible, while still allowing <br/>\n&gt; impressive amounts of extension.  To that end, it would be <br/>\n&gt; great to have a third party work on a souped-up parameterized <br/>\n&gt; test runner with features like you mention here.<br/>\n<br/>\n </span></blockquote>Fair enough. (It shouldn&#39;t actually end up being too complicated, to be<br/>\nhonest.)<br/>\n<br/>\nI just hope it&#39;s easy to apply those extensions when running in Eclipse.<br/>\n(I don&#39;t imagine it would be hard, but it&#39;s worth bearing in mind.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I wrote a separate runner a while back that parameterizes <br/>\n&gt; tests by method, but felt ambivalent about it--it was very <br/>\n&gt; different from how parameterized tests had been done in JUnit <br/>\n&gt; 3, and I hadn&#39;t really wanted it yet in my own development, <br/>\n&gt; so I wasn&#39;t sure I&#39;d gotten it &quot;right&quot;, and I didn&#39;t submit <br/>\n&gt; it to Kent.  However, you&#39;re not the first to request it.  In <br/>\n&gt; any case, do you really want to have parameters on both the <br/>\n&gt; class and the methods?  That seems really complex.<br/>\n<br/>\n </span></blockquote>I know what you mean - but I think I do. Sometimes I want to provide a<br/>\nlist of things for one test method to run through (and still getting all<br/>\nthe results when it fails on the first of them). Other times I want to<br/>\nrun all the tests on both SQL Server and Oracle (and HSQL, often).<br/>\n<br/>\nWhat I&#39;m not sure of is how often I need both at the same time. Taking<br/>\nbaby steps, it would probably be best to first work on an extension<br/>\nwhich *only* parameterised test methods, using the existing extension<br/>\nwhen I want to parameterise by test instances.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;         // In actual code, these would probably be enums, in my <br/>\n&gt; &gt; experience -<br/>\n&gt; &gt;         // they would provide mechanisms for connecting to the <br/>\n&gt; &gt; appropriate database,<br/>\n&gt; &gt;         // setting it up and tearing it down etc.<br/>\n&gt; &gt;         public static String[] classParameters = {&quot;Oracle&quot;, &quot;SQL&quot;};<br/>\n&gt; <br/>\n&gt; Using an enum to contain the parameters is a cool idea.  <br/>\n<br/>\n </span></blockquote>In this particular case, the enum already exists - because it provides a<br/>\nload of helper support. I probably wouldn&#39;t bother for enums which would<br/>\njust be names, effectively.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Would it be much easier than @Parameters public static <br/>\n&gt; List&lt;DbType&gt; parameters() { return<br/>\n&gt; DbType.values() }?<br/>\n<br/>\n </span></blockquote>In fact, I don&#39;t think the enums would be available &quot;inline&quot;. However,<br/>\nI&#39;d to be able to specify it as a field:<br/>\n<br/>\npublic static final databaseTypes = DbType.values();<br/>\n<br/>\n@Parameters (field=&quot;databaseTypes&quot;)<br/>\n@Test<br/>\n...<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;         @Test<br/>\n&gt; &gt;         @Parameters(strings={&quot;hello&quot;, &quot;there&quot;})<br/>\n&gt; &gt;         public void test3(String input)<br/>\n&gt; &gt;         {<br/>\n&gt; &gt;             assertEquals(input, input.toLowerCase());<br/>\n&gt; &gt;         }<br/>\n&gt; <br/>\n&gt; I like that a lot.<br/>\n<br/>\n </span></blockquote>Me too :)<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; 2) Unless multiple parameters are required, a single array (rather <br/>\n&gt; &gt; than an array of arrays) causes less confusion. I know that the <br/>\n&gt; &gt; counter-argument to that is that having two forms, one for <br/>\n&gt; &gt; single-parameter tests/constructors and one for multi-parameter <br/>\n&gt; &gt; tests/constructors is ugly, but I personally believe that it&#39;s <br/>\n&gt; &gt; justified in this case.<br/>\n&gt; <br/>\n&gt; I like your case here.<br/>\n&gt; <br/>\n&gt; For the rest of your features, I think they&#39;re cool.  I&#39;d <br/>\n&gt; like to see a runner that did them, and play with it a while.<br/>\n<br/>\n </span></blockquote>I&#39;ll see what I can do for you :)<br/>\n<br/>\n(The hard bit for me is developing it test-first. I can see how an<br/>\nimplementation could easily work, but I *am* going to do this properly.<br/>\nUnfortunately I can see potentially tens of &quot;fake&quot; test classes - either<br/>\nthat or one test which just logs everything and either works completely<br/>\nor doesn&#39;t!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; 5) One nasty problem: you need to construct instances of the test <br/>\n&gt; &gt; class just to count the test cases - and hope that the <br/>\n&gt; parameters you <br/>\n&gt; &gt; get back then is the same as the ones you get when you&#39;re <br/>\n&gt; ready to run the tests.<br/>\n&gt; &gt; (You could cache the results, of course...)<br/>\n&gt; <br/>\n&gt; That&#39;s a rough problem.  In general, I think that runners <br/>\n&gt; should avoid constructing instances in order to count test <br/>\n&gt; cases.  Do you think it&#39;s worth it?<br/>\n<br/>\n </span></blockquote>Fortunately if I avoid parameterising instances at the same time as<br/>\nmethods, I can avoid this. The only problem will be running the method<br/>\ntwice, but that can&#39;t be too hard.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Anyway, the bottom line is that I can see *huge* benefits in this <br/>\n&gt; &gt; approach in quite a few of our existing test code. Does anyone have <br/>\n&gt; &gt; any major objections to the above, or shall I give it a whirl?<br/>\n&gt; <br/>\n&gt; Absolutely give it a whirl.<br/>\n<br/>\n </span></blockquote>Okay. Will report back when I&#39;ve got something working.<br/>\n<br/>\nJon<br/>\n<br/>\n<br/>\nClearswift monitors, controls and protects all its messaging traffic in compliance with its corporate email policy using Clearswift products.<br/>\nFind out more about Clearswift, its solutions and services at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.clearswift.com\">http://www.clearswift.com</a><br/>\n<br/>\nThis communication is confidential and may contain privileged information intended solely for the named addressee(s). It may not be used or disclosed except for the purpose for which it has been sent. If you are not the intended recipient, you must not copy, distribute or take any action in reliance on it. Unless expressly stated, opinions in this message are those of the individual sender and not of Clearswift. If you have received this communication in error, please notify Clearswift by emailing <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:support@...\">support@...</a> quoting the sender and delete the message and any attached documents. Clearswift accepts no liability or responsibility for any onward transmission or use of emails and attachments having left the Clearswift domain.<br/>\n<br/>\nThis footnote confirms that this email message has been swept by MIMEsweeper for Content Security threats, including computer viruses.</div>", 
    "prevInTime": 15598, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1133341310", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 15598, 
    "headers": {
        "messageIdInHeader": "PDZFQUE4QUQ4MkQ3RUJGNDc4Q0NFMjYyRkEzMkM2QzY0MDFCNTZBQUFAR0VNSU5JLkVVUk9QRS5DTEVBUlNXSUZULkNPTT4="
    }
}