{
    "numMessagesInTopic": 1, 
    "nextInTime": 15608, 
    "senderId": "tN3nzoHql7nssVXA4134jvsM4j77zbQuTGzkOc4Dd6rKH2OXtPlRNbdIb1MfasSnAMMzXCs1Bmsix70Vpkldnt-KbQsni62pMVap0Pw", 
    "systemMessage": false, 
    "subject": "JUnit4: Why can&#39;t TextListener take a PrintWriter?", 
    "from": "&quot;Jon Skeet&quot; &lt;jon.skeet@...&gt;", 
    "authorName": "Jon Skeet", 
    "msgSnippet": "I ve just been writing some tests for my parameterisation classes, and I m trying to verify that the right things are being logged. For a quick and dirty", 
    "msgId": 15607, 
    "profile": "jskeetuk", 
    "topicId": 15607, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 246518675, 
    "messageBody": "<div id=\"ygrps-yiv-1425132995\">I&#39;ve just been writing some tests for my parameterisation classes, and<br/>\nI&#39;m trying to verify that the right things are being logged. For a quick<br/>\nand dirty start, I thought I&#39;d use TextListener, creating a StringWriter<br/>\nto get the results into. Unfortunately, TextListener only takes a<br/>\nPrintStream - it can&#39;t take a PrintWriter.<br/>\n<br/>\nIs there any reason for this? I&#39;d personally prefer the constructors to<br/>\nbe:<br/>\n<br/>\npublic TextListener() {<br/>\n    this(System.out);<br/>\n}<br/>\n<br/>\npublic TextListener(Writer writer) {<br/>\n    this.fWriter = new PrintWriter(writer);<br/>\n}<br/>\n<br/>\npublic TextListener(OutputStream stream) {<br/>\n    this.fWriter = new PrintWriter (stream);<br/>\n}<br/>\n<br/>\n(where fWriter becomes a PrintWriter instead of a PrintStream).<br/>\n<br/>\nThe listener is conceptually only dealing with text, so in my view a<br/>\nwriter is more appropriate than a stream anyway.<br/>\n <br/>\n(As it happens, I think I&#39;ll rewrite the tests to use EasyMock, but the<br/>\nabove is still worthwhile, IMO.)<br/>\n<br/>\nJon Skeet<br/>\nSenior Software Engineer<br/>\nCLEARSWIFT<br/>\nThe MIMEsweeper Company<br/>\n<br/>\nDDI:               +44 (0) 1189  038  109<br/>\nMobile:           +44 (0) 7970 158 865<br/>\nSwitchboard:   +44 (0) 1189  038  903 <br/>\nFax:               +44 (0) 1189  039  000      <br/>\nWeb: www.clearswift.com <br/>\n<br/>\n<br/>\nClearswift monitors, controls and protects all its messaging traffic in compliance with its corporate email policy using Clearswift products.<br/>\nFind out more about Clearswift, its solutions and services at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.clearswift.com\">http://www.clearswift.com</a><br/>\n<br/>\nThis communication is confidential and may contain privileged information intended solely for the named addressee(s). It may not be used or disclosed except for the purpose for which it has been sent. If you are not the intended recipient, you must not copy, distribute or take any action in reliance on it. Unless expressly stated, opinions in this message are those of the individual sender and not of Clearswift. If you have received this communication in error, please notify Clearswift by emailing <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:support@...\">support@...</a> quoting the sender and delete the message and any attached documents. Clearswift accepts no liability or responsibility for any onward transmission or use of emails and attachments having left the Clearswift domain.<br/>\n<br/>\nThis footnote confirms that this email message has been swept by MIMEsweeper for Content Security threats, including computer viruses.</div>", 
    "prevInTime": 15606, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1133446971", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDZFQUE4QUQ4MkQ3RUJGNDc4Q0NFMjYyRkEzMkM2QzY0MDFCNTZBRjlAR0VNSU5JLkVVUk9QRS5DTEVBUlNXSUZULkNPTT4="
    }
}