{
    "numMessagesInTopic": 14, 
    "nextInTime": 15648, 
    "senderId": "UHoqX70f_cAoq4OT9NDybVH3BqJtKM2f9IfCp3x7iDV-3HzqXuc9_51Lns-b_-Kn6Sp4ITxhGGnT7Gmssi8RuAWdTUAKxDj3DDDhGXFON-xh", 
    "systemMessage": false, 
    "subject": "Re: [junit] Clarifying how to use unit tests", 
    "from": "Rakesh Patel &lt;rakesh.mailgroups@...&gt;", 
    "authorName": "Rakesh Patel", 
    "msgSnippet": "Hi, have a bit of an update on my new TDD experiment. Apparently it is good practice to use interfaces and provide pluggable implementations as needed. I have", 
    "msgId": 15647, 
    "profile": "patelr08", 
    "topicId": 15467, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 217486622, 
    "messageBody": "<div id=\"ygrps-yiv-1232908298\">Hi,<br/>\n<br/>\nhave a bit of an update on my new TDD experiment.<br/>\n<br/>\nApparently it is good practice to use interfaces and provide pluggable <br/>\nimplementations as needed. I have heard this is good for testing.<br/>\n<br/>\nSo let me explain what I am trying to do. I am building my first web <br/>\nservices application but sticking with POJOs in the service layer <br/>\ninitially. I want to create a web service for a postcode lookup servlet <br/>\nwe already have. This servlet produces XML output but the code to <br/>\nconnect and send in paramters is all done manually (the author did not <br/>\nknow about web services at the time).<br/>\n<br/>\nSo here&#39;s my initial design.<br/>\n<br/>\npublic interface PostcodeService {<br/>\n    public String getAddressAsXML(String postcode);<br/>\n}<br/>\n<br/>\nnow, should I write a test class against the <br/>\ninterface(PostcodeServiceTest) or against the implementation <br/>\nclass(PostcodeServiceImplTest)?<br/>\n<br/>\nNow calling the underlying postcode servlet actually costs money so I <br/>\nknow I will need to produce a mock version of it also. So do I create a <br/>\ntest class for this also(PostcodeServiceMockImpl)?<br/>\n<br/>\nThats 3 potential test classes and also they will probably be very <br/>\nsimilar. Is that right? I can also see when I come to code DAOs i will <br/>\nbe in a similar situation since I will probably want to mock db access <br/>\n(perhaps the mock will return hard coded values).<br/>\n<br/>\nI am spending way too long thinking about this rather than writing code <br/>\nwhich has me a bit worried.<br/>\n<br/>\nAny input appreciated<br/>\n<br/>\nRP<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:saff@...\">saff@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;Quoting Rakesh Patel &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rakesh.mailgroups@...\">rakesh.mailgroups@...</a>&gt;:<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n&gt;&gt;However, the tests that result from TDD are NOT unti tests. They are <br/>\n&gt;&gt;actually quite high-level. I found dropping out of TDD into unit testing <br/>\n&gt;&gt;quite hard and unnatural. Even though the resulting tests are important <br/>\n&gt;&gt;to have, i couldn&#39;t help feeling that by not writing the lower-level <br/>\n&gt;&gt;unit tests (against say a private method) I was not doing the right thing.<br/>\n&gt;&gt;    <br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;Rakesh,<br/>\n&gt;<br/>\n&gt;It&#39;s really cool that you&#39;ve tried TDD and found it exciting.  I hope that you<br/>\n&gt;can quickly figure out something that feels like the right thing.<br/>\n&gt;<br/>\n&gt;Just to clarify, it sounds like you write a test for some functionality that<br/>\n&gt;feels high-level, and then find it fairly easy to quickly write the code that<br/>\n&gt;makes it pass, but at the end, find yourself with methods that appear to be<br/>\n&gt;tested only through tests exercising methods somewhere higher up the call<br/>\n&gt;chain, and you feel that it would be important to have tests against those<br/>\n&gt;lower-level methods.<br/>\n&gt;<br/>\n&gt;There are several situations that can drive me to have two &quot;levels&quot; of tests. <br/>\n&gt;However, I don&#39;t hit these situations on all projects:<br/>\n&gt;<br/>\n&gt;1) Running all the high-level tests takes longer than my attention span<br/>\n&gt;(somewhere around 30 seconds on good days, for me).<br/>\n&gt;2) It takes a long time to get each high-level test passing (I definitely get<br/>\n&gt;jumpy after an hour.)<br/>\n&gt;3) I can easily think of bugs in the lower-level methods that would not be<br/>\n&gt;caught by the higher-level tests.<br/>\n&gt;<br/>\n&gt;Notice that I might run into situation 1 after I had been working on a program<br/>\n&gt;for a while.  However, I try to catch situations 2 and 3 as soon as<br/>\n&gt;possible--they indicate that I need to adjust the &quot;pacing&quot; of my test-driven<br/>\n&gt;development toward more smaller tests.<br/>\n&gt;<br/>\n&gt;When I have two levels of tests, it is often the case that I actually have two<br/>\n&gt;failing tests at a time: one high-level failure, and one related low-level<br/>\n&gt;failure.<br/>\n&gt;<br/>\n&gt;I hope that helps.<br/>\n&gt;<br/>\n&gt;    David Saff<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 15646, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1134052036", 
    "canDelete": false, 
    "nextInTopic": 15651, 
    "prevInTopic": 15520, 
    "headers": {
        "inReplyToHeader": "PDExMzI1ODMxOTMuNDM4MWQ5MTljZWYxMEBpbWFwLmNzYWlsLm1pdC5lZHU+", 
        "messageIdInHeader": "PDQzOTg0MkM0LjgwOTA3MDBAZ21haWwuY29tPg==", 
        "referencesHeader": "PDQzODBDRUM5LjYwMDA3MDRAZ21haWwuY29tPiA8MTEzMjU4MzE5My40MzgxZDkxOWNlZjEwQGltYXAuY3NhaWwubWl0LmVkdT4="
    }
}