{
    "numMessagesInTopic": 12, 
    "nextInTime": 15681, 
    "senderId": "BIW-FE-LMtAXe23uVPNN9T2X1FQYduFqlpA5P-WyLojoZOE01jgHMunFuyXyutuBV_IrZbfS5XyssfPRr3_J3BobECccJyd-4bH2GLc", 
    "systemMessage": false, 
    "subject": "Re: overriding a method executed in the constructor: dont&#39;t work.", 
    "from": "&quot;Jon Skeet&quot; &lt;jon.skeet@...&gt;", 
    "authorName": "Jon Skeet", 
    "msgSnippet": "...  ... Doh! Isn t it always the way? I worked it out (I think) about 3 minutes after posting the above (when I d just got into the car). The problems", 
    "msgId": 15680, 
    "profile": "jskeetuk", 
    "topicId": 15674, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 246518675, 
    "messageBody": "<div id=\"ygrps-yiv-568891114\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;Jon Skeet&quot; &lt;jon.skeet@c...&gt; wrote:<br/>\n<br/>\n&lt;snip&gt;<br/>\n<br/>\n&gt; So yes, it&#39;s generally not a good idea, but very occasionally it can<br/>\n&gt; be the simplest way of working, and it should certainly work in the<br/>\n&gt; OP&#39;s case - and does for me... I&#39;d be interested to try to work out<br/>\n&gt; exactly why it doesn&#39;t on the OP&#39;s box.<br/>\n<br/>\nDoh! Isn&#39;t it always the way? I worked it out (I think) about 3<br/>\nminutes after posting the above (when I&#39;d just got into the car).<br/>\n<br/>\nThe problems with calling overridden methods in a constructor are<br/>\nparticularly nasty when it comes to inner classes - and *very* nasty<br/>\nfor anonymous inner classes which use variables in the declaring method.<br/>\n<br/>\nThere was a change to the Java compiler (and the byte code spec, if I<br/>\nremember correctly) to allow certain fields to be initialised *before*<br/>\nthe call to the superconstructor - fields such as those effectively<br/>\ntaken from the declaring method for anonymous inner classes, and the<br/>\nhidden field containing the reference to the &quot;parent&quot; instance for all<br/>\ninner classes.<br/>\n<br/>\nNow, I can&#39;t find where the change is documented unfortunately - I<br/>\nthought it was a feature in 1.4, but I can&#39;t see it in the release<br/>\nnotes. Anyway, I suspect that we&#39;ll find the OP was using an older<br/>\nversion of javac than I am, hence the difference.<br/>\n<br/>\nIn the light of this, I would after all agree with the idea that using<br/>\nan overridden method in a constructor puts you in no man&#39;s land, at<br/>\nleast in the case where you&#39;re using an inner class.<br/>\n<br/>\nJon </span></blockquote></div>", 
    "prevInTime": 15679, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1134374507", 
    "canDelete": false, 
    "nextInTopic": 15682, 
    "prevInTopic": 15679, 
    "headers": {
        "inReplyToHeader": "PGRuajhrYis3NDg0QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGRuamFwYitlOHBkQGVHcm91cHMuY29tPg=="
    }
}