{
    "numMessagesInTopic": 64, 
    "nextInTime": 15771, 
    "senderId": "DBtaZT5_ZtIcYyoxRWsNtVp5r76TERjp0PljHeaNQcG3ukm5C0QpCMqfRePjOzQYVRtbABkudZI39D34GXp9Iw", 
    "systemMessage": false, 
    "subject": "JUnit 4.0 release candidate 2", 
    "from": "David Saff &lt;saff@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "All, The first and most important point is this: early adopters, 99% of your JUnit 4 test cases still work, and now work better than before! Back in October,", 
    "msgId": 15770, 
    "profile": "dsaff", 
    "topicId": 15770, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 139771899, 
    "messageBody": "<div id=\"ygrps-yiv-339012291\">All,<br/>\n<br/>\nThe first and most important point is this: early adopters, 99% of your <br/>\nJUnit 4 test cases still work, and now work better than before!<br/>\n<br/>\nBack in October, Kent said &quot;The remaining functionality we need to add <br/>\nis a way to specify test suites that is represented in source code and <br/>\nworks with automated refactoring tools. Once that is in place we will <br/>\njavadoc everything, package it, and deploy.&quot;  We thought about it, and <br/>\nrealized that what this really meant was<br/>\n<br/>\n1) JUnit&#39;s extension mechanism should be so powerful that test suites <br/>\ncan be just another extension. <br/>\n2) Extensions should work seamlessly with IDE test runners, meaning<br/>\n    a) Since IDE&#39;s and UI&#39;s like to display the names of tests before <br/>\nthey&#39;re run, and match up successes and failures with these names, there <br/>\nmust be a standard way to display the components of an extended test suite.<br/>\n    b) There should be a standard way to run just a single method from a <br/>\ntest class, with extension-defined setup and teardown behavior<br/>\n    c) JUnit 4 should respond gracefully to user cancellation requests <br/>\nthat come in the middle of a run<br/>\n3) Extensions should work seamlessly with JUnit 3 test runners<br/>\n4) There should be a simple API for running test classes, sets of test <br/>\nclasses, single test methods, and any other test specification.<br/>\n<br/>\nTo support these goals, we needed the following concepts:<br/>\n<br/>\n- Runner.  An extension to JUnit will likely define a custom subclass of <br/>\nRunner.<br/>\n- Plan.  Each Runner must report a Plan, a hierarchical tree of the <br/>\nnames of the tests it will run.  Test events are reported with respect <br/>\nto leaves in this tree.<br/>\n- Request.  A Request is a specification of the desired tests to be <br/>\nrun.  Extensions may also define custom subclasses of Request, in order <br/>\nto, for example, read tests to be run out of an XML file--if you think <br/>\nthat&#39;s a good idea. :-)<br/>\n<br/>\nThere is an important distinction between Requests and Plans.  A Request <br/>\nmight be &quot;Please run all tests in class ValidationTest&quot;, with the <br/>\ncorresponding Plan being &quot;I will run methods foo, bar, baz, and foobar <br/>\nin class ValidationTest&quot;.<br/>\n<br/>\nAgain, nothing has changed about the basic annotation-based test <br/>\ndefinition API, so your existing test cases still work.  A revised <br/>\noverview of the packages and classes as they stand now, and how to run a <br/>\nJUnit 4 test using a JUnit 3 runner, is at<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://people.csail.mit.edu/saff/junit4.0rc2api.txt\">http://people.csail.mit.edu/saff/junit4.0rc2api.txt</a><br/>\n<br/>\nWe believe that this robust extensibility, explicit IDE support, <br/>\nbackward compatibility, and simple API are worth the extra time you&#39;ve <br/>\nwaited.  We&#39;re very interested in feedback.  To try things out, you can <br/>\ndownload the code from CVS, or, for a limited time only, download a <br/>\nlist-members-only distribution from<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://people.csail.mit.edu/saff/junit4.0rc2.zip\">http://people.csail.mit.edu/saff/junit4.0rc2.zip</a><br/>\n<br/>\nWe&#39;re especially interested in:<br/>\n1) Results of running JUnit 4 tests with various JUnit 3 runners.<br/>\n2) Experiences using JUnit 4 to write tests.<br/>\n3) New Runners and Requests.<br/>\n<br/>\nRemember that this is not the final release--the implementation and API <br/>\nmay still change as we respond to your comments and shake loose the <br/>\nremaining issues.  Thanks,<br/>\n<br/>\n    David Saff</div>", 
    "prevInTime": 15769, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1137599055", 
    "canDelete": false, 
    "nextInTopic": 15779, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDQzQ0U2MjRGLjEwMDAwMDBAbWl0LmVkdT4="
    }
}