{
    "numMessagesInTopic": 64, 
    "nextInTime": 15784, 
    "senderId": "kAiiZd9VbR-Pefa_--qXMZdw2LOtzw88Mf3iH1SCH7D-EG9SfUn-XK2QDJ8MQlH4C22hf3VJr14WIOABx6SMqvTL8HcyzVVI5dHfn1E", 
    "systemMessage": false, 
    "subject": "RE: [junit] JUnit 4.0 release candidate 2", 
    "from": "&quot;Jon Skeet&quot; &lt;jon.skeet@...&gt;", 
    "authorName": "Jon Skeet", 
    "msgSnippet": " ... This sounds very useful. It s a real pain that I don t have much time to look at properly it at the moment, though I ll do what I can. In", 
    "msgId": 15783, 
    "profile": "jskeetuk", 
    "topicId": 15770, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 246518675, 
    "messageBody": "<div id=\"ygrps-yiv-1557580635\">&lt;snip&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; To support these goals, we needed the following concepts:<br/>\n&gt; <br/>\n&gt; - Runner.  An extension to JUnit will likely define a custom <br/>\n&gt; subclass of Runner.<br/>\n&gt; - Plan.  Each Runner must report a Plan, a hierarchical tree <br/>\n&gt; of the names of the tests it will run.  Test events are <br/>\n&gt; reported with respect to leaves in this tree.<br/>\n&gt; - Request.  A Request is a specification of the desired tests <br/>\n&gt; to be run.  Extensions may also define custom subclasses of <br/>\n&gt; Request, in order to, for example, read tests to be run out <br/>\n&gt; of an XML file--if you think that&#39;s a good idea. :-)<br/>\n<br/>\n </span></blockquote>This sounds very useful. It&#39;s a real pain that I don&#39;t have much<br/>\ntime to look at properly it at the moment, though I&#39;ll do what I can.<br/>\n<br/>\nIn particular, when writing my own parameterisation which allowed<br/>\nparameterisation on a per test-method basis, I kept running into this<br/>\nkind of issue, in terms of how I&#39;d &quot;explain&quot; to a unit test UI what was<br/>\ngoing to be run etc.<br/>\n<br/>\nUnfortunately I can&#39;t (currently) release the source of my<br/>\ninvestigations, but I&#39;ll try to apply the code I&#39;d written to the new<br/>\nRunner/Plan/Request architecture and let you know how I get on.<br/>\n<br/>\nJon<br/>\n<br/>\n<br/>\nClearswift monitors, controls and protects all its messaging traffic in compliance with its corporate email policy using Clearswift products.<br/>\nFind out more about Clearswift, its solutions and services at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.clearswift.com\">http://www.clearswift.com</a><br/>\n<br/>\nThis communication is confidential and may contain privileged information intended solely for the named addressee(s). It may not be used or disclosed except for the purpose for which it has been sent. If you are not the intended recipient, you must not copy, distribute or take any action in reliance on it. Unless expressly stated, opinions in this message are those of the individual sender and not of Clearswift. If you have received this communication in error, please notify Clearswift by emailing <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:support@...\">support@...</a> quoting the sender and delete the message and any attached documents. Clearswift accepts no liability or responsibility for any onward transmission or use of emails and attachments having left the Clearswift domain.<br/>\n<br/>\nThis footnote confirms that this email message has been swept by MIMEsweeper for Content Security threats, including computer viruses.</div>", 
    "prevInTime": 15782, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1137659257", 
    "canDelete": false, 
    "nextInTopic": 15784, 
    "prevInTopic": 15782, 
    "headers": {
        "messageIdInHeader": "PDZFQUE4QUQ4MkQ3RUJGNDc4Q0NFMjYyRkEzMkM2QzY0MDFCNTcwMzFAR0VNSU5JLkVVUk9QRS5DTEVBUlNXSUZULkNPTT4="
    }
}