{
    "numMessagesInTopic": 9, 
    "nextInTime": 15859, 
    "senderId": "i_fhNdN-Vk_SSLtQViOEvvsHxf-05v7lYnpX3tppfhHlknEH9SPauxJQ2He1w_WK_UskpsFQBtHqy7C8orTXJDtrZ47kXsYIA14UyOLHKQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Experimental programming", 
    "from": "Elliotte Harold &lt;elharo@...&gt;", 
    "authorName": "Elliotte Harold", 
    "msgSnippet": "... The change was neither quick nor simple. It was actually a rather involved reworking of the code to add a new feature. I m not hugely surprised that in the", 
    "msgId": 15858, 
    "topicId": 15856, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 12653864, 
    "messageBody": "<div id=\"ygrps-yiv-2082669839\">Cédric Beust ♔ wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The first fix should have been a warning to you:  you made a quick change,<br/>\n&gt; thought you were done, shipped the new version and then someone else pointed<br/>\n&gt; out that your fix had created a deeper, more subtle bug.<br/>\n<br/>\n </span></blockquote>The change was neither quick nor simple. It was actually a rather <br/>\ninvolved reworking of the code to add a new feature. I&#39;m not hugely <br/>\nsurprised that in the new code that was added there was an undiscovered <br/>\nbug since that part of the code had not yet been through the full <br/>\nprocess the older parts of XOM have gone through (code review, static <br/>\ncode analysis, code coverage measurements, etc.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Well, yes, if you assume that your tests are 100% perfect.  They were not<br/>\n&gt; the first time, why do you assume they are now?<br/>\n<br/>\n </span></blockquote>Any time someone starts using words like &quot;perfect&quot; or &quot;100%&quot;, alarm <br/>\nbells go off in my head. It&#39;s never a question of perfect or 100%. It&#39;s <br/>\na question of better or worse. My argument is that test-driven <br/>\nprogramming is better.  It produces more robust, less-buggy code than <br/>\ntraditional approaches based on attempts to understand without actually <br/>\nverifying that understanding.<br/>\n<br/>\nYes, it would probably be better if I did understand exactly why the fix <br/>\nworked but:<br/>\n<br/>\n1. If I waited to understand it, it would take much longer to actually <br/>\nproduce the fix.<br/>\n<br/>\n2. If I had focused on understanding the fix, I might not have found it <br/>\nin the first place. My theoretical understanding wwas pointing at a much <br/>\nmore complicated solution. It&#39;s easier to figure out why something you <br/>\nknow works does work, than it is to figure out what will work.<br/>\n<br/>\n3. (and this is a point a lot of people are missing) XOM is at most a <br/>\nmedium sized code base. One person probably could understand all of it <br/>\ngiven a finite amount of time. However, there is an increasing amount of <br/>\ncode for which only a heuristic and experimental understanding is possible.<br/>\n<br/>\nMy argument is that there is hope, and that truly large, convoluted, and <br/>\n  opaque code bases are nonetheless practically fixable and <br/>\nmaintainable, despite the lack of understanding.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Don&#39;t you have enough proof that you are overestimating the<br/>\n&gt; comprehensiveness of these tests since they failed to catch two bugs in a<br/>\n&gt; short period of time?<br/>\n<br/>\n </span></blockquote>My tests did not fail to catch two bugs in a short period of time. There <br/>\nwas only one bug (at least found so far) and it was in a newly <br/>\nimplemented feature. Nothing will be perfect the first go round. That&#39;s <br/>\nwhy we do beta testing and code review and so forth. I&#39;m frankly <br/>\nsurprised there haven&#39;t been more bugs found in the new parts; but it&#39;s <br/>\nprobably that they haven&#39;t received extensive shakedowns yet.<br/>\n<br/>\nBy contrast in the two months since XOM 1.1 was released, there has been <br/>\nexactly one minor bug found in it (I wasn&#39;t checking for null where I <br/>\nshould have been. See <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://cafe.elharo.com/java/a-minor-glitch-in-type-safe-enums/\">http://cafe.elharo.com/java/a-minor-glitch-in-type-safe-enums/</a> .) That&#39;s <br/>\npretty damn good. It&#39;s certainly much better than competing products <br/>\nlike JDOM can claim. Complex programs can never be perfect but they can <br/>\nasymptotically approach perfection.<br/>\n<br/>\n-- <br/>\n﻿Elliotte Rusty Harold  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elharo@...\">elharo@...</a><br/>\nXML in a Nutshell 3rd Edition Just Published!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafeconleche.org/books/xian3/\">http://www.cafeconleche.org/books/xian3/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/exec/obidos/ISBN=0596007647/cafeaulaitA/ref=nosim\">http://www.amazon.com/exec/obidos/ISBN=0596007647/cafeaulaitA/ref=nosim</a></div>", 
    "prevInTime": 15857, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1138122641", 
    "canDelete": false, 
    "nextInTopic": 15869, 
    "prevInTopic": 15857, 
    "headers": {
        "inReplyToHeader": "PGI4NmI2YTljMDYwMTI0MDgzOWgzNjdlMWQ3ZHRhZTM4ZGRkMzU1OWM1NjAyQG1haWwuZ29vZ2xlLmNvbT4=", 
        "messageIdInHeader": "PDQzRDY1RjkxLjEwMjAxMDJAbWV0YWxhYi51bmMuZWR1Pg==", 
        "referencesHeader": "PDQzRDYzQjY1LjkwOTAwQG1ldGFsYWIudW5jLmVkdT4gPGI4NmI2YTljMDYwMTI0MDgzOWgzNjdlMWQ3ZHRhZTM4ZGRkMzU1OWM1NjAyQG1haWwuZ29vZ2xlLmNvbT4="
    }
}