{
    "numMessagesInTopic": 2, 
    "nextInTime": 15863, 
    "senderId": "lJOpcpn3IsOijBY2IjxPmdJi-vgND4quBCZUaJQ4OKXTF86L_fE13VbhUqZStfXkubik6OlnxGIQOxn3-DXxGwuQ_GEGkQ", 
    "systemMessage": true, 
    "subject": "Agile 2006 CFP Deadlines 01/31 & 02/28", 
    "from": "Alex Viggio &lt;aviggio@...&gt;", 
    "authorName": "Alex Viggio", 
    "msgSnippet": "AGILE 2006 July 23-29, 2006 Hyatt Regency Hotel Minneapolis, Minnesota, USA *** CFP SUBMISSION DEADLINES WILL SOON ARRIVE *** - January 31, 2006:  Discovery", 
    "msgId": 15862, 
    "profile": "aviggio", 
    "topicId": 15862, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 247997978, 
    "messageBody": "<div id=\"ygrps-yiv-572142725\">AGILE 2006<br/>\nJuly 23-29, 2006<br/>\nHyatt Regency Hotel<br/>\nMinneapolis, Minnesota, USA<br/>\n<br/>\n<br/>\n*** CFP SUBMISSION DEADLINES WILL SOON ARRIVE ***<br/>\n<br/>\n- January 31, 2006:  Discovery Session, Experience Reports, Hands-on<br/>\n   Sessions, Tutorials<br/>\n<br/>\n- February 28, 2006:  Research Papers, Educators&#39; Symposium<br/>\n<br/>\nAgile 2006 will be an exciting conference about techniques and <br/>\ntechnologies, attitudes and policies, research and experience, and the <br/>\nmanagement and development sides of agile software development. The <br/>\nagile approach focuses on delivering business value early in the project <br/>\nlifetime and being able to incorporate emergent requirements. It <br/>\naccentuates the use of rich, informal communication channels and <br/>\nfrequent delivery of running, tested systems, while attending to the <br/>\nhuman component of software development.<br/>\n<br/>\nAgile 2006 gives attendees access to the latest thinking in this domain, <br/>\nand bridges communities that rarely get a proper chance to exchange <br/>\nideas and thoughts. It brings together researchers from labs and <br/>\nacademia with executives, managers, and developers in the trenches of <br/>\nsoftware development. The conference is not about a single methodology <br/>\nor approach, but rather provides a forum for the exchange of information <br/>\nregarding all agile development technologies.<br/>\n<br/>\nVisit the conference website at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.agile2006.com\">http://www.agile2006.com</a> for details on <br/>\nall submission categories and links to the online submission areas.<br/>\n<br/>\nWe invite submissions for the following:<br/>\n<br/>\n**Research paper<br/>\nAn original contribution to the field of agile development. These<br/>\nsubmissions have the potential to promote reflection in the field, to<br/>\ndeepen our understanding of agile approaches, to influence future<br/>\ndevelopments, and to inspire innovation.<br/>\n<br/>\n**Educators&#39; Symposium<br/>\nA one-day event targeted particularly for agile educators. Sessions here<br/>\nmay take a variety of forms, such as papers, panels and activities.<br/>\n<br/>\n**Experience Report<br/>\nAn opportunity to describe what did or didn&#39;t work for you on a project.<br/>\nExperience reports allow practitioners to share practical advice and<br/>\nwarnings to other teams.  The proposal is a short summary of your<br/>\nexperience which will result in a paper presentation at the conference.<br/>\n<br/>\n**Discovery Session<br/>\nAn opportunity for conference attendees to learn from each other about a<br/>\nrelevant topic and share the concrete outcomes after the session. These <br/>\n90 or 180 minute sessions may take several formats including a think <br/>\ntank, a goldfish bowl or a workshop.<br/>\n<br/>\n**Tutorial<br/>\nAn opportunity for an expert to share knowledge with others through a<br/>\ncombination of lecture and exercise. Tutorials may be either 90 or 180<br/>\nminutes.<br/>\n<br/>\n**Hands-on session<br/>\nAn all-day or multi-day event during which participants are encouraged <br/>\nto drop in and stay from one hour to all day to work hands-on developing<br/>\nsoftware. In past years, hands-on events featured the FIT Fest, which<br/>\nprovided opportunities to use FIT and FitNesse.</div>", 
    "prevInTime": 15861, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1137957839", 
    "canDelete": false, 
    "nextInTopic": 15879, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDQzRDNEQkNGLjMwOTAxMDBAYml2aW8uYml6Pg=="
    }
}