{
    "numMessagesInTopic": 74, 
    "nextInTime": 15979, 
    "senderId": "u1V4YWCf29KFPrTsxMn9DBpP7TBRrwwHlTg7UXkEGbkbCS4APcoby9JkGNQ1-WmFAxfdiFuilu2U2MxvlZW7Og", 
    "systemMessage": false, 
    "subject": "Re: Pluggable Selector considered harmful? (Re: [junit] Re: Observations from a production use of JUnit4)", 
    "from": "David Saff &lt;saff@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "... I think it does, but I m still figuring it out.  Cleverness in design often comes from metaphor: what if we could think of A as a kind of B? What if we", 
    "msgId": 15978, 
    "profile": "dsaff", 
    "topicId": 15891, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 139771899, 
    "messageBody": "<div id=\"ygrps-yiv-1724127451\">J. B. Rainsberger wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; David Saff wrote:<br/>\n&gt; &gt; Was your other piece of code going to be reused as heavily as JUnit is?<br/>\n&gt;<br/>\n&gt; Probably not. This was more about demonstrating a technique than<br/>\n&gt; anything else.<br/>\n&gt;<br/>\n&gt; &gt; Does that make a difference?<br/>\n&gt;<br/>\n&gt; I don&#39;t think it does. Do you?<br/>\n<br/>\n </span></blockquote>I think it does, but I&#39;m still figuring it out.  Cleverness in design <br/>\noften comes from metaphor: what if we could think of A as a kind of B?  <br/>\nWhat if we could think of a String as an iterable collection of lines?  <br/>\n(Ruby)  What if we could think of a flat panel as a spinnable wheel?  <br/>\n(iPod)  What if we could think of methods as test statements?  (JUnit)  <br/>\nWhat if we could think of basic blocks as runnable objects?  <br/>\n(Smalltalk)  By capitalizing on the similarity between something that <br/>\nlooks complex and something that we think we understand, we gain leverage.<br/>\n<br/>\nHowever, these metaphors are not without costs.  There are distinctions <br/>\nin the world, and the adaptations that must be made are not always <br/>\nintuitive.  If you look at all the Xunit descendants in the world, there <br/>\nare many different answers to simple questions: should one object be <br/>\ncreated for each method, or each class?  How can we identify _which_ <br/>\nmethods are tests?  Does it make sense to pass parameters to these test <br/>\nmethods?  All of these need answers to adapt the idea of &quot;test&quot; to the <br/>\nidea of &quot;method&quot;.  New users need time to &quot;get&quot; the basic metaphor, and <br/>\nthen additional time to learn, often by frsutrating trial and surprising <br/>\nerror, all of the gotchas.<br/>\n<br/>\nPluggable Selector, using reflection, is such a metaphor.  So, whether <br/>\nthe cost of this metaphor is worth it depends on the benefit each user <br/>\ngets, and how many uses that cost is to be amortized across.<br/>\n<br/>\nI&#39;m still figuring this out, and I&#39;m interested in your ideas.  Thanks,<br/>\n<br/>\n    David Saff</div>", 
    "prevInTime": 15977, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1139240123", 
    "canDelete": false, 
    "nextInTopic": 15979, 
    "prevInTopic": 15977, 
    "headers": {
        "inReplyToHeader": "PDQzRTc0QUI0LjUwODAyMDhAcm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PDQzRTc2Q0JCLjQwNzAwMDJAbWl0LmVkdT4=", 
        "referencesHeader": "PGRycXQ5Mis1cWxuQGVHcm91cHMuY29tPiA8NDNFMThENkYuNjA1MDMwMkByb2dlcnMuY29tPiA8NDNFMjA5NTkuNzAzMDYwNUBmYXN0LW1haWwub3JnPiA8NDNFMkJERUQuODA0MDkwN0Byb2dlcnMuY29tPiA8NDNFMzhGOEEuMTA1MDcwMEBmYXN0LW1haWwub3JnPiA8NDNFNjlGM0IuMzA3MDEwMUByb2dlcnMuY29tPiA8NDNFNkM4OEIuOTA2MDcwMEBtaXQuZWR1PiA8NDNFNzRBQjQuNTA4MDIwOEByb2dlcnMuY29tPg=="
    }
}