{
    "numMessagesInTopic": 74, 
    "nextInTime": 15975, 
    "senderId": "GxonjKTwY0-_q8cdRk_mERYRRqQCJ6o75zFxxLeTC4itOwKRhDCxOTT9dWPNgDfrVhXAWIvEPprBfUCrqYTf4FiawzybG2vyH7mwAMdm", 
    "systemMessage": true, 
    "subject": "RE: Pluggable Selector considered harmful? (Re: [junit] Re: Observations from a production use of JUnit4)", 
    "from": "&quot;Antti Karanta&quot; &lt;Antti.Karanta@...&gt;", 
    "authorName": "Antti Karanta", 
    "msgSnippet": "... I fully agree and I d like to put this yet another way: people always say static typing catches more errors at compile time. It is true, but these are the", 
    "msgId": 15974, 
    "profile": "antti.karanta_at_napa_fi", 
    "topicId": 15891, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 252962393, 
    "messageBody": "<div id=\"ygrps-yiv-1909446917\"><blockquote><span title=\"ireply\">&gt; Cédric Beust ♔ wrote:\r<br/>\n&gt; &gt; On 2/2/06, J. B. Rainsberger &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jbrains@...\">jbrains@...</a>&gt; wrote:\r<br/>\n&gt; &gt;  &gt;\r<br/>\n&gt; &gt;  &gt;\r<br/>\n&gt; &gt;  &gt; &gt;    - Can break when refactoring\r<br/>\n&gt; &gt;  &gt;\r<br/>\n&gt; &gt;  &gt; That&#39;s why we have tests.\r<br/>\n&gt; &gt; \r<br/>\n&gt; &gt; No, that&#39;s why we have static typing.\r<br/>\n&gt; \r<br/>\n&gt; The static type checker generates a bunch of tests, 99% of \r<br/>\n&gt; which always pass.\r<br/>\n\r<br/>\n </span></blockquote>  I fully agree and I&#39;d like to put this yet another way: people always say static typing catches more errors at compile time. It is true, but these are the sort of errors that raraly occur anyhow and are usually trivial to notice, find and fix (if you have tests). And static typing makes you pay a high price for preventing these trivial errors - it&#39;s not just the type declarations for the vars, the impact goes a lot deeper.\r<br/>\n\r<br/>\n  As a comment to doing refactoring w/out static typing: having done some fairly big refactorings in a program written in Ruby I can say it wasn&#39;t that hard - as I had the tests. If I didn&#39;t have the tests it would have been more difficult.\r<br/>\n\r<br/>\n\r<br/>\n  I&#39;m not saying static typing is all bad. It provides usually better performance and it&#39;s easier to build tools on top of (although I have found it is self inflicted in the sense that you need the tools much more w/ statically typed languages than the dynamically typed ones due to the lack of metaprogramming). I think multilanguage development is the way to go, and hope to see it become more commonplace in the future. That way you get the best from both worlds.\r<br/>\n\r<br/>\n  Here&#39;s a nice article comparing some features of dynamically typed languages to Java (in an article series that is otherwise about Java development):\r<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www-128.ibm.com/developerworks/java/library/os-lightweight7/\">http://www-128.ibm.com/developerworks/java/library/os-lightweight7/</a>\r<br/>\n\r<br/>\n\r<br/>\n  I believe most people that root for static typing do so because they have never really tried the alternative. Personally I really appreciate the flexibility, having to write a lot less code, and having the code I write be more readable as there is much less noise. \r<br/>\n\r<br/>\n\r<br/>\n  I don&#39;t want to start a flamewar about the subject so I won&#39;t go into it any further. If you like static typing and are happy and productive w/ it, that&#39;s good. I&#39;d just urge every programmer to learn at least one object oriented dynamically typed language (ruby, smalltalk, python, groovy, maybe even lisp...) and do some real programming w/ it (not just small scripts) - I think you&#39;ll realize quite quickly why there are so many people who aren&#39;t so convinced about the blissfullness of static typing.\r<br/>\n\r<br/>\n\r<br/>\n\r<br/>\n       -Antti-</div>", 
    "prevInTime": 15973, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1138964837", 
    "canDelete": false, 
    "nextInTopic": 15975, 
    "prevInTopic": 15971, 
    "headers": {
        "messageIdInHeader": "PDY4MEZBMzcwQTM2RDgzNDM5RTE3N0JEQzAyRjBFOEI1QzFCOTk5QG53NjAubmFwYS5maT4="
    }
}