{
    "numMessagesInTopic": 15, 
    "nextInTime": 1600, 
    "senderId": "euZCDvLNPBDopMTIiw2xjEdSW0CvFgW4aemjaNOOJ52EGVtcid3LVxY9FTt--NKL060rshlcTQ", 
    "systemMessage": false, 
    "subject": "Re: How do I submit code which I think should be added to JUnit?", 
    "from": "kentbeck@...", 
    "authorName": "kentbeck@csi.com", 
    "msgSnippet": "Here s my (admittedly limited) perspective. Lots of people want to contribute to JUnit. Some people have done significant work. JXUnit went so far as forking,", 
    "msgId": 1599, 
    "topicId": 1581, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-458599013\">Here&#39;s my (admittedly limited) perspective. Lots of people want to <br/>\ncontribute to JUnit. Some people have done significant work. JXUnit <br/>\nwent so far as forking, and Vladimir Bossicard is obviously getting <br/>\nfrustrated (not that I blame him).<br/>\n<br/>\n1. Erich and I are doing this on really limited resources, and nobody <br/>\nhas ever said, &quot;How can I help?&quot; except Erik Meade. Coming to us with <br/>\nan offer to make some problem go away is much more likely to get a <br/>\npositive response than, &quot;Here&#39;s some code. Integrate it.&quot;<br/>\n<br/>\n2. JUnit as a political gesture celebrates the ability of programmers <br/>\nto test their own software. The code and tests must be held to a <br/>\nhigher standard, to demonstrate the techniques necessary to uphold <br/>\nour end of the bargain.<br/>\n<br/>\n3. We are new to the open source culture, and we are certain to make <br/>\nsome mistakes. When we do, we need feedback.<br/>\n<br/>\n4. We don&#39;t get to program much, and when we do it is generally in a <br/>\nvery constrainted situation where we have to make lots of <br/>\ncompromises. Our greatest joy in JUnit is a project where we can <br/>\nengineer at the limits of our ability.<br/>\n<br/>\nOur long-term goal is to shift primary responsibility for the further <br/>\ndevelopment of JUnit to the community, while retaining the technical <br/>\nexcellence exhibited by junit.framework, extending that level of <br/>\nrefinement to the rest of the codebase, and maintaining our ability <br/>\nto get together for a couple of days and add cool features.<br/>\n<br/>\nImmediately, expect any submissions that don&#39;t come with extensive <br/>\ntest cases to be unceremoniously bounced. Offers of help with grunge <br/>\nwork will be gratefully accepted.<br/>\n<br/>\nKent</div>", 
    "prevInTime": 1598, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "993157220", 
    "canDelete": false, 
    "nextInTopic": 1600, 
    "prevInTopic": 1598, 
    "headers": {
        "inReplyToHeader": "PDg3RUU2QjIxQzYyNEQ1MTFCNzI0MDAxMDRCQ0YxRUIwMUY2MEFGQGV4Y2g+", 
        "messageIdInHeader": "PDlndG45NCs0cjZuQGVHcm91cHMuY29tPg=="
    }
}