{
    "numMessagesInTopic": 74, 
    "nextInTime": 16000, 
    "senderId": "j6FaqJO230qlWOMbPfSLbR4W_4vx5owFD9FfnaqWxDoOAQsAmb-nFJrH7K6l185sHeKhsbMJG9js1mWqefpXKw", 
    "systemMessage": false, 
    "subject": "Re: Pluggable Selector considered harmful? (Re: [junit] Re: Observations from a production use of JUnit4)", 
    "from": "David Saff &lt;saff@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "... It beats me if it s OK.  You asked what the difference could possibly be.  I laid out that the difference might be reuse patterns.  We disagree on this", 
    "msgId": 15999, 
    "profile": "dsaff", 
    "topicId": 15891, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 139771899, 
    "messageBody": "<div id=\"ygrps-yiv-1993299243\">J. B. Rainsberger wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Although I can relate to all the things you wrote, I&#39;m stuck with one<br/>\n&gt; logical quandary.<br/>\n&gt;<br/>\n&gt; If Pluggable Selector is OK for JUnit, then why isn&#39;t it OK for the code<br/>\n&gt; I was writing, which happened to choose rule methods the same way JUnit<br/>\n&gt; chooses test methods?<br/>\n<br/>\n </span></blockquote>It beats me if it&#39;s OK.  You asked what the difference could possibly <br/>\nbe.  I laid out that the difference might be reuse patterns.  We <br/>\ndisagree on this point, but I claim no knowledge of whether your <br/>\noriginal design was good.  Frankly, you sound like an experienced <br/>\ndesigner, and I like clever designs, so on that point, we may very well <br/>\nbe on the same side.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You wonder whether it matters how heavily reused the code is. So, if<br/>\n&gt; this is code only my team will use, then it&#39;s not OK; but if it&#39;s code I<br/>\n&gt; plan to put into a general-purpose, widely-used rule engine[1]<br/>\n<br/>\n </span></blockquote>I&#39;d be interested in what that footnote was supposed to be.  :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; , then<br/>\n&gt; it&#39;s OK. I don&#39;t buy that at all. Ignoring the effort to write the code<br/>\n&gt; this way, its value might increase the more it&#39;s used, but that doesn&#39;t<br/>\n&gt; mean it has negative value when it&#39;s not widely used. It would seem that<br/>\n&gt; the more people who try to use a clever design, the more that clever<br/>\n&gt; design costs, if you include the cost of supporting the people trying to<br/>\n&gt; use it. As a result, I&#39;d argue the opposite: the fewer people who use<br/>\n&gt; it, the more we can afford to be clever.<br/>\n<br/>\n </span></blockquote>Good point.  I wonder if there&#39;s a lot we could learn about the <br/>\ncost/benefit analysis of cleverness.  I think that the strongest claim <br/>\nwe could probably agree on is that we&#39;re most likely to win if each <br/>\nperson that learns the metaphor ends up using it thousands of times <br/>\nregularly, rather than a handful of times separated by months on end.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In my case, JUnit /was/ the metaphor: rule methods are collected<br/>\n&gt; automatically like test methods, and if any rule fails, the whole<br/>\n&gt; ruleset fails. To anyone with any JUnit experience, I think that works<br/>\n&gt; well. This is why I was surprised to see many JUnit users balk at it. So<br/>\n&gt; there must be something else to it, and frankly, I can&#39;t see what it is<br/>\n&gt; beyond those people deciding arbitrarily. That&#39;s fine, but I don&#39;t want<br/>\n&gt; people to dress it up as more than that when that&#39;s what it is.<br/>\n<br/>\n </span></blockquote>It sounds like this is a question you should address to those JUnit <br/>\nusers.  Did they give you concrete feedback, or simply &quot;Nope, don&#39;t like <br/>\nit&quot;, or was there another design that enthralled them?<br/>\n<br/>\nThanks,<br/>\n<br/>\n    David Saff</div>", 
    "prevInTime": 15998, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1139275081", 
    "canDelete": false, 
    "nextInTopic": 16001, 
    "prevInTopic": 15996, 
    "headers": {
        "inReplyToHeader": "PDQzRTdFNjkzLjkwMzA4MDhAcm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PDQzRTdGNTQ5LjUwNTA1MDFAbWl0LmVkdT4=", 
        "referencesHeader": "PGRycXQ5Mis1cWxuQGVHcm91cHMuY29tPiA8NDNFMThENkYuNjA1MDMwMkByb2dlcnMuY29tPiA8NDNFMjA5NTkuNzAzMDYwNUBmYXN0LW1haWwub3JnPiA8NDNFMkJERUQuODA0MDkwN0Byb2dlcnMuY29tPiA8NDNFMzhGOEEuMTA1MDcwMEBmYXN0LW1haWwub3JnPiA8NDNFNjlGM0IuMzA3MDEwMUByb2dlcnMuY29tPiA8NDNFNkM4OEIuOTA2MDcwMEBtaXQuZWR1PiA8NDNFNzRBQjQuNTA4MDIwOEByb2dlcnMuY29tPiA8NDNFNzZDQkIuNDA3MDAwMkBtaXQuZWR1PiA8NDNFN0U2OTMuOTAzMDgwOEByb2dlcnMuY29tPg=="
    }
}