{
    "numMessagesInTopic": 40, 
    "nextInTime": 16051, 
    "senderId": "Z7xSnRQ4XfynOH0nX3FFvjfe2eVcEHYOV3zNyjmNn5fqR8oiViq99EqGsYstDp4uPvoE08EZJZiKkZvD5dDe7gOj6jk5PKrzTu28zGfufg", 
    "systemMessage": false, 
    "subject": "Re: [junit] Is Junit-based testing REALLY possible for commercial software development ?", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... Do commercial projects not also need to deliver high-quality systems quickly? ... This assumes that testing requires extra time. Very good testing means ", 
    "msgId": 16050, 
    "profile": "nails762", 
    "topicId": 16038, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-1909594771\">frank zou wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; After lots of reading and trying, I think I understand the following<br/>\n&gt; benefits that Junit-base testing can give us:<br/>\n&gt; <br/>\n&gt; * more robust system<br/>\n&gt; * clean / good design<br/>\n&gt; * less regression bugs<br/>\n&gt; * confidence to do refactorying, especially at the later phase of the<br/>\n&gt; project.<br/>\n&gt; * and lots more...<br/>\n&gt; <br/>\n&gt; These are really good things, for open-source projects where there is<br/>\n&gt; no deadline pressure and resource could almost be thought as<br/>\n&gt; un-limitted. However, for commercial software development, is this<br/>\n&gt; still possible ?<br/>\n<br/>\n </span></blockquote>Do commercial projects not also need to deliver high-quality systems <br/>\nquickly?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Although I knew JUnit and other JUnit-based open-source tools for a<br/>\n&gt; couple of years, my company and team never really enbrace it. The<br/>\n&gt; major reason is Product Managers always want to add cool features to<br/>\n&gt; the system quickly while programmers find the schedule is always too<br/>\n&gt; tight to spend any extra time to write testing.<br/>\n<br/>\n </span></blockquote>This assumes that testing requires extra time. Very good testing means <br/>\nvery few defects, which means less overall cost to deliver the same <br/>\nsoftware. It is important to compare the cost of the /entire/ <br/>\ndevelopment process, and not just the cost of typing code.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know from the mail list and books that we can take lots of advantage<br/>\n&gt; of JUnit-based testing, I myself have no real hands-on experience on<br/>\n&gt; it. So here are my questions:<br/>\n&gt; <br/>\n&gt; * Will Junit-based testing make the project time longer or shorter ?<br/>\n&gt; Any hard statistic data ? ( Here I mean commercial project rather than<br/>\n&gt; open-source project. )<br/>\n<br/>\n </span></blockquote>This depends on your time horizon. How far ahead are you planning? To <br/>\nuse JUnit effectively requires investment in learning. If you are <br/>\ndiligent in learning, you will see positive return on the investment, <br/>\nbut not immediately.<br/>\n<br/>\nFor a plain Java project (not J2EE), I have a team with 3 programmers <br/>\nwho report positive overall return on investment after 3 months.<br/>\n<br/>\nFor a J2EE project, it often takes longer. At least 6 months and maybe 1 <br/>\nyear.<br/>\n<br/>\nOf course, these numbers are based on my informal observations and are <br/>\nnot hard, scientific or statistical data.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; * One intersting point I found is that after Junit-based testing is<br/>\n&gt; introduced, programmers tend to use IDE debugger much less than<br/>\n&gt; before.  This would save lots of time. Is that true ?<br/>\n<br/>\n </span></blockquote>I only use the debugger to step through code without enough tests. In <br/>\nthe equivalent of the past 3 months, I have spent less than 1 hour in <br/>\nthe debugger. It is a big time savings for me.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; * Some guys say JUnit is good for biz / util code testing. But for web<br/>\n&gt; application development, where HTML/javascript would be root cause of<br/>\n&gt; lots of bugs, Junit is not so powerful. Any comments ?<br/>\n<br/>\n </span></blockquote>I don&#39;t believe that&#39;s true, but that doesn&#39;t matter. Even if I assume <br/>\nit is true, most of the high-priority defects in projects I coach are <br/>\nbusiness logic problems, so if we eliminate 70% of those, we have a lot <br/>\nof time to figure out how to test HTML and Javascript. (_JUnit Recipes_ <br/>\nalready provides a lot of advice on testing J2EE components and <br/>\napplications. Also Google &quot;Test-Driven J2EE&quot;.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; * How can I convince managers and programmers that JUnit-based is<br/>\n&gt; really possible for commercial software development ? Any differnece<br/>\n&gt; from open-source projects ?<br/>\n<br/>\n </span></blockquote>What does it mean for JUnit to be possible? What results do they expect?<br/>\n-- <br/>\nJ. B. (Joe) Rainsberger :: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jbrains.info\">http://www.jbrains.info</a><br/>\nYour guide to software craftsmanship<br/>\nJUnit Recipes: Practical Methods for Programmer Testing<br/>\n2005 Gordon Pask Award for contribution Agile Software Practice</div>", 
    "prevInTime": 16049, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1139539540", 
    "canDelete": false, 
    "nextInTopic": 16051, 
    "prevInTopic": 16048, 
    "headers": {
        "inReplyToHeader": "PGRzZmdvaStjNHJqQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDQzRUJGRTU0LjgwNDAyMDBAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PGRzZmdvaStjNHJqQGVHcm91cHMuY29tPg=="
    }
}