{
    "numMessagesInTopic": 40, 
    "nextInTime": 16069, 
    "senderId": "juArJtxu8jvk7WIG9mQrZUdpdKJBWP4GCPzIe_Dr7Zh12U1hhJwkHPVkD2wfY8vOmGpu-BdmdfqT", 
    "systemMessage": false, 
    "subject": "Re: [junit] Is Junit-based testing REALLY possible for commercial software development ?", 
    "from": "didoss@...", 
    "authorName": "didoss@comcast.net", 
    "msgSnippet": "I think it ultimately comes down to a question of faith.  I truly believe that the time I spend working on unit tests of my commercial application saves me", 
    "msgId": 16068, 
    "rawEmail": "Return-Path: &lt;didoss@...&gt;\r\nX-Sender: didoss@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 7310 invoked from network); 10 Feb 2006 14:36:24 -0000\r\nReceived: from unknown (66.218.67.33)\n  by m30.grp.scd.yahoo.com with QMQP; 10 Feb 2006 14:36:24 -0000\r\nReceived: from unknown (HELO rwcrmhc11.comcast.net) (216.148.227.151)\n  by mta7.grp.scd.yahoo.com with SMTP; 10 Feb 2006 14:36:24 -0000\r\nReceived: from rmailcenter78.comcast.net ([204.127.197.178])\n          by comcast.net (rwcrmhc11) with SMTP\n          id &lt;20060210143422m1100bsj49e&gt;; Fri, 10 Feb 2006 14:34:22 +0000\r\nReceived: from [139.177.224.128] by rmailcenter78.comcast.net;\n\tFri, 10 Feb 2006 14:34:21 +0000\r\nTo: junit@yahoogroups.com\r\nDate: Fri, 10 Feb 2006 14:34:21 +0000\r\nMessage-Id: &lt;021020061434.4847.43ECA46D00012E06000012EF22007613949C9C010B070B@...&gt;\r\nX-Mailer: AT&T Message Center Version 1 (Aug  4 2005)\r\nX-Authenticated-Sender: ZGlkb3NzQGNvbWNhc3QubmV0\r\nMIME-Version: 1.0\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: didoss@...\r\nSubject: Re: [junit] Is Junit-based testing REALLY possible for commercial software development ?\r\nX-Yahoo-Group-Post: member; u=180862158; y=wTuoVn2Y8JpyyTfarR4n0bKpkD_sn9KrH7n1gPjw91XLMw\r\nX-Yahoo-Profile: dijdoss\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\n\r\nI think it ultimately comes down to a question of faith.  I truly believe that the time I spend working on unit tests of my commercial application saves me time on the other end.  I can spend an extra couple of hours writing some tests during my development, in order to save my team quite a bit of effort down the road,...take this scenario,...\n\nI spend a couple incremental hours writing tests while I develop my code;\nWe run a nightly build;\nOne morning I see that a test has failed;\nI spend an hour to fix it;\nIt makes it to QC and our customer without further incident.\n\nOR\n\nI save a couple hours during development and don&#39;t write tests for my code;\nThe code gets built and released to our QC department;\nThey spend a week testing the code, and then find the bug;\nI spend an hour to fix it;\nThe code gets built and released to our QC department;\nThey start over, with the schedule slipped a week.\n\nOR\n\nSame scenario, except that QC doesn&#39;t catch it - the customer does;\nwe lose face with the customer;\nwe repeat the full cycle to release, with the schedule slipped by however long it took to get to the client.\n\nIt is something that you have to sell to product management,...if you can schedule time for writing tests (and writing before/during development is less time than after the code is written), and schedule time to fix bugs correctly (and write/fix tests to make sure it doesn&#39;t get through again), then you can make your commitments to your clients while providing a quality product that your staff can be proud of.\n\n\nmy two cents,\nDianne\n\n-------------- Original message -------------- \nFrom: &quot;frank zou&quot; &lt;frankz1998@...&gt; \n\nHi all,\n\nAfter lots of reading and trying, I think I understand the following\nbenefits that Junit-base testing can give us:\n\n* more robust system\n* clean / good design \n* less regression bugs \n* confidence to do refactorying, especially at the later phase of the\nproject. \n* and lots more...\n\nThese are really good things, for open-source projects where there is\nno deadline pressure and resource could almost be thought as\nun-limitted. However, for commercial software development, is this\nstill possible ?\n\n\nAlthough I knew JUnit and other JUnit-based open-source tools for a\ncouple of years, my company and team never really enbrace it. The\nmajor reason is Product Managers always want to add cool features to\nthe system quickly while programmers find the schedule is always too\ntight to spend any extra time to write testing. \n\nI know from the mail list and books that we can take lots of advantage\nof JUnit-based testing, I myself have no real hands-on experience on\nit. So here are my questions: \n\n* Will Junit-based testing make the project time longer or shorter ?\nAny hard statistic data ? ( Here I mean commercial project rather than\nopen-source project. )\n\n* One intersting point I found is that after Junit-based testing is\nintroduced, programmers tend to use IDE debugger much less than\nbefore.  This would save lots of time. Is that true ?\n\n* Some guys say JUnit is good for biz / util code testing. But for web\napplication development, where HTML/javascript would be root cause of\nlots of bugs, Junit is not so powerful. Any comments ? \n\n* How can I convince managers and programmers that JUnit-based is\nreally possible for commercial software development ? Any differnece\nfrom open-source projects ?\n\n\n\nCan some Junit gurus shed some light here ?\n\nThanks, \n- Frank\n\n\n\n\n\n\n\n\n\nSPONSORED LINKS Basic programming language C programming language Computer programming languages \nThe c programming language C programming language List of programming languages \n\n\n\nYAHOO! GROUPS LINKS \n\n Visit your group &quot;junit&quot; on the web.\n  \n To unsubscribe from this group, send an email to:\n junit-unsubscribe@yahoogroups.com\n  \n Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. \n\n[Non-text portions of this message have been removed]\n\n\n", 
    "profile": "dijdoss", 
    "topicId": 16038, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 180862158, 
    "prevInTime": 16067, 
    "contentTrasformed": false, 
    "postDate": "1139582061", 
    "canDelete": false, 
    "nextInTopic": 16069, 
    "prevInTopic": 16067, 
    "headers": {
        "messageIdInHeader": "PDAyMTAyMDA2MTQzNC40ODQ3LjQzRUNBNDZEMDAwMTJFMDYwMDAwMTJFRjIyMDA3NjEzOTQ5QzlDMDEwQjA3MEJAY29tY2FzdC5uZXQ+"
    }
}