{
    "numMessagesInTopic": 40, 
    "nextInTime": 16088, 
    "senderId": "w7MscKT2A1h0cRLV6fe5rxeWkiUX0JV_w0Zxv_GmwerqKdLo71hRnl8XTGeDBOJbw86D1gXCII7TVJU-DiQOu1wtpt5rqvYJaA", 
    "systemMessage": true, 
    "subject": "Re: Is Junit-based testing REALLY possible for commercial software development ?", 
    "from": "&quot;frank zou&quot; &lt;frankz1998@...&gt;", 
    "authorName": "frank zou", 
    "msgSnippet": "Thanks for your input and please read my comments and further questions inline. ... [Frank] That s a very interesitng point. If this becomes a trend in the", 
    "msgId": 16087, 
    "profile": "frankz1998", 
    "topicId": 16038, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 193176558, 
    "messageBody": "<div id=\"ygrps-yiv-1085119409\">Thanks for your input and please read my comments and further<br/>\nquestions inline. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;j0hlrogge&quot; &lt;j0hlrogge@...&gt; wrote:<br/>\n&gt; Today I would actually think twice if I knew that a comercial product<br/>\n&gt; was not properly unit-tested before buying it, I would not trust its<br/>\n&gt; quality since I have seen the difference in my code and other peoples<br/>\n&gt; code when changing towards TDD.<br/>\n<br/>\n<br/>\n[Frank] That&#39;s a very interesitng point. If this becomes a trend in<br/>\nthe market, it would be much easier to convince managers that we<br/>\nshould embrace Unit Testing as early as possible. ;)<br/>\n<br/>\n&gt; <br/>\n&gt; The development was no picknick, TDD is not a silver bullet and you<br/>\n&gt; make mistakes while you learn how to master it. This application was<br/>\n&gt; no exception.<br/>\n&gt; After we went live only 2 bugs have ever been discovered and none of<br/>\n&gt; them serious. The other application had more than 100 reported bugs of<br/>\n&gt; different levels chriticality the first week.<br/>\n&gt; <br/>\n&gt; I attribute this difference mainly to the fact that we had unit-tests<br/>\n&gt; and the others didn&#39;t (It would be tempting to think that we were<br/>\n&gt; simply that much better and smarter but realistically: our choice of<br/>\n&gt; enginering approach was better in this case). It is also interesting<br/>\n&gt; to note that we did not need more time to finish our application than<br/>\n&gt; the other team did, I think that this is bvecause they spent more time<br/>\n&gt; in word than we did and we spent more time in code than they did,<br/>\n&gt; relying more on our testcases to drive the design and acting on the<br/>\n&gt; feedback we got from our tests. In fact our server side components<br/>\n&gt; were live 1 week before theirs.<br/>\n<br/>\n[Frank] That is pretty impressive and just what I am looking forward<br/>\nto see, which makes me more confident to embrance JUnit-based testing. <br/>\n<br/>\n&gt; <br/>\n&gt; Do I think unit testing takes more time? Yes and no:<br/>\n&gt; <br/>\n&gt; Yes - because there is more code to write, and in the beginning there<br/>\n&gt; is a learning curve. I would say that you would experience a drop in<br/>\n&gt; productivity the first couple of months until you get the &quot;hang of it&quot;<br/>\n&gt; TDD is a new way of thinking but it is worth learning. I think TDD is<br/>\n&gt; almost as big of a change as it is to change from procvedural oriented<br/>\n&gt; thinking to OO thinking, you never stop learning and it will take you<br/>\n&gt; years to master it (although you will get benefits from it much earlier)<br/>\n<br/>\n<br/>\n[Frank] That happens to be my guess. However, I am not sure how much<br/>\nextra effort would be involved so far. <br/>\n<br/>\n&gt; No - because you tend to write less &quot;unused code&quot; simply because<br/>\n&gt; having to have a test for every line of code you write makes you<br/>\n&gt; reluctant to do &quot;might be good if I want to do this in the future&quot;<br/>\n&gt; kind of design stunts. This also comes from the knowledge that<br/>\n&gt; changing the code to support those &quot;might be good to haves&quot; is<br/>\n&gt; straight forward, if you have the tests, when they change from &quot;might<br/>\n&gt; be good&quot; to &quot;are necesary&quot;.<br/>\n&gt; Less &quot;might be good to haves&quot; alsoe leaves less production code to<br/>\n&gt; maintain wich saves some effort, I don&#39;t remember who said that he<br/>\n&gt; &quot;would rather have his developers surf the web than adding code that<br/>\n&gt; did not immediately provide any value&quot;. An interesting thought.<br/>\n&gt; <br/>\n<br/>\n[Frank] This is pretty impressive and I did not think about thing like<br/>\nthis. <br/>\n<br/>\n<br/>\n<br/>\n&gt; No - Because your design, with TDD, tends to be simpler, more to the<br/>\n&gt; point and better when you drive it with tests (when you learn how to<br/>\n&gt; do that, before that you will just have very complicated tests and the<br/>\n&gt; same design).<br/>\n&gt; Yes - Because if you have not been doing test-driven development so<br/>\n&gt; far your design will likely be hard to test until you remedy that. To<br/>\n&gt; fix that is time well spent since a testable design is usually an<br/>\n&gt; extendable one and when you have your tests you will see that you can<br/>\n&gt; add new features faster than you thought were possible. But<br/>\n&gt; productivity will no doubt drop until you have spent some time<br/>\n&gt; refactoring for testability (and fixing what you break/try to prevent<br/>\n&gt; to break stuff while doing that since you have no tests at the moment)<br/>\n<br/>\n[Frank] Seems you assume Unit Testing natually means TDD. However, I<br/>\nsaw some others guys said although it is best to have Unit Testing in<br/>\nTDD process, it is not a mandatary. Do you think Unit Testing can<br/>\nstill give us lots of benefits even if we do not follow Agile<br/>\nmethodology like XP, or even not follow TDD ?<br/>\n<br/>\n<br/>\n&gt; I am not saing that your design is bad, I&#39;m saying that it is unlikely<br/>\n&gt; to be very good for testing if that has not been a design-goal (from<br/>\n&gt; my experience)<br/>\n&gt; <br/>\n&gt; About testing web-based applications and the effectiveness of unit<br/>\n&gt; tests I would say that JUnit is equally appropriate for web, but, with<br/>\n&gt; JUnit you test one class at the time (if you do it interaction based)<br/>\n&gt; or several classes from one class at the time (if you are doing<br/>\n&gt; statebased testing). <br/>\n<br/>\n[Frank] Not quite follow you here. I guess when you mentioned &quot;with<br/>\nJUnit you test one class at the time (if you do it interaction<br/>\nbased)&quot;, what you meant is to test the interaction between objects by<br/>\nusing &quot;mock objects&quot;, right ?<br/>\n<br/>\n&gt; In order to find bugs in your HTML etc you need<br/>\n&gt; system tests and other tools (or add ons) to test that. <br/>\n<br/>\n[Frank] What exact &quot;other tools&quot; are you talking about here ? like<br/>\nHttpUnit, HtmlUnit, Canoo and etc ?<br/>\n<br/>\n<br/>\n&gt; (The example I<br/>\n&gt; gave you was a unit-tested serverside with a manually tested<br/>\n&gt; presentation layer). What you want to do though is to put as little<br/>\n&gt; business logic in your presentation layer as you can (that is put no<br/>\n&gt; businesslogic there) so that all your businesslogic can be unit<br/>\n&gt; tested. When you have that you find a lot fewer bugs in your<br/>\n&gt; presentation-layer.<br/>\n<br/>\n&gt; <br/>\n&gt; More and more tools are available testing web apps, I heard about but<br/>\n&gt; never tried &quot;selenium&quot; try that one.  And I also recomend looking at<br/>\n&gt; www.testdriven.com to see if you can find anything that suits you. But<br/>\n&gt; regardless of wether you test the generated html or not you can still<br/>\n&gt; rely on the fact that what is beneath your presentation-layer works.<br/>\n<br/>\n<br/>\n[Frank] You are telling me that in this example project, you tested<br/>\nonly the biz layer code and did not do any automatic testing against<br/>\nthe &quot;html/jsp&quot;, right ?<br/>\n<br/>\n <br/>\n&gt; Sorry for the blah, blah response I easilly get caught up in these<br/>\n&gt; things :) I hope you could distill something useful from this massive<br/>\n&gt; amount of text :)<br/>\n&gt;<br/>\n<br/>\n[Frank] Thanks a lot for your great patience to spend so much time to<br/>\nshare your experience to me. I think I learned a lot from you<br/>\ncomments. This really helps. :)<br/>\n<br/>\nCheers, <br/>\n- Frank </span></blockquote></div>", 
    "prevInTime": 16086, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1139810363", 
    "canDelete": false, 
    "nextInTopic": 16088, 
    "prevInTopic": 16083, 
    "headers": {
        "inReplyToHeader": "PGRzaWNrayttbnBoQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGRzcDc3citpZWYyQGVHcm91cHMuY29tPg=="
    }
}