{
    "numMessagesInTopic": 32, 
    "nextInTime": 16165, 
    "senderId": "OiXpYRawgS5YEsKmxwKBwEsaAXV5TTO5Vz6YoJ4KheNCZgGCLIfIGxthvfKpORWsdQxdj6CM8sjkKWeDAFKv2Q", 
    "systemMessage": false, 
    "subject": "Re: [junit] JUnit Anti-patterns", 
    "from": "David Saff &lt;saff@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "... The sophomores taking MIT s software engineering lab were given a test suite last week that had dozens of asserts per test method. One student managed to", 
    "msgId": 16164, 
    "profile": "dsaff", 
    "topicId": 16150, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 139771899, 
    "messageBody": "<div id=\"ygrps-yiv-1945049651\">Cédric Beust ♔ wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t see how having more that one assert &quot;fights against&quot; JUnit (what<br/>\n&gt; does this even mean?) and in the code that I see every day, very few tests<br/>\n&gt; contain only one assert. Especially if your tests require two or three<br/>\n&gt; statements to set up in the test method (not in setUp()), in which case<br/>\n&gt; there is even more to be gained to run more than one assert so you don&#39;t<br/>\n&gt; have to duplicate this code in other test methods.<br/>\n<br/>\n </span></blockquote>The sophomores taking MIT&#39;s software engineering lab were given a test <br/>\nsuite last week that had dozens of asserts per test method. One student <br/>\nmanaged to have an infinite loop in one of her methods. To figure out <br/>\nwhich of the twenty calls to that method in a single test was causing <br/>\nthe infinite loop, she had no choice but to put printlns between each <br/>\nassert. Certainly if I saw this in my own code (rather than code my <br/>\nclass staff gave me), I would think strongly about separating each of <br/>\nthose asserts into its own method.<br/>\n<br/>\nMore test methods mean more information: with 20 asserts and 20 tests, I <br/>\nknow exactly which of the asserts fail. In one test method, I know only <br/>\nthe first.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, the fix you show in your documentation is simplistic. What if the<br/>\n&gt; code to be extracted is specific to that test method? If you move it to<br/>\n&gt; setUp(), you are suddenly charging *all* the other test methods of <br/>\n&gt; that same<br/>\n&gt; class with this set up cost that they have no need for.<br/>\n<br/>\n </span></blockquote>Or you could create a new class. Is that too expensive?<br/>\n<br/>\nAs the FAQ says, I like to take the temptation to put more than one <br/>\nassert in a method as a sign that I could do something better with my <br/>\ndesign. If there are two or three lines of setup, could that be a single <br/>\nline in a better API? If testing one idea requires three different <br/>\naccessor calls, could I create a single accessor or equals method that <br/>\nwould do that work? If I can&#39;t think of names for the different tests, <br/>\nare they really testing different things?<br/>\n<br/>\nOne downside is that lots of methods does take up a lot of screen space <br/>\nin my IDE. Unless Java introduces an &quot;in-line block&quot; syntax, however, <br/>\nit&#39;s probably the best we can do for now.<br/>\n<br/>\nDavid Saff</div>", 
    "prevInTime": 16163, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1140634493", 
    "canDelete": false, 
    "nextInTopic": 16165, 
    "prevInTopic": 16159, 
    "headers": {
        "inReplyToHeader": "PGI4NmI2YTljMDYwMjIxMTI1M2w1NzJmNDhhNXA4Yzk4MGNlNTMwYWUxMjc4QG1haWwuZ29vZ2xlLmNvbT4=", 
        "messageIdInHeader": "PDQzRkNCMzdELjUwNTA5QG1pdC5lZHU+", 
        "referencesHeader": "PGR0NXBnbCs5NTg5QGVHcm91cHMuY29tPiA8NDNGQjdBOTMuNTAxMDUwNEBhbmRyZXdtY2RvbmFnaC5mMnMuY29tPiA8Yjg2YjZhOWMwNjAyMjExMjUzbDU3MmY0OGE1cDhjOTgwY2U1MzBhZTEyNzhAbWFpbC5nb29nbGUuY29tPg=="
    }
}