{
    "numMessagesInTopic": 8, 
    "nextInTime": 16174, 
    "senderId": "6B0HC0hAy1B6VCOCRHbNASTD8enH3vx0SyZ7iXcZbl7GlImnZmpLPZF5uCQukEGRyttflxdUpa9odeq5XmXixTgPxmPjFOeDgyl_6xc", 
    "systemMessage": false, 
    "subject": "RE: [junit] Re: JUnit 4.0 IDE support", 
    "from": "&quot;Jon Skeet&quot; &lt;jon.skeet@...&gt;", 
    "authorName": "Jon Skeet", 
    "msgSnippet": "... I m an emeritus committer for Ant, and get on well with some of the head honchos. I ve volunteered on the Ant mailing list to be a conduit between these", 
    "msgId": 16173, 
    "profile": "jskeetuk", 
    "topicId": 16140, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 246518675, 
    "messageBody": "<div id=\"ygrps-yiv-927020033\">David Saff wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Excellent idea.  If anyone has an &quot;inside connection&quot; to ant, <br/>\n&gt; let me know.<br/>\n<br/>\n </span></blockquote>I&#39;m an emeritus committer for Ant, and get on well with some of the head<br/>\nhonchos. I&#39;ve volunteered on the Ant mailing list to be a conduit<br/>\nbetween these two lists, where one is needed, and to do *some* work<br/>\ninvolved in writing a JUnit4 Ant task.<br/>\n<br/>\nOne of the things near the top of my priority list is that we don&#39;t get<br/>\ninto the current mess again whereby you need to add JUnit&#39;s jar file to<br/>\nAnt&#39;s lib directory (or specify -lib ...) due to the JUnit task already<br/>\nbeing part of the distribution. To be honest, I think the JUnit project<br/>\nshould &quot;own&quot; the Ant task more than Ant should. (I&#39;m not suggesting it<br/>\nshould be part of the normal JUnit distribution, however.) Hopefully<br/>\nlicences shouldn&#39;t get in the way of using a lot of the existing JUnit<br/>\nAnt task and contributing it to a JUnit-owned repository...<br/>\n<br/>\nI suspect that a lack of first-class Ant support would be a major<br/>\ncontributing factor to a slow take-up of JUnit4.<br/>\n<br/>\nAs I say, I&#39;m happy to do some of the work, but as we&#39;ve seen before I&#39;m<br/>\nnot always able to find time to do all I&#39;d like to (parameterised tests<br/>\nanyone? I&#39;ll get back to it some day!). This is likely to become worse<br/>\nin a couple of months when we go from a family of three to a family of<br/>\nfive - but I&#39;m sure I&#39;ll find *some* hacking time. In particular I&#39;m<br/>\nalso happy to code review :)<br/>\n<br/>\nJon<br/>\n<br/>\n<br/>\nClearswift monitors, controls and protects all its messaging traffic in compliance with its corporate email policy using Clearswift products.<br/>\nFind out more about Clearswift, its solutions and services at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.clearswift.com\">http://www.clearswift.com</a><br/>\n<br/>\nThis communication is confidential and may contain privileged information intended solely for the named addressee(s). It may not be used or disclosed except for the purpose for which it has been sent. If you are not the intended recipient, you must not copy, distribute or take any action in reliance on it. Unless expressly stated, opinions in this message are those of the individual sender and not of Clearswift. If you have received this communication in error, please notify Clearswift by emailing <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:support@...\">support@...</a> quoting the sender and delete the message and any attached documents. Clearswift accepts no liability or responsibility for any onward transmission or use of emails and attachments having left the Clearswift domain.<br/>\n<br/>\nThis footnote confirms that this email message has been swept by MIMEsweeper for Content Security threats, including computer viruses.</div>", 
    "prevInTime": 16172, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1140684389", 
    "canDelete": false, 
    "nextInTopic": 16203, 
    "prevInTopic": 16166, 
    "headers": {
        "messageIdInHeader": "PDZFQUE4QUQ4MkQ3RUJGNDc4Q0NFMjYyRkEzMkM2QzY0MDFCNTc1MUVAR0VNSU5JLkVVUk9QRS5DTEVBUlNXSUZULkNPTT4="
    }
}