{
    "numMessagesInTopic": 32, 
    "nextInTime": 16191, 
    "senderId": "ZVGQRV6WZ4j1F3C0FH1f34x-eLvfD4wH7aB6vjSVSRFMwFVPm0rkvnZxCMmcvP5SinAvCr7Tv3YvMkExiKhmHy88sxOrXg", 
    "systemMessage": true, 
    "subject": "Re: [junit] JUnit Anti-patterns", 
    "from": "Joe Schmetzer &lt;joe@...&gt;", 
    "authorName": "Joe Schmetzer", 
    "msgSnippet": "... Actually, I recently came across the XUnit Test Patterns website at http://xunitpatterns.com/ . Gerard Meszaros uses the term Test Smells , which probably", 
    "msgId": 16190, 
    "profile": "copabella", 
    "topicId": 16150, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 238072118, 
    "messageBody": "<div id=\"ygrps-yiv-959734289\">On Wed, 2006-02-22 at 19:38 -0600, Robert Wenner wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; On Friday 17 February 2006 18:24, Joe Schmetzer wrote:<br/>\n&gt; &gt; I&#39;ve just updated the JUnit Anti-patterns page I maintain at<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.exubero.com/junit/antipatterns.html.\">http://www.exubero.com/junit/antipatterns.html.</a> I&#39;d be interested in<br/>\n&gt; &gt; any feedback, if people want to suggest additions or improvements.<br/>\n&gt; <br/>\n&gt; Hm, some of these items seem to be bad ideas. But anti pattern sounds too <br/>\n&gt; strong for my taste. <br/>\n<br/>\n </span></blockquote>Actually, I recently came across the XUnit Test Patterns website at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://xunitpatterns.com/\">http://xunitpatterns.com/</a> . Gerard Meszaros uses the term &quot;Test Smells&quot;,<br/>\nwhich probably would be more agreeable to you. However, I&#39;m inclined to<br/>\nleave the anti-patterns page at its current location, as it&#39;s getting<br/>\nfairly well known at that spot (not that I couldn&#39;t set up a 203<br/>\nresponse).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Anyhow...<br/>\n&gt; <br/>\n&gt; No unit tests: sounds like saying &quot;you sing wrong because you don&#39;t sing <br/>\n&gt; at all&quot;. If I don&#39;t test, I surley do something wrong, but I am not doing <br/>\n&gt; unit testing wrong.<br/>\n<br/>\n </span></blockquote>You are right, in that it shows a problem with development methodology,<br/>\nand not the tests themselves. That section is meant to have a slightly<br/>\nfacetious tone, and possibly doesn&#39;t belong there (I&#39;ve nearly removed<br/>\nit a number of times). In the end, I liked the point that it was making,<br/>\nbut I probably should consider moving it to a less prominent position.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t like the section heading &quot;Refactoring&quot; because a refactoring is <br/>\n&gt; something different. Your &#39;refactorings&#39; actively change the code and its <br/>\n&gt; behavior, while AFAIK a refactoring in terms of THE book doesn&#39;t do that. <br/>\n&gt; Maybe &#39;fixes&#39; or &#39;solutions&#39; would be better headings?<br/>\n<br/>\n </span></blockquote>You&#39;re right, in that &quot;refactoring&quot; refers to improving internal<br/>\nstructure without changing external behaviour. The anti-patterns page<br/>\nrecommends a number of transformations that are in fact refactoring by<br/>\nthis definition (e.g. catching unexpected exceptions), but it also<br/>\nrecommends a number of changes to existing test behaviour.<br/>\n<br/>\nIn the end, I was basing the headings on the original anti-patterns book<br/>\nby Brown et al, which use the term &quot;Refactored Solution&quot;. Since I<br/>\nskipped over most of the other headings anyway, there probably isn&#39;t<br/>\nmuch reason to dogmatically stick to that particular heading.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Missing assertions may be ok, for example in a test that was written for a <br/>\n&gt; bug report where the code threw but shouldn&#39;t do so. This test can just <br/>\n&gt; have a comment like // This line throws if bug 123 is not fixed.<br/>\n<br/>\n </span></blockquote>True. In this case, it&#39;s more of a smell, along the lines of if there is<br/>\nno assertion, maybe the programmer didn&#39;t understand what they were<br/>\ntrying to test. In your example, it is clear what is happening, but I<br/>\nhave seen many cases of long meandering tests that didn&#39;t contain any<br/>\nasserts. In the end, the test only confirmed that the code didn&#39;t throw<br/>\nexceptions, without making any stronger statements about what the<br/>\nexpected behaviour should have been.<br/>\n<br/>\nI think your example hightlights the importance of context in<br/>\ndetermining if a particular style of programming is problematic or<br/>\nnormal.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also don&#39;t have problems with multiple assertions, if it&#39;s only two or <br/>\n&gt; three. For example I may assert some object to be not null before <br/>\n&gt; asserting its properties.<br/>\n<br/>\n </span></blockquote>Yeah, I agree here. JBR gave a good example that explained the logic<br/>\nhere more clearly.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Superficial coverage: this can happen for TDD beginners, and unless there <br/>\n&gt; is a requirement to check something not on the happy path, I wouldn&#39;t <br/>\n&gt; make this a hard rule. For example, if I write tests that deal with <br/>\n&gt; people&#39;s age (as an integer), I see no problem with not testing negative <br/>\n&gt; values, if the code is used in a context where this is other classes <br/>\n&gt; responsibility.<br/>\n&gt; <br/>\n&gt; An example for the &quot;only easy tests&quot; section would be helpful.<br/>\n&gt; <br/>\n&gt; I agree on the overly complex tests. However, you may not always be able <br/>\n&gt; to just refactor as you&#39;d like.<br/>\n&gt; <br/>\n&gt; You could add time/date and randomness to the external dependencies.<br/>\n </span></blockquote>Nice ones.<br/>\n<br/>\nThanks for your comments.<br/>\n<br/>\nCheers!<br/>\n-- <br/>\nJoe Schmetzer .:. Renaissance Developer .:. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.exubero.com/blog/\">http://www.exubero.com/blog/</a></div>", 
    "prevInTime": 16189, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1140734493", 
    "canDelete": false, 
    "nextInTopic": 16195, 
    "prevInTopic": 16185, 
    "headers": {
        "inReplyToHeader": "PDIwMDYwMjIyMTkzOC4xNjUyOC5yb2JlcnQud2VubmVyQGdteC5kZT4=", 
        "messageIdInHeader": "PDExNDA3MzQ0OTMuMTI2NzMuNzcuY2FtZWxAc2lyaXVzPg==", 
        "referencesHeader": "PGR0NXBnbCs5NTg5QGVHcm91cHMuY29tPgkgPDIwMDYwMjIyMTkzOC4xNjUyOC5yb2JlcnQud2VubmVyQGdteC5kZT4="
    }
}