{
    "numMessagesInTopic": 18, 
    "nextInTime": 1639, 
    "senderId": "GZg0OekWtT-ZcuZQkw4_tlDsubIBeTEWPWNAauPyJeNZHtQSYIBWACvx-QF4MfZKFeIo0bKJundA7Y0pnNHFxlp1Uy2wKzVC", 
    "systemMessage": false, 
    "subject": "Test coverage metrics reporting tool", 
    "from": "John Stetic &lt;johns@...&gt;", 
    "authorName": "John Stetic", 
    "msgSnippet": "Hi, I m trying to put together a test coverage metrics reporting tool, and want to know if anyone has tried doing this yet. (I m sure someone has.)   What I ", 
    "msgId": 1638, 
    "topicId": 1638, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1988818205\">Hi,<br/>\n<br/>\nI&#39;m trying to put together a test coverage metrics reporting tool, and want<br/>\nto know if anyone has tried doing this yet. (I&#39;m sure someone has.)   What I<br/>\nwhat to do is generate a report that shows some stats on how many classes<br/>\nhave test cases and how many methods in the class under test have<br/>\ncorresponding test methods.  I have tried it a few different ways: <br/>\n<br/>\n1. Just scanning through the source folder, picking up the java files and<br/>\nthen checking if a ?Test.java file exists in a corresponding unit test<br/>\nfolder.  <br/>\n<br/>\nThis approach works well if I only cared about the file coverage, but I now<br/>\nwant info on the method coverage.  Enter method 2.  <br/>\n<br/>\n2. Use a tool that will parse through the java source and tell me all the<br/>\nmethods. I used javadoc for this, but the problem with it is that I can only<br/>\nsort through one source structure at a time, and javadoc is not so nice to<br/>\ncall programmatically (it shuts down your app after it runs once).  <br/>\n<br/>\nIf anyone has suggestions on a better was to get info on the methods in a<br/>\nclass, and other information like is the class an interface, I would love to<br/>\nhear it.  Or better yet, if anyone has seen or built a tool similar to what<br/>\nI&#39;m doing I would also love to hear about it.<br/>\n<br/>\nThanks,<br/>\n<br/>\nJohn</div>", 
    "prevInTime": 1637, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "993516613", 
    "canDelete": false, 
    "nextInTopic": 1639, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PEZFNUZGMEIyMTcxMEQ1MTE5MDI5MDA1MDhCQjBDRUQxNjdBREEwQG1haWw+"
    }
}