{
    "numMessagesInTopic": 18, 
    "nextInTime": 16419, 
    "senderId": "v_WsiUjZvH1eHRKj5rRr2VuDpZ8HKMBurgaIJYxCPOgIHV_78ycPCUyZtnYKNhpyAs2TrJ_TxnkHy3LDhUD7Gnc2Hp3dvqxBMiKlnVLFtXFL0eLC", 
    "systemMessage": true, 
    "subject": "Re: [junit] chosing between jmock and easymock for mocks?", 
    "from": "&quot;Joakim Ohlrogge&quot; &lt;joakim.ohlrogge@...&gt;", 
    "authorName": "Joakim Ohlrogge", 
    "msgSnippet": "First to the starter of this thread, check this framework out aswell: rmock.sf.net it is comparable to EasyMock but is nicer in some ways I think (it does not", 
    "msgId": 16418, 
    "profile": "j0hlrogge", 
    "topicId": 16387, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 261856052, 
    "messageBody": "<div id=\"ygrps-yiv-323570765\">First to the starter of this thread, check this framework out aswell: <br/>\nrmock.sf.net it is comparable to EasyMock but is nicer in some ways I<br/>\nthink (it does not have the cool 1.5 stuff that EasyMock does though).<br/>\nI&#39;ll talk more about it below :)<br/>\n<br/>\nTo Joe,<br/>\n<br/>\nI have a lot of respect for you and your opinions and I usually enjoy<br/>\nyour posts and agree with what you write but did you really think this<br/>\none through: (?)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; First, I don&#39;t know why he&#39;s creating a constant for every method he<br/>\n&gt; mocks. If he lives in a world where all literals must be stored in a<br/>\n&gt; constant, that&#39;s not jMock&#39;s fault. That&#39;s called &quot;tyranny&quot; and is bound<br/>\n&gt; to bad for a number of other reasons.<br/>\n<br/>\n </span></blockquote>About keeping all literals constants I coudn&#39;t agree more. But if you<br/>\nneed to use the same method over and over again it kind of bites when<br/>\nyou need to change it doesn&#39;t it? So in a way you could say jMock<br/>\nforces you to do that (or search replace, or not change that many<br/>\nmethods that often, or be really clever when you write your tests).<br/>\n<br/>\nI think jMock tend to bite beginners a bit more than record/replay<br/>\nframeworks such as easyMock. If you are really good at test-driven<br/>\nprogramming, understand interaction based testing fully and know all<br/>\nyour patterns and your OO-principles you will not have a big problem<br/>\nwith jMock, Your test will not have that much setUp-code that the<br/>\n&quot;declarative&quot; nature is a problem.<br/>\n<br/>\nHowever in most projects (if not all) I have been on there have been a<br/>\nfew people that are not (yet) that great at TDD or OO for that matter.<br/>\nVery few have yet seen the light when it comes to interaction based<br/>\ntesting and think that it is used primarily for isolating your system<br/>\nfrom external systems. With that view they will use any mock-framework<br/>\npoorly. They make mistakes and learn from them same as we all have<br/>\ndone. There will be tests with too complicated setup etc, they might<br/>\nnot be your&#39;s but you may have to change them when refactoring<br/>\nsomething else...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Still, there&#39;s a flipside to the whole &quot;can&#39;t generate a method stub&quot;<br/>\n&gt; argument. With EasyMock, if I use a faked or mocked method that doesn&#39;t<br/>\n&gt; yet exist, my test can&#39;t even compile yet!<br/>\n<br/>\n </span></blockquote>Yes but I see that as a good thing, I totally don&#39;t see the problem.<br/>\nYou will have compilation errors if your compiler runs automatically<br/>\nlike in eclipse but that is kind of because it doesn&#39;t compile right?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When I practise TDD, I often<br/>\n&gt; design interfaces, and forcing me to generate a method stub for a method<br/>\n&gt; I might not even like yet is annoying.<br/>\n<br/>\n </span></blockquote>I usually create my interfaces from tests too and I think if anything<br/>\nRMock and Easymock promtes that: ctrl-space, done. If you don&#39;t like<br/>\nthe method at some later öpoint, delete. I don&#39;t see how this can be<br/>\nannoying. You allways have the oportunity not to generate the method<br/>\nif you until you like it and whith rMock and EasyMock you can<br/>\nautomatically refactor it to something you like when you know what you<br/>\nlike, with jmock this is a bit harder IMHO. _I_ personally find it way<br/>\nmore annying to replace all occurences of a method that I decided I<br/>\ndidn&#39;t like at some point later when I know more about the system I&#39;m<br/>\ncoding than I did when I created an interface.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Keeping the methods as strings<br/>\n&gt; allows me to write the test, compile it, and even run it before I decide<br/>\n&gt; whether the interface or method signature is good enough to start<br/>\n&gt; putting into stone.<br/>\n<br/>\n </span></blockquote>What does putting it into stone mean? It is not like you cannot change<br/>\nyour mind once you generated your method-stub and it is not like you<br/>\ncan&#39;t refactor it later (unless you&#39;re using jMock :))<br/>\n<br/>\nAnd what is the point in running it, nothing can possibly call your<br/>\nmocks since the methods do not exist. To me this is like saying using<br/>\nonly reflection instead of calling methods directly is bettter because<br/>\nyou can run the code before it compiles. What am I missing, I don&#39;t<br/>\nsee that any value is lost with EasyMock and rMock in this case.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; As for EasyMock being more readable, EasyMock 1.x certainly wasn&#39;t. It<br/>\n&gt; looks like EasyMock 2.0 gives jMock a run for its money, at least in the<br/>\n&gt; easiest cases. The jury&#39;s out, since I haven&#39;t used it yet.<br/>\n<br/>\n </span></blockquote>I think that is in the eyes of the beholder. Ironically I noticed that<br/>\na lot of people think that EasyMock is more intuitive than jMock and<br/>\nhence more readable until someone explains to them why jMock is more<br/>\nreadable and then they change their mind. So which is better?<br/>\n<br/>\nI think that EasyMock can allow for a bit too much messyness, that is<br/>\nwhy I prefer rMock that is more strict and forces you to express<br/>\nyourself in a certainway rather than providing you with all the<br/>\noptions all the time and leave it up to you to figure out how to use<br/>\nthem.<br/>\n<br/>\nRMock  also looks more like jMock when modifying method-calls which I<br/>\nthink is nice.<br/>\n<br/>\nIf i had to choose between jMock and EasyMock I&#39;m not sure what I<br/>\nwould choose. Given that I used Java 1.5 it would probably be EasyMock<br/>\nbut I don&#39;t know. I have not yet found myself in a project that have<br/>\nno requirements that some parts should run in earlier versions of<br/>\nJava...<br/>\n<br/>\nThrowing rMock into the picture I would pick it for at least the<br/>\nfollowing reasons (except that I am involved in developing it :) ):<br/>\n<br/>\n* Strict workflow, all tests are forcecd to have the same structure.<br/>\n* Sections for structuring and requering order of your tests.<br/>\n* INTERCEPT! I have really started to love this feature, it is extremely useful.<br/>\n* automatical verification, no way around it, you cannot forget<br/>\nverifying your mocks even if you want to<br/>\n* easy asserts for exceptions.<br/>\n* Clear error messages, while I think EasyMock and JMock provide nice<br/>\nerrors rMocks are  IMHO nicer, they give you more context to be able<br/>\nto figure out what went wrong.<br/>\n* assertThat out of the box (I think jMock has this feature aswell)<br/>\n* Custom constraints and actions are easier to write, no StringBuffer<br/>\ngoo to describe your constraints<br/>\n* References, among other thigs allows comparing arrays and describing<br/>\nthem in a readable way. no more [B@565238fa to String messages.<br/>\n* DynamicTestSuites allows you to get better perfomance in your<br/>\nnightly builds but removes the pain of keeping TestSuites in sync.<br/>\n<br/>\nwww.rmock.sf.net check it out!<br/>\n<br/>\nBest Regards!<br/>\n/Joakim Ohlrogge</div>", 
    "prevInTime": 16417, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1143448033", 
    "canDelete": false, 
    "nextInTopic": 16425, 
    "prevInTopic": 16413, 
    "headers": {
        "inReplyToHeader": "PDQ0MjczQTdDLjEwMDA3MDVAcm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PGI5ZWU1ZTQxMDYwMzI3MDAyN3A1NTVmNmFjMXJhMmEwYWNhMDZiMTdkNDQzQG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PGEwM2EyMDkzMDYwMzI0MDc1MG42YWIxYTI3OWc0M2QxOTJhMDZmZmNhMjY1QG1haWwuZ21haWwuY29tPgkgPGI4NmI2YTljMDYwMzI1MjEyNWk0NTgxZmZlNnE0MGFhZDY1YjdhNzAwM2I1QG1haWwuZ29vZ2xlLmNvbT4JIDw0NDI3M0E3Qy4xMDAwNzA1QHJvZ2Vycy5jb20+"
    }
}