{
    "numMessagesInTopic": 18, 
    "nextInTime": 16433, 
    "senderId": "RPySTdSjW_CMIYEHZPYzc4QN9gFtKi43YA3v-h2oZu90YtBZ1e4uWS5IdPqbPZUqB7q2COA8AwXMKG3TA2uKqFY7Gj63iv-pi1762wKU6RtdK_QY", 
    "systemMessage": false, 
    "subject": "Re: [junit] chosing between jmock and easymock for mocks?", 
    "from": "&quot;Joakim Ohlrogge&quot; &lt;joakim.ohlrogge@...&gt;", 
    "authorName": "Joakim Ohlrogge", 
    "msgSnippet": "Thanks for your reply, it cleared some things out for me and in some we just have different experiences, opinions and preferences, I guess.  ... Just to", 
    "msgId": 16432, 
    "profile": "j0hlrogge", 
    "topicId": 16387, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 261856052, 
    "messageBody": "<div id=\"ygrps-yiv-860483649\">Thanks for your reply, it cleared some things out for me and in some<br/>\nwe just have different experiences, opinions and preferences, I guess.<br/>\n<br/>\n&lt;snip&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There is probably no one answer to that question. There is no question<br/>\n&gt; that EasyMock is, well, easier. (It&#39;s in the name after all.) But<br/>\n&gt; readability and refactorability of the code is not the only factor in<br/>\n&gt; determining which is better. I think you&#39;re forgotten that jMock has<br/>\n&gt; more features and flexibility than (at least) EasyMock 1.x. (I could be<br/>\n&gt; wrong, because I haven&#39;t touched EasyMock since early 2004.)<br/>\n<br/>\n </span></blockquote>Just to clarify, I&#39;m not using EasyMock, I&#39;m using rMock the only<br/>\nthing I can compare is a record/play framework to a declare framework<br/>\nsuch as jMock.<br/>\n<br/>\nI have not worked actively with EasyMock enough to have an opinion, I<br/>\nhave read the documentation and looked at the examples, in the 2.0<br/>\nonline documentation it is a bit more emphasized how to extend it but<br/>\nif focuses mainly on the new 1.5 features, in the 2.0 documentation I<br/>\nrecognized more things from jMock in EasyMock but I don&#39;t know if they<br/>\nhave always been there and are just brought more to my attention now.<br/>\nIt is possible that I would like jMock more than EasyMock, i picked<br/>\njMock over EasyMock once upon a time espesially after reading the<br/>\njMock vs EasyMock comparison on the jMock site.<br/>\n<br/>\nAt the moment I am using and developing rMock 2.0. In terms of<br/>\nflexibility and readability I have what I need there, some things are<br/>\nmore flexible than jMock some things are less flexible but imo it is<br/>\natleast as readable.<br/>\n<br/>\nThe featureset and clairity of rMock suits me but that is not a big<br/>\nsurprise since I participate in its development. I espesially like<br/>\nthat all tests tend to have the same structure in rMock (this is<br/>\ndriven by the fact that rMock allows _less_ flexibility in this area<br/>\nthan both Easymock and jMock).<br/>\n<br/>\nOne of the things I do value most with record/play frameworks is the<br/>\nability to ctrl+space your interfaces from your tests. The refactoring<br/>\npart is not _as_ important once the interface has settled a bit but<br/>\nstill nice. I understand your point about the niceness of not having<br/>\nto specify the methods before you have settled on them better after<br/>\nyour last mail,  at least when you are extending existing interfaces<br/>\n(that already have some implementations). I still prefer the ablity to<br/>\ncomplete my methods it has become a natural way to wiork for me, in<br/>\nthis case i think it boils down to personal preferences.<br/>\n<br/>\nAll the best<br/>\n/Joakim Ohlrogge</div>", 
    "prevInTime": 16431, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1143703200", 
    "canDelete": false, 
    "nextInTopic": 16435, 
    "prevInTopic": 16425, 
    "headers": {
        "inReplyToHeader": "PDQ0MkE4MjFFLjkwODA3MDBAcm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PGI5ZWU1ZTQxMDYwMzI5MjMyMG40YjE4ZmZiYm8yMjBiNDY1NjAzOWZkMTlAbWFpbC5nbWFpbC5jb20+", 
        "referencesHeader": "PGEwM2EyMDkzMDYwMzI0MDc1MG42YWIxYTI3OWc0M2QxOTJhMDZmZmNhMjY1QG1haWwuZ21haWwuY29tPgkgPGI4NmI2YTljMDYwMzI1MjEyNWk0NTgxZmZlNnE0MGFhZDY1YjdhNzAwM2I1QG1haWwuZ29vZ2xlLmNvbT4JIDw0NDI3M0E3Qy4xMDAwNzA1QHJvZ2Vycy5jb20+CSA8YjllZTVlNDEwNjAzMjcwMDI3cDU1NWY2YWMxcmEyYTBhY2EwNmIxN2Q0NDNAbWFpbC5nbWFpbC5jb20+CSA8NDQyQTgyMUUuOTA4MDcwMEByb2dlcnMuY29tPg=="
    }
}