{
    "numMessagesInTopic": 18, 
    "nextInTime": 16463, 
    "senderId": "6iAWtp-4F4D0fhSUmf9qUwOHNJMASBcyOzq4_DUiLR7rJ-wpTRVoCkdNzCoa7QMMqjdUQuVGcl5zIxhfKaNuEUUzsC4BaesyFdFmS6k", 
    "systemMessage": false, 
    "subject": "RE: [junit] Re: chosing between jmock and easymock for mocks?", 
    "from": "&quot;Jon Skeet&quot; &lt;jon.skeet@...&gt;", 
    "authorName": "Jon Skeet", 
    "msgSnippet": "... my ... This raises an issue which I don t *think* I ve seen mentioned here. I find that there s a bit of a benefit when writing test code with EasyMock", 
    "msgId": 16462, 
    "profile": "jskeetuk", 
    "topicId": 16387, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 246518675, 
    "messageBody": "<div id=\"ygrps-yiv-849272610\"><blockquote><span title=\"ireply\">&gt; &gt; And there is also the issue of code completion when <br/>\n&gt; &gt; defining expectations. With JMock, it does not work, you <br/>\n&gt; &gt; have to rely on text completion features.<br/>\n&gt; &gt; With EasyMock, it works like a charm.<br/>\n&gt; <br/>\n&gt; I do admit that this is a shortcoming, but I don&#39;t find that annoying <br/>\n&gt; when I use jMock. In fact, in an odd way, if I find I really <br/>\n&gt; want code completion when defining fakes or expectations, then perhaps<br/>\n </span></blockquote>my <br/>\n<blockquote><span title=\"ireply\"> &gt; interface is too complex. :)<br/>\n<br/>\n </span></blockquote>This raises an issue which I don&#39;t *think* I&#39;ve seen mentioned here.<br/>\n<br/>\nI find that there&#39;s a bit of a benefit when writing test code with<br/>\nEasyMock (either version) in that after typing in what I want to be<br/>\ncalled before it exists, I can then ask Eclipse to generate all the<br/>\nmethods for me, in both the interface and the class. The tests really do<br/>\ndrive the code - it&#39;s only when a test requires a method to be present<br/>\nthat it gets put in the interface, because I don&#39;t end up writing the<br/>\ninterface declarations by hand in the first place. (Of course, I add<br/>\ndocumentation and might change the parameter names later, but that&#39;s a<br/>\ndifferent matter.)<br/>\n<br/>\nJust a small benefit, but I thought I&#39;d mention it...<br/>\n<br/>\nJon (a very happy EasyMock user)<br/>\n<br/>\nClearswift monitors, controls and protects all its messaging traffic in compliance with its corporate email policy using Clearswift products.<br/>\nFind out more about Clearswift, its solutions and services at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.clearswift.com\">http://www.clearswift.com</a><br/>\n<br/>\nThis communication is confidential and may contain privileged information intended solely for the named addressee(s). It may not be used or disclosed except for the purpose for which it has been sent. If you are not the intended recipient, you must not copy, distribute or take any action in reliance on it. Unless expressly stated, opinions in this message are those of the individual sender and not of Clearswift. If you have received this communication in error, please notify Clearswift by emailing <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:support@...\">support@...</a> quoting the sender and delete the message and any attached documents. Clearswift accepts no liability or responsibility for any onward transmission or use of emails and attachments having left the Clearswift domain.<br/>\n<br/>\nThis footnote confirms that this email message has been swept by MIMEsweeper for Content Security threats, including computer viruses.</div>", 
    "prevInTime": 16461, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1144654538", 
    "canDelete": false, 
    "nextInTopic": 16472, 
    "prevInTopic": 16438, 
    "headers": {
        "messageIdInHeader": "PEI1MzQyMEMxMkRBMUFFNDNCMUQwMjRFREEwQzQzMjQ2QTVFNzZGQHNjb3JwaW8uRVVST1BFLkNMRUFSU1dJRlQuQ09NPg=="
    }
}