{
    "numMessagesInTopic": 4, 
    "nextInTime": 16593, 
    "senderId": "J-lq827RdhixYUIJXYqWDHxcY5dmf98b-nV5K7IDvd3wjJzv_shU5BEToC3murpGR02E9RoSOCn6gppUKHi38fAXpT2kLady", 
    "systemMessage": true, 
    "subject": "Re: [junit] how to test for compile error?", 
    "from": "Jon Barrilleaux &lt;jonb@...&gt;", 
    "authorName": "Jon Barrilleaux", 
    "msgSnippet": "Its not as trivial as int i = foo .  I have a set of nested classes and interfaces with a somewhat complex inheritance/implementation structure.  They act", 
    "msgId": 16592, 
    "profile": "jonbarril", 
    "topicId": 16574, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 102238185, 
    "messageBody": "<div id=\"ygrps-yiv-2124547980\">Its not as trivial as &#39;int i = &quot;foo&quot;&#39;.  I have a set of nested classes <br/>\nand interfaces with a somewhat complex inheritance/implementation <br/>\nstructure.  They act of &quot;connection&quot; nodes.  The nodes are &quot;typed&quot; for <br/>\nIn and Out, as well as for data, as in In&lt;MyObject&gt;.  I want to make <br/>\nsure that an In can only connect to an Out, that only certain methods <br/>\ncan be called on an In and not an Out, and that a &lt;MyObject&gt; can only <br/>\nconnect to a &lt;? extends MyObject&gt;.  This requires attempting to make a <br/>\nbad connection and then asserting that it results in a compile error. <br/>\nThe neccessity for making such &quot;compiler error&quot; tests is real given that <br/>\nchanges to extension, implementation, and method visibility affect what <br/>\nshould and should not compile and therefore must be tested.  In other <br/>\nwords, whether the problem is static or dynamic, testing is important.<br/>\n<br/>\nIdeally, as with any testing, I&#39;d like to be able to incorporate the <br/>\n&quot;bad&quot; tests right alongside the &quot;good&quot; tests, rather than sticking the <br/>\nbad ones off in some separate file that must be compiled separately. <br/>\nNote also that such an approach means that EACH &quot;bad compile&quot; test <br/>\nstatement must be put into its own file and invoked with javac to see if <br/>\nthe compile failed.<br/>\n<br/>\nAlso, I&#39;d prefer a general solution as opposed to a specific one.  The <br/>\nissue of needing to make compile error (static) tests is a real one, and <br/>\nhas been exacerbated with the introduction of 1.5 generics.<br/>\n<br/>\n--jon<br/>\n<br/>\njason r tibbetts wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; jonbarril wrote:<br/>\n&gt; <br/>\n&gt;&gt;Is there any way to &quot;catch&quot; a compile error for failure assertion?<br/>\n&gt;&gt;<br/>\n&gt;&gt;I have classes whose methods accept specific combinations of generic<br/>\n&gt;&gt;parameter types, and I want to test to make sure that the bad<br/>\n&gt;&gt;combinations truly generate compile errors.  I have not been able to<br/>\n&gt;&gt;figure out an automatic way to test for a compile error as part of my<br/>\n&gt;&gt;JUnit test suite.  Currently, I have to manually uncomment the bad<br/>\n&gt;&gt;code lines to &quot;test&quot; if they are still bad compiles.  Is there a<br/>\n&gt;&gt;better way?<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; If I understand your scenario correctly, you&#39;re testing a feature of the <br/>\n&gt; 1.5 language. That&#39;s like testing whether the statement &#39;int i = &quot;foo&quot;&#39; <br/>\n&gt; will compile. Why must that be tested?<br/>\n&gt; <br/>\n&gt; That said, I suppose that you could rig up a test that calls <br/>\n&gt; java.lang.Runtime.exec(&quot;javac &quot; + filename) on a number of pre-existing <br/>\n&gt; *.java files that will trigger the expected compilation error. You&#39;d <br/>\n&gt; have to examine the Process object that&#39;s returned by exec(), wait for <br/>\n&gt; it to finish, then assert its exit value and/or error and output <br/>\n&gt; streams. I wouldn&#39;t want to be the one who writes that test, though. </span></blockquote></div>", 
    "prevInTime": 16591, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1146241126", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 16582, 
    "headers": {
        "inReplyToHeader": "PDQ0NTIyRDNBLjUwMzAxMDVAdmVyZGkuaWlzZC5zcmEuY29tPg==", 
        "messageIdInHeader": "PDQ0NTI0MDY2LjEwMTA3QGptYmFhaS5jb20+", 
        "referencesHeader": "PGUybGd2Zys2MnBiQGVHcm91cHMuY29tPiA8NDQ1MjJEM0EuNTAzMDEwNUB2ZXJkaS5paXNkLnNyYS5jb20+"
    }
}