{
    "numMessagesInTopic": 12, 
    "nextInTime": 16649, 
    "senderId": "zGbsgZy4PwW47CWB4nI3mxklYTubx5CDXgSUOIgxliNQb2D4Dk8nMXyNpLptcQwBv0wxhcH2FSb_mbiuetwPeF6cXhbAjBUvsUiGn_ow4w", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Another question on assertEquals()", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... So if you re stuck using floating-point numbers, then I go back to my earlier advice. If you also can t add equals() to the class you re testing, then you", 
    "msgId": 16648, 
    "profile": "nails762", 
    "topicId": 16572, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-1956411994\">Anna Skawinska wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; If you have a choice, don&#39;t use float.<br/>\n&gt; <br/>\n&gt;   Thank you guys for your wise advice. Unfortunately, I landed at the<br/>\n&gt; position of &quot;tester&quot; which allows me to request minor changes in code,<br/>\n&gt; but not changing the whole philosophy of project.<br/>\n&gt;   Although I don&#39;t generally do &quot;off-topic&quot; posts.<br/>\n<br/>\n </span></blockquote>So if you&#39;re stuck using floating-point numbers, then I go back to my <br/>\nearlier advice. If you also can&#39;t add equals() to the class you&#39;re <br/>\ntesting, then you are indeed stuck pulling apart the values from each <br/>\nclass and checking them individually. This statement is true whether <br/>\nthey&#39;re floating point or not.<br/>\n<br/>\nI don&#39;t mean to be rude, so please interpret what I&#39;m about to say in <br/>\nthe nicest possible way. I don&#39;t understand why /any/ project would ask <br/>\nnon-coders (or people who can code, but are not allowed to code on the <br/>\nproject, like testers) to test any code with JUnit. That misses the <br/>\nwhole point of what JUnit is for. JUnit is not a testing tool in the <br/>\ntraditional testing sense. Trying to test code with JUnit /almost <br/>\nalways/ results in identifying design problems that impede code-level <br/>\ntesting, and so JUnit is more of a design tool than anything else. If <br/>\nall you want to do is automate external (QA-style) tests, then why are <br/>\nthose tests at the code level? Why aren&#39;t they at the product level <br/>\nusing tools like WinRunner or Silk Performer?<br/>\n<br/>\nAre you in a position and do you have the courage to communicate that <br/>\nkind of message to your project&#39;s manager? or your testing department <br/>\nmanager? If it helps, you have one of the world&#39;s experts on the topic <br/>\ngiving you the information. :) [The people on this list can vouch for me.]<br/>\n<br/>\nGood luck.<br/>\n-- <br/>\nJ. B. (Joe) Rainsberger :: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jbrains.info\">http://www.jbrains.info</a><br/>\nYour guide to software craftsmanship<br/>\nJUnit Recipes: Practical Methods for Programmer Testing<br/>\n2005 Gordon Pask Award for contribution Agile Software Practice</div>", 
    "prevInTime": 16647, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1147348912", 
    "canDelete": false, 
    "nextInTopic": 16649, 
    "prevInTopic": 16646, 
    "headers": {
        "inReplyToHeader": "PGUzdjc3cCs0bGhrQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDQ0NjMyN0IwLjkwMjAyMDhAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PGUzdjc3cCs0bGhrQGVHcm91cHMuY29tPg=="
    }
}