{
    "numMessagesInTopic": 15, 
    "nextInTime": 1669, 
    "senderId": "WSLOKFMEyToyNMZCcZG85EOAn5z2CTxl-zN6hrZR0FFjzVyjHQSFx0ea5mfPwfoAfJsh0FoxJESGXEjnOdM17oKgp-Iz0mAlkF93", 
    "systemMessage": false, 
    "subject": "Re: [junit] How to test EJBs?", 
    "from": "Kevin Mukhar &lt;kmukhar@...&gt;", 
    "authorName": "Kevin Mukhar", 
    "msgSnippet": "... I think you should probably use both local and remote testing. It s probably easier to test a lot of the methods of the EJB by treating the bean ", 
    "msgId": 1667, 
    "topicId": 1631, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-620854941\">John Stetic wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Your post is kind of vague.  You are asking a big question.  We are just<br/>\n&gt; treating EJB like any other classes.  We create the EJB in the set up method<br/>\n&gt; and then delete it in the tear down.  As long as you have the EJB deployed<br/>\n&gt; to a running app server, your off to the races.<br/>\n&gt; <br/>\n&gt; This is really a good topic for discussion.  Anyone else what to share there<br/>\n&gt; experiences with EJB testing?  I have heard allot about Cactus, How does it<br/>\n&gt; fit in to the whole thing?  (Now my post is the vague one &lt;grin&gt;)<br/>\n<br/>\n </span></blockquote>I think you should probably use both local and remote testing. It&#39;s probably<br/>\neasier to test a lot of the methods of the EJB by treating the bean<br/>\nimplentation as a local object, instantiated it and testing those methods.<br/>\nHowever, you also need to test the bean from the client&#39;s point of view. <br/>\n<br/>\nI think there are frameworks that run in the EJB server for testing the EJBs.<br/>\nBut it doesn&#39;t seem to be any more trouble just to create a client in the test<br/>\nclass. With the system I work on, I test my EJB by using the test class as<br/>\nclient that calls the business methods. That is, The test class contains a<br/>\nreference of the remote type, and then in the setup I get the context, do the<br/>\nlookup, and then create the reference to the remote object. Each test method<br/>\ncalls one business method, and I check the results of the method. There may be<br/>\nmultiple test methods for each business method. The teardown method calls the<br/>\nremove() method of the bean. These seems to work pretty well for my<br/>\nenvironment, but we only have about two dozen EJBs in our system.</div>", 
    "prevInTime": 1666, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "993571426", 
    "canDelete": false, 
    "nextInTopic": 1679, 
    "prevInTopic": 1665, 
    "headers": {
        "messageIdInHeader": "PDNCMzhCMjYyLjVCNkMwMDhBQGNvcnAudXNhLm5ldD4=", 
        "referencesHeader": "PEZFNUZGMEIyMTcxMEQ1MTE5MDI5MDA1MDhCQjBDRUQxNjdBREE2QG1haWw+"
    }
}