{
    "numMessagesInTopic": 19, 
    "nextInTime": 16721, 
    "senderId": "KyuMD6UOZbBhMqjq1PDk0gn6m4G1OTlwF_BNqWzkoZu_pzUWX8JawdaxnIcf0xAda0GVLuG-iHM14HsVeAp-pTygLlmpc8XN7jq0ac5GgA", 
    "systemMessage": true, 
    "subject": "JUnit vs. Agitator", 
    "from": "&quot;davek725&quot; &lt;david.kissinger@...&gt;", 
    "authorName": "davek725", 
    "msgSnippet": "My company is currently doing TDD and using JUnit for our unit testing - both persistence testing and business logic testing.  We are now looking at Agitator", 
    "msgId": 16720, 
    "profile": "davek725", 
    "topicId": 16720, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 270226956, 
    "messageBody": "<div id=\"ygrps-yiv-6398630\">My company is currently doing TDD and using JUnit for our unit <br/>\ntesting - both persistence testing and business logic testing.  We <br/>\nare now looking at Agitator and trying to determine if, and how, it <br/>\nfits into our current practices.  I was wondering how others have <br/>\ndecided to use Agitator (or not use it).  Some of the issues we are <br/>\nstruggling with:<br/>\n<br/>\n1.  Agitator looks like it can eliminate the need to write most JUnit <br/>\ntests (except true persistence testing).  The downside is that we <br/>\nwould be left with only Agitator config files that contain our <br/>\nbusiness logic assertions.  This seems like a big leap to take, given <br/>\nthat if Agitar goes away, we have no JUnit.<br/>\n<br/>\n2.  Agitator mocks and factories look easy to create, but look like <br/>\nthey are only useful in the context of Agitator.  I couldn&#39;t use them <br/>\nfor other purposes (e.g. Fitnesse, JUnit).<br/>\n<br/>\n3.  Having my business logic tests in JUnit means they are in an <br/>\nunderstood format and things such as inputs and expected results are <br/>\nclearly visible and grouped with each test.  My impression of <br/>\nAgitator is that this wouldn&#39;t be as clear.</div>", 
    "prevInTime": 16719, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1148655013", 
    "canDelete": false, 
    "nextInTopic": 16728, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGU1NzRqNSt0am1lQGVHcm91cHMuY29tPg=="
    }
}