{
    "numMessagesInTopic": 19, 
    "nextInTime": 16730, 
    "senderId": "UL2rEjlmn8ebn1vulrruSu0qDqKR01K1woawUIsdScIUmicDn_ihCsqceAwG48wC33agjnQ_kJb5xhxeHjvTqLGndiquml9fmXRo-q9tjw", 
    "systemMessage": false, 
    "subject": "Re: [junit] JUnit vs. Agitator", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... I find the notion that Agitator outcomes replace JUnit tests to be at best questionable and at worst troubling. It s steeped in the notion that TDD is", 
    "msgId": 16729, 
    "profile": "nails762", 
    "topicId": 16720, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-2102596838\">davek725 wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; My company is currently doing TDD and using JUnit for our unit<br/>\n&gt; testing - both persistence testing and business logic testing.  We<br/>\n&gt; are now looking at Agitator and trying to determine if, and how, it<br/>\n&gt; fits into our current practices.  I was wondering how others have<br/>\n&gt; decided to use Agitator (or not use it).  Some of the issues we are<br/>\n&gt; struggling with:<br/>\n&gt; <br/>\n&gt; 1.  Agitator looks like it can eliminate the need to write most JUnit<br/>\n&gt; tests (except true persistence testing).  The downside is that we<br/>\n&gt; would be left with only Agitator config files that contain our<br/>\n&gt; business logic assertions.  This seems like a big leap to take, given<br/>\n&gt; that if Agitar goes away, we have no JUnit.<br/>\n&gt; <br/>\n&gt; 2.  Agitator mocks and factories look easy to create, but look like<br/>\n&gt; they are only useful in the context of Agitator.  I couldn&#39;t use them<br/>\n&gt; for other purposes (e.g. Fitnesse, JUnit).<br/>\n&gt; <br/>\n&gt; 3.  Having my business logic tests in JUnit means they are in an<br/>\n&gt; understood format and things such as inputs and expected results are<br/>\n&gt; clearly visible and grouped with each test.  My impression of<br/>\n&gt; Agitator is that this wouldn&#39;t be as clear.<br/>\n<br/>\n </span></blockquote>I find the notion that Agitator outcomes replace JUnit tests to be at <br/>\nbest questionable and at worst troubling. It&#39;s steeped in the notion <br/>\nthat TDD is about testing, and it isn&#39;t.<br/>\n<br/>\nIf your team wants to practice TDD, then it can use Agitator to <br/>\nsupplement help find tests you missed when you were test-driving your <br/>\ncode. As you get better at TDD, you rely on Agitator less, but there <br/>\nwill always be some gap between the tests you need to test-drive your <br/>\ndesign and the tests you need to cover your codebase adequately (say, <br/>\n85%). For top TDD practitioners, that gap is very small, but for people <br/>\nstill learning to write JUnit tests and do TDD, the gap is larger. In <br/>\nthis case, Agitator helps quite a bit.<br/>\n<br/>\nAlso, Agitator can help retrofit tests to legacy code, however it <br/>\n/doesn&#39;t/ help you identify the specific design problems in that code, <br/>\nnor does it motivate you to improve the design. This might or might not <br/>\nconcern your team at this time.<br/>\n<br/>\nOn my next real Java project, I will probably want to use Agitator to <br/>\nhelp me find tests I missed, but not to replace writing any particular <br/>\nJUnit tests. Without those tests, I don&#39;t design well.<br/>\n<br/>\nTake care.<br/>\n-- <br/>\nJ. B. (Joe) Rainsberger :: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jbrains.info\">http://www.jbrains.info</a><br/>\nYour guide to software craftsmanship<br/>\nJUnit Recipes: Practical Methods for Programmer Testing<br/>\n2005 Gordon Pask Award for contribution Agile Software Practice</div>", 
    "prevInTime": 16728, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1148670194", 
    "canDelete": false, 
    "nextInTopic": 16730, 
    "prevInTopic": 16728, 
    "headers": {
        "inReplyToHeader": "PGU1NzRqNSt0am1lQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDQ0Nzc1MEYyLjkwNjAxMDlAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PGU1NzRqNSt0am1lQGVHcm91cHMuY29tPg=="
    }
}