{
    "numMessagesInTopic": 19, 
    "nextInTime": 16737, 
    "senderId": "s1rGQiwyiPmRAD68uFX6JwTWq71HMnpfYVdwhpMQz9HtWOEuM5gbbSc8RZ4li9i2zhaVxGHBf41tTxxxPilj7YiUMI2j2-YB20DTnA", 
    "systemMessage": true, 
    "subject": "Re: JUnit vs. Agitator", 
    "from": "&quot;albsavoia&quot; &lt;albsavoia@...&gt;", 
    "authorName": "albsavoia", 
    "msgSnippet": "As co-founder and CTO of Agitar, I find the JUnit vs. Agitator subject heading very troubling - so I feel compelled to jump in. Agitator *complements* JUnit;", 
    "msgId": 16736, 
    "profile": "albsavoia", 
    "topicId": 16720, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174158319, 
    "messageBody": "<div id=\"ygrps-yiv-1433733120\">As co-founder and CTO of Agitar, I find the &quot;JUnit vs. Agitator&quot;<br/>\nsubject heading very troubling - so I feel compelled to jump in.  <br/>\n<br/>\nAgitator *complements* JUnit; it helps you in performing broad<br/>\nexploratory testing, and in identifying and persisting class and<br/>\nmethod invariants (amount many other things).<br/>\n<br/>\nI am a big fan and proponent of JUnit, and so is Agitar.  As a matter<br/>\nof fact, we brought Kent Beck on board as an Agitar Fellow a couple of<br/>\nyears ago.  I also gave 2 JavaOne presentation on JUnit (not<br/>\nAgitator); one in 2004 and the last one just last week where I<br/>\nco-presented with Kent Beck himself.  Agitator takes full advantage of<br/>\nany existing JUnit tests and our Dashboard product is also fully<br/>\nintegrated with JUnit.<br/>\n<br/>\nSo, don&#39;t think in terms of JUnit vs. Agitator, but in terms of what<br/>\ncan Agitator do to complement my JUnit and TDD efforts.  Of course, I<br/>\nbelieve it can do a lot - but I am hardly an impartial party :-).<br/>\n<br/>\nJUnit is great for TDD which, as some people noted, is more about<br/>\ndesign than testing.  It&#39;s also great for crafting very specific test<br/>\ncases where you can use your intuition and understanding of the domain<br/>\nspace and implementation to cover interesting scenarios and sequences.<br/>\n<br/>\nAgitator is great for exploratory testing, subjecting your code to all<br/>\nsorts of inputs - both valid and invalid - which helps you think about<br/>\ncorner cases and conditions that you might have overlooked. It&#39;s also<br/>\nuniquely capable in discovering and enforcing class and method<br/>\ninvariants (i.e. properties of the code that should *always* be true -<br/>\nas opposed to the more specific cases people typically write in JUnit).<br/>\n<br/>\nBottom line:  Think in terms of JUnit + Agitator and not JUnit vs.<br/>\nAgitator.<br/>\n<br/>\nThanks,<br/>\n<br/>\nAlberto Savoia<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;davek725&quot; &lt;david.kissinger@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My company is currently doing TDD and using JUnit for our unit <br/>\n&gt; testing - both persistence testing and business logic testing.  We <br/>\n&gt; are now looking at Agitator and trying to determine if, and how, it <br/>\n&gt; fits into our current practices.  I was wondering how others have <br/>\n&gt; decided to use Agitator (or not use it).  Some of the issues we are <br/>\n&gt; struggling with:<br/>\n&gt; <br/>\n&gt; 1.  Agitator looks like it can eliminate the need to write most JUnit <br/>\n&gt; tests (except true persistence testing).  The downside is that we <br/>\n&gt; would be left with only Agitator config files that contain our <br/>\n&gt; business logic assertions.  This seems like a big leap to take, given <br/>\n&gt; that if Agitar goes away, we have no JUnit.<br/>\n&gt; <br/>\n&gt; 2.  Agitator mocks and factories look easy to create, but look like <br/>\n&gt; they are only useful in the context of Agitator.  I couldn&#39;t use them <br/>\n&gt; for other purposes (e.g. Fitnesse, JUnit).<br/>\n&gt; <br/>\n&gt; 3.  Having my business logic tests in JUnit means they are in an <br/>\n&gt; understood format and things such as inputs and expected results are <br/>\n&gt; clearly visible and grouped with each test.  My impression of <br/>\n&gt; Agitator is that this wouldn&#39;t be as clear.<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 16735, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1148673021", 
    "canDelete": false, 
    "nextInTopic": 16737, 
    "prevInTopic": 16733, 
    "headers": {
        "inReplyToHeader": "PGU1NzRqNSt0am1lQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGU1N201dCs4YzcwQGVHcm91cHMuY29tPg=="
    }
}