{
    "numMessagesInTopic": 3, 
    "nextInTime": 16733, 
    "senderId": "_1VwFewH38zonrkD8wEltWBETIjXmGqLW3SV2jwrR1g_LYhDem8E9IL3jFG0Zi9EMRcIeKiF90O0NCOm9838c3lM2jQ5YtXj6aC6XBkD8Os", 
    "systemMessage": false, 
    "subject": "Re: [junit] Digest Number 1841", 
    "from": "Robert Martin &lt;UncleBob@...&gt;", 
    "authorName": "Robert Martin", 
    "msgSnippet": "... I ve struggled with this myself.  Agitar has some very cool capabilities, but I can t figure out when I d actually use them.  Oh, I think the code coverage", 
    "msgId": 16732, 
    "rawEmail": "Return-Path: &lt;unclebob@...&gt;\r\nX-Sender: unclebob@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 84846 invoked from network); 27 May 2006 23:44:15 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m27.grp.scd.yahoo.com with QMQP; 27 May 2006 23:44:15 -0000\r\nReceived: from unknown (HELO cliff.objectmentor.com) (67.153.232.124)\n  by mta6.grp.scd.yahoo.com with SMTP; 27 May 2006 23:44:14 -0000\r\nReceived: from [192.168.15.107] (c-67-165-129-251.hsd1.il.comcast.net [::ffff:67.165.129.251])\n  (AUTH: LOGIN robertcmartin, SSL: TLSv1/SSLv3,128bits,RC4-SHA)\n  by cliff.objectmentor.com with esmtp; Sat, 27 May 2006 18:44:12 -0500\r\nMime-Version: 1.0 (Apple Message framework v750)\r\nIn-Reply-To: &lt;1148715912.1233.95698.m19@yahoogroups.com&gt;\r\nReferences: &lt;1148715912.1233.95698.m19@yahoogroups.com&gt;\r\nMessage-Id: &lt;8C5615C0-4304-41CA-9B61-F54BC0489388@...&gt;\r\nDate: Sat, 27 May 2006 18:44:05 -0500\r\nTo: junit@yahoogroups.com\r\nX-Mailer: Apple Mail (2.750)\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: Robert Martin &lt;UncleBob@...&gt;\r\nSubject: Re: [junit] Digest Number 1841\r\nX-Yahoo-Group-Post: member; u=85922638; y=Cqs2N6bihO3qRWaYVy5XCYmXdRKalVl6-CoyvzoflAEjUizV7g\r\nX-Yahoo-Profile: rmartinoma\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\n\r\n\nOn May 27, 2006, at 2:45 AM, junit@yahoogroups.com wrote:\n\n&gt;     From: &quot;davek725&quot; david.kissinger@...\n&gt;     Date: Fri May 26, 2006 9:54am(PDT)\n&gt; Subject: JUnit vs. Agitator\n&gt;\n&gt; My company is currently doing TDD and using JUnit for our unit\n&gt; testing - both persistence testing and business logic testing.  We\n&gt; are now looking at Agitator and trying to determine if, and how, it\n&gt; fits into our current practices.  I was wondering how others have\n&gt; decided to use Agitator (or not use it).  Some of the issues we are\n&gt; struggling with:\n\nI&#39;ve struggled with this myself.  Agitar has some very cool  \ncapabilities, but I can&#39;t figure out when I&#39;d actually use them.  Oh,  \nI think the code coverage reports are useful; though I think clover  \novers more value for money in that regard.  The real problem I have  \nwith Agitar is with the core functionality itself.  I don&#39;t really  \nknow when I&#39;d use the agitation.\n\nThe problems I have experienced, when I have tried to use it, stem  \nfrom the fact that random generation of input data is not a  \nparticularly good way to exercise a function.  Most functions make a  \nsequence of decisions about their input data.  If the random  \nagitation does not offer data in the appropriate syntax, then the  \nagitation simply won&#39;t test more than the outer skin of the function.\n\nTo put this another way, imagine that you are testing the following  \nfunction:\n\npublic boolean isSpecial(String userName);\n\nThis function returns true of the userName matches one of a list of  \n&quot;special&quot; users.  How is Agitar going to observe this functionality  \nunless you build a special factory to create the input values?\n\nAnother kind of function that doesn&#39;t seem to work well for agitation  \nis one that can be called several times and expects a sequence of  \ndata.  Imagine, for example, the function named:\n\n   public boolean compile(character c);\n\nThis function is called, one character at a time, and only returns  \ntrue once a valid line of Java has been entered.  How do you agitate  \nthis?\n\nFunctions like this may seem contrived; but my problem is that when I  \nhave tried to use Agitar (or it&#39;s competitor, JTest) I have  \nconsistently run in to variations on these themes.  That is,  \nfunctions for which the random generation of input data is  \ninsufficient to get very far below the surface.\n\n&gt;\n&gt; 1.  Agitator looks like it can eliminate the need to write most JUnit\n&gt; tests (except true persistence testing).\n\nNO, NO, NO, NO, NO!!!!  First the spirit is wrong.  Second the facts  \nare wrong.\nTDD is not about HAVING tests, it is about WRITING tests.  If you try  \nto generate tests from code, then you might as well not have the  \ntests at all; because all you are doing is creating tests that pass.\n\nThe most major benefit of TDD is that the author writes everything  \ntwice, once as a test and once as production code.\n(see: http://butunclebob.com/ArticleS.UncleBob.TheSensitivityProblem)\n\nYet even if you did not accept this argument, remember that Agitation  \ncan&#39;t see very far below the surface.  So the tests that it creates  \nwould be imperfect at best.\n\nIn the end you get an imperfect representation of what IS, rather  \nthan a separate specification of what you intend.\n\n&gt; The downside is that we\n&gt; would be left with only Agitator config files that contain our\n&gt; business logic assertions.  This seems like a big leap to take, given\n&gt; that if Agitar goes away, we have no JUnit.\n\nJTest provides similar functionality to Agitar, but writes it&#39;s  \nobservations out as JUnit tests.\n\n&gt;\n&gt; 2.  Agitator mocks and factories look easy to create, but look like\n&gt; they are only useful in the context of Agitator.  I couldn&#39;t use them\n&gt; for other purposes (e.g. Fitnesse, JUnit).\n\nAnd again, why would you?  The effort spent on those would be better  \nspent on writing unit tests using true TDD.\n\n&gt;\n&gt; 3.  Having my business logic tests in JUnit means they are in an\n&gt; understood format and things such as inputs and expected results are\n&gt; clearly visible and grouped with each test.  My impression of\n&gt; Agitator is that this wouldn&#39;t be as clear.\n\nCertainly true. This was one of my early complaints about the product  \nbefore I dug beneath the surface.\n\nThe bottom line is that this is a very interesting product that  \nappears to me to be looking for a problem to solve. I&#39;m not at all  \nsure how I would use it to solve any of the problems that my teams  \ncurrently have.  I think the random generation of input data is  \ninteresting, and can be beneficial for simple syntax and validation  \nissues; but Agitar is NOT a replacement for TDD; and NOBODY should  \nthink that the tool can write your unit tests for you.  Remember.  \nTEST FIRST!, not Agitate second.\n\n\n----\nRobert C. Martin (Uncle Bob)  | email: unclebob@...\nObject Mentor Inc.            | blog:  www.butunclebob.com\nThe Agile Transition Experts  | web:   www.objectmentor.com\n800-338-6716                  |\n\n\n\n\n\n\n[Non-text portions of this message have been removed]\n\n\n", 
    "profile": "rmartinoma", 
    "topicId": 16732, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 85922638, 
    "prevInTime": 16731, 
    "contentTrasformed": false, 
    "postDate": "1148773445", 
    "canDelete": false, 
    "nextInTopic": 16747, 
    "prevInTopic": 0, 
    "headers": {
        "inReplyToHeader": "PDExNDg3MTU5MTIuMTIzMy45NTY5OC5tMTlAeWFob29ncm91cHMuY29tPg==", 
        "messageIdInHeader": "PDhDNTYxNUMwLTQzMDQtNDFDQS05QjYxLUY1NEJDMDQ4OTM4OEBvYmplY3RtZW50b3IuY29tPg==", 
        "referencesHeader": "PDExNDg3MTU5MTIuMTIzMy45NTY5OC5tMTlAeWFob29ncm91cHMuY29tPg=="
    }
}