{
    "numMessagesInTopic": 2, 
    "nextInTime": 16745, 
    "senderId": "uKCbebF7SOMK4suhlL_YaEHBm9ZgueXNsGrb0dXpgDFEI25B4kUj7DSqriwKwLSZKjpVujh8Lc1d78OfPIOfP3dBjLqstM7xpRN_9lDQUkN2urDj", 
    "systemMessage": true, 
    "subject": "RE: [junit] Using JUnit in GPL licensed projects", 
    "from": "&quot;Charlie Poole&quot; &lt;charlie@...&gt;", 
    "authorName": "Charlie Poole", 
    "msgSnippet": "Hi Joachim, ... I ve been researching this in trying to select a license for NUnitLite. For a serious opinion, consult an attorney, but here s what I think is", 
    "msgId": 16744, 
    "profile": "cpoole98370", 
    "topicId": 16735, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 212099090, 
    "messageBody": "<div id=\"ygrps-yiv-797033442\">Hi Joachim, <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; how can junit be used in gpl projects? I think it&#39;s not <br/>\n&gt; possible to publish junit based tests of gpl software. <br/>\n&gt; Junit tests cannot be published under gpl because licenses <br/>\n&gt; are incompatible. <br/>\n&gt; Tests that use gpl code have to be published under the gpl. q.e.d.<br/>\n&gt; Has anybody experiences with this topic? Any thoughts?<br/>\n<br/>\n </span></blockquote>I&#39;ve been researching this in trying to select a license for NUnitLite. For<br/>\na serious opinion, consult an attorney, but here&#39;s what I think is true.<br/>\n<br/>\nLicenses need interpretation. What counts first is the interpretation and<br/>\nintent of the person who holds the copyright to the GPLed project. If they<br/>\ndon&#39;t think you&#39;re in violation, they won&#39;t sue you and nobody else has<br/>\nstanding. So one thing to do is to ask the copyright holders if they believe<br/>\npublishing your tests requires licensing the tests. If they say there&#39;s no<br/>\nproblem, then there&#39;s no problem. If they say it is a problem, you have to<br/>\ndecide whether to take the risk based on what you think a court would do.<br/>\n<br/>\nWhat about Junit? Does publishing your tests mean you have to license them<br/>\nunder CPL? Or license them at all? I don&#39;t think so (but IANAL). According<br/>\nto that license, works that are separate modules and not &quot;derivative works&quot;<br/>\nof Junit are not required to use CPL. Do the authors of Junit think that the<br/>\nCPL license provision should apply to your tests? You can ask that question<br/>\nright here.<br/>\n<br/>\nI usually just lurk here, but I responded because I think this is a big<br/>\nissue for the testing community. If we&#39;re in favor of free/open source<br/>\nsoftware, and also in favor of publishing tests, then we need to come to<br/>\nsome understanding that publishing the tests of your application does not<br/>\nput you under any reciprocal obligations to the authors of the test<br/>\nframework you are using.<br/>\n<br/>\nIt seems to me that writing tests is part of the &quot;use&quot; of a test framework<br/>\nand doesn&#39;t amount to the same thing as extending it, say by publishing a<br/>\nSuperJUnit framework that included the original. If I, as a framework<br/>\nauthor, were to sue you for writing and publishing tests that use my<br/>\nframework, I&#39;d look pretty silly.<br/>\n<br/>\nThat said, people need assurances. I think NUnitLite will have a notice that<br/>\nexplains our intention to not inforce any licensing requirements against<br/>\npublished tests, so long as they are only tests of a particular application<br/>\nand not a general-purpose program. Maybe it would be useful if we all did<br/>\nsomething like that.<br/>\n<br/>\nCharlie</div>", 
    "prevInTime": 16743, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1148925849", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 16735, 
    "headers": {
        "inReplyToHeader": "PGU1OTlkYitvYTc0QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDAwMzQwMWM2ODM0YSQ0OTI1ZjI0MCQ2NTAwYThjMEBGRVJSQVJJPg=="
    }
}