{
    "numMessagesInTopic": 19, 
    "nextInTime": 16755, 
    "senderId": "2baxmjyIrNkbOmI6RqJQs3UyeOZxfBdcQZ6mNHk-DVRBvmXMXY8RIadvQ9HPfK15fpMhsymzxY7qx_vUyE7kiarvBBx31XqHFaiWsLe3KQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: JUnit vs. Agitator", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... I do it the same way you do, but rather than check messages, I design exceptions that tell me about the problem with non-text data. The smell with checking", 
    "msgId": 16754, 
    "profile": "nails762", 
    "topicId": 16720, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-230766205\">frogstar wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt; wrote:<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; Now I don&#39;t necessarily agree that checking an exception message is<br/>\n&gt;  &gt; /good design/. I also don&#39;t necessarily agree that having a negative<br/>\n&gt;  &gt; value for &#39;score&#39; is cause for an exception--it depends where the<br/>\n&gt; system<br/>\n&gt;  &gt; boundaries are.<br/>\n&gt; <br/>\n&gt; In this case &quot;points&quot; was the count of JUnit or Agitator assertions --<br/>\n&gt; negative values were non-sensical.<br/>\n&gt; <br/>\n&gt; And I&#39;m not sure checking the exception message in my test is a<br/>\n&gt; question of design at all, but out of curiousity, how do you TDD<br/>\n&gt; throwing an exception?<br/>\n<br/>\n </span></blockquote>I do it the same way you do, but rather than check messages, I design <br/>\nexceptions that tell me about the problem with non-text data. The smell <br/>\nwith checking exception messages is Primitive Obsession: specifically, <br/>\nusing text to represent something meaningful.<br/>\n<br/>\nIf Java had symbols (like Ruby does), then I would be able to have an <br/>\nexception class like OutOfRangeException that takes a symbol, value and <br/>\nacceptable range. Then I could expect this kind of exception:<br/>\n<br/>\n     new OutOfRangeException(:score, -5, Range.POSITIVE)<br/>\n<br/>\nmeaning that the symbol score, at value -5, is out of the range of [0, <br/>\nMAX_INT).<br/>\n<br/>\nSince we don&#39;t have symbols in Java, I would use a string to represent <br/>\nthe variable name. I don&#39;t like it, but I find it better than checking a <br/>\nmessage that can easily change. The concept of &quot;score&quot; in a bowling game <br/>\nclass in unlikely to change name.<br/>\n<br/>\n...and I&#39;m not arguing that a negative score makes sense. I&#39;m merely <br/>\nsaying that without system context, it might or might not make sense for <br/>\nthis class to defend itself against a negative score. It&#39;s possible that <br/>\nin the system in which it will live full time, that situation is never <br/>\ngoing to happen, in which case, someone /else/ (like the module that <br/>\ninvokes this class) should check for such invalid data.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; Finally, I should mention that this is not the kind of design problem I<br/>\n&gt;  &gt; have in mind when I made my admittedly baseless claim. Since it was<br/>\n&gt;  &gt; baseless, I should revise my claim. Here it is:<br/>\n&gt;  &gt;<br/>\n&gt;  &gt;      When I write JUnit tests, I am forced to deal with dependency<br/>\n&gt;  &gt;      problems in my code. I don&#39;t yet have any evidence that Agitator<br/>\n&gt;  &gt;      would help me with that. I am concerned that since Agitator helps<br/>\n&gt;  &gt;      me /not/ write JUnit tests, it might also help me /not/ feel the<br/>\n&gt;  &gt;      pain of those kinds of dependency problems.<br/>\n&gt; <br/>\n&gt; I think it is a reasonable concern but not something to fear in<br/>\n&gt; practice. I don&#39;t think I&#39;ve ever worked with a customer where I<br/>\n&gt; haven&#39;t pointed to the screen and said something about dependency<br/>\n&gt; injection.<br/>\n<br/>\n </span></blockquote>In the hands of a thoughtful practitioner, I believe Agitator to be a <br/>\ngreat thing. I am concerned that less-thoughtful practitioners will use <br/>\nAgitator as an excuse not to write tests. I&#39;ve heard it too many times <br/>\nalready. I should make it clear: that&#39;s not Agitator&#39;s fault. It&#39;s just <br/>\na statement about the product and what it does. Any product, of course, <br/>\ncan be abused.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; fwiw about the only JUnit tests that I haven&#39;t written becuase of<br/>\n&gt; Agitator are the ones I would have written to fix the bugs that would<br/>\n&gt; have otherwise have been reported.  :)<br/>\n<br/>\n </span></blockquote>This is exactly how I expect to use Agitator: to help me find the tests <br/>\nI missed. When the day comes that I&#39;m on a full-time Java project (if <br/>\nthat day ever comes again), I will insist on Agitator.<br/>\n-- <br/>\nJ. B. (Joe) Rainsberger :: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jbrains.info\">http://www.jbrains.info</a><br/>\nYour guide to software craftsmanship<br/>\nJUnit Recipes: Practical Methods for Programmer Testing<br/>\n2005 Gordon Pask Award for contribution Agile Software Practice</div>", 
    "prevInTime": 16753, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1149011389", 
    "canDelete": false, 
    "nextInTopic": 16762, 
    "prevInTopic": 16753, 
    "headers": {
        "inReplyToHeader": "PGU1Z2kwYytoN2FhQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDQ0N0M4NUJELjUwMjAwMDJAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PGU1Z2kwYytoN2FhQGVHcm91cHMuY29tPg=="
    }
}