{
    "numMessagesInTopic": 3, 
    "nextInTime": 16758, 
    "senderId": "wSYdqIrjutewav3Dgtqo0GeM0Srdk-x9KtqWoHJ2Zdn7uFDG_1QZ37ayUw9WSBskOTkhId2WEaedANEZe8vjzlZnPY9cJzmpQEfFKQ", 
    "systemMessage": false, 
    "subject": "JUnit *AND* Agitator", 
    "from": "&quot;albsavoia&quot; &lt;albsavoia@...&gt;", 
    "authorName": "albsavoia", 
    "msgSnippet": "... Hi Bob, I appreciate your participation and opinions on this topic. Questions, discussions, and constructive criticism will help all of us learn more about", 
    "msgId": 16757, 
    "profile": "albsavoia", 
    "topicId": 16732, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174158319, 
    "messageBody": "<div id=\"ygrps-yiv-1216109481\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, Robert Martin &lt;UncleBob@...&gt; wrote:<br/>\n<br/>\n<br/>\n<br/>\nHi Bob,<br/>\n<br/>\nI appreciate your participation and opinions on this topic.<br/>\n<br/>\nQuestions, discussions, and constructive criticism will help all of us<br/>\n learn more about the problems and challenges of testing and how to<br/>\naddress them.<br/>\n<br/>\nSo let me start :-).  I will start not by talking about Agitator, but<br/>\nabout a more general issue: is there a problem with unit testing that<br/>\nneeds solving?<br/>\n<br/>\nYou write:<br/>\n<br/>\n&gt; The bottom line is that this is a very interesting product that  <br/>\n&gt; appears to me to be looking for a problem to solve. <br/>\n<br/>\nI believe that there&#39;s a HUGE and GROWING problem to solve.  My<br/>\nco-founder (Dr. Roongko Doong, another person who is as passionate<br/>\nabout advancing the state-of-the-art in test automation for 15+<br/>\nyears), started Agitar not because we were looking for something to<br/>\ndo, or make a quick buck (quite the contrary, in 2002 when we started<br/>\nAgitar I was Senior Director of Software Engineering at Google - if<br/>\nall I cared about was money I would have stayed put :-)).  We started<br/>\nAgitar to solve what I believe is one of the biggest problems in<br/>\nsoftware development, and one that we are very passionate about:<br/>\ngetting developers to think about and do testing DURING development -<br/>\nso they can address defects and design problems with maximum<br/>\nefficiency and minimum impact.  As opposed to the more traditional <br/>\n&quot;throw the code over the wall to QA&quot; model.<br/>\n<br/>\nMy experience at Google, where with others I championed the<br/>\nintroduction of JUnit and the idea of developer testing was very<br/>\nrevealing.  Admittedly, Google is a way off the chart in terms of<br/>\nprogramming talent, but in the last 4 years I confirmed the very same<br/>\nfindings with 100s of other people and software organizations that<br/>\nalso introduced, or tried to introduce, developer/unit testing:<br/>\n<br/>\nHere are some of the key things I discovered:<br/>\n<br/>\n1) On average, approximately only 30% of developers who are introduced<br/>\nto xUnit/developer-testing/TDD become test-infected (i.e. the will<br/>\ncontinue to do unit testing even if they are not asked to).  The other<br/>\n70% will go back to their &quot;old-ways&quot;.  Why is that?  My next points<br/>\nsheds some light.<br/>\n<br/>\n2) Most developer complained that in order to get decent coverage (say<br/>\n80-90%) they have to write 3-4 lines of JUnit code for every line of<br/>\nJava.  They wanted some way to automate the most mundane parts of the<br/>\ntesting effort and retain control of the areas that require human<br/>\nintelligence, insight, domain-knowledge, and creativity.<br/>\n<br/>\n3) Most of the unit tests that actually get written cover only the<br/>\nnormal/&quot;happy&quot; path.  They assume the best of all possible world; that<br/>\nthey would never be passed bad parameters, that all strings would be<br/>\nnice ASCII code and never exceed some magic length, that all objects<br/>\nwill be well formed and in the state they were expecting, etc. <br/>\nNeedless to say, this is not sufficient for most industrial<br/>\napplications, especially if they have to survive in hostile<br/>\nenvironments where hackers look for every possible deficiency in the<br/>\nsystem, or when your colleagues assume that you are going to handle<br/>\nthose null pointers so he does not have to worry about them. On the<br/>\nother hand, if you want to cover all those contingencies testing<br/>\nbecomes a combinatorial problem and it&#39;s hard for developers to<br/>\nconceive of and test for everything that should be tested for.<br/>\n<br/>\n4) If testing a particular piece of code was too complicated (lots of<br/>\ndependencies, complicated set-up, lots of things to mock, etc.) the<br/>\ntests were skipped.  This is human nature. Ideally people would look<br/>\nat code that&#39;s difficult to test and think re-factoring and (re)design<br/>\nfor testability but most people are not there yet.<br/>\n<br/>\n5) Test maintenance was as time consuming as code maintenance.  If<br/>\nthere&#39;s anything that most developers disliked more than writing lots<br/>\nof test code by hand, was maintaining that code.  One of the most<br/>\ncommon unit test maintenance patterns is: delete or comment-out<br/>\nfailing tests.<br/>\n<br/>\nSo, for someone who believes that developer/unit testing is the right<br/>\nthing to do - one of the MOST important things to do and do WELL - I<br/>\nsaw a VERY big and VERY definite problem.  Namely: Most developers<br/>\nwant and need help with their testing effort.  Without some help and<br/>\nautomation they will either give up on developer/unit testing or, even<br/>\nworse because it gives a false sense of security, write some trivial<br/>\n&quot;happy-path&quot; tests that pass too easily and fail to cover some<br/>\ncritical conditions.  Note that I am not in favor of complete<br/>\nautomation (press a button get some passing tests) unless you need<br/>\nsome quick change detector. I want Agitator to do for software<br/>\ndevelopers what spreadsheets have done for accountants and business<br/>\npeople: raise the level of abstraction, allow the user to focus on the<br/>\nimportant things that require their intelligence and understanding<br/>\n(e.g. formulae in spreadsheets, test data/assertions in Agitator),<br/>\nprovide a number of other related utilities (e.g. graphs in<br/>\nspreadsheets, code coverage and code rules and dashboard reports in<br/>\nAgitator).<br/>\n<br/>\nWe could argue whether Agitator helps with some of the problems (I<br/>\nbelieve it does since it was designed to address them specifically),<br/>\nbut I don&#39;t think we can argue that there is no problem to be solved<br/>\nwhen it comes to developer testing.  Until most developers and<br/>\nsoftware development organizations practice thorough unit testing on a<br/>\nconsistent basis, we have a problem.<br/>\n<br/>\nWithout JUnit we would not be where we are today.  A 30% test<br/>\ninfection rate is a huge step from what it was before (i.e. ~0%).  But<br/>\nI refuse believe that we cannot augment and provide developers with<br/>\nother tools beyond JUnit, and that we are stuck at 30% test infected.<br/>\n<br/>\nThere&#39;s work we all have left to do.<br/>\n<br/>\nPeople like you are helping our common cause doing what you do best<br/>\nand, presumably, like to do best: training, coaching, mentoring,<br/>\neducating, writing, etc.<br/>\n<br/>\nMe?  I am a software tool maker.  That&#39;s what I do best, and that&#39;s<br/>\nwhat I like to do. That&#39;s the best way I can help the cause.  I<br/>\nbelieve that tools are critical to progress, and that the right tools<br/>\nwill enable the right behavior.  Anyone who knows me, or has talked<br/>\nwith me for just a few minutes, knows how passionate I am about<br/>\nsolving this problem (if we agree that there is a problem :-)) and I<br/>\nalso would like to think that in addition to my passion, I bring some<br/>\nunique experience, skills, and vision to the table.<br/>\n<br/>\nBoy, this was a long post.  I apologize.  I will take a break - do<br/>\nsome real work - and address some your other more specific comments a<br/>\nlittle later.<br/>\n<br/>\nAlberto </span></blockquote></div>", 
    "prevInTime": 16756, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1149014602", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 16747, 
    "headers": {
        "inReplyToHeader": "PDhDNTYxNUMwLTQzMDQtNDFDQS05QjYxLUY1NEJDMDQ4OTM4OEBvYmplY3RtZW50b3IuY29tPg==", 
        "messageIdInHeader": "PGU1aTNvYitzNjE1QGVHcm91cHMuY29tPg=="
    }
}