{
    "numMessagesInTopic": 12, 
    "nextInTime": 16777, 
    "senderId": "Tb1I1bqGs3bJq9Ffto8cYONiBBiLtc7OUOK11D8G07Ga6XhiJEYnvyklgG9NbCaVdrBn7YIhTp6-WrSTurQnhL7pHRfWhgFea0auwA", 
    "systemMessage": false, 
    "subject": "Re: Digest Number 1845", 
    "from": "&quot;albsavoia&quot; &lt;albsavoia@...&gt;", 
    "authorName": "albsavoia", 
    "msgSnippet": "... Bob, While I don t agree with you 100% on Test First being THE solution, or THE right approach in ALL cases, I am definitely more in your camp than not. ", 
    "msgId": 16776, 
    "rawEmail": "Return-Path: &lt;albsavoia@...&gt;\r\nX-Sender: albsavoia@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 37109 invoked from network); 31 May 2006 21:16:09 -0000\r\nReceived: from unknown (66.218.67.35)\n  by m34.grp.scd.yahoo.com with QMQP; 31 May 2006 21:16:09 -0000\r\nReceived: from unknown (HELO n23.bullet.scd.yahoo.com) (66.94.237.52)\n  by mta9.grp.scd.yahoo.com with SMTP; 31 May 2006 21:16:09 -0000\r\nComment: DomainKeys? See http://antispam.yahoo.com/domainkeys\r\nReceived: from [66.218.69.5] by n23.bullet.scd.yahoo.com with NNFMP; 31 May 2006 21:15:58 -0000\r\nReceived: from [66.218.66.68] by t5.bullet.scd.yahoo.com with NNFMP; 31 May 2006 21:15:58 -0000\r\nDate: Wed, 31 May 2006 21:15:57 -0000\r\nTo: junit@yahoogroups.com\r\nMessage-ID: &lt;e5l12d+gh0r@...&gt;\r\nIn-Reply-To: &lt;23F28B0F-42AA-4528-94CF-D1ED974EFA50@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: &quot;albsavoia&quot; &lt;albsavoia@...&gt;\r\nSubject: Re: Digest Number 1845\r\nX-Yahoo-Group-Post: member; u=174158319; y=HkdmrATHii5b50Dl_-xmXJtoeECmvlAdZ0PbZ1qAwYMBUw-k\r\nX-Yahoo-Profile: albsavoia\r\n\r\n&gt; I wear a green wrist band that says &quot;Test First&quot;.  It is a symbol of  \n&gt; =\r\nmy commitment to this minmium level of professional ethics.  I WILL  \n&gt; TES=\r\nT MY CODE.\n\nBob,\n\nWhile I don&#39;t agree with you 100% on Test First being THE=\r\n solution, or\nTHE right approach in ALL cases, I am definitely more in your=\r\n camp\nthan not.\n\nWhen Roongko and I were at SunLabs, we headed a research p=\r\nroject\ncalled ADL (Assertion Definition Language) that was close in spirit =\r\nto\ntest first: designers/developers would write the spec for the code\nbefor=\r\ne writing it.  The spec included both syntax (e.g. the method\nsignature) as=\r\n well as semantics (what the method was supposed to do in\nterms of assertio=\r\nns (the A in ADL) - for example: if X &lt; 0 throw\nInvalidArgumentException)).=\r\n\n\nThe spec would serve as a guide for the developers: &quot;I have to write\ncode=\r\n that throws an InvalidArgumentException when X is less than 0&quot;.\n\nThe spec =\r\nwas also used to automatically generate tests that would\nvalidate the speci=\r\nfied behavior (e.g. pass -1 and check to see if the\nInvalidArgumentExceptio=\r\nn is thrown).\n\nNot exactly test first, but the same basic idea: the code wa=\r\ns not\n&quot;done&quot; until the tests (generated directly from the spec therefore\nin=\r\n-sync with the spec) passed.\n\nThe system worked just fine, but there was a =\r\nbig problem.  Most\ndevelopers did not want to write specs first.  Let me be=\r\n more\nspecific: some of them did not want to, others could not do it. Some\n=\r\ndevelopers, including some very good ones, are not wired to think test\nfirs=\r\nt.  They could do it, but they would not be very effective at it -\nlike ask=\r\ning a left-handed person to write with their write hand.\n\nNow, we could fir=\r\ne all people who refuse to, or are not good at test\nfirst, but I don&#39;t thin=\r\nk that will work.  Over the years, and by\nlooking at the way the world work=\r\ns (which I know is far from ideal), I\nhave come to the conclusion that tryi=\r\nng to globally change some\nbehaviors (even when the new behavior is so obvi=\r\nously best for\neveryone (think smoking, eating junk, ..., not writing tests=\r\n before\nwriting your code)) is a noble, but pointless pursuit.  Some people=\r\n\nare going to be easily changed (the test infected ones in our\ndiscussions =\r\n- say ~30%), others might change with some effort and over\ntime - say anoth=\r\ner ~30%, but many are not going to be changed.\n\nLet me attempt a simple ana=\r\nlogy...\n\nWe all know that a bad diet leads to cholesterol and heart-disease=\r\n. \nIdeally all people should clean-up their diet and start exercising\nregul=\r\narly, but we know that&#39;s not going to happen, or happen fast\nenough to save=\r\n some lives.  Cholesterol reducing drugs could be seen\nas an excuse to not =\r\ncontrol diet and exercise (the way you say that\nsome tools could be used by=\r\n developers as an excuse to not write\ntests) but I am sure you would not wi=\r\nthold them from people who are\nnot willing to be virtuous and change their =\r\nways.  The goal is to\nlower cholesterol and for most people the best approa=\r\nch is to clean-up\ntheir diet AND take the drugs.  Over-time they may get of=\r\nf the drugs,\nbut diet and exercise alone are simply not sufficient for a lo=\r\nt of people.\n\nSimilarly, when it comes to developing code I agree with you =\r\n100% that\ndevelopers should take responsibility for unit testing their own =\r\ncode\n(although I don&#39;t feel as strong as you do about test *first*, testing=\r\n\nand testing well is what&#39;s most important to me).\n\nAnd I believe that the =\r\nmost effective way to get developers to test\ntheir code is to give them too=\r\nls (JUnit is one, Agitator is another)\nto make them as efficient and as eff=\r\nective as possible.  To me, the\ndesirable end result is well designed, well=\r\n tested, well understood\ncode using whatever methodology, technology, and t=\r\nools are available\nand work best for the code and the people in question.\n\n=\r\n&gt;My problem is that I just don&#39;t know if the  \n&gt;Agitation features of Agita=\r\nr are really particularly useful.   \n\nI don&#39;t know how to respond to that e=\r\nxcept to, perhaps, schedule a\ncouple of days working *together* on real cod=\r\ne to show you all the\nbenefits that you get from agitation.  For example, d=\r\no you know that\nyou can use Agitator in a test-first way?  Again, we did no=\r\nt wake  up\none morning looking for a problem to solve with our technology. =\r\n I\nbelieve that the core ideas behind agitation are not only useful, but\nin=\r\ndispensable.\n\n&gt; Moreover I fear a tool that can figure out tests for you ma=\r\ny give  \n&gt; developers an excuse not to write their own tests; \n\nAh, you are=\r\n missing one VERY CRITICAL point here.  Unlike other test\nautomation produc=\r\nts, Agitator does not &quot;figure out&quot; tests for you.\nThat&#39;s a key concept behi=\r\nnd the agitation - without developer\nintervention all you could test is tha=\r\nt the code does what the code\ndoes - we don&#39;t do that. Instead, we help you=\r\n analyze the code by\nshowing you how it behaves, but without developer inte=\r\nraction, and\nwithout a developer looking at observations and promoting them=\r\n to\nassertions, or adding their own assertions there are NO TESTS and no\nte=\r\nst points.  Please refer to my spreadsheet analogy in another post -\nthink =\r\nof Agitator as a tool to accelerate, amplify, and add depth to\nyour testing=\r\n effort (even your test-first efforts).\n\n&gt;especially if it  \n&gt; is marketed =\r\nto managers and developers as a way to reduce unit test  \n&gt; writing time.\n\n=\r\nI don&#39;t believe that unit test *writing* *time* is the right thing to\nlook =\r\nat.  Using that time effectively is most important.  Sometimes\nusing JUnit =\r\nis the most effective way to test (e.g. when you have a\nvery specific seque=\r\nnce of operations in mind (as you mention in your\nexamples).  Other times, =\r\nusing Agitator is the most effective way to\ntest (e.g. when you want to spe=\r\ncify and test a class or method\ninvariant with a lot of valid and invalid i=\r\nnputs). \n\nI believe that the most effective use of testing time *must* incl=\r\nude a\ntool like Agitator to help developers think about, discover, analyze,=\r\n\nall the possible behaviors of their code and generate powerful and\nbroad (=\r\ndata-driven) regression tests to complement more specific JUnit\ntests when =\r\nthey exists.\n\nOK, my word-count for the day is up.  I hope that someone oth=\r\ner than\nthe two of us reads these posts (feel free to chime in) otherwise w=\r\ne\nmight as well continue this conversation over a couple of beers :-).\n\nAlb=\r\nerto (Test-first, test-during, test soon after, but please test!)\n\n\n\n\n\n\n\n\n\n=\r\n\n--- In junit@yahoogroups.com, Robert Martin &lt;UncleBob@...&gt; wrote:\n&gt;\n&gt; \n&gt; O=\r\nn May 31, 2006, at 3:15 AM, junit@yahoogroups.com wrote:\n&gt; \n&gt; &gt;    Date: Tu=\r\ne May 30, 2006 11:44 am (PDT)\n&gt; &gt;    From: &quot;albsavoia&quot; albsavoia@...\n&gt; &gt; Su=\r\nbject: JUnit *AND* Agitator\n&gt; &gt;\n&gt; &gt; Hi Bob,\n&gt; &gt;\n&gt; &gt; I appreciate your parti=\r\ncipation and opinions on this topic.\n&gt; \n&gt; Hello Alberto, great to talk with=\r\n you.\n&gt; &gt; Questions, discussions, and constructive criticism will help all =\r\nof us\n&gt; &gt;  learn more about the problems and challenges of testing and how =\r\nto\n&gt; &gt; address them.\n&gt; &gt;\n&gt; &gt; So let me start :-).  I will start not by talk=\r\ning about Agitator, but\n&gt; &gt; about a more general issue: is there a problem =\r\nwith unit testing that\n&gt; &gt; needs solving?\n&gt; &gt;\n&gt; &gt; You write:\n&gt; &gt;\n&gt; &gt;&gt; The b=\r\nottom line is that this is a very interesting product that\n&gt; &gt;&gt; appears to =\r\nme to be looking for a problem to solve.\n&gt; &gt;\n&gt; &gt; I believe that there&#39;s a H=\r\nUGE and GROWING problem to solve.  My\n&gt; &gt; co-founder (Dr. Roongko Doong, an=\r\nother person who is as passionate\n&gt; &gt; about advancing the state-of-the-art =\r\nin test automation for 15+\n&gt; &gt; years), started Agitar not because we were l=\r\nooking for something to\n&gt; &gt; do, or make a quick buck (quite the contrary, i=\r\nn 2002 when we started\n&gt; &gt; Agitar I was Senior Director of Software Enginee=\r\nring at Google - if\n&gt; &gt; all I cared about was money I would have stayed put=\r\n :-)).\n&gt; \n&gt; Let me be clear.  There was an old joke in the &#39;60s about the L=\r\naser  \n&gt; being a solution in search of a problem.  I was making an oblique =\r\n \n&gt; reference to that old joke, and not a snide remark about  \n&gt; commercial=\r\nism.  I think the agitation technology is very cool.  I&#39;m  \n&gt; just wonderin=\r\ng what problem it solves.\n&gt; \n&gt; I agree with you that there is a huge and gr=\r\nowing problem in software  \n&gt; quality, and that test automation is the solu=\r\ntion to that problem.   \n&gt; I&#39;m just perplexed about how Agitar addresses th=\r\nat issue.\n&gt; \n&gt; &gt; We started\n&gt; &gt; Agitar to solve what I believe is one of th=\r\ne biggest problems in\n&gt; &gt; software development, and one that we are very pa=\r\nssionate about:\n&gt; &gt; getting developers to think about and do testing DURING=\r\n development -\n&gt; &gt; so they can address defects and design problems with max=\r\nimum\n&gt; &gt; efficiency and minimum impact.  As opposed to the more traditional=\r\n\n&gt; &gt; &quot;throw the code over the wall to QA&quot; model.\n&gt; \n&gt; I completely agree th=\r\nat the over-the-wall method is broken.  I think  \n&gt; it&#39;s broken for many re=\r\nasons.\n&gt; \n&gt; 1. Tests are done at the end of the schedule when there&#39;s no ti=\r\nme  \n&gt; left (because all the slack has been eaten up by the developers.)\n&gt; =\r\n\n&gt; 2. Manual tests are very costly, time consuming, and error prone;  \n&gt; es=\r\npecially when they come at the end and are under schedule pressure.\n&gt; \n&gt; 3.=\r\n Tests that come at the end are based on the *current* execution of  \n&gt; the=\r\n program rather than on the true requirements.  This is a bizarre  \n&gt; break=\r\n in encapsulation which tends to let the implementation drive  \n&gt; the requi=\r\nrements.\n&gt; \n&gt; &gt; My experience at Google, where with others I championed the=\r\n\n&gt; &gt; introduction of JUnit and the idea of developer testing was very\n&gt; &gt; r=\r\nevealing.  Admittedly, Google is a way off the chart in terms of\n&gt; &gt; progra=\r\nmming talent,\n&gt; \n&gt; And way off the charts in assisting repressive nations.\n=\r\n&gt; \n&gt; &gt; but in the last 4 years I confirmed the very same\n&gt; &gt; findings with =\r\n100s of other people and software organizations that\n&gt; &gt; also introduced, o=\r\nr tried to introduce, developer/unit testing:\n&gt; &gt;\n&gt; &gt; Here are some of the =\r\nkey things I discovered:\n&gt; &gt;\n&gt; &gt; 1) On average, approximately only 30% of d=\r\nevelopers who are introduced\n&gt; &gt; to xUnit/developer-testing/TDD become test=\r\n-infected (i.e. the will\n&gt; &gt; continue to do unit testing even if they are n=\r\not asked to).  The other\n&gt; &gt; 70% will go back to their &quot;old-ways&quot;.  Why is =\r\nthat?  My next points\n&gt; &gt; sheds some light.\n&gt; &gt;\n&gt; &gt; 2) Most developer compl=\r\nained that in order to get decent coverage (say\n&gt; &gt; 80-90%) they have to wr=\r\nite 3-4 lines of JUnit code for every line of\n&gt; &gt; Java.  They wanted some w=\r\nay to automate the most mundane parts of the\n&gt; &gt; testing effort and retain =\r\ncontrol of the areas that require human\n&gt; &gt; intelligence, insight, domain-k=\r\nnowledge, and creativity.\n&gt; &gt;\n&gt; &gt; 3) Most of the unit tests that actually g=\r\net written cover only the\n&gt; &gt; normal/&quot;happy&quot; path.  They assume the best of=\r\n all possible world; that\n&gt; &gt; they would never be passed bad parameters, th=\r\nat all strings would be\n&gt; &gt; nice ASCII code and never exceed some magic len=\r\ngth, that all objects\n&gt; &gt; will be well formed and in the state they were ex=\r\npecting, etc.\n&gt; &gt; Needless to say, this is not sufficient for most industri=\r\nal\n&gt; &gt; applications, especially if they have to survive in hostile\n&gt; &gt; envi=\r\nronments where hackers look for every possible deficiency in the\n&gt; &gt; system=\r\n, or when your colleagues assume that you are going to handle\n&gt; &gt; those nul=\r\nl pointers so he does not have to worry about them. On the\n&gt; &gt; other hand, =\r\nif you want to cover all those contingencies testing\n&gt; &gt; becomes a combinat=\r\norial problem and it&#39;s hard for developers to\n&gt; &gt; conceive of and test for =\r\neverything that should be tested for.\n&gt; &gt;\n&gt; &gt; 4) If testing a particular pi=\r\nece of code was too complicated (lots of\n&gt; &gt; dependencies, complicated set-=\r\nup, lots of things to mock, etc.) the\n&gt; &gt; tests were skipped.  This is huma=\r\nn nature. Ideally people would look\n&gt; &gt; at code that&#39;s difficult to test an=\r\nd think re-factoring and (re)design\n&gt; &gt; for testability but most people are=\r\n not there yet.\n&gt; &gt;\n&gt; &gt; 5) Test maintenance was as time consuming as code m=\r\naintenance.  If\n&gt; &gt; there&#39;s anything that most developers disliked more tha=\r\nn writing lots\n&gt; &gt; of test code by hand, was maintaining that code.  One of=\r\n the most\n&gt; &gt; common unit test maintenance patterns is: delete or comment-o=\r\nut\n&gt; &gt; failing tests.\n&gt; \n&gt; My solution to all these &quot;problems&quot; is to re-edu=\r\ncate the developers  \n&gt; and fire the ones who don&#39;t realize that they can&#39;t=\r\n release untested  \n&gt; code.  This seems to me to be a matter of professiona=\r\nl ethics.  I  \n&gt; have no sympathy for whining software developers who don&#39;t=\r\n want to  \n&gt; write tests.  What they are really whining about is that they =\r\ndon&#39;t  \n&gt; want to be responsible for making their code work.\n&gt; \n&gt; Writing t=\r\nests first (i.e. true TDD) solves most of the problems  \n&gt; mentioned above =\r\nexcept the discipline problem.  Pink slips solve that  \n&gt; problem.  (I&#39;m de=\r\nad serious about this.  You don&#39;t test, you don&#39;t  \n&gt; work. Period.)\n&gt; \n&gt; U=\r\nsing TDD you can&#39;t write production code unless you write a failing  \n&gt; uni=\r\nt test first.  Thus you will get very high coverage (80-90), and  \n&gt; you wo=\r\nn&#39;t write code that&#39;s hard to test, because you write the tests  \n&gt; first.\n=\r\n&gt; \n&gt; Refactoring solves the test maintenance problem.  Tests are not  \n&gt; se=\r\ncond class citizens.  They have to be kept to the same standard of  \n&gt; clea=\r\nnliness and design as production code.  Therefore we refactor  \n&gt; them to k=\r\neep them easy to modify.\n&gt; &gt;\n&gt; &gt; So, for someone who believes that develope=\r\nr/unit testing is the right\n&gt; &gt; thing to do - one of the MOST important thi=\r\nngs to do and do WELL - I\n&gt; &gt; saw a VERY big and VERY definite problem.  Na=\r\nmely: Most developers\n&gt; &gt; want and need help with their testing effort.  Wi=\r\nthout some help and\n&gt; &gt; automation they will either give up on developer/un=\r\nit testing or, even\n&gt; &gt; worse because it gives a false sense of security, w=\r\nrite some trivial\n&gt; &gt; &quot;happy-path&quot; tests that pass too easily and fail to c=\r\nover some\n&gt; &gt; critical conditions.\n&gt; \n&gt; Again, developers who have the atti=\r\ntude that it is OK to give up on  \n&gt; testing need their attitude readjusted=\r\n -- and fast!  I have no  \n&gt; problem with tools to help with this; but the =\r\nfirst problem to solve  \n&gt; is the attitude problem.\n&gt; \n&gt; Also, one of my pr=\r\noblems with the Agitar tool is that it can&#39;t seem  \n&gt; to see very far into =\r\na function.  Therefore the observations it makes  \n&gt; are naive, thus possib=\r\nly reinforcing the &quot;false sense of security&quot;  \n&gt; you talked about.\n&gt; \n&gt; &gt; N=\r\note that I am not in favor of complete\n&gt; &gt; automation (press a button get s=\r\nome passing tests) unless you need\n&gt; &gt; some quick change detector. I want A=\r\ngitator to do for software\n&gt; &gt; developers what spreadsheets have done for a=\r\nccountants and business\n&gt; &gt; people: raise the level of abstraction, allow t=\r\nhe user to focus on the\n&gt; &gt; important things that require their intelligenc=\r\ne and understanding\n&gt; &gt; (e.g. formulae in spreadsheets, test data/assertion=\r\ns in Agitator),\n&gt; &gt; provide a number of other related utilities (e.g. graph=\r\ns in\n&gt; &gt; spreadsheets, code coverage and code rules and dashboard reports i=\r\nn\n&gt; &gt; Agitator).\n&gt; \n&gt; I like the code coverage aspects of Agitar.  Some of =\r\nthe graphs and  \n&gt; charts are very useful.  I have no problems with them at=\r\n all.\n&gt; &gt;\n&gt; &gt; We could argue whether Agitator helps with some of the proble=\r\nms (I\n&gt; &gt; believe it does since it was designed to address them specificall=\r\ny),\n&gt; &gt; but I don&#39;t think we can argue that there is no problem to be solve=\r\nd\n&gt; &gt; when it comes to developer testing.  Until most developers and\n&gt; &gt; so=\r\nftware development organizations practice thorough unit testing on a\n&gt; &gt; co=\r\nnsistent basis, we have a problem.\n&gt; \n&gt; Agreed.  And tool support is import=\r\nant.  Education is even more  \n&gt; important.  There is a minimum level of pr=\r\nofessional ethics involved  \n&gt; here, and every developer needs to learn it.=\r\n\n&gt; \n&gt; I wear a green wrist band that says &quot;Test First&quot;.  It is a symbol of =\r\n \n&gt; my commitment to this minmium level of professional ethics.  I WILL  \n&gt;=\r\n TEST MY CODE.\n&gt; &gt;\n&gt; &gt; Without JUnit we would not be where we are today.  A=\r\n 30% test\n&gt; &gt; infection rate is a huge step from what it was before (i.e. ~=\r\n0%).  But\n&gt; &gt; I refuse believe that we cannot augment and provide developer=\r\ns with\n&gt; &gt; other tools beyond JUnit, and that we are stuck at 30% test infe=\r\ncted.\n&gt; \n&gt; I agree.  And I think JUnit was partially responsible for this. =\r\n  \n&gt; However I also think that the revolution would have happened without  =\r\n\n&gt; the tool -- causing the tool to be written anyway.\n&gt; &gt;\n&gt; &gt; There&#39;s work =\r\nwe all have left to do.\n&gt; &gt;\n&gt; &gt; People like you are helping our common caus=\r\ne doing what you do best\n&gt; &gt; and, presumably, like to do best: training, co=\r\naching, mentoring,\n&gt; &gt; educating, writing, etc.\n&gt; &gt;\n&gt; &gt; Me?  I am a softwar=\r\ne tool maker.  That&#39;s what I do best, and that&#39;s\n&gt; &gt; what I like to do. Tha=\r\nt&#39;s the best way I can help the cause.  I\n&gt; &gt; believe that tools are critic=\r\nal to progress, and that the right tools\n&gt; &gt; will enable the right behavior=\r\n.  Anyone who knows me, or has talked\n&gt; &gt; with me for just a few minutes, k=\r\nnows how passionate I am about\n&gt; &gt; solving this problem (if we agree that t=\r\nhere is a problem :-)) and I\n&gt; &gt; also would like to think that in addition =\r\nto my passion, I bring some\n&gt; &gt; unique experience, skills, and vision to th=\r\ne table.\n&gt; \n&gt; And I appreciate that!  I think we need more and better tools=\r\n for  \n&gt; software development.  My problem is that I just don&#39;t know if the=\r\n  \n&gt; Agitation features of Agitar are really particularly useful.   \n&gt; More=\r\nover I fear a tool that can figure out tests for you may give  \n&gt; developer=\r\ns an excuse not to write their own tests; especially if it  \n&gt; is marketed =\r\nto managers and developers as a way to reduce unit test  \n&gt; writing time.\n&gt;=\r\n \n&gt; \n&gt; ----\n&gt; Robert C. Martin (Uncle Bob)  | email: unclebob@...\n&gt; Object =\r\nMentor Inc.            | blog:  www.butunclebob.com\n&gt; The Agile Transition =\r\nExperts  | web:   www.objectmentor.com\n&gt; 800-338-6716                  |\n&gt; =\r\n\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; [Non-text portions of this message have been removed]\n&gt;\n\n=\r\n\n\n\n", 
    "profile": "albsavoia", 
    "topicId": 16772, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174158319, 
    "prevInTime": 16775, 
    "contentTrasformed": false, 
    "postDate": "1149110157", 
    "canDelete": false, 
    "nextInTopic": 16777, 
    "prevInTopic": 16775, 
    "headers": {
        "inReplyToHeader": "PDIzRjI4QjBGLTQyQUEtNDUyOC05NENGLUQxRUQ5NzRFRkE1MEBvYmplY3RtZW50b3IuY29tPg==", 
        "messageIdInHeader": "PGU1bDEyZCtnaDByQGVHcm91cHMuY29tPg=="
    }
}