{
    "numMessagesInTopic": 12, 
    "nextInTime": 16778, 
    "senderId": "61s7uTgGB-L-zHeoTOoS4jZGKxCjiXyMzDgoW7ckDOIN684q7jUB8fmCjo5_cTt4Aqyiouxpfxp_CQOvBkO95tbiypb-PtWBYRhsnpuAgE_1guvA2LfFOV0m3V5nZ25d451KZJI", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Digest Number 1845", 
    "from": "&quot;=?UTF-8?Q?C=C3=A9dric_Beust_=E2=99=94_?=&quot; &lt;cbeust@...&gt;", 
    "authorName": "Cédric Beust ♔", 
    "msgSnippet": "Hi Alberto, good to see you again, ... I agree.  TDD is a powerful tool, but not as much as simple testing .  If a developer prefers to write code first and", 
    "msgId": 16777, 
    "profile": "cbeust", 
    "topicId": 16772, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 199443513, 
    "messageBody": "<div id=\"ygrps-yiv-588364804\">Hi Alberto, good to see you again,<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 5/31/06, albsavoia &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:albsavoia@...\">albsavoia@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt; I wear a green wrist band that says &quot;Test First&quot;.  It is a symbol of<br/>\n&gt; &gt; my commitment to this minmium level of professional ethics.  I WILL<br/>\n&gt; &gt; TEST MY CODE.<br/>\n&gt;<br/>\n&gt; Bob,<br/>\n&gt;<br/>\n&gt; While I don&#39;t agree with you 100% on Test First being THE solution, or<br/>\n&gt; THE right approach in ALL cases, I am definitely more in your camp<br/>\n&gt; than not.<br/>\n<br/>\n<br/>\nI agree.  TDD is a powerful tool, but not as much as &quot;simple testing&quot;.  If a<br/>\ndeveloper prefers to write code first and tests then, that&#39;s perfectly fine<br/>\nwith me.  The important point here is that this developer needs to agree<br/>\nthat writing tests is part of her job.  At least to a certain extent.<br/>\n<br/>\nWhen Roongko and I were at SunLabs, we headed a research project<br/>\n&gt; called ADL (Assertion Definition Language) that was close in spirit to<br/>\n&gt; test first: designers/developers would write the spec for the code<br/>\n&gt; before writing it.  The spec included both syntax (e.g. the method<br/>\n&gt; signature) as well as semantics (what the method was supposed to do in<br/>\n&gt; terms of assertions (the A in ADL) - for example: if X &lt; 0 throw<br/>\n&gt; InvalidArgumentException)).<br/>\n<br/>\n<br/>\nI am not a big fan of design by contract (DBC) for the simple reason that it<br/>\nis just not applicable in the real world, and if you look around, the only<br/>\nillustrations of DBC that you see are for Money, BankAccount or Bowling<br/>\nprograms.<br/>\n<br/>\nWhen you start solving real problems, this kind of assertions is either<br/>\nsuper simple, and you can just use assertions in your code, or too<br/>\ncomplicated to express with a DSL and you&#39;re then better off writing a test<br/>\nfor it.  DBC sits in-between these two worlds and has never caught on for<br/>\nthat reason.<br/>\n<br/>\nMore details here &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jroller.com/page/cbeust/20021213\">http://www.jroller.com/page/cbeust/20021213</a>&gt; (I wrote<br/>\nthis four years ago, but my points still stand).<br/>\n<br/>\nSome developers, including some very good ones, are not wired to think test<br/>\n&gt; first.  They could do it, but they would not be very effective at it -<br/>\n&gt; like asking a left-handed person to write with their write hand.<br/>\n<br/>\n<br/>\nGood point.  Another reason is that there are many situations where TDD is<br/>\nsimply not feasible. I&#39;ve come across enough of these scenarios these past<br/>\nyears to start looking at TDD as something that is only *sometimes* useful.<br/>\nIf you&#39;re in a situation where you can use TDD, then by all means, go ahead<br/>\nand do it:  I certainly know how good it makes you feel.  But keep in mind<br/>\nyou&#39;re lucky in the same way that somebody who can use Java to get their job<br/>\ndone is more lucky than someone forced to use COBOL :-)<br/>\n<br/>\nAgain, it&#39;s a matter of philosophy.  If all the developers on your team<br/>\nstrongly feel that writing tests is part of their job, you will obtain<br/>\nsoftware of equal quality as you would from a team of TDD nuts.<br/>\n<br/>\n-- <br/>\nCédric<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 16776, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1149111358", 
    "canDelete": false, 
    "nextInTopic": 16778, 
    "prevInTopic": 16776, 
    "headers": {
        "inReplyToHeader": "PGU1bDEyZCtnaDByQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGI4NmI2YTljMDYwNTMxMTQzNWk2MzU5ZWUyYmljZDJiODE1ZmNkMmZkOTZlQG1haWwuZ29vZ2xlLmNvbT4=", 
        "referencesHeader": "PDIzRjI4QjBGLTQyQUEtNDUyOC05NENGLUQxRUQ5NzRFRkE1MEBvYmplY3RtZW50b3IuY29tPgkgPGU1bDEyZCtnaDByQGVHcm91cHMuY29tPg=="
    }
}