{
    "numMessagesInTopic": 12, 
    "nextInTime": 16777, 
    "senderId": "Y0h5ZwC_FULisoZ_VknG_utsPyeaAhf_nz26fbiz8F2a4gH88XZFKiHFRrB9vUn4ZtEmHtLJGBGpdpzXFaCvGytuBRUlHtSak8O_Wg", 
    "systemMessage": false, 
    "subject": "Re: Digest Number 1845", 
    "from": "&quot;albsavoia&quot; &lt;albsavoia@...&gt;", 
    "authorName": "albsavoia", 
    "msgSnippet": "... Bob, While I don t agree with you 100% on Test First being THE solution, or THE right approach in ALL cases, I am definitely more in your camp than not. ", 
    "msgId": 16776, 
    "profile": "albsavoia", 
    "topicId": 16772, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174158319, 
    "messageBody": "<div id=\"ygrps-yiv-1093229511\"><blockquote><span title=\"ireply\">&gt; I wear a green wrist band that says &quot;Test First&quot;.  It is a symbol of  <br/>\n&gt; my commitment to this minmium level of professional ethics.  I WILL  <br/>\n&gt; TEST MY CODE.<br/>\n<br/>\n </span></blockquote>Bob,<br/>\n<br/>\nWhile I don&#39;t agree with you 100% on Test First being THE solution, or<br/>\nTHE right approach in ALL cases, I am definitely more in your camp<br/>\nthan not.<br/>\n<br/>\nWhen Roongko and I were at SunLabs, we headed a research project<br/>\ncalled ADL (Assertion Definition Language) that was close in spirit to<br/>\ntest first: designers/developers would write the spec for the code<br/>\nbefore writing it.  The spec included both syntax (e.g. the method<br/>\nsignature) as well as semantics (what the method was supposed to do in<br/>\nterms of assertions (the A in ADL) - for example: if X &lt; 0 throw<br/>\nInvalidArgumentException)).<br/>\n<br/>\nThe spec would serve as a guide for the developers: &quot;I have to write<br/>\ncode that throws an InvalidArgumentException when X is less than 0&quot;.<br/>\n<br/>\nThe spec was also used to automatically generate tests that would<br/>\nvalidate the specified behavior (e.g. pass -1 and check to see if the<br/>\nInvalidArgumentException is thrown).<br/>\n<br/>\nNot exactly test first, but the same basic idea: the code was not<br/>\n&quot;done&quot; until the tests (generated directly from the spec therefore<br/>\nin-sync with the spec) passed.<br/>\n<br/>\nThe system worked just fine, but there was a big problem.  Most<br/>\ndevelopers did not want to write specs first.  Let me be more<br/>\nspecific: some of them did not want to, others could not do it. Some<br/>\ndevelopers, including some very good ones, are not wired to think test<br/>\nfirst.  They could do it, but they would not be very effective at it -<br/>\nlike asking a left-handed person to write with their write hand.<br/>\n<br/>\nNow, we could fire all people who refuse to, or are not good at test<br/>\nfirst, but I don&#39;t think that will work.  Over the years, and by<br/>\nlooking at the way the world works (which I know is far from ideal), I<br/>\nhave come to the conclusion that trying to globally change some<br/>\nbehaviors (even when the new behavior is so obviously best for<br/>\neveryone (think smoking, eating junk, ..., not writing tests before<br/>\nwriting your code)) is a noble, but pointless pursuit.  Some people<br/>\nare going to be easily changed (the test infected ones in our<br/>\ndiscussions - say ~30%), others might change with some effort and over<br/>\ntime - say another ~30%, but many are not going to be changed.<br/>\n<br/>\nLet me attempt a simple analogy...<br/>\n<br/>\nWe all know that a bad diet leads to cholesterol and heart-disease. <br/>\nIdeally all people should clean-up their diet and start exercising<br/>\nregularly, but we know that&#39;s not going to happen, or happen fast<br/>\nenough to save some lives.  Cholesterol reducing drugs could be seen<br/>\nas an excuse to not control diet and exercise (the way you say that<br/>\nsome tools could be used by developers as an excuse to not write<br/>\ntests) but I am sure you would not withold them from people who are<br/>\nnot willing to be virtuous and change their ways.  The goal is to<br/>\nlower cholesterol and for most people the best approach is to clean-up<br/>\ntheir diet AND take the drugs.  Over-time they may get off the drugs,<br/>\nbut diet and exercise alone are simply not sufficient for a lot of people.<br/>\n<br/>\nSimilarly, when it comes to developing code I agree with you 100% that<br/>\ndevelopers should take responsibility for unit testing their own code<br/>\n(although I don&#39;t feel as strong as you do about test *first*, testing<br/>\nand testing well is what&#39;s most important to me).<br/>\n<br/>\nAnd I believe that the most effective way to get developers to test<br/>\ntheir code is to give them tools (JUnit is one, Agitator is another)<br/>\nto make them as efficient and as effective as possible.  To me, the<br/>\ndesirable end result is well designed, well tested, well understood<br/>\ncode using whatever methodology, technology, and tools are available<br/>\nand work best for the code and the people in question.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;My problem is that I just don&#39;t know if the  <br/>\n&gt;Agitation features of Agitar are really particularly useful.   <br/>\n<br/>\n </span></blockquote>I don&#39;t know how to respond to that except to, perhaps, schedule a<br/>\ncouple of days working *together* on real code to show you all the<br/>\nbenefits that you get from agitation.  For example, do you know that<br/>\nyou can use Agitator in a test-first way?  Again, we did not wake  up<br/>\none morning looking for a problem to solve with our technology.  I<br/>\nbelieve that the core ideas behind agitation are not only useful, but<br/>\nindispensable.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Moreover I fear a tool that can figure out tests for you may give  <br/>\n&gt; developers an excuse not to write their own tests; <br/>\n<br/>\n </span></blockquote>Ah, you are missing one VERY CRITICAL point here.  Unlike other test<br/>\nautomation products, Agitator does not &quot;figure out&quot; tests for you.<br/>\nThat&#39;s a key concept behind the agitation - without developer<br/>\nintervention all you could test is that the code does what the code<br/>\ndoes - we don&#39;t do that. Instead, we help you analyze the code by<br/>\nshowing you how it behaves, but without developer interaction, and<br/>\nwithout a developer looking at observations and promoting them to<br/>\nassertions, or adding their own assertions there are NO TESTS and no<br/>\ntest points.  Please refer to my spreadsheet analogy in another post -<br/>\nthink of Agitator as a tool to accelerate, amplify, and add depth to<br/>\nyour testing effort (even your test-first efforts).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;especially if it  <br/>\n&gt; is marketed to managers and developers as a way to reduce unit test  <br/>\n&gt; writing time.<br/>\n<br/>\n </span></blockquote>I don&#39;t believe that unit test *writing* *time* is the right thing to<br/>\nlook at.  Using that time effectively is most important.  Sometimes<br/>\nusing JUnit is the most effective way to test (e.g. when you have a<br/>\nvery specific sequence of operations in mind (as you mention in your<br/>\nexamples).  Other times, using Agitator is the most effective way to<br/>\ntest (e.g. when you want to specify and test a class or method<br/>\ninvariant with a lot of valid and invalid inputs). <br/>\n<br/>\nI believe that the most effective use of testing time *must* include a<br/>\ntool like Agitator to help developers think about, discover, analyze,<br/>\nall the possible behaviors of their code and generate powerful and<br/>\nbroad (data-driven) regression tests to complement more specific JUnit<br/>\ntests when they exists.<br/>\n<br/>\nOK, my word-count for the day is up.  I hope that someone other than<br/>\nthe two of us reads these posts (feel free to chime in) otherwise we<br/>\nmight as well continue this conversation over a couple of beers :-).<br/>\n<br/>\nAlberto (Test-first, test-during, test soon after, but please test!)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, Robert Martin &lt;UncleBob@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; On May 31, 2006, at 3:15 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> wrote:<br/>\n&gt; <br/>\n&gt; &gt;    Date: Tue May 30, 2006 11:44 am (PDT)<br/>\n&gt; &gt;    From: &quot;albsavoia&quot; albsavoia@...<br/>\n&gt; &gt; Subject: JUnit *AND* Agitator<br/>\n&gt; &gt;<br/>\n&gt; &gt; Hi Bob,<br/>\n&gt; &gt;<br/>\n&gt; &gt; I appreciate your participation and opinions on this topic.<br/>\n&gt; <br/>\n&gt; Hello Alberto, great to talk with you.<br/>\n&gt; &gt; Questions, discussions, and constructive criticism will help all of us<br/>\n&gt; &gt;  learn more about the problems and challenges of testing and how to<br/>\n&gt; &gt; address them.<br/>\n&gt; &gt;<br/>\n&gt; &gt; So let me start :-).  I will start not by talking about Agitator, but<br/>\n&gt; &gt; about a more general issue: is there a problem with unit testing that<br/>\n&gt; &gt; needs solving?<br/>\n&gt; &gt;<br/>\n&gt; &gt; You write:<br/>\n&gt; &gt;<br/>\n&gt; &gt;&gt; The bottom line is that this is a very interesting product that<br/>\n&gt; &gt;&gt; appears to me to be looking for a problem to solve.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I believe that there&#39;s a HUGE and GROWING problem to solve.  My<br/>\n&gt; &gt; co-founder (Dr. Roongko Doong, another person who is as passionate<br/>\n&gt; &gt; about advancing the state-of-the-art in test automation for 15+<br/>\n&gt; &gt; years), started Agitar not because we were looking for something to<br/>\n&gt; &gt; do, or make a quick buck (quite the contrary, in 2002 when we started<br/>\n&gt; &gt; Agitar I was Senior Director of Software Engineering at Google - if<br/>\n&gt; &gt; all I cared about was money I would have stayed put :-)).<br/>\n&gt; <br/>\n&gt; Let me be clear.  There was an old joke in the &#39;60s about the Laser  <br/>\n&gt; being a solution in search of a problem.  I was making an oblique  <br/>\n&gt; reference to that old joke, and not a snide remark about  <br/>\n&gt; commercialism.  I think the agitation technology is very cool.  I&#39;m  <br/>\n&gt; just wondering what problem it solves.<br/>\n&gt; <br/>\n&gt; I agree with you that there is a huge and growing problem in software  <br/>\n&gt; quality, and that test automation is the solution to that problem.   <br/>\n&gt; I&#39;m just perplexed about how Agitar addresses that issue.<br/>\n&gt; <br/>\n&gt; &gt; We started<br/>\n&gt; &gt; Agitar to solve what I believe is one of the biggest problems in<br/>\n&gt; &gt; software development, and one that we are very passionate about:<br/>\n&gt; &gt; getting developers to think about and do testing DURING development -<br/>\n&gt; &gt; so they can address defects and design problems with maximum<br/>\n&gt; &gt; efficiency and minimum impact.  As opposed to the more traditional<br/>\n&gt; &gt; &quot;throw the code over the wall to QA&quot; model.<br/>\n&gt; <br/>\n&gt; I completely agree that the over-the-wall method is broken.  I think  <br/>\n&gt; it&#39;s broken for many reasons.<br/>\n&gt; <br/>\n&gt; 1. Tests are done at the end of the schedule when there&#39;s no time  <br/>\n&gt; left (because all the slack has been eaten up by the developers.)<br/>\n&gt; <br/>\n&gt; 2. Manual tests are very costly, time consuming, and error prone;  <br/>\n&gt; especially when they come at the end and are under schedule pressure.<br/>\n&gt; <br/>\n&gt; 3. Tests that come at the end are based on the *current* execution of  <br/>\n&gt; the program rather than on the true requirements.  This is a bizarre  <br/>\n&gt; break in encapsulation which tends to let the implementation drive  <br/>\n&gt; the requirements.<br/>\n&gt; <br/>\n&gt; &gt; My experience at Google, where with others I championed the<br/>\n&gt; &gt; introduction of JUnit and the idea of developer testing was very<br/>\n&gt; &gt; revealing.  Admittedly, Google is a way off the chart in terms of<br/>\n&gt; &gt; programming talent,<br/>\n&gt; <br/>\n&gt; And way off the charts in assisting repressive nations.<br/>\n&gt; <br/>\n&gt; &gt; but in the last 4 years I confirmed the very same<br/>\n&gt; &gt; findings with 100s of other people and software organizations that<br/>\n&gt; &gt; also introduced, or tried to introduce, developer/unit testing:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Here are some of the key things I discovered:<br/>\n&gt; &gt;<br/>\n&gt; &gt; 1) On average, approximately only 30% of developers who are introduced<br/>\n&gt; &gt; to xUnit/developer-testing/TDD become test-infected (i.e. the will<br/>\n&gt; &gt; continue to do unit testing even if they are not asked to).  The other<br/>\n&gt; &gt; 70% will go back to their &quot;old-ways&quot;.  Why is that?  My next points<br/>\n&gt; &gt; sheds some light.<br/>\n&gt; &gt;<br/>\n&gt; &gt; 2) Most developer complained that in order to get decent coverage (say<br/>\n&gt; &gt; 80-90%) they have to write 3-4 lines of JUnit code for every line of<br/>\n&gt; &gt; Java.  They wanted some way to automate the most mundane parts of the<br/>\n&gt; &gt; testing effort and retain control of the areas that require human<br/>\n&gt; &gt; intelligence, insight, domain-knowledge, and creativity.<br/>\n&gt; &gt;<br/>\n&gt; &gt; 3) Most of the unit tests that actually get written cover only the<br/>\n&gt; &gt; normal/&quot;happy&quot; path.  They assume the best of all possible world; that<br/>\n&gt; &gt; they would never be passed bad parameters, that all strings would be<br/>\n&gt; &gt; nice ASCII code and never exceed some magic length, that all objects<br/>\n&gt; &gt; will be well formed and in the state they were expecting, etc.<br/>\n&gt; &gt; Needless to say, this is not sufficient for most industrial<br/>\n&gt; &gt; applications, especially if they have to survive in hostile<br/>\n&gt; &gt; environments where hackers look for every possible deficiency in the<br/>\n&gt; &gt; system, or when your colleagues assume that you are going to handle<br/>\n&gt; &gt; those null pointers so he does not have to worry about them. On the<br/>\n&gt; &gt; other hand, if you want to cover all those contingencies testing<br/>\n&gt; &gt; becomes a combinatorial problem and it&#39;s hard for developers to<br/>\n&gt; &gt; conceive of and test for everything that should be tested for.<br/>\n&gt; &gt;<br/>\n&gt; &gt; 4) If testing a particular piece of code was too complicated (lots of<br/>\n&gt; &gt; dependencies, complicated set-up, lots of things to mock, etc.) the<br/>\n&gt; &gt; tests were skipped.  This is human nature. Ideally people would look<br/>\n&gt; &gt; at code that&#39;s difficult to test and think re-factoring and (re)design<br/>\n&gt; &gt; for testability but most people are not there yet.<br/>\n&gt; &gt;<br/>\n&gt; &gt; 5) Test maintenance was as time consuming as code maintenance.  If<br/>\n&gt; &gt; there&#39;s anything that most developers disliked more than writing lots<br/>\n&gt; &gt; of test code by hand, was maintaining that code.  One of the most<br/>\n&gt; &gt; common unit test maintenance patterns is: delete or comment-out<br/>\n&gt; &gt; failing tests.<br/>\n&gt; <br/>\n&gt; My solution to all these &quot;problems&quot; is to re-educate the developers  <br/>\n&gt; and fire the ones who don&#39;t realize that they can&#39;t release untested  <br/>\n&gt; code.  This seems to me to be a matter of professional ethics.  I  <br/>\n&gt; have no sympathy for whining software developers who don&#39;t want to  <br/>\n&gt; write tests.  What they are really whining about is that they don&#39;t  <br/>\n&gt; want to be responsible for making their code work.<br/>\n&gt; <br/>\n&gt; Writing tests first (i.e. true TDD) solves most of the problems  <br/>\n&gt; mentioned above except the discipline problem.  Pink slips solve that  <br/>\n&gt; problem.  (I&#39;m dead serious about this.  You don&#39;t test, you don&#39;t  <br/>\n&gt; work. Period.)<br/>\n&gt; <br/>\n&gt; Using TDD you can&#39;t write production code unless you write a failing  <br/>\n&gt; unit test first.  Thus you will get very high coverage (80-90), and  <br/>\n&gt; you won&#39;t write code that&#39;s hard to test, because you write the tests  <br/>\n&gt; first.<br/>\n&gt; <br/>\n&gt; Refactoring solves the test maintenance problem.  Tests are not  <br/>\n&gt; second class citizens.  They have to be kept to the same standard of  <br/>\n&gt; cleanliness and design as production code.  Therefore we refactor  <br/>\n&gt; them to keep them easy to modify.<br/>\n&gt; &gt;<br/>\n&gt; &gt; So, for someone who believes that developer/unit testing is the right<br/>\n&gt; &gt; thing to do - one of the MOST important things to do and do WELL - I<br/>\n&gt; &gt; saw a VERY big and VERY definite problem.  Namely: Most developers<br/>\n&gt; &gt; want and need help with their testing effort.  Without some help and<br/>\n&gt; &gt; automation they will either give up on developer/unit testing or, even<br/>\n&gt; &gt; worse because it gives a false sense of security, write some trivial<br/>\n&gt; &gt; &quot;happy-path&quot; tests that pass too easily and fail to cover some<br/>\n&gt; &gt; critical conditions.<br/>\n&gt; <br/>\n&gt; Again, developers who have the attitude that it is OK to give up on  <br/>\n&gt; testing need their attitude readjusted -- and fast!  I have no  <br/>\n&gt; problem with tools to help with this; but the first problem to solve  <br/>\n&gt; is the attitude problem.<br/>\n&gt; <br/>\n&gt; Also, one of my problems with the Agitar tool is that it can&#39;t seem  <br/>\n&gt; to see very far into a function.  Therefore the observations it makes  <br/>\n&gt; are naive, thus possibly reinforcing the &quot;false sense of security&quot;  <br/>\n&gt; you talked about.<br/>\n&gt; <br/>\n&gt; &gt; Note that I am not in favor of complete<br/>\n&gt; &gt; automation (press a button get some passing tests) unless you need<br/>\n&gt; &gt; some quick change detector. I want Agitator to do for software<br/>\n&gt; &gt; developers what spreadsheets have done for accountants and business<br/>\n&gt; &gt; people: raise the level of abstraction, allow the user to focus on the<br/>\n&gt; &gt; important things that require their intelligence and understanding<br/>\n&gt; &gt; (e.g. formulae in spreadsheets, test data/assertions in Agitator),<br/>\n&gt; &gt; provide a number of other related utilities (e.g. graphs in<br/>\n&gt; &gt; spreadsheets, code coverage and code rules and dashboard reports in<br/>\n&gt; &gt; Agitator).<br/>\n&gt; <br/>\n&gt; I like the code coverage aspects of Agitar.  Some of the graphs and  <br/>\n&gt; charts are very useful.  I have no problems with them at all.<br/>\n&gt; &gt;<br/>\n&gt; &gt; We could argue whether Agitator helps with some of the problems (I<br/>\n&gt; &gt; believe it does since it was designed to address them specifically),<br/>\n&gt; &gt; but I don&#39;t think we can argue that there is no problem to be solved<br/>\n&gt; &gt; when it comes to developer testing.  Until most developers and<br/>\n&gt; &gt; software development organizations practice thorough unit testing on a<br/>\n&gt; &gt; consistent basis, we have a problem.<br/>\n&gt; <br/>\n&gt; Agreed.  And tool support is important.  Education is even more  <br/>\n&gt; important.  There is a minimum level of professional ethics involved  <br/>\n&gt; here, and every developer needs to learn it.<br/>\n&gt; <br/>\n&gt; I wear a green wrist band that says &quot;Test First&quot;.  It is a symbol of  <br/>\n&gt; my commitment to this minmium level of professional ethics.  I WILL  <br/>\n&gt; TEST MY CODE.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Without JUnit we would not be where we are today.  A 30% test<br/>\n&gt; &gt; infection rate is a huge step from what it was before (i.e. ~0%).  But<br/>\n&gt; &gt; I refuse believe that we cannot augment and provide developers with<br/>\n&gt; &gt; other tools beyond JUnit, and that we are stuck at 30% test infected.<br/>\n&gt; <br/>\n&gt; I agree.  And I think JUnit was partially responsible for this.   <br/>\n&gt; However I also think that the revolution would have happened without  <br/>\n&gt; the tool -- causing the tool to be written anyway.<br/>\n&gt; &gt;<br/>\n&gt; &gt; There&#39;s work we all have left to do.<br/>\n&gt; &gt;<br/>\n&gt; &gt; People like you are helping our common cause doing what you do best<br/>\n&gt; &gt; and, presumably, like to do best: training, coaching, mentoring,<br/>\n&gt; &gt; educating, writing, etc.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Me?  I am a software tool maker.  That&#39;s what I do best, and that&#39;s<br/>\n&gt; &gt; what I like to do. That&#39;s the best way I can help the cause.  I<br/>\n&gt; &gt; believe that tools are critical to progress, and that the right tools<br/>\n&gt; &gt; will enable the right behavior.  Anyone who knows me, or has talked<br/>\n&gt; &gt; with me for just a few minutes, knows how passionate I am about<br/>\n&gt; &gt; solving this problem (if we agree that there is a problem :-)) and I<br/>\n&gt; &gt; also would like to think that in addition to my passion, I bring some<br/>\n&gt; &gt; unique experience, skills, and vision to the table.<br/>\n&gt; <br/>\n&gt; And I appreciate that!  I think we need more and better tools for  <br/>\n&gt; software development.  My problem is that I just don&#39;t know if the  <br/>\n&gt; Agitation features of Agitar are really particularly useful.   <br/>\n&gt; Moreover I fear a tool that can figure out tests for you may give  <br/>\n&gt; developers an excuse not to write their own tests; especially if it  <br/>\n&gt; is marketed to managers and developers as a way to reduce unit test  <br/>\n&gt; writing time.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ----<br/>\n&gt; Robert C. Martin (Uncle Bob)  | email: unclebob@...<br/>\n&gt; Object Mentor Inc.            | blog:  www.butunclebob.com<br/>\n&gt; The Agile Transition Experts  | web:   www.objectmentor.com<br/>\n&gt; 800-338-6716                  |<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 16775, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1149110157", 
    "canDelete": false, 
    "nextInTopic": 16777, 
    "prevInTopic": 16775, 
    "headers": {
        "inReplyToHeader": "PDIzRjI4QjBGLTQyQUEtNDUyOC05NENGLUQxRUQ5NzRFRkE1MEBvYmplY3RtZW50b3IuY29tPg==", 
        "messageIdInHeader": "PGU1bDEyZCtnaDByQGVHcm91cHMuY29tPg=="
    }
}