{
    "numMessagesInTopic": 3, 
    "nextInTime": 16787, 
    "senderId": "mT3uYAuIF7_zv3sg4kxMtrqoAdfuX0ezXN73ikEpldMeRuG8ypaZW1vjfs6JvIKRJfGRbeO2TJMqWRGjdD7HpLK7cPFNco4N", 
    "systemMessage": true, 
    "subject": "Re: testing for compile", 
    "from": "Jon Barrilleaux &lt;jonb@...&gt;", 
    "authorName": "Jon Barrilleaux", 
    "msgSnippet": "I wasn t planning to automate the generation.  What I am finding is that there are a many compile cases to be tested but not so many as that they would need to", 
    "msgId": 16786, 
    "profile": "jonbarril", 
    "topicId": 16771, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 102238185, 
    "messageBody": "<div id=\"ygrps-yiv-117125503\">I wasn&#39;t planning to automate the generation.  What I am finding is that <br/>\nthere are a many compile cases to be tested but not so many as that they <br/>\nwould need to be generated automatically.  So, unless Java could execute <br/>\nthe good code and only throw an exception when it hits bad code, it <br/>\nseems that the code snippets need to be encapsulated somehow and <br/>\ncompiled and executed at runtime.<br/>\n<br/>\nI haven&#39;t looked at java 1.6 or at sun&#39;s Main.  I&#39;ll add these to my <br/>\nlist, but it seems that whatever the solution, the context of the test <br/>\ncase would have to be included, with each test case including a copy of <br/>\nall the supporting code.  This would require some manner of automation <br/>\nto take a line of code, embed it in an automatically generated program <br/>\nwith all of its contextual code, and then try and compile each test case.<br/>\n<br/>\nHmmmmm.  Another approach would be to isolate the test case method <br/>\ncontaining the questionable code snippets, enclosing each code snippet <br/>\nto be tested for compile errors in some JUnit call, perhaps with the <br/>\nline to be tested passed as a String.  Then one at a time, JUnit would <br/>\nexclude all but one of these code snippets while trying to compile the <br/>\nwhole test method.  In this manner, the compile assertion test would <br/>\n(hopefully) appear and work much like ordinary dynamic testing using JUnit.<br/>\n<br/>\nBeing a consumer of JUnit, not a developer, please forgive me if my <br/>\n&quot;solution&quot; fails to make any sense.<br/>\n<br/>\n--jon<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Message: 5 Date: Wed May 31, 2006 12:51 pm (PDT) From: &quot;Mark Salter&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marksalter@...\">marksalter@...</a> Subject: Re: testing for compile Jon Barrilleaux wrote:<br/>\n&gt; <br/>\n&gt;&gt;&gt; How do you test to make sure that what you think should happen actually <br/>\n&gt;&gt;&gt; happens at compile time?  Don&#39;t forget that JUnit is about regression <br/>\n&gt;&gt;&gt; testing.  If you make some change in the type hierarchies or <br/>\n&gt;&gt;&gt; implementations, how do you make sure you haven&#39;t broken the <br/>\n&gt;&gt;&gt; compile-time enforcement of what should and should not be allowed...<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Without actually compiling all of the code, I&#39;m not sure you can precisely.<br/>\n&gt; Perhaps the trick is to compile just the code you can predict the <br/>\n&gt; expected outcome for and check it conforms.<br/>\n&gt; <br/>\n&gt; Could<br/>\n&gt;      sun.tools.javac.Main (JDK 1.5)<br/>\n&gt; or<br/>\n&gt;      javax.tools.JavaCompilerTool (JDK 1.6+)<br/>\n&gt; <br/>\n&gt; help in your aim?  These appear to be two ways of invoking javac directly.<br/>\n&gt; <br/>\n&gt; If you could invoke the compiler in this way - perhaps once for each <br/>\n&gt; test source element, you could use JUnit to assertTrue/False on the return.<br/>\n&gt; <br/>\n&gt; The run method of JavaCompilerTool returns a boolean :-<br/>\n&gt; <br/>\n&gt; &quot;<br/>\n&gt; true if and only all the files compiled without errors; false otherwise<br/>\n&gt; &quot;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;&gt;&gt; <br/>\n&gt;&gt;&gt; <br/>\n&gt;&gt;&gt; DelegatorA.getNodeOut().connectTo(DelegatorB.getNodeIn()); // no error<br/>\n&gt; <br/>\n&gt; [snip]<br/>\n&gt; <br/>\n&gt;&gt;&gt; SubDelegA.getNodeIn().connectTo(SubDelegB.getNodeOut()); // no error<br/>\n&gt;&gt;&gt; <br/>\n&gt;&gt;&gt; etc, etc, etc....<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Will you be attempting to generate the possible combinations, if so, can <br/>\n&gt; you predict within the generation what should and shouldn&#39;t compile?<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;&gt;&gt; <br/>\n&gt;&gt;&gt; So, is there any way for JUnit to include an assertion for a compile <br/>\n&gt;&gt;&gt; time error?  Earlier attempts on my part, and suggestions by others, <br/>\n&gt;&gt;&gt; have been unsuccessful.  Is this something that is currently impossible <br/>\n&gt;&gt;&gt; in Java?<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I admit, I have not looked through your other threads, so if this <br/>\n&gt; suggestion has been made and rejected already, please forgive my laziness!<br/>\n&gt; <br/>\n&gt; -- Mark </span></blockquote></div>", 
    "prevInTime": 16785, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1149173754", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 16774, 
    "headers": {
        "messageIdInHeader": "PDQ0N0VGRkZBLjYwMDA5MDFAam1iYWFpLmNvbT4="
    }
}