{
    "numMessagesInTopic": 17, 
    "nextInTime": 16786, 
    "senderId": "ppe6Z3zpFRjvZhvFYl2sfaOpYp26k_ZGxYQSPMtFH3RYWWm8yJQZgjo6_EuaAJeUJNjQ8mkO6jTfjpUk2t82Hnt8YblcJr9fBKi0swhssYE", 
    "systemMessage": false, 
    "subject": "Re: [junit] Digest Number 1846", 
    "from": "Robert Martin &lt;UncleBob@...&gt;", 
    "authorName": "Robert Martin", 
    "msgSnippet": "... I am quite convinced that test-first is a good approach to a huge majority of software situations.  It is my default position.  When, as very rarely", 
    "msgId": 16785, 
    "profile": "rmartinoma", 
    "topicId": 16783, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 85922638, 
    "messageBody": "<div id=\"ygrps-yiv-1783405691\">On Jun 1, 2006, at 4:35 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;    Date: Wed May 31, 2006 2:16 pm (PDT)<br/>\n&gt;    From: &quot;albsavoia&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:albsavoia@...\">albsavoia@...</a><br/>\n&gt; Subject: Re: Digest Number 1845<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;&gt; I wear a green wrist band that says &quot;Test First&quot;.  It is a symbol of<br/>\n&gt;&gt; my commitment to this minmium level of professional ethics.  I WILL<br/>\n&gt;&gt; TEST MY CODE.<br/>\n&gt;<br/>\n&gt; Bob,<br/>\n&gt;<br/>\n&gt; While I don&#39;t agree with you 100% on Test First being THE solution, or<br/>\n&gt; THE right approach in ALL cases, I am definitely more in your camp<br/>\n&gt; than not.<br/>\n<br/>\n </span></blockquote>I am quite convinced that test-first is a good approach to a huge  <br/>\nmajority of software situations.  It is my default position.  When,  <br/>\nas very rarely happens, this approach leads to an apparent impasse, I  <br/>\nwill expend significant energy to find a way through before  <br/>\nabandoning the test-first approach.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; When Roongko and I were at SunLabs, we headed a research project<br/>\n&gt; called ADL (Assertion Definition Language) that was close in spirit to<br/>\n&gt; test first:<br/>\n<br/>\n </span></blockquote>&lt;&lt;description of test-first-like process elided&gt;&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The system worked just fine, but there was a big problem.  Most<br/>\n&gt; developers did not want to write specs first.  Let me be more<br/>\n&gt; specific: some of them did not want to, others could not do it. Some<br/>\n&gt; developers, including some very good ones, are not wired to think test<br/>\n&gt; first.  They could do it, but they would not be very effective at it -<br/>\n&gt; like asking a left-handed person to write with their write hand.<br/>\n<br/>\n </span></blockquote>I hear this objection a lot, in many different contexts:<br/>\n  - I know very good developers who aren&#39;t wired for OO.<br/>\n  - I know very good developers who aren&#39;t wired for clean code.<br/>\n  - I know very good developers who aren&#39;t wired for short iterations.<br/>\n<br/>\nMy reaction: These are not very good developers.  Why?  Because the  <br/>\nwiring argument is bogus.  A developer who &quot;isn&#39;t wired for X&quot; is  <br/>\nreally a developer who has decided that X doesn&#39;t suit him or her for  <br/>\none reason or another.  A developer who isn&#39;t &quot;wired&quot; for X is a  <br/>\ndeveloper who has decided not to learn.  And THAT DEFINES a poor  <br/>\ndeveloper.<br/>\n<br/>\nNote that I am not talking about agreement.  I know a very good  <br/>\ndeveloper who took the trouble to learn TDD and still remains  <br/>\nskeptical of the benfits.  And just so you understand where my  <br/>\nparticular values lie, I hired this person.  I value informed  <br/>\nskepticism.<br/>\n<br/>\nHowever, if someone can learn to write code, they can learn to write  <br/>\ntests, and they can learn to write tests first.  Yes, it requires a  <br/>\nchange in thinking process; but the ability to change thinking  <br/>\nprocess is critical to being a good developer.  The one thing a good  <br/>\ndeveloper can never do is get caught in a rut.  This industry changes  <br/>\ntoo quickly for that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Now, we could fire all people who refuse to, or are not good at test<br/>\n&gt; first, but I don&#39;t think that will work.<br/>\n<br/>\n </span></blockquote>Actually I don&#39;t think we have to fire them.  They&#39;ll be gone into  <br/>\nother jobs soon enough.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Over the years, and by<br/>\n&gt; looking at the way the world works (which I know is far from ideal), I<br/>\n&gt; have come to the conclusion that trying to globally change some<br/>\n&gt; behaviors (even when the new behavior is so obviously best for<br/>\n&gt; everyone (think smoking, eating junk, ..., not writing tests before<br/>\n&gt; writing your code)) is a noble, but pointless pursuit.<br/>\n<br/>\n </span></blockquote>I disagree.  We don&#39;t allow doctors to perform surgery before washing  <br/>\ntheir hands.  It took a lot of effort and angst to get doctors to  <br/>\nagree to this procedure when it was first discovered as beneficial.   <br/>\nI think the effort was noble, and certainly not pointless.<br/>\n<br/>\nI look at TDD in exactly the same way.  It is a minimum standard of  <br/>\nprofessionalism.  You wash your hands before you cut, or you don&#39;t  <br/>\ncut.  Period.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Let me attempt a simple analogy...<br/>\n<br/>\n </span></blockquote>&lt;&lt;cholesterol and exercise example elided&gt;&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Similarly, when it comes to developing code I agree with you 100% that<br/>\n&gt; developers should take responsibility for unit testing their own code<br/>\n&gt; (although I don&#39;t feel as strong as you do about test *first*, testing<br/>\n&gt; and testing well is what&#39;s most important to me).<br/>\n<br/>\n </span></blockquote>There are two aspects of testing that deserve scrutiny.  First there  <br/>\nis test coverage.  There is no excuse for not achieving a test  <br/>\ncoverage number in the high 80s or 90s.  I use TDD to achieve that  <br/>\ngoal; but must respect any technique that can achieve it by another  <br/>\nmeans.<br/>\n<br/>\nThe second aspect is dual-entry-bookkeeping.  Accountants ensure the  <br/>\nreliability of their transactions by (among other things) entering  <br/>\nthem in two places.  Every transaction goes once on the credit books,  <br/>\nand once on the debit books.  The two books should eventually deliver  <br/>\nequal but opposite sums.<br/>\n<br/>\nTDD also provides this dual-entry nature.  Thought must be given to  <br/>\neach action of the software TWICE.  Once on the test side, and once  <br/>\non the production code side.  I find this to be a powerful error  <br/>\nelimination scheme.  In short, we don&#39;t depend on the production code  <br/>\nto tell us how to write the tests. We employ serious thought on both  <br/>\nsides.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And I believe that the most effective way to get developers to test<br/>\n&gt; their code is to give them tools (JUnit is one, Agitator is another)<br/>\n&gt; to make them as efficient and as effective as possible.  To me, the<br/>\n&gt; desirable end result is well designed, well tested, well understood<br/>\n&gt; code using whatever methodology, technology, and tools are available<br/>\n&gt; and work best for the code and the people in question.<br/>\n&gt;<br/>\n&gt;&gt; My problem is that I just don&#39;t know if the<br/>\n&gt;&gt; Agitation features of Agitar are really particularly useful.<br/>\n&gt;<br/>\n&gt; I don&#39;t know how to respond to that except to, perhaps, schedule a<br/>\n&gt; couple of days working *together* on real code to show you all the<br/>\n&gt; benefits that you get from agitation.<br/>\n<br/>\n </span></blockquote>I&#39;d love that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For example, do you know that<br/>\n&gt; you can use Agitator in a test-first way?<br/>\n<br/>\n </span></blockquote>I have tried this on a couple of occasions.  The experiences have not  <br/>\nresolved my questions.  But I&#39;d love to try again.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Again, we did not wake  up<br/>\n&gt; one morning looking for a problem to solve with our technology.  I<br/>\n&gt; believe that the core ideas behind agitation are not only useful, but<br/>\n&gt; indispensable.<br/>\n<br/>\n </span></blockquote>That&#39;s the puzzling thing for me.  I look at what Agitar does and I  <br/>\nthink it&#39;s very cool.  I love the random input generation, and the  <br/>\nclever way you hunt for likely input values.  I can&#39;t remember if you  <br/>\nguys do automatic mock generation, or whether that was JTest, but  <br/>\nthat&#39;s cool too.  JTest generates junit tests instead of  <br/>\nobservations. I find that interesting also.  But having used both  <br/>\nAgitar and JTest I am still left wondering when I would actually use  <br/>\nthe tool in anger.  The things that the tool has observed in my code  <br/>\nhave not (yet) been convincing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;&gt; Moreover I fear a tool that can figure out tests for you may give<br/>\n&gt;&gt; developers an excuse not to write their own tests;<br/>\n&gt;<br/>\n&gt; Ah, you are missing one VERY CRITICAL point here.  Unlike other test<br/>\n&gt; automation products, Agitator does not &quot;figure out&quot; tests for you.<br/>\n<br/>\n </span></blockquote>Yes, I know, it makes observations.  And you can then select those  <br/>\nobservations that you deem to be important and ignore those that aren&#39;t.<br/>\n<br/>\nActually, that&#39;s part of my confusion.  I&#39;ve looked at the long list  <br/>\nof observations, many of which are trivial, and wondered how much  <br/>\neffort it would take to understand each and decide whether or not  <br/>\nthey should be promoted to assertions.  And, then I noted that the  <br/>\nmost interesting things about my functions, the things I REALLY want  <br/>\nasserted, weren&#39;t observed.<br/>\n<br/>\n&lt;&lt;description of observation and assertion elided&gt;&gt;<br/>\n<br/>\n----<br/>\nRobert C. Martin (Uncle Bob)  | email: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unclebob@...\">unclebob@...</a><br/>\nObject Mentor Inc.            | blog:  www.butunclebob.com<br/>\nThe Agile Transition Experts  | web:   www.objectmentor.com<br/>\n800-338-6716                  |<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 16784, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1149169294", 
    "canDelete": false, 
    "nextInTopic": 16787, 
    "prevInTopic": 16784, 
    "headers": {
        "inReplyToHeader": "PDExNDkxNTQ1NDkuMTgwOS4yODg3Ny5tMTlAeWFob29ncm91cHMuY29tPg==", 
        "messageIdInHeader": "PDkzNjAyQTAyLUM5M0UtNDU2OC04Mjc4LTQ5MzRDOTg3QUY3RkBvYmplY3RtZW50b3IuY29tPg==", 
        "referencesHeader": "PDExNDkxNTQ1NDkuMTgwOS4yODg3Ny5tMTlAeWFob29ncm91cHMuY29tPg=="
    }
}