{
    "numMessagesInTopic": 12, 
    "nextInTime": 16782, 
    "senderId": "RpnEXOnzMOfC4lVGVltY1NVieKKwQOxDoMZAr1SRyJkWi8AN7lbWJgQDLEzidK864b4snA21K34aD28GNVS9-wT06Utp3nxI4bp7FmMZ5w", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Digest Number 1845", 
    "from": "Elliotte Harold &lt;elharo@...&gt;", 
    "authorName": "Elliotte Harold", 
    "msgSnippet": "... The system did not work just fine. As you point out, developers would not and could not operate this way. This wasn t a problem with your developers. It", 
    "msgId": 16781, 
    "topicId": 16772, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 12653864, 
    "messageBody": "<div id=\"ygrps-yiv-349170581\">albsavoia wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Not exactly test first, but the same basic idea: the code was not<br/>\n&gt; &quot;done&quot; until the tests (generated directly from the spec therefore<br/>\n&gt; in-sync with the spec) passed.<br/>\n&gt; <br/>\n&gt; The system worked just fine, but there was a big problem.  Most<br/>\n&gt; developers did not want to write specs first.  Let me be more<br/>\n&gt; specific: some of them did not want to, others could not do it. Some<br/>\n&gt; developers, including some very good ones, are not wired to think test<br/>\n&gt; first.  They could do it, but they would not be very effective at it -<br/>\n&gt; like asking a left-handed person to write with their write hand.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>The system did not work just fine. As you point out, developers would <br/>\nnot and could not operate this way. This wasn&#39;t a problem with your <br/>\ndevelopers. It was a problem with your process.<br/>\n<br/>\nI have *never* met a competent developer who was incapable of doing test <br/>\nfirst development once introduced to it. The reason you couldn&#39;t get <br/>\ndevelopers to follow your system is precisely that it wasn&#39;t test first <br/>\ndevelopment. You were asking for big up-front design, and we know from <br/>\nexperience that doesn&#39;t work. I am not surprised that you encountered <br/>\nresistance when asking programmers to produce this level of design <br/>\nbefore writing code.<br/>\n<br/>\nThe proper way to do test first development is to write *one* test, just <br/>\none. Then code until the test passes. Then write another test. Then code <br/>\nuntil it passes. Repeat until the application is done.<br/>\n<br/>\nYou don&#39;t have to be a total stickler about this. Sometimes you can <br/>\nwrite a few tests before writing the code to make them pass. Sometimes <br/>\nyou can write a somewhat more generic version of a method than is <br/>\nstrictly needed to make a test pass. However the two extremes--all code <br/>\nbefore any tests or all tests before any code--are completely <br/>\ndysfunctional modes of operation. Normally we&#39;re arguing against the <br/>\nformer position--all code before testing--because it&#39;s the more common <br/>\npathology. However the opposite is equally pathological, just not as <br/>\noften seen.<br/>\n<br/>\n-- <br/>\n﻿Elliotte Rusty Harold  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elharo@...\">elharo@...</a><br/>\nJava I/O 2nd Edition Just Published!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafeaulait.org/books/javaio2/\">http://www.cafeaulait.org/books/javaio2/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/exec/obidos/ISBN=0596527500/ref=nosim/cafeaulaitA/\">http://www.amazon.com/exec/obidos/ISBN=0596527500/ref=nosim/cafeaulaitA/</a></div>", 
    "prevInTime": 16780, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1149159149", 
    "canDelete": false, 
    "nextInTopic": 16782, 
    "prevInTopic": 16779, 
    "headers": {
        "inReplyToHeader": "PGU1bDEyZCtnaDByQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDQ0N0VDNkVELjgwOTA4MDBAbWV0YWxhYi51bmMuZWR1Pg==", 
        "referencesHeader": "PGU1bDEyZCtnaDByQGVHcm91cHMuY29tPg=="
    }
}