{
    "numMessagesInTopic": 17, 
    "nextInTime": 16796, 
    "senderId": "duDYx8irnCPN4bj7iT68n2vFyU27HL4cDf-XCRoQwRvCW90A0Na3IUm2iboxVAUFVAurLCTyJ647ySgNZsBF2wCS6_yRbSo0ee3vFD63dLw-y17LVOIDWHvLLNqYcv05bfjopBQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Digest Number 1846", 
    "from": "&quot;=?UTF-8?Q?C=C3=A9dric_Beust_=E2=99=94_?=&quot; &lt;cbeust@...&gt;", 
    "authorName": "Cédric Beust ♔", 
    "msgSnippet": "... That s a bit extreme, but not contradictory with what I said earlier. I can t really think of any project I worked on where I knew deep inside that 100% of", 
    "msgId": 16795, 
    "profile": "cbeust", 
    "topicId": 16783, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 199443513, 
    "messageBody": "<div id=\"ygrps-yiv-451026316\">On 6/1/06, Robert Martin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UncleBob@...\">UncleBob@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I disagree that there is a limited responsibility.  A developer<br/>\n&gt; should not release code that they haven&#39;t tested.  They should not<br/>\n&gt; release a line of code that they have not tested.  Every line, every<br/>\n&gt; statement, every condition should be tested before the developer<br/>\n&gt; releases the code.  It seems to me that&#39;s a minimum professional<br/>\n&gt; standard.  Releasing code that you have not thoroughly tested is,<br/>\n&gt; simply, unprofessional.<br/>\n<br/>\n<br/>\n </span></blockquote>That&#39;s a bit extreme, but not contradictory with what I said earlier.<br/>\n<br/>\nI can&#39;t really think of any project I worked on where I knew deep inside<br/>\nthat 100% of the code I or my colleagues wrote was tested.  It&#39;s a fact of<br/>\nlife:  we never ship the product we want, and at some point, we need to draw<br/>\nthe line.<br/>\n<br/>\nDevelopers need to test their code, but I&#39;m a bit more lenient on &quot;how&quot; they<br/>\ndo it.  Ideally, I&#39;d like them to use TDD, but if they can make a reasonable<br/>\ncase for not doing TDD, I&#39;ll be fine with it as long as they provide<br/>\nreasonable tests.<br/>\n<br/>\nThere is also another aspect that is often overlooked in the kind of<br/>\ndiscussion we&#39;re having right now:  QA departments.<br/>\n<br/>\nOpen source projects are ideal Petri dishes:  if the developers are the<br/>\nbleeding edge kind, they will typically write code and supply 100% of the<br/>\ntests.  Things are quite different in the industry and it&#39;s very common to<br/>\nsee engineering and QA share the load of testing.  When you start factoring<br/>\nthis in, the impact of TDD becomes harder to quantify.<br/>\n<br/>\nAt the very least, I expect developers to write &quot;passing&quot; tests for their<br/>\ncode, but after this, it&#39;s quite common to see these tests passed along to<br/>\nQA which will expand on them and bring their own mindset and experience.<br/>\n<br/>\nI have been fortunate to work with very talented QA engineers who were<br/>\nabsolutely brilliant at improving the tests initially supplied by the<br/>\ndevelopers, and obviously, TDD is quite irrelevant for these QA departments<br/>\nsince the code has already been written.<br/>\n<br/>\n-- <br/>\nCédric<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 16794, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1149227127", 
    "canDelete": false, 
    "nextInTopic": 16796, 
    "prevInTopic": 16794, 
    "headers": {
        "inReplyToHeader": "PDVFNkNGNEIzLUM5QzUtNERBQi05MzVBLUQ1ODk0Q0I1NjZDN0BvYmplY3RtZW50b3IuY29tPg==", 
        "messageIdInHeader": "PGI4NmI2YTljMDYwNjAxMjI0NWsyZjI4YjY1YXc5MjkzNGRhNGYyOGE4ODhiQG1haWwuZ29vZ2xlLmNvbT4=", 
        "referencesHeader": "PDExNDkxNTQ1NDkuMTgwOS4yODg3Ny5tMTlAeWFob29ncm91cHMuY29tPgkgPDVFNkNGNEIzLUM5QzUtNERBQi05MzVBLUQ1ODk0Q0I1NjZDN0BvYmplY3RtZW50b3IuY29tPg=="
    }
}