{
    "numMessagesInTopic": 17, 
    "nextInTime": 16803, 
    "senderId": "rEjC5mksam5MecIPX3PnOFw4xvLsaPM56P_sxFJT2NEfxbGGZUQshXUYdS0Re6ziKuXGfPxIEKyAQKj05j1xM0bzW7vTvxCPFSQh-tz-R-Q2", 
    "systemMessage": false, 
    "subject": "Re: [junit] Digest Number 1846", 
    "from": "James P Gunderson &lt;jgunders@...&gt;", 
    "authorName": "James P Gunderson", 
    "msgSnippet": "I am not a testing guru, but I (and our small company) try to be professional. As part of that our goal is to never release code that is untested, and we use", 
    "msgId": 16802, 
    "profile": "jpg3u", 
    "topicId": 16783, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 193138280, 
    "messageBody": "<div id=\"ygrps-yiv-1521920607\">I am not a testing guru, but I (and our small company) try to be <br/>\nprofessional. As part of that our goal is to never release code that is <br/>\nuntested, and we use the available tools to try to accomplish that goal.<br/>\n<br/>\nI have been reading this thread with interest, and am a little confused <br/>\nover the argument.  I liked Bob Martin&#39;s analogy of double entry <br/>\nbookkeeping, and this may be part of the confusion. As far as I know, it <br/>\ndoesn&#39;t matter whether the credit is put into the books first, or the <br/>\ndebit is done first. The value of the practice is that both entries have <br/>\nto be done, and both must match. We do some test first, and some test <br/>\nsecond, but everything gets tested.<br/>\n<br/>\nIn fact our model is a back and forth approach. We write a few tests <br/>\nbased on a use case, and they fail. We write the code to support those <br/>\ntests, and (in the process) write support code to make the test driven <br/>\ncode compile and pass it&#39;s tests. Then we write the tests for the <br/>\nsupport code, and the tests for the next use case, this leads to writing <br/>\nboth the code to pass the tests, and some underlying code, which calls <br/>\nfor a few more test cases. These latter tests are driven by the need to <br/>\ntest corner conditions in the support code which may not be exercised by <br/>\na specific instance of the use-case driven code.<br/>\n<br/>\nThis back and forth approach seems natural, it reduced context switching <br/>\nin the design/implement domain, and seems to work well.  What am I missing?<br/>\n<br/>\nJim<br/>\n<br/>\nRobert Martin wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; On Jun 1, 2006, at 4:35 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> wrote:<br/>\n&gt; <br/>\n&gt;&gt; I agree.  TDD is a powerful tool, but not as much as &quot;simple  <br/>\n&gt;&gt; testing&quot;.  If a<br/>\n&gt;&gt; developer prefers to write code first and tests then, that&#39;s  <br/>\n&gt;&gt; perfectly fine<br/>\n&gt;&gt; with me.<br/>\n&gt; <br/>\n&gt; It&#39;s not fine with me.  In the end, if a developer can show me that s/ <br/>\n&gt; he&#39;s got very high test coverage, then I&#39;d accept the effort.  But  <br/>\n&gt; I&#39;d also strongly suggest that they write their tests first next time  <br/>\n&gt; to see if they don&#39;t find that they get done quicker and with a  <br/>\n&gt; better design.<br/>\n&gt; <br/>\n&gt;&gt; The important point here is that this developer needs to agree<br/>\n&gt;&gt; that writing tests is part of her job.  At least to a certain extent.<br/>\n&gt; <br/>\n&gt; I disagree that there is a limited responsibility.  A developer  <br/>\n&gt; should not release code that they haven&#39;t tested.  They should not  <br/>\n&gt; release a line of code that they have not tested.  Every line, every  <br/>\n&gt; statement, every condition should be tested before the developer  <br/>\n&gt; releases the code.  It seems to me that&#39;s a minimum professional  <br/>\n&gt; standard.  Releasing code that you have not thoroughly tested is,  <br/>\n&gt; simply, unprofessional.<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 16801, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1149269770", 
    "canDelete": false, 
    "nextInTopic": 16809, 
    "prevInTopic": 16799, 
    "headers": {
        "inReplyToHeader": "PDVFNkNGNEIzLUM5QzUtNERBQi05MzVBLUQ1ODk0Q0I1NjZDN0BvYmplY3RtZW50b3IuY29tPg==", 
        "messageIdInHeader": "PDQ0ODA3NzBBLjUwNTA0MDBAZ2FtbWEtdHdvLmNvbT4=", 
        "referencesHeader": "PDExNDkxNTQ1NDkuMTgwOS4yODg3Ny5tMTlAeWFob29ncm91cHMuY29tPiA8NUU2Q0Y0QjMtQzlDNS00REFCLTkzNUEtRDU4OTRDQjU2NkM3QG9iamVjdG1lbnRvci5jb20+"
    }
}