{
    "numMessagesInTopic": 12, 
    "nextInTime": 16817, 
    "senderId": "T7craCuLhQkNFMdIc1AgnZ7L_Tgv6nYda51lIC-EjM_HX6XVtj9ROlklepEpzgIfRewHaTL1J_HHX_ef61D1lG44iJY2iwF-Py8sIQ", 
    "systemMessage": false, 
    "subject": "Re: The Developer Testing Paradox - the real challenge we should address", 
    "from": "&quot;albsavoia&quot; &lt;albsavoia@...&gt;", 
    "authorName": "albsavoia", 
    "msgSnippet": "... Hi Elliotte, I understand the concept and mission of Test-First/TDD, support its use in-house, and I ve had some personal successes with it.  I also try to", 
    "msgId": 16816, 
    "profile": "albsavoia", 
    "topicId": 16772, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174158319, 
    "messageBody": "<div id=\"ygrps-yiv-2102448554\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, Elliotte Harold &lt;elharo@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Instead of attacking or confronting people who bring other approaches,<br/>\n&gt; &gt; views, and tools to the table, we should welcome them because we need<br/>\n&gt; &gt; more people on our side and more/better tools and options to get more<br/>\n&gt; &gt; people to join the ranks of test-infected developers.<br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; The sides are not where you think they are. No one here is arguing <br/>\n&gt; against the relevance of QA departments and testing. However test first <br/>\n&gt; development is primarily about *development*, not testing. It is a <br/>\n&gt; programming strategy. That strategy depends critically on writing the <br/>\n&gt; unit tests in sync with the code. It depends critically on applying <br/>\n&gt; human intelligence to the code so the *humans* develop better <br/>\n&gt; understanding of what they want. These are not side issues. They are at <br/>\n&gt; the core of test driven development.<br/>\n<br/>\n </span></blockquote>Hi Elliotte,<br/>\n<br/>\nI understand the concept and mission of Test-First/TDD, support its<br/>\nuse in-house, and I&#39;ve had some personal successes with it.  I also<br/>\ntry to make sure that the tools we develop try to support some mode of<br/>\nTDD.  But TDD is not the battle I am choosing to personally fight. <br/>\nFirst because there are many other people more qualified, more<br/>\npassionate, and more convinced than I am about its benefits and<br/>\ngeneral/broad applicability (just look at this forum).  Second,<br/>\nbecause I believe that the best way to get developers to consider and<br/>\nappreciate TDD or other &quot;more rigorous&quot; forms/disciplines of<br/>\ndesign/testing is to get them to consider and appreciate testing in<br/>\nthe first place; and accept that testing their own code is a<br/>\nprofessional responsibility (I like Bob Martin&#39;s analogy of doctors<br/>\nhaving to wash their hands before surgery).<br/>\n<br/>\nWhen I say &quot;Test-first or test-last? Either one as long as you test&quot;,<br/>\nI am not saying that there&#39;s no difference betweeen the two<br/>\napproaches, or trivializing it.  I am saying, that as far as I am<br/>\nconcerned, both approaches are OK with me.  Either approach is a big<br/>\nimprovement over the current situations where most developers don&#39;t<br/>\ntest.  I am trying to bring developers in the testing camp in the<br/>\nfirst place, once in the camp they can start to appreciate the value<br/>\nof testing and then decide for themselves if test-first is for them.<br/>\n<br/>\nIn summary: I am most interested/passionate in getting developers to<br/>\ntake responsibility for testing their code - writing tests for testing<br/>\nsake if you will. I see people who practice and promote TDD as allies;<br/>\nI understand and respect their beliefs and practices, but I also<br/>\naccept, understand, and welcome people who don&#39;t want to practice TDD.<br/>\n<br/>\nDo you believe that promoting the idea of developer testing without<br/>\ndirectly promoting TDD (i.e. saying that if developers write tests<br/>\nthey should only write them before the code) harms the TDD cause?  <br/>\n<br/>\nOr that mentioning test-first in a more general &quot;developers should<br/>\nwrite tests&quot; message &quot;cheapens&quot; TDD because TDD is about design and<br/>\nnot testing?<br/>\n<br/>\nI am asking these questions not to start/continue an argument.  I<br/>\nsincerely want to understand where you stand.<br/>\n<br/>\nAlberto</div>", 
    "prevInTime": 16815, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1149278315", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 16811, 
    "headers": {
        "inReplyToHeader": "PDQ0ODA3QjI0LjcwNjA2MDhAbWV0YWxhYi51bmMuZWR1Pg==", 
        "messageIdInHeader": "PGU1cTU5Yis1cTY3QGVHcm91cHMuY29tPg=="
    }
}