{
    "numMessagesInTopic": 12, 
    "nextInTime": 16812, 
    "senderId": "mu2mvDxRZQKEaozR5n0yrHe0fZU7-ujSo81I0TJIUxldkvkzdLuY8Mo_jBwSp_Zj8Hw5ly74e2MJze_W0_JXEWWP0sTHysviqoSR1bTbF-1bljvWk7Kh", 
    "systemMessage": true, 
    "subject": "Re: The Developer Testing Paradox - the real challenge we should address", 
    "from": "&quot;whitworthjanet&quot; &lt;janet.e.whitworth@...&gt;", 
    "authorName": "whitworthjanet", 
    "msgSnippet": "I agree with you completely. The thing we need to focus on is anything that we can do to get them started testing. The argument I constantly hear from", 
    "msgId": 16811, 
    "profile": "whitworthjanet", 
    "topicId": 16772, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 247009288, 
    "messageBody": "<div id=\"ygrps-yiv-1669068033\">I agree with you completely. The thing we need to focus on is anything <br/>\nthat we can do to get them started testing. The argument I constantly <br/>\nhear from developers is that they don&#39;t have time. My personal <br/>\nexperience is that testing actually saves me time. We need some way to <br/>\nget the non-believers to try it themselves, so they will see. <br/>\n<br/>\nMy preference is to adopt an organic approach to gradually incorporate <br/>\nunit testing into the project. I emphasize the importance of building <br/>\njunit tests before modifying existing code. It isn&#39;t essential that <br/>\nthey be write isolated unit tests, when the components of the class <br/>\nare known to work. Instead focus on testing the API of the class in <br/>\nany way that it can possibly change due to the modifications. Before <br/>\nfixing a bug, write a junit test that fails. This proves that the <br/>\ncause of the bug is known and once the code is modified, that the bug <br/>\nis fixed. When they see how easy it is to test at the unit level <br/>\nrather than the user interface, hopefully they will become sold.<br/>\n<br/>\nJanet</div>", 
    "prevInTime": 16810, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1149270437", 
    "canDelete": false, 
    "nextInTopic": 16816, 
    "prevInTopic": 16806, 
    "headers": {
        "inReplyToHeader": "PGU1cG50cSttZjFlQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGU1cHRqNStmc3RtQGVHcm91cHMuY29tPg=="
    }
}