{
    "numMessagesInTopic": 1, 
    "nextInTime": 16824, 
    "senderId": "pOLwvwCMUaHIrHSh3kPDjQuECdHp8KH7D8uIHAqD7tMucGf_2BR7DJ-D3gWhl3csoh94NSX_Gv9-Q4nVGgfNLvk6idFq15yKcw0eLoBTs2t8FQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Digest Number 1848", 
    "from": "Ron Jeffries &lt;ronjeffries@...&gt;", 
    "authorName": "Ron Jeffries", 
    "msgSnippet": "... Testing everything is a good thing. An important difference between TDD and double entry bookkeeping is that it /does/ matter whether we do the test or the", 
    "msgId": 16823, 
    "profile": "ronaldejeffries", 
    "topicId": 16823, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 155351857, 
    "messageBody": "<div id=\"ygrps-yiv-1873351283\">On Friday, June 2, 2006, at 7:35:39 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Message: 7 <br/>\n&gt;    Date: Fri Jun 2, 2006 10:38 am (PDT) <br/>\n&gt;    From: &quot;James P Gunderson&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jgunders@...\">jgunders@...</a>  <br/>\n&gt; Subject: Re: Digest Number 1846 <br/>\n&gt;  <br/>\n<br/>\n&gt; I am not a testing guru, but I (and our small company) try to be <br/>\n&gt; professional. As part of that our goal is to never release code that is<br/>\n&gt; untested, and we use the available tools to try to accomplish that goal.<br/>\n<br/>\n&gt; I have been reading this thread with interest, and am a little confused<br/>\n&gt; over the argument.  I liked Bob Martin&#39;s analogy of double entry <br/>\n&gt; bookkeeping, and this may be part of the confusion. As far as I know, it<br/>\n&gt; doesn&#39;t matter whether the credit is put into the books first, or the<br/>\n&gt; debit is done first. The value of the practice is that both entries have<br/>\n&gt; to be done, and both must match. We do some test first, and some test<br/>\n&gt; second, but everything gets tested.<br/>\n<br/>\n </span></blockquote>Testing everything is a good thing. An important difference between<br/>\nTDD and double entry bookkeeping is that it /does/ matter whether we<br/>\ndo the test or the code first.<br/>\n<br/>\nThe most apparent reason is that the test is a /user/ of the code<br/>\nand the code is an /implementer/ of the usage. So when we write the<br/>\ntest first, we are designing the interface to our code from the<br/>\nviewpoint of a user and when we write the code first, we have (more)<br/>\nthe viewpoint of the implementer.<br/>\n<br/>\nI often find that I&#39;ll write the first few tests a couple of times,<br/>\nstopping part way through each one. I&#39;ll muse about how the object<br/>\nshould be built and called ... start writing the test ... not like<br/>\nthe interface ... change it.<br/>\n<br/>\nThen I make that test work and do it again ... I learn more about<br/>\nthe interface ... perhaps change it again.<br/>\n<br/>\nWhen I write the code first, I find that I&#39;m less likely to change<br/>\nit when I find it hard to use.<br/>\n<br/>\nIt could be just me. I&#39;m not saying what I do is better -- I&#39;m<br/>\nreporting how it&#39;s different.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In fact our model is a back and forth approach. We write a few tests<br/>\n&gt; based on a use case, and they fail. We write the code to support those<br/>\n&gt; tests, and (in the process) write support code to make the test driven<br/>\n&gt; code compile and pass it&#39;s tests. Then we write the tests for the <br/>\n&gt; support code, and the tests for the next use case, this leads to writing<br/>\n&gt; both the code to pass the tests, and some underlying code, which calls<br/>\n&gt; for a few more test cases. These latter tests are driven by the need to<br/>\n&gt; test corner conditions in the support code which may not be exercised by<br/>\n&gt; a specific instance of the use-case driven code.<br/>\n<br/>\n&gt; This back and forth approach seems natural, it reduced context switching<br/>\n&gt; in the design/implement domain, and seems to work well.  What am I missing?<br/>\n<br/>\n </span></blockquote>You may not be missing anything. Personally, I like the context<br/>\nswitching. It keeps my mind fresh, and ensures that I don&#39;t get<br/>\nlocked in on a direction that turns out not to be what it should be.<br/>\n<br/>\nI have this unsupported theory that &quot;corner cases&quot; in my code<br/>\nrepresent design flaws, so I try to produce code that doesn&#39;t have<br/>\nsuch things. I could be completely wrong about that whole notion.<br/>\n<br/>\nRon Jeffries<br/>\nwww.XProgramming.com<br/>\nIf it is more than you need, it is waste. -- Andy Seidl</div>", 
    "prevInTime": 16822, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1149292048", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "inReplyToHeader": "PDExNDkyOTEzMzkuOTE0MS41MTg2MC5tOUB5YWhvb2dyb3Vwcy5jb20+", 
        "messageIdInHeader": "PDE0NTU5Nzk2ODEuMjAwNjA2MDIxOTQ3MjhAYWNtLm9yZz4=", 
        "referencesHeader": "PDExNDkyOTEzMzkuOTE0MS41MTg2MC5tOUB5YWhvb2dyb3Vwcy5jb20+"
    }
}