{
    "numMessagesInTopic": 11, 
    "nextInTime": 16887, 
    "senderId": "9ceZEGntMCMD41so-uVig2XlIubrqITjylHCwiRMR7L9sVtwLR3lDHIDjvlgwWLCCov7pw4U2DdZjWFNlphOKqNnqfn89JDdOlqQPyrqC6yi", 
    "systemMessage": true, 
    "subject": "Re: [junit] @Ignore with a time", 
    "from": "&quot;Brett L. Schuchert&quot; &lt;schuchert@...&gt;", 
    "authorName": "Brett L. Schuchert", 
    "msgSnippet": "We use JUnit for both unit tests and some level of integration tests. We can have a side discussion on the merits of that, but it s a fact. We have right now", 
    "msgId": 16886, 
    "profile": "schuchert", 
    "topicId": 16877, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 162568887, 
    "messageBody": "<div id=\"ygrps-yiv-1718636891\">We use JUnit for both unit tests and some level of integration tests. We can have a side discussion on the merits of that, but it&#39;s a fact. We have right now around 60 developers working across 10 projects. All 10 projects share a common architecture and supporting components. I&#39;d guess we have around 7000 unit tests across the 10 projects. Our coverage is a bit lacking but I know it&#39;s helped.<br/>\n <br/>\nHere are 2 situations where we&#39;d use this:<br/>\n <br/>\n <br/>\nSituation 1:<br/>\nSome of our tests acquire information from external systems we do not have control over. Those systems sometimes go through maintenance for a day or two or sometimes those systems clear out all of the test data and repopulate (I hate that we cannot own a part of the test data, but it&#39;s been a political issue for 3 years). When this happens, we need to update tests. It usually takes a 1 to 3 days to do that - often the information the test uses is externalized, we still have to find appropriate replacement keys. So we don&#39;t actually update the test, we update the data driven part of the tests. While that happens, other development would lose out on CI or we&#39;d have to disable those tests. It&#39;d be nice to just put a 3-day delay on them. Then they&#39;d start running again automatically. So I guess the ignore is until a date and after that the test continues to run.<br/>\n<br/>\nSituation 2:<br/>\nI&#39;m working on something in the trunk. I want to write tests and check in my work. I could work in a branch, check in all I want and then make sure to merge that branch back into the trunk. However, if I do that, I have to keep the branch up to date with the trunk and vice versa - merging in both directions. This is a pain. So I&#39;d rather just write several tests. Put on the ignore, check them in. Then take out the ignore while I continue my development (better yet, maybe I could set some environment variable when executing tests to ignore the ignore!-).<br/>\n <br/>\nWe have a utility class called TimeBomb (we&#39;re still using JUnit 3.8.1). When we want to disable a test, we put a time bomb in the test. That test will eventually start to ACTIVELY fail in the near future. Here&#39;s an example from something else I&#39;m working on, on the side: <a rel=\"nofollow\" target=\"_blank\" href=\"http://schuchert.wikispaces.com/JUnit+4.x#TimeBomb\">http://schuchert.wikispaces.com/JUnit+4.x#TimeBomb</a><br/>\n <br/>\nBrett<br/>\n----- Original Message ----<br/>\nFrom: Joakim Ohlrogge &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joakim.ohlrogge@...\">joakim.ohlrogge@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSent: Thursday, June 8, 2006 6:09:54 AM<br/>\nSubject: Re: [junit] @Ignore with a time<br/>\n<br/>\n<br/>\nI think that would address my concern that @ignore can be forgotten.<br/>\nA failing test would be a really nice reminder: &quot;ignore expired: &lt;your<br/>\nmessage&gt;&quot;<br/>\nI have not yet used ignore I have not seen the need, when do you typically<br/>\nneed it?<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 6/8/06, Brett L. Schuchert &lt;schuchert@yahoo. com&gt; wrote:<br/>\n&gt;<br/>\n&gt; I&#39;ve been working with a group for the past 3.5 years and we&#39;ve been<br/>\n&gt; using JUnit from the beginning. A while back, as the project grew,<br/>\n&gt; there were times when we would break tests (or because we had<br/>\n&gt; external dependencies that we had to wait and had not yet mocked<br/>\n&gt; things out), tests would fail for a few days before we could get to<br/>\n&gt; them.<br/>\n&gt;<br/>\n&gt; This stopped our CI, so we introduced a helper class, TimeBomb. We&#39;d<br/>\n&gt; add a call to TimeBomb with a date and the test would stop failing<br/>\n&gt; until after the provided date.<br/>\n&gt;<br/>\n&gt; It was an active way to remind us go back and fix something in a few<br/>\n&gt; days.<br/>\n&gt;<br/>\n&gt; @Ignore has a message. What about adding a date? Ignore until the<br/>\n&gt; date, after which the test will fail by throwing a runtime exception?<br/>\n&gt;<br/>\n&gt; Is that crazy?<br/>\n&gt;<br/>\n&gt; Brett<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 16885, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1149782317", 
    "canDelete": false, 
    "nextInTopic": 16889, 
    "prevInTopic": 16885, 
    "headers": {
        "inReplyToHeader": "PGI5ZWU1ZTQxMDYwNjA4MDQwOXA0ZTg4M2Y4ZGo0ZjUzOTNhYTY1M2Y5NzVkQG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PDIwMDYwNjA4MTU1ODM3Ljk5NDMucW1haWxAd2ViNTQxMTMubWFpbC55YWhvby5jb20+"
    }
}