{
    "numMessagesInTopic": 11, 
    "nextInTime": 16890, 
    "senderId": "hdaQ3Ik6qbM2Pt9Cbl7bYtAtW4LQUTf6KooINhAAOMxBoaFrWLth0qMKQhVtvL5WaSfCNp8Aa2tskaRSDDbL2JlhfIGS1lVK8eJ1fpphOibIjpvZ", 
    "systemMessage": false, 
    "subject": "Re: [junit] @Ignore with a time", 
    "from": "&quot;Joakim Ohlrogge&quot; &lt;joakim.ohlrogge@...&gt;", 
    "authorName": "Joakim Ohlrogge", 
    "msgSnippet": "I think ignore seems way better than someone just commenting a test out (something I guess we have all seen happen or, god forbid,  even done ourselves", 
    "msgId": 16889, 
    "rawEmail": "Return-Path: &lt;joakim.ohlrogge@...&gt;\r\nX-Sender: joakim.ohlrogge@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 85106 invoked from network); 8 Jun 2006 18:01:56 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m22.grp.scd.yahoo.com with QMQP; 8 Jun 2006 18:01:56 -0000\r\nReceived: from unknown (HELO nf-out-0910.google.com) (64.233.182.187)\n  by mta3.grp.scd.yahoo.com with SMTP; 8 Jun 2006 18:01:55 -0000\r\nReceived: by nf-out-0910.google.com with SMTP id x29so407928nfb\n        for &lt;junit@yahoogroups.com&gt;; Thu, 08 Jun 2006 11:01:44 -0700 (PDT)\r\nReceived: by 10.49.93.15 with SMTP id v15mr1698828nfl;\n        Thu, 08 Jun 2006 11:01:43 -0700 (PDT)\r\nReceived: by 10.48.42.1 with HTTP; Thu, 8 Jun 2006 11:01:43 -0700 (PDT)\r\nMessage-ID: &lt;b9ee5e410606081101s1bc4ba30v50df8bb9e89fdb6@...&gt;\r\nDate: Thu, 8 Jun 2006 20:01:43 +0200\r\nTo: junit@yahoogroups.com\r\nIn-Reply-To: &lt;20060608155837.9943.qmail@...&gt;\r\nMIME-Version: 1.0\r\nReferences: &lt;b9ee5e410606080409p4e883f8dj4f5393aa653f975d@...&gt;\n\t &lt;20060608155837.9943.qmail@...&gt;\r\nX-Google-Sender-Auth: cc61195d2a3bb5d7\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nX-eGroups-From: &quot;Joakim Ohlrogge&quot; &lt;joakim.ohlrogge@...&gt;\r\nFrom: &quot;Joakim Ohlrogge&quot; &lt;joakim.ohlrogge@...&gt;\r\nReply-To: joakim.ohlrogge@...\r\nSubject: Re: [junit] @Ignore with a time\r\nX-Yahoo-Group-Post: member; u=261856052; y=fQMXxXDvib9sVB6KZ39rdOmOaiizWWR7W__HUevOOz7Wfp7B\r\nX-Yahoo-Profile: j0hlrogge\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\n\r\nI think ignore seems way better than someone just commenting a test out\n(something I guess we have all seen happen or, god forbid,  even done\nourselves sometime in the past).\nI think that your timebomb concept seems way better than ignore for the\nreason that you will HAVE to deal with it eventually I&#39;d like that option if\nI ever use ignore since I KNOW that I will forget to change one or two of\nthem :).\n\nAbout situation 1 Iguess it is a result of system-testing I don&#39;t think\nusing some other tool than jUnit would change the fact that you do have a\ndatadependency in your system-tets that you don&#39;t own. I agree lets not have\nthe &quot;don&#39;t system test with jUnit discussion&quot;. To me it seems that it would\nbe great if you could find a way to replicate enough of the data you don&#39;t\nown to be able to run your tests but I bet you wanted that like a million\ntimes yourself and since you&#39;ve been living with that for 3 years I bet\nmocking it out is not an option either, tough one :S\n\nAbout situation 2 I have been in the situation myself many times and\nalthough I always feel I missed some baby-step I should have taken or that I\nshould have checked something in before I started on this big thingy... I\nguess checing in with ignore is better than not checking in as long as you\ndon&#39;t ruin someone elses day... One concern I have is that you say that you\nwrite seeral tests and they are failing why not one at the time, is it like\na TODO list? is that why you feel safe to check them in?\n\n/Joakim\n\n\n\n\n\n\n\nOn 6/8/06, Brett L. Schuchert &lt;schuchert@...&gt; wrote:\n&gt;\n&gt;   We use JUnit for both unit tests and some level of integration tests. We\n&gt; can have a side discussion on the merits of that, but it&#39;s a fact. We have\n&gt; right now around 60 developers working across 10 projects. All 10 projects\n&gt; share a common architecture and supporting components. I&#39;d guess we have\n&gt; around 7000 unit tests across the 10 projects. Our coverage is a bit lacking\n&gt; but I know it&#39;s helped.\n&gt;\n&gt; Here are 2 situations where we&#39;d use this:\n&gt;\n&gt;\n&gt; Situation 1:\n&gt; Some of our tests acquire information from external systems we do not have\n&gt; control over. Those systems sometimes go through maintenance for a day or\n&gt; two or sometimes those systems clear out all of the test data and repopulate\n&gt; (I hate that we cannot own a part of the test data, but it&#39;s been a\n&gt; political issue for 3 years). When this happens, we need to update tests. It\n&gt; usually takes a 1 to 3 days to do that - often the information the test uses\n&gt; is externalized, we still have to find appropriate replacement keys. So we\n&gt; don&#39;t actually update the test, we update the data driven part of the tests.\n&gt; While that happens, other development would lose out on CI or we&#39;d have to\n&gt; disable those tests. It&#39;d be nice to just put a 3-day delay on them. Then\n&gt; they&#39;d start running again automatically. So I guess the ignore is until a\n&gt; date and after that the test continues to run.\n&gt;\n&gt; Situation 2:\n&gt; I&#39;m working on something in the trunk. I want to write tests and check in\n&gt; my work. I could work in a branch, check in all I want and then make sure to\n&gt; merge that branch back into the trunk. However, if I do that, I have to keep\n&gt; the branch up to date with the trunk and vice versa - merging in both\n&gt; directions. This is a pain. So I&#39;d rather just write several tests. Put on\n&gt; the ignore, check them in. Then take out the ignore while I continue my\n&gt; development (better yet, maybe I could set some environment variable when\n&gt; executing tests to ignore the ignore!-).\n&gt;\n&gt; We have a utility class called TimeBomb (we&#39;re still using JUnit 3.8.1).\n&gt; When we want to disable a test, we put a time bomb in the test. That test\n&gt; will eventually start to ACTIVELY fail in the near future. Here&#39;s an example\n&gt; from something else I&#39;m working on, on the side:\n&gt; http://schuchert.wikispaces.com/JUnit+4.x#TimeBomb\n&gt;\n&gt; Brett\n&gt;\n&gt; ----- Original Message ----\n&gt; From: Joakim Ohlrogge &lt;joakim.ohlrogge@...&lt;joakim.ohlrogge%40gmail.com&gt;\n&gt; &gt;\n&gt; To: junit@yahoogroups.com &lt;junit%40yahoogroups.com&gt;\n&gt; Sent: Thursday, June 8, 2006 6:09:54 AM\n&gt; Subject: Re: [junit] @Ignore with a time\n&gt;\n&gt; I think that would address my concern that @ignore can be forgotten.\n&gt; A failing test would be a really nice reminder: &quot;ignore expired: &lt;your\n&gt; message&gt;&quot;\n&gt; I have not yet used ignore I have not seen the need, when do you typically\n&gt; need it?\n&gt;\n&gt; On 6/8/06, Brett L. Schuchert &lt;schuchert@yahoo. com&gt; wrote:\n&gt; &gt;\n&gt; &gt; I&#39;ve been working with a group for the past 3.5 years and we&#39;ve been\n&gt; &gt; using JUnit from the beginning. A while back, as the project grew,\n&gt; &gt; there were times when we would break tests (or because we had\n&gt; &gt; external dependencies that we had to wait and had not yet mocked\n&gt; &gt; things out), tests would fail for a few days before we could get to\n&gt; &gt; them.\n&gt; &gt;\n&gt; &gt; This stopped our CI, so we introduced a helper class, TimeBomb. We&#39;d\n&gt; &gt; add a call to TimeBomb with a date and the test would stop failing\n&gt; &gt; until after the provided date.\n&gt; &gt;\n&gt; &gt; It was an active way to remind us go back and fix something in a few\n&gt; &gt; days.\n&gt; &gt;\n&gt; &gt; @Ignore has a message. What about adding a date? Ignore until the\n&gt; &gt; date, after which the test will fail by throwing a runtime exception?\n&gt; &gt;\n&gt; &gt; Is that crazy?\n&gt; &gt;\n&gt; &gt; Brett\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;\n&gt; [Non-text portions of this message have been removed]\n&gt;\n&gt; [Non-text portions of this message have been removed]\n&gt;\n&gt;  \n&gt;\n\n\n[Non-text portions of this message have been removed]\n\n\n", 
    "profile": "j0hlrogge", 
    "topicId": 16877, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 261856052, 
    "prevInTime": 16888, 
    "contentTrasformed": false, 
    "postDate": "1149789703", 
    "canDelete": false, 
    "nextInTopic": 16892, 
    "prevInTopic": 16886, 
    "headers": {
        "inReplyToHeader": "PDIwMDYwNjA4MTU1ODM3Ljk5NDMucW1haWxAd2ViNTQxMTMubWFpbC55YWhvby5jb20+", 
        "messageIdInHeader": "PGI5ZWU1ZTQxMDYwNjA4MTEwMXMxYmM0YmEzMHY1MGRmOGJiOWU4OWZkYjZAbWFpbC5nbWFpbC5jb20+", 
        "referencesHeader": "PGI5ZWU1ZTQxMDYwNjA4MDQwOXA0ZTg4M2Y4ZGo0ZjUzOTNhYTY1M2Y5NzVkQG1haWwuZ21haWwuY29tPgkgPDIwMDYwNjA4MTU1ODM3Ljk5NDMucW1haWxAd2ViNTQxMTMubWFpbC55YWhvby5jb20+"
    }
}