{
    "numMessagesInTopic": 6, 
    "nextInTime": 16924, 
    "senderId": "GtsMEBEfyoLLrc3Gl8kCS0hHVf_gzwWVfeUfi1oTWWv4GsMXhmWl53EfY54KNGXLtS8TRaqABm1fumeEaf6Ry45gQA0mdBrfaOaJHGRS", 
    "systemMessage": true, 
    "subject": "Harsh: Selectively running tests", 
    "from": "&quot;Chaudhary, Harsh&quot; &lt;hchaudha@...&gt;", 
    "authorName": "Chaudhary, Harsh", 
    "msgSnippet": "Hi all, I am writing tests for a project and I need help on something. I will try to be as brief as possible. I have about 100 excel spreadsheets that I am", 
    "msgId": 16923, 
    "profile": "hchaudh1", 
    "topicId": 16923, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 272297462, 
    "messageBody": "<div id=\"ygrps-yiv-316285470\">Hi all,<br/>\nI am writing tests for a project and I need help on something. I will<br/>\ntry to be as brief as possible.<br/>\n <br/>\nI have about 100 excel spreadsheets that I am accessing via POI. These<br/>\nbasically form the input to my system. Then I take this input and run it<br/>\nagainst a component to get some rates. The aim of my test is to compare<br/>\nthe output coming from the rate engine to the output generated by<br/>\nformulas on each Excel workbook.<br/>\n <br/>\nIf I run tests on all 100 workbooks at once, it takes a long time. And<br/>\nit takes longer to identify which workbooks have errors on them and why.<br/>\nSo, I would like to selectively run tests on some workbooks only at a<br/>\ntime. One way to do this is to write a Base Test Class which contains<br/>\nall the test methods and 100 Test classes (each corresponding to one<br/>\nworkbook) which extend this class. Then these 100 classes are added to a<br/>\nsuite and I can then run each test class independently.<br/>\n <br/>\nThe problem is writing the 100 classes. Also, its hard to go on creating<br/>\nmore classes if we need to test more workbooks.<br/>\n <br/>\nMy question is, is there a way to programatically run tests on a<br/>\nworkbook by passing in the name of the workbook. So that, for example, I<br/>\ncan pass in the name of the Workbook and test would run for only that<br/>\nworkbook.<br/>\n <br/>\nI did some research and it seems like a concept of a Plugggable Selector<br/>\nmight do the trick for me. Its available at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://junit.sourceforge.net/doc/cookstour/cookstour.htm\">http://junit.sourceforge.net/doc/cookstour/cookstour.htm</a><br/>\n <br/>\nBut I don&#39;t know this for sure. Has anyone done this before or have any<br/>\nidea how to do it?<br/>\n <br/>\nThanks,<br/>\nHarsh.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 16922, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1150300701", 
    "canDelete": false, 
    "nextInTopic": 16924, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDkxODRGOTAxQjkzMjkzNDNCMTVDQTY2MUQxMDA5QjA1MDJFNkZBNjlATkhRMUFDQ09FWDAyVlMxLmNvcnBvcmF0ZS5hbWZhbS5jb20+"
    }
}