{
    "numMessagesInTopic": 8, 
    "nextInTime": 16995, 
    "senderId": "E82cj4_YDPN3nJkqRsOiWAait831nYvIyN8XQS_PluX1Ujki3PRHUCeZ53nGCotE8UBF10B6RlnAn7DhZW9jPYak44CvTGkZPD4tkAnfbDXHcAgw-RsZmB_SU9c", 
    "systemMessage": false, 
    "subject": "RE: Mocking libraries and moving parts (was: Re: [junit] unit tes t       case for login())", 
    "from": "&quot;Rutherford, Michael&quot; &lt;michael.rutherford@...&gt;", 
    "authorName": "Rutherford, Michael", 
    "msgSnippet": "Yes I m aware that the various mocking frameworks all provide ways to in erffect provide stub implementations of a given interface. The problerm is having to", 
    "msgId": 16994, 
    "profile": "mrutherfurd", 
    "topicId": 16987, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 229542016, 
    "messageBody": "<div id=\"ygrps-yiv-238795409\">Yes I&#39;m aware that the various mocking frameworks all provide ways to in<br/>\nerffect provide stub implementations of a given interface. The problerm is<br/>\nhaving to provide the interelationships between the various interfaces to<br/>\nallow the mock to function adequately. In the simple example below I needed<br/>\nto provide a mock IDfSession with enough extra code for it to produce mock<br/>\nIDfGroup and IDfUser objects that could then be resolved against each other<br/>\nin several variations by the business logic. It was a major effort just to<br/>\nget the mocks set up. IIRC the test code was significantly larger than the<br/>\noriginal class, let alone just the method I was testing.<br/>\n <br/>\nThe fact that calls to Documentum super class methods are intermingled with<br/>\nbusiness logic to a high degree and seperating them would complicate the<br/>\nclass inordinately making it less maintainable is also annoying.<br/>\n <br/>\nHaving said that I still haven&#39;t given up, I&#39;m just less confident than I<br/>\nwas. I also reread the holy books regularly (&quot;Refactoring&quot;, &quot;Working<br/>\nEffectively With Legacy Code&quot;, &quot;JUnit Recipes&quot;, &quot;Design Patterns&quot; and<br/>\n&quot;Refactoring to Patterns&quot;) trying to get ideas :-)<br/>\n <br/>\nMichael Rutherfurd <br/>\n <br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>] On Behalf Of<br/>\nDavid Saff<br/>\nSent: Wednesday, 21 June 2006 7:21 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSubject: Re: Mocking libraries and moving parts (was: Re: [junit] unit tes t<br/>\ncase for login())<br/>\n<br/>\n<br/>\n<br/>\nRutherford, Michael wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; In one example I tried was a fairly simple piece of business logic. I<br/>\n </span></blockquote>needed<br/>\n<blockquote><span title=\"ireply\"> &gt; to write some tests around a user belonging to a group.<br/>\n&gt; <br/>\n&gt; I needed at a minimum an implementation of IDfUser and IDfGroup. Due to<br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\"> &gt; nature of the beast it is most common to get these from the session<br/>\n&gt; (IDfSession). As all of these are interfaces it wasn&#39;t too bad but each of<br/>\n&gt; the interfaces extends others and have several hundred methods each. I<br/>\n&gt; eventually decided that what I was trying to test in this case was<br/>\n&gt; Documentum logic and that I should just trust the framework.<br/>\n&gt; <br/>\n </span></blockquote>One quick point: a major appeal of JMock, and the other mocking <br/>\nframeworks, as far as I know, is that the number of methods or <br/>\nsuperinterfaces of an interface does not affect the complexity of the <br/>\ntest, just the number of methods used. However, I also agree that you <br/>\nshouldn&#39;t test the framework, just your own code, as much as possible. <br/>\nThanks for the clarification,<br/>\n<br/>\nDavid Saff<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n**************   IMPORTANT MESSAGE  **************<br/>\nThis e-mail message is intended only for the addressee(s) and contains information which may be confidential. <br/>\nIf you are not the intended recipient please advise the sender by return email, do not use or disclose the contents, and delete the message and any attachments from your system. Unless specifically indicated, this email does not constitute formal advice or commitment by the sender or the Commonwealth Bank of Australia (ABN 48 123 123 124) or its subsidiaries. <br/>\nWe can be contacted through our web site: commbank.com.au. <br/>\nIf you no longer wish to receive commercial electronic messages from us, please reply to this e-mail by typing Unsubscribe in the subject line.<br/>\n***************************************************************<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 16993, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1150884128", 
    "canDelete": false, 
    "nextInTopic": 16998, 
    "prevInTopic": 16993, 
    "headers": {
        "messageIdInHeader": "PDRGRDE5MzEwOTE5OTQyNDhCOTEzREQ2Qjk4MkU4QjFCMEQyNDZCNDNAYzIwNTk2MHMxMz4="
    }
}