{
    "numMessagesInTopic": 6, 
    "nextInTime": 17007, 
    "senderId": "3FMk6O93PBCUePUyxMdjyqnkGd-T9fsxOtTFEJJCu2L2eYKJxpTNZy2ackOcZyWC28oFk5oMwpxKVw0F9JCNmjizNK3w0Zz0GLo2DyWmzz3k", 
    "systemMessage": true, 
    "subject": "Re: [junit] can junit test ejb&#39;s without junit extensions", 
    "from": "&quot;Brett L. Schuchert&quot; &lt;schuchert@...&gt;", 
    "authorName": "Brett L. Schuchert", 
    "msgSnippet": "Yes. We ve been doing it for 3+ years. The key is getting the right combination of jar files and property files in your class path. Once you ve done that, you", 
    "msgId": 17006, 
    "profile": "schuchert", 
    "topicId": 17004, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 162568887, 
    "messageBody": "<div id=\"ygrps-yiv-134448473\">Yes. We&#39;ve been doing it for 3+ years.<br/>\n <br/>\nThe key is getting the right combination of jar files and property files in your class path. Once you&#39;ve done that, you can connect to an EJB and send it a message. No problem.<br/>\n <br/>\nHowever, I&#39;d caution you to not do that if you can avoid it. <br/>\n <br/>\nI understand that you are testing the use of the code more closely to the environment in which it will run. On the other hand, you now will need to run a server to run your unit tests. They will be a bit more of a pain to debug (though they are certainly debug-able).<br/>\n <br/>\nWe are using stateful session beans (I can give you the reasons for it if you&#39;d like, but suffice it to say we are doing that). We then introduce entity beans because, frankly, WebSphere&#39;s handling of stateful session beans was wholly inadequate (and I can explain that - this was for WAS 5.0 - 5.1, have not experimented with WAS 6.0 or 6.1 yet). Since we started using entity beans, we started using server side tests. Now we have a whole lot of tests that require a server. <br/>\n <br/>\nWell we&#39;re moving away from that. We&#39;re replacing all of our entity beans (about 6 coarse-grained beans) with hibernate. We are moving all logic out of stateful session beans into POJO&#39;s so the session beans are just pass through. Then we&#39;ll use spring to configure the system.<br/>\n <br/>\nThis allows for quick testing without having to have a server running (better support for continuous integration only because it removes an excuse for people to check in without running all unit tests - not really a good reason but it can help). ALSO, if you move to WAS 6.0 and RAD 6.0, deployment can be VERY slow (up to 15 minutes and beyond for a moderate system), which makes testing even more of a pain BUT NO LESS ESSENTIAL.<br/>\n <br/>\nI understand that to be pragmatic you probably need a solution now and might consider allowing tests to run without having to use a server.<br/>\n <br/>\nI won&#39;t be able to get back to you with any details until next week (I&#39;m about to leave on a vacation). But if you send me the following information, I&#39;ll try to give you the details that might get you there:<br/>\n- Version of WAS<br/>\n- Your IDE, if any (WSAD, RAD, Eclipse + WTP, ...) and the version number of that IDE<br/>\n <br/>\nAs an alternative, you can try this right now:<br/>\n1. Start a server.<br/>\n2. Run the universal test client to look at the JNDI tree<br/>\n3. Find where your beans are actually deployed: cell/nodes/server/server1/... (or something like that, don&#39;t have the info handy)<br/>\n4. Use Sun&#39;s JNDI instead of IBM&#39;s<br/>\n5. Point to the correct port, 2809 for WAS 5.1, 2810 for WAS 6.x<br/>\n6. If you are looking for a session bean called FooHome, add cell/nodes/server/server1/ in front of it.<br/>\n <br/>\nHope that&#39;s enough to get you started. I can get more to you next week.<br/>\n <br/>\nEmail me direct, please, at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:schuchert@...\">schuchert@...</a><br/>\n <br/>\n<br/>\n <br/>\nTutorials and Articles<br/>\n     <a rel=\"nofollow\" target=\"_blank\" href=\"http://schuchert.wikispaces.com/\">http://schuchert.wikispaces.com/</a><br/>\n<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: swetha yalamanchili &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sb_syalamanchili@...\">sb_syalamanchili@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSent: Thursday, June 22, 2006 10:42:41 AM<br/>\nSubject: [junit] can junit test ejb&#39;s without junit extensions<br/>\n<br/>\n<br/>\nHi Rain,<br/>\n<br/>\nI have few questions.<br/>\nCan junit test ejb&#39;s without any sort of extensions like cactus or junitee or etc.<br/>\nCan JUnit test Ejb&#39;s on IBMWebsphere.<br/>\n<br/>\nplease help<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------ --------- --------- ---<br/>\nSneak preview the all-new Yahoo.com. It&#39;s not radically different. Just radically better. <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 17005, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1150999037", 
    "canDelete": false, 
    "nextInTopic": 17014, 
    "prevInTopic": 17004, 
    "headers": {
        "inReplyToHeader": "PDIwMDYwNjIyMTU0MjQxLjI2Mzk4LnFtYWlsQHdlYjU1NDAyLm1haWwucmU0LnlhaG9vLmNvbT4=", 
        "messageIdInHeader": "PDIwMDYwNjIyMTc1NzE3Ljg2NTEucW1haWxAd2ViNTQxMDQubWFpbC55YWhvby5jb20+"
    }
}