{
    "numMessagesInTopic": 1, 
    "nextInTime": 17066, 
    "senderId": "OZNQjv8xnTKdL4Bh4pMM6zkN2nqJ9LZEYFpo8rz7VDomCUEoydZ-qJYuHyeyxYkyC-KpEf2zsBwiHmADdU93ObBojMRJBk3PQAqxgFY", 
    "systemMessage": true, 
    "subject": "Junit, classpath, and eclipse", 
    "from": "&quot;Michael Schilder&quot; &lt;ansfrid@...&gt;", 
    "authorName": "Michael Schilder", 
    "msgSnippet": "I have been given the task at my workplace to be the junit guru for our development team. While we have the basic shell in place to make use of it, no one has,", 
    "msgId": 17065, 
    "profile": "ansfrid", 
    "topicId": 17065, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 63982624, 
    "messageBody": "<div id=\"ygrps-yiv-1021312161\">I have been given the task at my workplace to be the junit guru for<br/>\nour development team. While we have the basic shell in place to make<br/>\nuse of it, no one has, and our manager wants to start. <br/>\n<br/>\nI downloaded the jUnitDoclet code so that we could generate a junit<br/>\nshell for our whole application, and slowly start filling it out, and<br/>\nam encountering a few difficulties. I am trying to getting running in<br/>\nEclipse. I have set it up as an external tool as per the instructions.<br/>\nI have had to do a few fiddly fixes due to spaces being in used here<br/>\nand there in our path (source code is in a &quot;Java Source&quot; directory),<br/>\nbut that&#39;s fine, I figured that all out.<br/>\n<br/>\nWhat I am having trouble with, is the classpath. I know I can pass a<br/>\nclasspath as a parameter to the run_junitdoclet.bat file, though I am<br/>\nhaving difficulty making even that work. What I would really like, is<br/>\nto have it run, using the classpath of my specific project. I would<br/>\nprefer it being project relevant so that the same logic will work on<br/>\nany project. The problem is that as it runs, it creates a whole pile<br/>\nof compiler errors indicating that x reference or y package doesn&#39;t<br/>\nexist. Now sometimes, despite that, it will still create the test<br/>\nclass, so ultimately, it seems to work (if you just ignore over a<br/>\nhundred error mesages). Other times, it seems there are too many<br/>\nerrors for the test class to get written. This really prevents me from<br/>\njust trying to build every class in our application (way to many to go<br/>\none by one).<br/>\n<br/>\nSo...can I get it to use the project classpath, if not, what am I<br/>\nmissing from passing in classpath as a parameter. I added <br/>\n<br/>\n&quot;.&#92;Web Content&#92;WEB-INF&#92;lib&quot;<br/>\n<br/>\nas a classpath parameter, which does help, as I don&#39;t seem to get any<br/>\nerrors for any jar files that fall into this area, and this is<br/>\n*always* a relevant area, but we do reference other jar files as well,<br/>\nin some cases other projects, and in some cases external directories<br/>\nentirely (like Tomcat&#39;s common&#92;lib folder). I tried extending it to..<br/>\n<br/>\n&quot;.&#92;Web Content&#92;WEB-INF&#92;lib;C:&#92;Tomcat 5.0&#92;common&#92;lib&#92;&quot;<br/>\n<br/>\nand I get an error<br/>\n<br/>\n&quot;Content&#92;WEB-INF&#92;lib was unexpected at this time.&quot;<br/>\n<br/>\nso I am getting a little puzzled, and I just realized how long this<br/>\nmessage is, thanks for geting this far.</div>", 
    "prevInTime": 17064, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1152020956", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGU4ZHJrcytkdGJiQGVHcm91cHMuY29tPg=="
    }
}