{
    "numMessagesInTopic": 9, 
    "nextInTime": 17098, 
    "senderId": "gsW-t4cXD1pbZq-HqTwsKTQBr71V9ZiYiQ7jskLXO5k9xklg4OHmDiIOEJMzdeWpXML-IUFnP-cP", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Learning JUnit", 
    "from": "didoss@...", 
    "authorName": "didoss@comcast.net", 
    "msgSnippet": "I agree. There are a lot of basic JUnit concepts that can be addressed against some basic classes, without having to add the complexity of mocking, and all the", 
    "msgId": 17097, 
    "rawEmail": "Return-Path: &lt;didoss@...&gt;\r\nX-Sender: didoss@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 49063 invoked from network); 7 Jul 2006 17:27:47 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m33.grp.scd.yahoo.com with QMQP; 7 Jul 2006 17:27:47 -0000\r\nReceived: from unknown (HELO rwcrmhc11.comcast.net) (204.127.192.81)\n  by mta4.grp.scd.yahoo.com with SMTP; 7 Jul 2006 17:27:47 -0000\r\nReceived: from rmailcenter90.comcast.net ([204.127.197.190])\n          by comcast.net (rwcrmhc11) with SMTP\n          id &lt;20060707164934m1100i805fe&gt;; Fri, 7 Jul 2006 16:49:34 +0000\r\nReceived: from [24.248.74.254] by rmailcenter90.comcast.net;\n\tFri, 07 Jul 2006 16:49:32 +0000\r\nTo: junit@yahoogroups.com\r\nDate: Fri, 07 Jul 2006 16:49:32 +0000\r\nMessage-Id: &lt;070720061649.22353.44AE909B000CA1F90000575122068246939C9C010B070B@...&gt;\r\nX-Mailer: AT&T Message Center Version 1 (Apr 11 2006)\r\nX-Authenticated-Sender: ZGlkb3NzQGNvbWNhc3QubmV0\r\nMIME-Version: 1.0\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: didoss@...\r\nSubject: Re: [junit] Re: Learning JUnit\r\nX-Yahoo-Group-Post: member; u=180862158; y=kshDCoK5KcpnPWZnAryEcHNr04lajpfMyqqyo1z1hVzyxQ\r\nX-Yahoo-Profile: dijdoss\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\n\r\nI agree.\n\nThere are a lot of basic JUnit concepts that can be addressed against some basic classes, without having to add the complexity of mocking, and all the XUnit variations.  Get the basic ideas down: test one thing per test; test everything (that can break); use test results for refactoring; use test complexity as sign of need for refactoring; set up nightly builds with test result e-mails (really ant tasks, but useful tools in Unit Testing); etc.\n\nYou could look at it as starting at a &quot;Hello World&quot; level.  Every programming concept/language has a basic &quot;Hello World&quot; level, and then you add functionality.  So write the &quot;Hello World&quot; app and write the tests (or vice versa, depending on your mindset), and automate the build, and produce test results.\n\nAfter you have everything running that you would do for a full project, add a new requirement.  Then, work through how to handle that new requirement.  Teach them how to think about testing,...I have this new thing to test, but it is a little different than what I already have - how do I go about testing it?  \n\nSo, if you are looking at a 2 day course (which I think was mentioned in the original thread), maybe the first half a day is discussing the needs for (and benefits of) unit testing.  The second half of the first day could be working through the Hello World example from scratch (&quot;download&quot; JUnit and everything - could already have the files, but show them where to get them).  The first part of the second day is hands-on, let them right code/tests to enhance their Hello World applications.  Midway through the second day, start discussing how to think about testing: how to address new challenges.  This gives you the opportunity to introduce the other concepts that you mentioned below and show them where to find more information,...and also might plug into some follow-up classes.\n\nSo, I wrote this whole response and then went back to your original e-mail.  I noticed that you state that you are &quot;designing a course on Testing&quot;,...which leads me to question who your audience is.  This being the JUnit list, I assume it is geared towards engineers/developers and is really focused on Unit/Engineer/Functional/Integration Testing - however you classify the testing that the person who writes the code does.  Do you care/need to address the WinRunner, etc. side of the house, where the QA person is testing code?\n\n\nDianne\n\n-------------- Original message -------------- \nFrom: &quot;Simon Chappell&quot; &lt;simonpeterchappell@...&gt; \n\nI&#39;m firmly of the &quot;less is more&quot; school on this matter. While all of\nthe things that you&#39;re suggesting to cover are well and good, I would\nstrongly recommend getting all of your students grounded in basic\nJUnit for a couple of days. Then let them have a few days/weeks to use\nit against actual code and then bring them back in for a followup\nclass on the basics again. Hold off on mockobjects, db or web testing\nuntil they can write standard tests in their sleep.\n\nJUnit is a great tool, but getting developers to use even the basics\nis a challenge. Don&#39;t ask any more of them than the basics to start\nwith.\n\nSimon\n\nOn 7/6/06, Vijay &lt;vijay_nathani@...&gt; wrote:\n&gt; I am posting this message again with some more details. I need help on\n&gt; this issue. I would appreciate if someone helps me.\n&gt;\n&gt; I am designing a course on Testing. The course should train the\n&gt; participants on all the practical tools used for testing. The suggested\n&gt; course contents are\n&gt;\n&gt; 1) Using Junit for unit testing\n&gt; 2) Mock objects. (Which is better JMock or EasyMock?)\n&gt; 3) DBUnit for database testing.\n&gt; 4) Web testing. (Which tool is the best HtmlUnit or JWebTest or\n&gt; Selenium?)\n&gt; 5) Acceptance testing with FIT. (Is this tool used by many people?)\n&gt;\n&gt; If possible, I would appreciate comments from the group regarding\n&gt; topics to be added in /deleted from this course and also the questions\n&gt; in the above message.\n&gt; Thanks............Vijay\n&gt; www.geocites.com/vijay_nathani\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Yahoo! Groups Links\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n\n-- \nwww.simonpeter.org\n\n \n\n[Non-text portions of this message have been removed]\n\n\n", 
    "profile": "dijdoss", 
    "topicId": 17025, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 180862158, 
    "prevInTime": 17096, 
    "contentTrasformed": false, 
    "postDate": "1152290972", 
    "canDelete": false, 
    "nextInTopic": 17099, 
    "prevInTopic": 17096, 
    "headers": {
        "messageIdInHeader": "PDA3MDcyMDA2MTY0OS4yMjM1My40NEFFOTA5QjAwMENBMUY5MDAwMDU3NTEyMjA2ODI0NjkzOUM5QzAxMEIwNzBCQGNvbWNhc3QubmV0Pg=="
    }
}