{
    "numMessagesInTopic": 38, 
    "nextInTime": 17145, 
    "senderId": "GRPqdX7-NVE5iEiGi_3UuuQPOg0h2WU0QH-JT1mY0zPt4EMwKzuHISZzbTL6atGuCWBbKoXJA7oNoWS34OPcRjXC5jlDF5AOwFR7OYqbZW1e", 
    "systemMessage": true, 
    "subject": "More JUnit Examples", 
    "from": "&quot;Brett L. Schuchert&quot; &lt;schuchert@...&gt;", 
    "authorName": "Brett L. Schuchert", 
    "msgSnippet": "http://schuchert.wikispaces.com/Car+Rental+Example This is an example I plan to get a lot of mileage out of. It contains 100 unit tests written for Dao s (all", 
    "msgId": 17144, 
    "profile": "schuchert", 
    "topicId": 17141, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 162568887, 
    "messageBody": "<div id=\"ygrps-yiv-1462140140\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://schuchert.wikispaces.com/Car+Rental+Example\">http://schuchert.wikispaces.com/Car+Rental+Example</a><br/>\n <br/>\nThis is an example I plan to get a lot of mileage out of. It contains 100 unit tests written for Dao&#39;s (all in memory right now), Components that perform simple validation and Business Objects that do NOT follow the transfer object (anti) pattern. (When I got to around 95 tests naturally, I went around looking for 5 more to add).<br/>\n <br/>\nYou can just download the file and have a look at the &quot;test&quot; directory under the CarRental project. Alternatively, you can follow all of the instructions and get them to run.<br/>\n <br/>\nThis example has several things embedded in it, including:<br/>\n- A simple use of Spring<br/>\n- An aspect that outputs the time each unit test takes to run (mentioned earlier on this list)<br/>\n- Yet another simple wrapper around Log4J that actually adds value by using variable arguments<br/>\n- Several examples of the use of Generics (both types and methods)<br/>\n- What something looks like after using both PMD and Checkstyle<br/>\n- JUnit, of course (not TestNG - just to presempt Cédric&#39;s question about whether I&#39;ve looked at TestNG (I have))<br/>\n <br/>\nI plan to extend this example over the next several months (as time permits). On my TO DO list (not necessarily in priority order):<br/>\n- Introduce Hibernate (replace all of the in-memory Dao&#39;s with hibernate)<br/>\n- Rewrite (by hand) every test using TestNG (for experience - I don&#39;t want to just convert them so I can learn TestNG from the ground up - and I figure after writing that many tests I&#39;ll have enough experience to intelligently speak about both JUnit and TestNG)<br/>\n- I&#39;ll add some kind of front end, have not yet decided.<br/>\n- Plan out more possible Aspect assignments to be applied to this example (that&#39;s the original impetus for this work - part 2 of a 3-part class on AOP and AspectJ)<br/>\n <br/>\nComments welcome.<br/>\n <br/>\nOh, if you do follow all of the instructions and you install everything under the same directory, it will take up roughly 312 MB (+ some for the block size used by your hard drive).<br/>\n <br/>\nFYI, the last time I checked, the ratio of the &quot;source&quot; code to the &quot;test&quot; code was 3:2. That is, around 1500 non-comment source statements for the src directory and about 1000 non-comment source statements for the test directory. Are your results similar?<br/>\n <br/>\nBrett<br/>\n <br/>\nTutorials and Articles<br/>\n     <a rel=\"nofollow\" target=\"_blank\" href=\"http://schuchert.wikispaces.com/\">http://schuchert.wikispaces.com/</a><br/>\n<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: clgonsal &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:clgonsal@...\">clgonsal@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSent: Monday, July 17, 2006 6:08:15 PM<br/>\nSubject: [junit] setUp versus constructors<br/>\n<br/>\n<br/>\nI&#39;ve been using JUnit for a few years now, and one thing that&#39;s always<br/>\nbothered me is the &quot;setUp&quot; method.<br/>\n<br/>\nI always do my initialization in my constructor (if I&#39;m not just doing<br/>\nit at the field definition) as constructors allow me to initialize<br/>\nfinal fields. The semantics of using a constructor also seem far more<br/>\nobvious to me as everyone reading my code knows Java, while not<br/>\neveryone is a JUnit guru.<br/>\n<br/>\nThe additional complexity of having the (as far as I can tell)<br/>\nredundant setUp method seems counterproductive, so why does setUp exist?<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 17143, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1153190247", 
    "canDelete": false, 
    "nextInTopic": 17145, 
    "prevInTopic": 17141, 
    "headers": {
        "inReplyToHeader": "PGU5aDU4ditzaTFhQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDIwMDYwNzE4MDIzNzI3LjUzODA1LnFtYWlsQHdlYjU0MTE0Lm1haWwueWFob28uY29tPg=="
    }
}