{
    "numMessagesInTopic": 10, 
    "nextInTime": 17231, 
    "senderId": "01KkEDqOz095Mu7nJEk7AT9vPKRICfxHVjOnkVgqeMQ_rI6z1j4qjTNjQ9hbzEqn7mFXM88fmSWva_RYoIxSNbz1Gz4OMdBfXkoMiICazv6NE6DAxyO4lAIaPZ8", 
    "systemMessage": false, 
    "subject": "RE: [junit] OT: Streams / Readers/ Writers or files, what do you use    and how do you test?", 
    "from": "&quot;Rutherford, Michael&quot; &lt;michael.rutherford@...&gt;", 
    "authorName": "Rutherford, Michael", 
    "msgSnippet": "I prefer streams for the additional flexability. I like that I can wrap one or two contructors and get completely different input or output destinations. The", 
    "msgId": 17230, 
    "profile": "mrutherfurd", 
    "topicId": 17215, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 229542016, 
    "messageBody": "<div id=\"ygrps-yiv-651590472\">I prefer streams for the additional flexability. I like that I can wrap one<br/>\nor two contructors and get completely different input or output<br/>\ndestinations.<br/>\n <br/>\nThe thing that does bug me is that classes like Properties don&#39;t have a<br/>\nstandard input stream constructor. It does have load() of course but that<br/>\nrequires you to first instantiate then load.<br/>\n <br/>\nMichael Rutherfurd<br/>\n <br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>] On Behalf Of<br/>\nJoakim Ohlrogge<br/>\nSent: Thursday, 27 July 2006 5:56 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSubject: Re: [junit] OT: Streams / Readers/ Writers or files, what do you<br/>\nuse and how do you test?<br/>\n<br/>\n<br/>\n<br/>\nHi Cédric, sorry about spelling your name wrong.ö<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s not a matter of preference. Sometimes I work with streams, sometimes<br/>\n </span></blockquote>I<br/>\n<blockquote><span title=\"ireply\"> &gt; work with File objects and sometimes, I just want the content of the file<br/>\n </span></blockquote>as<br/>\n<blockquote><span title=\"ireply\"> &gt; an array of strings or as one big String. It&#39;s unfortunate that the latter<br/>\n&gt; is still not supported in the JDK.<br/>\n<br/>\n </span></blockquote>The reason I am asking is that I always seem to prefer a<br/>\nFileStream/Reader/Writer to working directly with a file. I have<br/>\nnoticed that a lot of people seem to have a preference towards working<br/>\nwith files rather than Streams/Readers/Writers.<br/>\n<br/>\nIf I would want random acces or something I would opt for working<br/>\ndirectly with files but I can&#39;t recall needing that, I have not<br/>\nwritten storages or such. Another occation when I use file objects is<br/>\nwhen doing file system management, creating listing, renaming, working<br/>\nwith directories etc. But when I read/write data i always use<br/>\nstreams/readers/writers.<br/>\n<br/>\nCould you give an example when you think that reading/writing directly<br/>\nto/from a File is better than a stream.<br/>\n<br/>\nAlso, when you have your array of Strings or single big string, what<br/>\ndo you typically do with it? I can think of some things but I am<br/>\ncurious.<br/>\n<br/>\nOne of the reasons I prefer Streams so much is because of the<br/>\nadvantage of being able to direct state to memory rather than disk and<br/>\nvary source/target media (like parser might just aswell get its input<br/>\nfrom a keyboard, socket, file, memory-location, it should not be bound<br/>\nto a file). The first point of directing state to memory is<br/>\nindispensable when testing.<br/>\n<br/>\nAlso, files imply mutable state of the worst kind. Most of the bugs I<br/>\nfind in my code have to do with mutablestate in one way or another and<br/>\nthus I try to avoid it when possible. That is also why I am a fan of<br/>\ninteractionbased testing.<br/>\n<br/>\nJust tossing some of my reasoning in there to be analysed, questioned<br/>\nand developed.<br/>\n/J<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n**************   IMPORTANT MESSAGE  **************<br/>\nThis e-mail message is intended only for the addressee(s) and contains information which may be confidential. <br/>\nIf you are not the intended recipient please advise the sender by return email, do not use or disclose the contents, and delete the message and any attachments from your system. Unless specifically indicated, this email does not constitute formal advice or commitment by the sender or the Commonwealth Bank of Australia (ABN 48 123 123 124) or its subsidiaries. <br/>\nWe can be contacted through our web site: commbank.com.au. <br/>\nIf you no longer wish to receive commercial electronic messages from us, please reply to this e-mail by typing Unsubscribe in the subject line.<br/>\n***************************************************************<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 17229, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1153956423", 
    "canDelete": false, 
    "nextInTopic": 17232, 
    "prevInTopic": 17226, 
    "headers": {
        "messageIdInHeader": "PDRGRDE5MzEwOTE5OTQyNDhCOTEzREQ2Qjk4MkU4QjFCMEQyNDZCRTJAYzIwNTk2MHMxMz4="
    }
}