{
    "numMessagesInTopic": 5, 
    "nextInTime": 17262, 
    "senderId": "jKBNxDpo41X0mwnMe0X36ftIdP3ijW6Q5Kl_tUkSIpW1KQh1T2CrjLUSjo_rX_p1sd5PUpxwUJOhYHjdORtmthl1My-6u4_NFTUcvc0dDtPghymhUA", 
    "systemMessage": false, 
    "subject": "Re: [junit] Static objects vs tests separation", 
    "from": "jason r tibbetts &lt;tibbettj@...&gt;", 
    "authorName": "jason r tibbetts", 
    "msgSnippet": "Anna, ... If the app class has a non-private constructor, then your tests don t need to instantiate it as a singleton, right? And you also modifed the app", 
    "msgId": 17261, 
    "profile": "tibbettj_at_verdi_sra_com", 
    "topicId": 17251, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 224061497, 
    "messageBody": "<div id=\"ygrps-yiv-187425122\">Anna,<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The application is a kind of specialized graphic editor with a typical<br/>\n&gt; MDI design. Its core is an object, say APP, static reference of which<br/>\n&gt; is kept in the main class (much like in singleton, but the<br/>\n&gt; constructor&#39;s not private; for the above stated reasons I don&#39;t want<br/>\n&gt; to discuss this detail).<br/>\n&gt; <br/>\n&gt; *snip*<br/>\n&gt; <br/>\n&gt; And what&#39;s what started to give me trouble recently. It is possible to<br/>\n&gt; initialize this APP object, loading GUI modules or not. To be honest,<br/>\n&gt; using it without UI is a workaround of mine, which I implemented to be<br/>\n&gt; somewhat closer to unit testing, although my tasks are actually<br/>\n&gt; regular regression tests, examining whole big chunks of<br/>\n&gt; functionality... So in a part of my tests that don&#39;t need the<br/>\n&gt; graphical modules, I simply don&#39;t load them. However, I&#39;ve recently<br/>\n&gt; been trying out some other type of tests that operate on a<br/>\n&gt; full-fledged application, which needs loading the UI. And that&#39;s where<br/>\n&gt; the problem begins - trying to load those modules, having used the<br/>\n&gt; application without them in previous tests, is in the application, as<br/>\n&gt; it currently is, impossible (and don&#39;t think that anyone will take<br/>\n&gt; grumbling of a humble tester into consideration).<br/>\n&gt; <br/>\n&gt; So the question to you guys is as follows: should I give up hope that<br/>\n&gt; my job has anything to do with unit testing, and allow dosens of funny<br/>\n&gt; windows to jump here and fro while basic functionality is being<br/>\n&gt; checked or rather do you see any other possibility to solve my problem<br/>\n&gt; that I, humble rookie, overlooked?<br/>\n<br/>\n </span></blockquote>If the app class has a non-private constructor, then your tests don&#39;t <br/>\nneed to instantiate it as a singleton, right? And you also modifed the <br/>\napp class so that you can suppress the loading of the UI modules. What, <br/>\nthen, is impossible about having some tests instantiate the app without <br/>\nthe UI bits, and other tests that do?</div>", 
    "prevInTime": 17260, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1154457098", 
    "canDelete": false, 
    "nextInTopic": 17286, 
    "prevInTopic": 17251, 
    "headers": {
        "inReplyToHeader": "PGVhbDM4dCs1MmxnQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDQ0Q0Y5RTBBLjYwOTAxMDhAdmVyZGkuaWlzZC5zcmEuY29tPg==", 
        "referencesHeader": "PGVhbDM4dCs1MmxnQGVHcm91cHMuY29tPg=="
    }
}