{
    "numMessagesInTopic": 287, 
    "nextInTime": 17288, 
    "senderId": "mtLvxVJ6nmTHoXYuHu5kyE32JoliaaNcHzUoNAES4-nlioUzuiP5kWZcYhRspil_1htHwcavVDw5DEGURdVKTrcOsRvYfeQyNO67nejDdqdJ8JxC", 
    "systemMessage": false, 
    "subject": "Re: Not doing testing (was: Re: [junit] Re: Are you really using JUnit during your development?)", 
    "from": "&quot;Joakim Ohlrogge&quot; &lt;joakim.ohlrogge@...&gt;", 
    "authorName": "Joakim Ohlrogge", 
    "msgSnippet": "... Hi Cédric, 1) I would change this statement to most software is not automatically tested with tools such as TestNG, JUnit or FIT or similar . Then I", 
    "msgId": 17287, 
    "profile": "j0hlrogge", 
    "topicId": 17266, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 261856052, 
    "messageBody": "<div id=\"ygrps-yiv-780600382\"><blockquote><span title=\"ireply\">&gt;  I&#39;ll just repeat what I said in my previous email:  most of the software out<br/>\n&gt;  there is 1) not tested and 2) works great.<br/>\n<br/>\n </span></blockquote>Hi Cédric,<br/>\n<br/>\n1) I would change this statement to &quot;most software is not<br/>\nautomatically tested with tools such as TestNG, JUnit or FIT or<br/>\nsimilar&quot;. Then I would agree with you. I think that ALL software out<br/>\nthere is tested but a lot of the time it is a manual effort and the<br/>\nwhole piece of software is not guaranteed to be tested every release.<br/>\nAlso a lot of testing is sadly deferred to end users.<br/>\n<br/>\n2) I certainly don&#39;t think that most software out there works great. I<br/>\nthink most software is living up to our expectations of how it should<br/>\nwork but I have certainly been on projects where nothing has been<br/>\ntested automatically and that had a level that we thought were<br/>\nacceptable that I now think is embarrasing. Everything is relative.<br/>\n<br/>\nAs an example:<br/>\n<br/>\nI know if a company that released a whole lot of custom made software<br/>\nto their very large userbase. When a new feature or &quot;application&quot; as<br/>\nit was called (this was a web-portal) was released live it was<br/>\nperfecly natural to have a &quot;break in period&quot; of a few weeks/months.<br/>\nEvreybody knew that this is what to expect when new software is<br/>\nreleased. The customer was used to this and did not find it strange<br/>\nalthough they found it a bit stressfull. The developers of course made<br/>\nsure that they had their evenings free atleast the first week after<br/>\ngoing live. The applications were devloped mainly by contractors.<br/>\n<br/>\nOf course testing was done, rigorous testing, the code was moved<br/>\nbetween and tested in different environments according to a very<br/>\nstrict process. A LOT of manual effort was spent testing the software<br/>\nand still over a 100 bug reports in the first week, after going live,<br/>\nfrom end-users was not unheard of. This was for relatively small and<br/>\nsimple applications.<br/>\n<br/>\nI don&#39;t know about you, but I don&#39;t think I ever submitted a bugreport<br/>\nto a site I visited that gave me an error. Aparently some people do<br/>\nand my guess is that they are not happy when they take time out of<br/>\ntheir schedules to do that.<br/>\n<br/>\nOne application was later developed where automatic unit testing was<br/>\nused (with JUnit). That application was a real application and a<br/>\n&quot;proof of concept&quot; for unit testing. The people that coded the<br/>\napplication had not used JUnit before in their development but were<br/>\nwell familiar with the concept and had finally convinced the right<br/>\npeople that it should be tried. So the developers were learning while<br/>\ncoding and there were some personal prestige at stake so I bet they<br/>\nwere more careful than normal.<br/>\n<br/>\nWhen that application went live it was a success. To this day I only<br/>\nknow of one or two bugs that have been submitted ever about that<br/>\napplication.<br/>\n<br/>\nI think that using JUnit was a big part of that success but of course<br/>\nthe extra prestige and strong commitment from the team was a highly<br/>\ncontributing factor. Since then JUnit has been a requirement by the<br/>\ncustomer. It has worked better but not as good as that success-story.<br/>\nI think the biggest reason it could not be reproduced fully was that<br/>\nJUnit was forced on people without any education effort. JUnit doesn&#39;t<br/>\nwork &quot;well&quot;/&quot;at all&quot; if you don&#39;t understand why you should use it.<br/>\nMore importantly, It doesn&#39;t fix any problems if you think that<br/>\neverything is fine (there are no real problems, so what if we release<br/>\na few bugs! this is software!)<br/>\n<br/>\nTo sum it up, I agree that most applications out there are not tested<br/>\nthe way we would like them to have been tested. I think most of them<br/>\nwork well enough but I also think there are generally /too many/ bugs<br/>\nin software today. I think that users and more importantly<br/>\n/developers/ have an unhealthily high acceptance for this situation. I<br/>\nthink we as developers should not be satisfied with delivering<br/>\nsoftware that contains stuff that doesn&#39;t work even if /most/ of the<br/>\nstuff delivered works. I think this attitude is unproffesional and I<br/>\ndon&#39;t want to work that way. I want to /know/ what I delver works. I<br/>\nam not 100% sure all of the time about this but until I am I am not<br/>\nsatisfied with the situation.<br/>\n<br/>\nI am convinced that whenever you trade testing for features it will<br/>\nbite you sooner or later. I still do this more often than I would<br/>\nlike, it happens from time to time but I hope that I have learned<br/>\nbefore I can no longer get away with that &quot;my stuff tend to work<br/>\nbetter than other stuff&quot; (the stuff that is not tested as well).<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I&#39;d like everybody to reflect on that for a while before I send my next<br/>\n&gt;  message...<br/>\n<br/>\n </span></blockquote>I look forward to your next message. It is uch an interesting subject.<br/>\nThanks for the discussion.<br/>\n<br/>\n/Joakim Ohlrogge</div>", 
    "prevInTime": 17286, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1154592358", 
    "canDelete": false, 
    "nextInTopic": 17289, 
    "prevInTopic": 17285, 
    "headers": {
        "inReplyToHeader": "PGI4NmI2YTljMDYwODAyMjEyMWgyM2QxYTFmOWo1OGE0MmY4YWZlMjZlODdmQG1haWwuZ29vZ2xlLmNvbT4=", 
        "messageIdInHeader": "PGI5ZWU1ZTQxMDYwODAzMDEwNWszMDZjMzM1ZnVhZWM4NjJlMzc1ZWUxMTllQG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PEQwOTIyODY5LUNDRUItNDBCMi04RDM0LUQ0RDc3QkZEMEEwQUBvYmplY3RtZW50b3IuY29tPgkgPGI4NmI2YTljMDYwODAyMTI1MnQxZDg2NzgxcjU3MGMwMDVmYzFkZGFjNWJAbWFpbC5nb29nbGUuY29tPgkgPDQ0RDE2QTJCLjQwMzAwMDFAbWluZHNwcmluZy5jb20+CSA8Yjg2YjZhOWMwNjA4MDIyMDIzZzM1MzZiMDhlcGE4MDQ2YjIwNjI2MGE0ZjNAbWFpbC5nb29nbGUuY29tPgkgPDQ0RDE3NUEwLjUwNzA2MDBAbWl0LmVkdT4JIDxiODZiNmE5YzA2MDgwMjIxMjFoMjNkMWExZjlqNThhNDJmOGFmZTI2ZTg3ZkBtYWlsLmdvb2dsZS5jb20+"
    }
}