{
    "numMessagesInTopic": 17, 
    "nextInTime": 17326, 
    "senderId": "uTEVSQ547Eje-X1CDaqttHg50qvW1iuMEYcQOk7CiWL3J24ntymKYTHwbFT1f0TWVnUpEQAHTWPokB3a5TyWMdIH7BA_zjL2a8qcpdB7yxeM3X5w", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Are you really using JUnit during your developmen t?", 
    "from": "&quot;Joakim Ohlrogge&quot; &lt;joakim.ohlrogge@...&gt;", 
    "authorName": "Joakim Ohlrogge", 
    "msgSnippet": "My sinsere apologies to you Cédric, I didn t realise that the statement that upset me was not written by you. I jumped to my guns too quickly.", 
    "msgId": 17325, 
    "profile": "j0hlrogge", 
    "topicId": 17279, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 261856052, 
    "messageBody": "<div id=\"ygrps-yiv-754056016\">My sinsere apologies to you Cédric, I didn&#39;t realise that the<br/>\nstatement that upset me was not written by you. I jumped to my guns<br/>\ntoo quickly.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 8/7/06, Joakim Ohlrogge &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joakim.ohlrogge@...\">joakim.ohlrogge@...</a>&gt; wrote:<br/>\n&gt; Hi Cédric,<br/>\n&gt;<br/>\n&gt; &gt; FYI, a few more reactions and articles on the same topic.  It looks like<br/>\n&gt; &gt;  most of the Java and Ruby communities (last link) are typically using a<br/>\n&gt; &gt;  small portion of TDD and a majority of regular testing, which matches my<br/>\n&gt; &gt;  experience.<br/>\n&gt;<br/>\n&gt; I don&#39;t think anyone ever disagreed that &quot;regular testing&quot; interpreted<br/>\n&gt; to mean automated acceptance testing and unit testing is not done to<br/>\n&gt; the extent we would like to see on this list. I don&#39;t think anyone<br/>\n&gt; needs to be convinced about this, this is a known fact, one that a lot<br/>\n&gt; of us believe should change. It is in the conclusions that can be<br/>\n&gt; derived from that where opinions differ. You seem to say that since<br/>\n&gt; most software is not &quot;regularly tested&quot; and most software works great<br/>\n&gt; you can abviously do perfectly well without &quot;regular testing&quot;.<br/>\n&gt;<br/>\n&gt; Myself and others have argued that most software can work better and<br/>\n&gt; that our acceptance for errors is too high. David Saff also made an<br/>\n&gt; interesting comment about all the software we don&#39;t see, the software<br/>\n&gt; we don&#39;t use and the software that is never released. I think it is<br/>\n&gt; natural that popular software used by many works great, or it<br/>\n&gt; wouldn&#39;&#39;t be popular. Popular software can also deferr some testing to<br/>\n&gt; their &quot;beta&quot;-testers and &quot;get away with it&quot;. But that is just a small<br/>\n&gt; fraction of all the software written.<br/>\n&gt;<br/>\n&gt; I personally think that you are way wrong that there is code that is<br/>\n&gt; ot tested and works. I think that all software out there is tested,<br/>\n&gt; meaning some effort has been made to ensure that it works. There are<br/>\n&gt; hard ways and easy ways to test software. The easy way (I think it is<br/>\n&gt; automated testing) is the most reliable while the hard way requires<br/>\n&gt; some guesswork and predictions coupled with manual effort.<br/>\n&gt;<br/>\n&gt; I followed the first link and got a little bit upset by one of your<br/>\n&gt; transcriptions of a supposedly rethorical answer:<br/>\n&gt;<br/>\n&gt; &quot;One response to the question suggests that there are only two types<br/>\n&gt; of code: Code that is tested and works and code that is not tested and<br/>\n&gt; doesn&#39;t work. Cedric&#39;s take on the subject is that there are ways of<br/>\n&gt; knowing that your code is working without actually testing it. So we<br/>\n&gt; should also include a third category: Code that is not tested and<br/>\n&gt; works.&quot;<br/>\n&gt;<br/>\n&gt; That was your subjective interpretation of what Robert C Martin wrote.<br/>\n&gt; When you asked for clarification you asked:<br/>\n&gt;<br/>\n&gt; &quot;You seem to imply that there are only two kinds of code:<br/>\n&gt;<br/>\n&gt;  - Code that is tested and works<br/>\n&gt;  - Code that is not tested and doesn&#39;t work<br/>\n&gt;<br/>\n&gt; There is actually something in the middle: it&#39;s called &quot;Code that<br/>\n&gt; is not<br/>\n&gt; tested but that works&quot;.&quot;<br/>\n&gt;<br/>\n&gt; That was the interpretation you used in the blog-entry.<br/>\n&gt; The reply came:<br/>\n&gt;<br/>\n&gt; &quot;The two kinds of code are:<br/>\n&gt;<br/>\n&gt; - Code you have tested, and you know works to the best of your<br/>\n&gt; ability to determine.<br/>\n&gt; - Code you have not tested and don&#39;t know if it works.<br/>\n&gt;<br/>\n&gt; If you haven&#39;t tested the code, you don&#39;t know that it works. If you<br/>\n&gt; HAVE tested the code then you know that it passes your tests.&quot;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Why didn&#39;t you just post the statement as it was written instead of<br/>\n&gt; your subjective interpretation? Your interpretation sure has more<br/>\n&gt; punch that the real thing but it is obviously  not what the author<br/>\n&gt; meant.<br/>\n&gt;<br/>\n&gt; I really admire you taking a stand in this discussion and in this<br/>\n&gt; forum. A lot of really good discussion has come out of it and not many<br/>\n&gt; are so brave as you are to go against the flow on a board like this.<br/>\n&gt; But when you post subjective interpretaions like the one above you<br/>\n&gt; loose credibility, atleast with me. And I think that is a shame<br/>\n&gt; because you obviously have a message that you want to get through<br/>\n&gt; with. I think your opinions deserves to be listened to and evaluated.<br/>\n&gt;<br/>\n&gt; I didn&#39;t read the rest of the links or the comments, perhaps something<br/>\n&gt; more interesting or would have com up there.<br/>\n&gt;<br/>\n&gt; Just one mans opinion<br/>\n&gt; /J<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 17324, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1154938400", 
    "canDelete": false, 
    "nextInTopic": 17328, 
    "prevInTopic": 17323, 
    "headers": {
        "inReplyToHeader": "PGI5ZWU1ZTQxMDYwODA3MDAyNGs3M2RiNjA5Y3gyMjIwMDIwYjdmNDczZDJjQG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PGI5ZWU1ZTQxMDYwODA3MDExM3FjMTE5MjU2ajEwMGZkMjBhZWY4MjE1ZjhAbWFpbC5nbWFpbC5jb20+", 
        "referencesHeader": "PEI2ODEyMUJBLUQ4QTUtNDREQi1BNzMwLTNCRkUwQkFGNTgxMUBvYmplY3RtZW50b3IuY29tPgkgPGI4NmI2YTljMDYwODAzMTg0MHE1NDdhYTcwY3U1ODc4ZTBhOWM2ZmU4YmRmQG1haWwuZ29vZ2xlLmNvbT4JIDxiODZiNmE5YzA2MDgwNjEyMzZ5YzkyYWNkZXEzYmZhMjFkNTE5NDQwYzU0QG1haWwuZ29vZ2xlLmNvbT4JIDxiOWVlNWU0MTA2MDgwNzAwMjRrNzNkYjYwOWN4MjIyMDAyMGI3ZjQ3M2QyY0BtYWlsLmdtYWlsLmNvbT4="
    }
}