{
    "numMessagesInTopic": 13, 
    "nextInTime": 17339, 
    "senderId": "2cUK12ASH1nlxcsC2ZfxMu6XsfUUXusDEvz4-ZtniNSXpBizhkl-zvnkU_GqaYo8L4ls1i9qKWsl9JGQ-stRaEfpfrkrOYh0kje3qN1vAvWU", 
    "systemMessage": true, 
    "subject": "How to add functionality for execution flexibilty?", 
    "from": "&quot;Michael Schechter&quot; &lt;bard@...&gt;", 
    "authorName": "Michael Schechter", 
    "msgSnippet": "I am looking to add the following functionality to my tests: - When provided a list of method names on the command line, only those methods in the invoked", 
    "msgId": 17338, 
    "profile": "mlschechter", 
    "topicId": 17338, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 92828003, 
    "messageBody": "<div id=\"ygrps-yiv-1895124137\">I am looking to add the following functionality to my tests:<br/>\n- When provided a list of method names on the command line, only those<br/>\nmethods in the invoked class will be executed.<br/>\n<br/>\nI need this implementation at the test class level. This was pretty<br/>\nstraightforward with JUnit 3.8.1 - just create new instances of the<br/>\nderived TestCase with the method name as the argument, and add them to<br/>\nthe suite.<br/>\n<br/>\nI am having a lot of difficulty trying to replicate this<br/>\nfunctionality. The filter logic appears to be a one-shot exclusion<br/>\nfilter (everything not matching is dropped), and I can&#39;t seem to find<br/>\nany documentation that would address this.<br/>\n<br/>\nAs Mr. Rainsberger and others have suggested, I have searched the web<br/>\nfor an appropriate tutorial. I have found a number of good basic<br/>\ntutorials (including some references in this group), and a couple with<br/>\nsome advanced content. I cannot seem to find one with the detail to<br/>\nunlock the tools and capabilities that I am positive are available<br/>\nwithin the new JUnit framework. <br/>\n<br/>\nI am also convinced that no one is as capable as the authors in<br/>\ndocumenting the features of the framework, and I am having trouble<br/>\nfind Javadoc for some of the classes and APIs in the JUnit 4.1 tree.<br/>\nThere is a fairly good chance that I am looking in the wrong place.<br/>\n<br/>\nIf anyone has any suggestions or guidance on these issues, it would be<br/>\ngreatly appreciated.<br/>\n<br/>\nThanks in advance!<br/>\n<br/>\nMichael Schechter</div>", 
    "prevInTime": 17337, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1154963435", 
    "canDelete": false, 
    "nextInTopic": 17346, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGViN2w1Yis4Njk5QGVHcm91cHMuY29tPg=="
    }
}