{
    "numMessagesInTopic": 17, 
    "nextInTime": 17335, 
    "senderId": "nQZLs1UmmYtFdWVD1FFm4IYjqKIdOBaJE7SEMBY_XZt5yHnc_bQIOcWuQcEZH--V1IaEFQaQYqHfXv6gV_to_s4IniaCHRcN6Rbtl4X0rvMnZOX-1To", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Are you really using JUnit during your developmen t?", 
    "from": "&quot;Simon Chappell&quot; &lt;simonpeterchappell@...&gt;", 
    "authorName": "Simon Chappell", 
    "msgSnippet": "Cédric, Jumping back in (I was in at the start then took a rest :-). ... !snip! ... !snip! I think that I d phrase it that we re trying to build in quality", 
    "msgId": 17334, 
    "profile": "spchappell", 
    "topicId": 17279, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 211142374, 
    "messageBody": "<div id=\"ygrps-yiv-238927803\">Cédric,<br/>\n<br/>\nJumping back in (I was in at the start then took a rest :-).<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 8/7/06, Cédric Beust ♔ &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cbeust@...\">cbeust@...</a>&gt; wrote:<br/>\n&gt; On 8/7/06, Joakim Ohlrogge &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joakim.ohlrogge@...\">joakim.ohlrogge@...</a>&gt; wrote:<br/>\n!snip!<br/>\n&gt; On one hand, we have a small (very small) population of people who&#39;ve put<br/>\n&gt; testing at the forefront of every single engineering task they undertake<br/>\n&gt; every day at the exclusion of anything else.<br/>\n!snip!<br/>\n<br/>\nI think that I&#39;d phrase it that we&#39;re trying to build in quality and<br/>\nthat testing is just a tool to help us achieve that end. At the end of<br/>\nthe day, it&#39;s all about quality. Now, for some large corporations that<br/>\nsell shrink wrapped software, the definition of quality involves less<br/>\n&quot;blue screens of death&quot;, while for others it&#39;s &quot;no bugs. ever.&quot;.<br/>\n<br/>\nMany things in life are shades of gray and it&#39;s obvious that you fall<br/>\ninto that group for quality/testing. I am firmly in the binary camp<br/>\n(it&#39;s tested or it isn&#39;t), because to quote myself &quot;unit testing is<br/>\nthe first tollbooth on the road to software quality.&quot;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://simonpeter.org/technology/writings/fourthlaw.html\">http://simonpeter.org/technology/writings/fourthlaw.html</a><br/>\n<br/>\nFor me it&#39;s all about quality. I think that is where Uncle Bob is<br/>\ncoming from. He cares about quality and he&#39;s going to use everything<br/>\nhe has to get there, and TDD is like taking a gun to a knife fight.<br/>\nYeah, it might be overkill, but the smart money is going to be on you<br/>\nto win.<br/>\n<br/>\nI&#39;m drawn to a parallel example. Indulge me if you will. Consider the<br/>\nOpenBSD project. Their candy stick is security. Everything they do is<br/>\ntargeted at increasing security. They audit code that has never been<br/>\nknown to cause problems. They go back through the entire code base<br/>\nevery time a new exploit is discovered in any operating system<br/>\nanywhere. These guys make Uncle Bob look like a slacker (sorry, sir).<br/>\nWhy do they do what they do? Because they care about the quality of<br/>\ntheir end product. They have proven that an operating system can be<br/>\nsecure to an insane degree, by default, out of the box. Yet, Microsoft<br/>\nstill brags about &quot;less blue screens of death&quot;. Not. Even.Close!<br/>\n<br/>\nThere are many areas of life where close enough is going to work.<br/>\nGrill your steak for 9 minutes instead of 8 and it&#39;s still going to<br/>\ntaste pretty good. But there are some things where anything less than<br/>\n100% is going to fail. I have a friend that tests flight control<br/>\nsystems for a living. He often explains about how they test code in<br/>\nhis industry when we get together for breakfast. I feel like a slacker<br/>\nafter talking with him. But, aircraft falling out of the sky would be<br/>\nbad. In his world, &quot;close enough&quot; is &quot;good as dead&quot;.<br/>\n<br/>\nIt is vital that as programmers, that we test as much as we can,<br/>\nbecause the powers that be, have been known to shutdown testing when<br/>\nthe budget runs out. Your unit tests might be all the testing that<br/>\nportion of code ever gets. We have no control over anyone else (unless<br/>\nwe&#39;re the boss), but as professionals, we can take control of the<br/>\nquality of the deliverable that we produce.<br/>\n<br/>\nI&#39;ll stop now as there doesn&#39;t seem to be much meat left on the horse! :-)<br/>\n<br/>\nSimon<br/>\n<br/>\n-- <br/>\nwww.simonpeter.org </span></blockquote></div>", 
    "prevInTime": 17333, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1154976392", 
    "canDelete": false, 
    "nextInTopic": 17339, 
    "prevInTopic": 17333, 
    "headers": {
        "inReplyToHeader": "PGI4NmI2YTljMDYwODA3MDcyM2w3NDU0ZjY5NnY3YzFlNjRkNGFhYzcyMDg3QG1haWwuZ29vZ2xlLmNvbT4=", 
        "messageIdInHeader": "PDhlZDczMzkwMDYwODA3MTE0Nmw3NjQ1YmZjNXY4NjlmN2Q2NDlhOTBiYjQ3QG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PEI2ODEyMUJBLUQ4QTUtNDREQi1BNzMwLTNCRkUwQkFGNTgxMUBvYmplY3RtZW50b3IuY29tPgkgPGI4NmI2YTljMDYwODAzMTg0MHE1NDdhYTcwY3U1ODc4ZTBhOWM2ZmU4YmRmQG1haWwuZ29vZ2xlLmNvbT4JIDxiODZiNmE5YzA2MDgwNjEyMzZ5YzkyYWNkZXEzYmZhMjFkNTE5NDQwYzU0QG1haWwuZ29vZ2xlLmNvbT4JIDxiOWVlNWU0MTA2MDgwNzAwMjRrNzNkYjYwOWN4MjIyMDAyMGI3ZjQ3M2QyY0BtYWlsLmdtYWlsLmNvbT4JIDxiOWVlNWU0MTA2MDgwNzAxMTNxYzExOTI1NmoxMDBmZDIwYWVmODIxNWY4QG1haWwuZ21haWwuY29tPgkgPGI4NmI2YTljMDYwODA3MDcyM2w3NDU0ZjY5NnY3YzFlNjRkNGFhYzcyMDg3QG1haWwuZ29vZ2xlLmNvbT4="
    }
}