{
    "numMessagesInTopic": 17, 
    "nextInTime": 17333, 
    "senderId": "z6yDNRA2Pj1S_4bnasa_WyrPbyWLq04Wl3f5waBDKuJAzirm_cVtDeC4gG1JddB9ClJhwa0pspf7JgeQEL3aMsdJEBuMtKpE", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Are you really using JUnit during your developmen t?", 
    "from": "&quot;Carl Hume&quot; &lt;carl.hume@...&gt;", 
    "authorName": "Carl Hume", 
    "msgSnippet": "Hello Ray, On 8/4/06, Ray V  wrote: I d like to add that in my recent experience on a team of 4 developers, it s been very hard to", 
    "msgId": 17332, 
    "profile": "carl_hume", 
    "topicId": 17279, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 236625471, 
    "messageBody": "<div id=\"ygrps-yiv-724715356\">Hello Ray,<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 8/4/06, Ray V &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ttftestrayv@...\">ttftestrayv@...</a>&gt; wrote:<br/>\n I&#39;d like to add that in my recent experience on a team<br/>\n of 4 developers, it&#39;s been very hard to convince the<br/>\n others of the value of the unit tests. I find they<br/>\n rarely run the tests that are there, often check in<br/>\n code that breaks the tests (but not the build), and<br/>\n they very frequently add new code that&#39;s untested.<br/>\n<br/>\nI have found myself in this situation more often than I would like.  Up to<br/>\nnow, I have found the best thing to do is wait for someone to check in a<br/>\nfailing test.  Once the test fails, I invest some time determining why.<br/>\nNormally, I find that:<br/>\n<br/>\na) Object behavior has changed, and certain corner cases the developer<br/>\ndidn&#39;t manually test for arenow failing.  This is an excellent opportunity<br/>\nto bring the failure to the developer in question and let them know.  When<br/>\nthey ask how you found out so quickly, you can demonstrate the value of the<br/>\ntests.<br/>\n<br/>\nb) Something trivial has changed - for example a toString() method now<br/>\nreturns something different.  This is usually an indication of a test that<br/>\nis too dependent upon the implementation and is fragile.  This is an<br/>\nexellent learning opportunity for yourself - what is the test really<br/>\ntesting?  How can it be rewritten so that these trivial changes won&#39;t cause<br/>\nproblems?<br/>\n<br/>\nc) Something about the design has changed - instead of injecting a<br/>\ncollaborator the code now creates one.  I&#39;ve had the most trouble with these<br/>\nfailures.  If the people writing the code don&#39;t value tests, and don&#39;t<br/>\nunderstand the value of dependency injection outside of tests, it can<br/>\nquickly turn negative.  I tend to clean these up quietly and promote<br/>\nDependency Injection as a best practice when the team talks about design.<br/>\nI&#39;m sure there are better ways to handle it - I&#39;d love to hear some from the<br/>\npeople on the list.<br/>\n<br/>\nMy personal advice is to keep unit testing.  It can be extremely frustrating<br/>\n&quot;playing catchup&quot;, however you can&#39;t beat that rewarding feeling when other<br/>\ndevelopers on your team starts promoting them too.<br/>\n<br/>\nCheers!<br/>\nCarl<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://genomescampaigns.blogspot.com\">http://genomescampaigns.blogspot.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 17331, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1154960674", 
    "canDelete": false, 
    "nextInTopic": 17333, 
    "prevInTopic": 17328, 
    "headers": {
        "inReplyToHeader": "PDIwMDYwODA1MDExNzU2LjU4MDkucW1haWxAd2ViNjA3MTkubWFpbC55YWhvby5jb20+", 
        "messageIdInHeader": "PGMwZDY4OGFjMDYwODA3MDcyNHcyMGIzN2JjZm1hMjg2M2ZiODQ0YWMxNDM4QG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PDQ0RDJBRDY5LjYwNTA5MDRAZ2FtbWEtdHdvLmNvbT4JIDwyMDA2MDgwNTAxMTc1Ni41ODA5LnFtYWlsQHdlYjYwNzE5Lm1haWwueWFob28uY29tPg=="
    }
}