{
    "numMessagesInTopic": 5, 
    "nextInTime": 17361, 
    "senderId": "5Y8gjWeOw3H80uHT0bqJl71ju8JpXohzVfYjPBxEXvjs9HeYJMt9B4J-k9WrHypNp3ugNcIICTBKQfqYYdhsBATpA_Z7WtVz0yd44HG5Lg", 
    "systemMessage": true, 
    "subject": "Re: [junit] Static objects vs tests separation", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... I feel for you. ... I got my start in this community by writing about that very topic. Google use your singletons wisely . ... I don t consider that a", 
    "msgId": 17360, 
    "profile": "nails762", 
    "topicId": 17251, 
    "spamInfo": {
        "reason": "4", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-1809584655\">Anna Skawinska wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Before I describe my problem, I&#39;ll remind you that I was hired as a<br/>\n&gt; humble tester, having only minor influence on the production code...<br/>\n<br/>\n </span></blockquote>I feel for you.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The application is a kind of specialized graphic editor with a typical<br/>\n&gt; MDI design. Its core is an object, say APP, static reference of which<br/>\n&gt; is kept in the main class (much like in singleton, but the<br/>\n&gt; constructor&#39;s not private; for the above stated reasons I don&#39;t want<br/>\n&gt; to discuss this detail).<br/>\n&gt; <br/>\n&gt; I&#39;m only a rookie in programming as such and might not know things<br/>\n&gt; that are second nature to you. But having a singleton-like<br/>\n&gt; architecture seems to me to contradict the tests separation<br/>\n&gt; principle...<br/>\n<br/>\n </span></blockquote>I got my start in this community by writing about that very topic. <br/>\nGoogle &quot;use your singletons wisely&quot;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Every time I call a static method of my APP class, I use<br/>\n&gt; the same object...<br/>\n&gt; <br/>\n&gt; And what&#39;s what started to give me trouble recently. It is possible to<br/>\n&gt; initialize this APP object, yloading GUI modules or not. To be honest,<br/>\n&gt; using it without UI is a workaround of mine, which I implemented to be<br/>\n&gt; somewhat closer to unit testing, although my tasks are actually<br/>\n&gt; regular regression tests, examining whole big chunks of<br/>\n&gt; functionality... So in a part of my tests that don&#39;t need the<br/>\n&gt; graphical modules, I simply don&#39;t load them.<br/>\n<br/>\n </span></blockquote>I don&#39;t consider that a workaround, but rather more focused testing. <br/>\nIt&#39;s a Good Thing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; However, I&#39;ve recently<br/>\n&gt; been trying out some other type of tests that operate on a<br/>\n&gt; full-fledged application, which needs loading the UI. And that&#39;s where<br/>\n&gt; the problem begins - trying to load those modules, having used the<br/>\n&gt; application without them in previous tests, is in the application, as<br/>\n&gt; it currently is, impossible (and don&#39;t think that anyone will take<br/>\n&gt; grumbling of a humble tester into consideration).<br/>\n&gt; <br/>\n&gt; So the question to you guys is as follows: should I give up hope that<br/>\n&gt; my job has anything to do with unit testing, and allow dosens of funny<br/>\n&gt; windows to jump here and fro while basic functionality is being<br/>\n&gt; checked or rather do you see any other possibility to solve my problem<br/>\n&gt; that I, humble rookie, overlooked?<br/>\n<br/>\n </span></blockquote>If no-one will take your &quot;grumbling&quot; (which is really simple, obvious <br/>\ndesign criticism that they should listen to) into consideration, then <br/>\nyes, give up on trying to unit test. The idea that you could do unit <br/>\ntesting /for/ them is absurd on its face. You could do it /with/ them, <br/>\nor they could do it with your advice, but you can&#39;t do it for them. It <br/>\njust doesn&#39;t work.<br/>\n<br/>\nSo you&#39;d need to change the hearts and minds before you can make <br/>\nprogress with the practice.<br/>\n<br/>\nGood luck.<br/>\n-- <br/>\nJ. B. (Joe) Rainsberger :: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jbrains.info\">http://www.jbrains.info</a><br/>\nYour guide to software craftsmanship<br/>\nJUnit Recipes: Practical Methods for Programmer Testing<br/>\n2005 Gordon Pask Award for contribution Agile Software Practice</div>", 
    "prevInTime": 17359, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1154457368", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 17299, 
    "headers": {
        "inReplyToHeader": "PGVhbDM4dCs1MmxnQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDQ0Q0Y5RjE4LjQwMjAwMDRAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PGVhbDM4dCs1MmxnQGVHcm91cHMuY29tPg=="
    }
}