{
    "numMessagesInTopic": 287, 
    "nextInTime": 17405, 
    "senderId": "j-buXnlVXY7_P2HQGkSDe3fxRhYKxvNG_g6S4YvLCWOwCa-XjQ-sS-0XelcJaIA82G7IyjuSsOnG-ZFXgqP2OTYMG5-ao4y1_W1nhaPBGAYv", 
    "systemMessage": true, 
    "subject": "Re: [junit] Re: Are you really using JUnit during your development?", 
    "from": "&quot;Brett L. Schuchert&quot; &lt;schuchert@...&gt;", 
    "authorName": "Brett L. Schuchert", 
    "msgSnippet": "Simon, OK, based on your working definition of TDD, I agree that without it, you won t produce the same level of quality code. But then all you re really", 
    "msgId": 17404, 
    "profile": "schuchert", 
    "topicId": 17266, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 162568887, 
    "messageBody": "<div id=\"ygrps-yiv-1253392708\">Simon,<br/>\n <br/>\nOK, based on your working definition of TDD, I agree that without it, you won&#39;t produce the same level of quality code. But then all you&#39;re really saying is we need a feedback look and we need to care about what we are doing.<br/>\n <br/>\nHowever, that brings to light the fact that TDD means different things to different people. I *think*, for example, that TDD for Bob Martin means Test first, write one test, get it to work, etc, as he describes with the bowling example in his last book.<br/>\n <br/>\nAs for your definition of quality, I don&#39;t agree with it. I use Jerry Weinberg&#39;s definition:<br/>\n   Quality = value to someone<br/>\n <br/>\nSo I cannot, for example, with all the caring in the world make something of quality for someone else. Caring is probably necessary but not sufficient. They have to decide that what they got is useful to them and therefore is of quality.<br/>\n <br/>\nI will agree that without caring you&#39;re not likely to develop something that has quality for someone else. By caring, you&#39;ll talk to the person who wants the thing.<br/>\n <br/>\nTutorials and Articles<br/>\n     http://schuchert.wikispaces.com/<br/>\n<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Simon Chappell &lt;simonpeterchappell@...&gt;<br/>\nTo: junit@yahoogroups.com<br/>\nSent: Saturday, August 12, 2006 9:40:02 AM<br/>\nSubject: Re: [junit] Re: Are you really using JUnit during your development?<br/>\n<br/>\nBrett,<br/>\n<br/>\nActually, I really meant it when I said that without TDD, you&#39;ll only<br/>\never write code that is &quot;good enough&quot;. Quality code only comes from<br/>\nusing TDD.<br/>\n<br/>\nNow, TDD is not JUnit, after all, JUnit is just a library. TDD is at<br/>\nit&#39;s most basic, a philosophy. This means that anytime you are<br/>\ndeveloping with a positive feedback loop from your tests, you are<br/>\ndoing TDD.<br/>\n<br/>\nNow, as I have already mentioned a few times in this thread, I have a<br/>\nfriend who works for a aeronautical testing company. They are called<br/>\nin to perform third-party independent verification of tests and test<br/>\nresults for flight systems. When flight systems are designed, their<br/>\ncomplete behaviour is specified up front. The code and the tests are<br/>\nwritten and then when all of the tests pass, the code is handed over<br/>\nto the third-party folks for verification.<br/>\n<br/>\nYou can argue that this isn&#39;t TDD, and I wouldn&#39;t argue the point too<br/>\nhard, but the basic philosophy is compatible. They think carefully<br/>\nabout what they want, they define the desired behaviour including what<br/>\nthe tests should test and then the developers get to work and then<br/>\nthere is another round where the third-party verification provides<br/>\nfeedback on the tests and how well they satisfy the original<br/>\nrequirements. Hmmmm, that sounds like something I&#39;ve seen around here.<br/>\n:-)<br/>\n<br/>\nQuality is caring. http://simonpeter. org/technology/ writings/ thirdlaw. html<br/>\n<br/>\nWithout caring, even someone who is mandated to use TDD is going to<br/>\nchurn out Sierra Hotel 1 Tango. I&#39;ve seen it done. At my previous<br/>\nemployer, unit tests were mandated, so some developers created unit<br/>\ntests but never made any assertions about expected results. Naturally<br/>\nthe tests passed, because they never actually tested anything and<br/>\ntherefore could never fail.<br/>\n<br/>\nWhile I&#39;m fully in favour of TDD, without caring, TDD cannot work.<br/>\nWithout caring, non-TDD development techniques can&#39;t work either.<br/>\nWithout caring, even the aeronautical testing won&#39;t work.<br/>\n<br/>\nIf you do care about quality, I assert (pun intended) that TDD is the<br/>\nmost effective converter of caring into software quality.<br/>\n<br/>\nSimon<br/>\n<br/>\n-- <br/>\nwww.simonpeter. org<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 8/11/06, Brett L. Schuchert &lt;schuchert@yahoo. com&gt; wrote:<br/>\n&gt; &gt;&gt; From: Simon Chappell &lt;simonpeterchappell@ gmail.com&gt;<br/>\n&gt; &gt;&gt; religion. I&#39;m sure it&#39;s possible to write code that is &quot;good enough&quot;<br/>\n&gt; &gt;&gt; without TDD, but it&#39;ll never be high quality.<br/>\n&gt;<br/>\n&gt; You just made a strong claim:<br/>\n&gt; Without TDD you&#39;ll never be high quality<br/>\n&gt;<br/>\n&gt; TDD: Test Driven Design<br/>\n&gt; Write a test, get it to compile, get it to work<br/>\n&gt; Repeat<br/>\n&gt;<br/>\n&gt; Space Shuttle control software does not use TDD, but apparently it is not high quality?<br/>\n&gt;<br/>\n&gt; Apollo mission software did not use TDD, but apparently it is not high quality?<br/>\n&gt;<br/>\n&gt; I wonder, when you write TDD, do you really mean using effective unit testing? Because it is not the same thing.<br/>\n&gt;<br/>\n&gt; Did you really mean to write that?<br/>\n&gt;<br/>\n&gt; Brett<br/>\n&gt;<br/>\n&gt; Tutorials and Articles<br/>\n&gt; http://schuchert. wikispaces. com/<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ----- Original Message ----<br/>\n&gt; From: Simon Chappell &lt;simonpeterchappell@ gmail.com&gt;<br/>\n&gt; To: junit@yahoogroups. com<br/>\n&gt; Sent: Friday, August 11, 2006 7:58:08 AM<br/>\n&gt; Subject: Re: [junit] Re: Are you really using JUnit during your development?<br/>\n&gt;<br/>\n&gt; On 8/11/06, J. B. Rainsberger &lt;jbrains@rogers. com&gt; wrote:<br/>\n&gt; !snip!<br/>\n&gt; &gt; 1. You&#39;re shipping shit, or<br/>\n&gt; &gt; 2. You&#39;re not shipping shit, which means you&#39;re a genius, which means<br/>\n&gt; &gt; you go faster than everyone else, anyway, whether you practise TDD or not.<br/>\n&gt;<br/>\n&gt; I think it&#39;s safe to say that most versions of Microsoft Windows have<br/>\n&gt; been Sierra Hotel 1 Tango, but apparently, that hasn&#39;t stopped it<br/>\n&gt; selling. This says nothing good about our industry or our users, I<br/>\n&gt; fear.<br/>\n&gt;<br/>\n&gt; &gt; I just can&#39;t buy the notion that it&#39;s possible to write good, untested<br/>\n&gt; &gt; code. Show it to me. Where is this good, untested code?<br/>\n&gt;<br/>\n&gt; I still maintain that it&#39;s all about quality. TDD is a tool to help<br/>\n&gt; you build quality in to your software. It isn&#39;t, nor should it be a<br/>\n&gt; religion. I&#39;m sure it&#39;s possible to write code that is &quot;good enough&quot;<br/>\n&gt; without TDD, but it&#39;ll never be high quality.<br/>\n&gt;<br/>\n&gt; And you&#39;ll never get code that&#39;s &quot;good enough&quot; accepted into flight<br/>\n&gt; systems. They not only test the code, but they have independent<br/>\n&gt; testers test the tests and certify the results. When Windows crashes<br/>\n&gt; it&#39;s annoying, when airplanes crash, it&#39;s at the far end of bad.<br/>\n&gt;<br/>\n&gt; It&#39;s all about how much quality you want in your code. Quality has to<br/>\n&gt; be built in, you can&#39;t go back an bolt it on. I use TDD whenever<br/>\n&gt; possible to build quality into my code. No one make me do it, but I<br/>\n&gt; find that the more tests I write, the quicker I write them and the<br/>\n&gt; quicker I get to working code.<br/>\n&gt;<br/>\n&gt; Simon<br/>\n&gt;<br/>\n&gt; --<br/>\n&gt; www.simonpeter. org<br/>\n&gt;<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 17403, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1155410296", 
    "canDelete": false, 
    "nextInTopic": 17409, 
    "prevInTopic": 17403, 
    "headers": {
        "inReplyToHeader": "PDhlZDczMzkwMDYwODEyMDc0MHk1NGE1NGFlOG9kODMwMWM3ODQ4MmU5ODU5QG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PDIwMDYwODEyMTkxODE2LjM4ODg5LnFtYWlsQHdlYjU0MTA4Lm1haWwueWFob28uY29tPg=="
    }
}