{
    "numMessagesInTopic": 287, 
    "nextInTime": 17419, 
    "senderId": "b0GprqnJqQYhi4DPIDzK3ksPn0QeWIM9uItxLkHzzyzKgxpctF6ADQdF6TrTgCO_oHaW-iFPmGnKGYJWaPBXHTDtm5YG6uqI95qWLwaMAY97aeZh", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Are you really using JUnit during your development?", 
    "from": "&quot;Joakim Ohlrogge&quot; &lt;joakim.ohlrogge@...&gt;", 
    "authorName": "Joakim Ohlrogge", 
    "msgSnippet": "... Not that I don t think that it would be better to write the test first but I guess the answer to your question would be in the same way you can write a", 
    "msgId": 17418, 
    "profile": "j0hlrogge", 
    "topicId": 17266, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 261856052, 
    "messageBody": "<div id=\"ygrps-yiv-138051571\"><blockquote><span title=\"ireply\">&gt;  how can you think about a test which does not yet exist?<br/>\n </span></blockquote>Not that I don&#39;t think that it would be better to write the test first<br/>\nbut I guess the answer to your question would be &quot;in the same way you<br/>\ncan write a test for code that does not yet exist&quot;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  However it would seem<br/>\n&gt;  immediately obvious that writing that functional code first was a<br/>\n&gt;  waste of time since it just gets deleted anyway making it more<br/>\n&gt;  practical to write the test first.<br/>\n<br/>\n </span></blockquote>I&#39;m not sure the code would have to be deleted or changed, maybe a<br/>\nlittle. Even if I&#39;m convinced though that it is not the best way to<br/>\nproduce code I still think that you can produce code that you are<br/>\nhappy with even if you retrofit the tests.<br/>\nOn the other hand, after using TDD and looking back on how it changed<br/>\nthe way of thinking and how much it aided/simplified my thought<br/>\nprocess I don&#39;t see how I would /want/ to do that. I&#39;m having much<br/>\nmore fun now, writing much better code than I used to do and I think I<br/>\ndo it with less effort.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  These types of test add no value as they are difficult to maintain.<br/>\n<br/>\n </span></blockquote>I think that you would miss out on the value of the tests /driving/<br/>\nthe design wich I think is a lot. I don&#39;t think that they have /no/<br/>\nvalue.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Writing the test would only slow development under<br/>\n&gt;  these scenarios unless I&#39;m missing something obvious.<br/>\n </span></blockquote>I would agree to that to some degree, if you miss out on the driving<br/>\npart of your tests them the argument that it takes more time because<br/>\nyou have to write twice as much code is  a lot more valid. (You miss<br/>\nout on the thoughtprocess and the design that &quot;falls out of your<br/>\ntests&quot;).<br/>\n<br/>\nI agree with a lot you wrote since I read it the way I wanted to read<br/>\nit. Someone else that wanted to read it differently would perhaps<br/>\nloose some of the good points you make since it seems a bit &quot;binary&quot;?<br/>\n<br/>\nI don&#39;t know, just my two cents for what they might be worth...</div>", 
    "prevInTime": 17417, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1155656666", 
    "canDelete": false, 
    "nextInTopic": 17419, 
    "prevInTopic": 17417, 
    "headers": {
        "inReplyToHeader": "PGVic25ycyt2a2xnQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGI5ZWU1ZTQxMDYwODE1MDg0NHIzMjNmZmZjOGo2OWZjNDA5YzJjN2U2MTBmQG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PGVibzhtcStodnNtQGVHcm91cHMuY29tPiA8ZWJzbnJzK3ZrbGdAZUdyb3Vwcy5jb20+"
    }
}