{
    "numMessagesInTopic": 287, 
    "nextInTime": 17418, 
    "senderId": "kfIL-9vK0rodOqgjF6_xRAjWwq50Ie_OuxWMgKJCr-H2n58xORl7qewTMfCMBpg2x1xpBZ4SDykpL3r6_Cnd1WLQFaYx9sSh_-Ch0n1r3uI", 
    "systemMessage": false, 
    "subject": "Re: Are you really using JUnit during your development?", 
    "from": "&quot;cliftonccraig&quot; &lt;cliftonccraig@...&gt;", 
    "authorName": "cliftonccraig", 
    "msgSnippet": "I m intruiged as well as confused by this. ... how can you think about a test which does not yet exist? I m not labeling this as impossible though I do think", 
    "msgId": 17417, 
    "profile": "cliftonccraig", 
    "topicId": 17266, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 190580959, 
    "messageBody": "<div id=\"ygrps-yiv-736165769\">I&#39;m intruiged as well as confused by this.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;Marvin Toll&quot; &lt;MarvinToll@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; In support of Cedric&#39;s opinion ...<br/>\n&gt; <br/>\n&gt; When working with teams, I use the term &quot;test concurrent&quot; (rather <br/>\n&gt; than test first) to send the message that:<br/>\n&gt; <br/>\n&gt; 1) When writing functional code think about the test.<br/>\n&gt; <br/>\n&gt; 2) When writing test code think about the functionality.<br/>\n&gt; <br/>\n&gt; 3) The specific order may be less important than the effective <br/>\n&gt; thinking.<br/>\n&gt; <br/>\n&gt; _Marvin<br/>\n<br/>\nhow can you think about a test which does not yet exist? I&#39;m not<br/>\nlabeling this as impossible though I do think it sounds impractical.<br/>\nWhen you write functional code it ought to be satisfying some<br/>\npractical usage contract. If the contract does not exist then your<br/>\nfunctional code becomes the definition of the contract. Putting a test<br/>\non pre existing code becomes an excercise in putting a contract on a<br/>\ncontract. In short your implementation quickly and easily becomes more<br/>\nimportant than the usage. (That&#39;s always been my experience and unless<br/>\nyou&#39;re extremely lucky or extremely gifted I find it hard to see how<br/>\nyour results would differ.) When the implementation becomes more<br/>\nimportant than the usage you comprimise usability because it becomes<br/>\ndifficult to throw away functional code. If you don&#39;t have a problem<br/>\nthrowing away code you&#39;ve just written for the sake of a test (which<br/>\nwould likely indicate that the code you&#39;ve written needs changing or<br/>\ndeleting) then I guess order isn&#39;t important. However it would seem<br/>\nimmediately obvious that writing that functional code first was a<br/>\nwaste of time since it just gets deleted anyway making it more<br/>\npractical to write the test first.<br/>\n<br/>\nOn the inverse, writing the test first would garuantee a usable<br/>\ninterface where no time would be wasted on throw away code. What I&#39;m<br/>\ntrying to say here is that the existance of a test is not nearly as<br/>\nimportant as a good interface or an accurate definition of the usage<br/>\nof a piece of code. The Test is the only place to define that and<br/>\nwithout that you will most likely have a bunch of tests that are<br/>\nbrittle and highly dependant on the internals of the functional code.<br/>\nThese types of test add no value as they are difficult to maintain. If<br/>\nyou are lucky or knowledgeable enough to write functional code without<br/>\na test then you are lucky or knowledgeable enough to go completely<br/>\nwithout the test. Writing the test would only slow development under<br/>\nthese scenarios unless I&#39;m missing something obvious. </span></blockquote></div>", 
    "prevInTime": 17416, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1155654332", 
    "canDelete": false, 
    "nextInTopic": 17418, 
    "prevInTopic": 17413, 
    "headers": {
        "inReplyToHeader": "PGVibzhtcStodnNtQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGVic25ycyt2a2xnQGVHcm91cHMuY29tPg=="
    }
}