{
    "numMessagesInTopic": 14, 
    "nextInTime": 17474, 
    "senderId": "x0drkoChJ3G_ZYIVuKtrpEgW2Hb6I1eqbGdpSABDuB7hRSDFDMgcGF4wA3OwQCRLKGNHOVv_WOTg", 
    "systemMessage": false, 
    "subject": "Re: [junit] GUI unit testing", 
    "from": "didoss@...", 
    "authorName": "didoss@comcast.net", 
    "msgSnippet": "Depending on what your UI is, I m almost positive that there is a way to do it.  My last company had an application that was largely jsp, which then could", 
    "msgId": 17473, 
    "profile": "ddoss_2006", 
    "topicId": 17468, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 180862158, 
    "messageBody": "<div id=\"ygrps-yiv-2104402283\">Depending on what your UI is, I&#39;m almost positive that there is a way to do it.  My last company had an application that was largely jsp, which then could launch an applet based on the context of the jsp.<br/>\n<br/>\nWe didn&#39;t have unit tests for the jsps, but could have with HtmlUnit, I assume.  A majority of the jsp content was served up through java classes, so they had JUnit tests.<br/>\n<br/>\nThe applet was tested through some sort of JUnit construct - have already purged enough of that code from my head - but I can tell you that it can be done.  Again, the business logic behind the GUI was tested within those classes, and then the applet had its own tests to confirm that widgets displayed when they should.<br/>\n<br/>\nI think looking for appletviewer as relates to unit testing might send you down a path - at least as relates to testing applets, if that is how you are presenting your UI.<br/>\n<br/>\nhope it helps,<br/>\nDianne<br/>\n<br/>\n-------------- Original message -------------- <br/>\nFrom: &quot;Simon Chappell&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:simonpeterchappell@...\">simonpeterchappell@...</a>&gt; <br/>\n<blockquote><span title=\"qreply\"> On 8/16/06, Altman, Joel G. (JSC-CC)[LM] &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joel.g.altman@...\">joel.g.altman@...</a>&gt; wrote:<br/>\n&gt; I&#39;ve been dragging the programmers on my latest project into unit<br/>\n&gt; testing, and they have not all gone quietly.<br/>\n&gt;<br/>\n&gt; One senior developer to whom I gave the task of developing the graphical<br/>\n&gt; portion of the user interface says there is no way to use JUnit on his<br/>\n&gt; code. I believe it can be done, but I haven&#39;t found anything in JUnit<br/>\n&gt; Recipes I can use to convince him.<br/>\n&gt;<br/>\n&gt; Can somebody give me ammunition for this task? What would be the best<br/>\n&gt; method for unit testing graphics code?<br/>\n&gt;<br/>\n&gt; Joel Altman<br/>\n&gt; Shuttle Training Aircraft Project<br/>\n<br/>\nGenerally, you get as much code as possible out of the GUI, so that<br/>\nthe extracted code can be easily tested the old fashioned way. Domain<br/>\n(business) objects that are easily testable and a very thin GUI that<br/>\nis difficult to test beats a thick GUI that&#39;s difficult to test.<br/>\n<br/>\nSomeone else will have to advise you about the best GUI testing tools.<br/>\nI&#39;ve never needed to use one.<br/>\n<br/>\nSimon<br/>\n<br/>\n-- <br/>\nwww.simonpeter.org<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 17472, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1155757419", 
    "canDelete": false, 
    "nextInTopic": 17475, 
    "prevInTopic": 17472, 
    "headers": {
        "messageIdInHeader": "PDA4MTYyMDA2MTk0My4yNjkxNi40NEUzNzU2QjAwMDY2MjQ2MDAwMDY5MjQyMjAwNzUwNzQ0OUM5QzAxMEIwNzBCQGNvbWNhc3QubmV0Pg=="
    }
}