{
    "numMessagesInTopic": 287, 
    "nextInTime": 17488, 
    "senderId": "rRLcCr2qoaBODh7c6BGFfuS8vWDwKncYecP7zkhKj7m4GBfbRhfYA824i41cgToQxp-OefEZxxa9827TUszGyRUdeV4vuhAkFYage68AmTpX", 
    "systemMessage": true, 
    "subject": "Re: [junit] Test-friendly, but not caller-friendly?", 
    "from": "&quot;Brett L. Schuchert&quot; &lt;schuchert@...&gt;", 
    "authorName": "Brett L. Schuchert", 
    "msgSnippet": "Elliotte, I don t work for Google and I love to use interfaces. In fact, I ve been consulting at Hertz for 4 years. In that time we have rewritten most of", 
    "msgId": 17487, 
    "profile": "schuchert", 
    "topicId": 17266, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 162568887, 
    "messageBody": "<div id=\"ygrps-yiv-1545422716\">Elliotte,<br/>\n <br/>\nI don&#39;t work for Google and I love to use interfaces. In fact, I&#39;ve been consulting at Hertz for 4 years. In that time we have rewritten most of their reservations systems from COBOL to Java AND retrained a majority of their COBOL programmers to use Java.<br/>\n <br/>\nAnd guess what? We use interfaces. You know what else we use:<br/>\n- Spring<br/>\n- Hibernate<br/>\n- JUnit (our base reference architecture has roughly 2900 unit tests and raising)<br/>\n- AspectJ<br/>\n- Continuous Integration<br/>\n- ...<br/>\n <br/>\nSo here&#39;s a bunch (right now about 60 people working on roughly 6 active projects, with 9 projects already in production and being used in the field) of former COBOL programmers using interfaces, JUnit, Inversion of Control, all those &quot;pie in the sky book things&quot;.<br/>\n <br/>\nI do agree with some of what you are saying. Not everything should have an interface. But that&#39;s based on the granularity of the thing in question.<br/>\n <br/>\nI also think, for the most part, that writing unit tests for a trivial Java Bean is questionable. <br/>\n <br/>\nHowever, as soon as you start using things like Spring, using interfaces buys you a bunch. You can, for example, get automatic transactional demarcation based on a simple configuration. You can accomplish this without using interfaces (so long as the class is not also final), but it&#39;s a matter of whether you want to use proxies or classes generated using CGLIB.<br/>\n <br/>\nAnything that I might want to test that depends on some external source of information (database, message queue, ...), using an interface (which you&#39;re probably doing anyway) really makes something testable in isolation. And it adds a lot of value.<br/>\n <br/>\nThat&#39;s NOT pie in the sky, that&#39;s based on actual experience in the field working with developers of vastly varying skills.<br/>\n <br/>\nTutorials and Articles<br/>\n     <a rel=\"nofollow\" target=\"_blank\" href=\"http://schuchert.wikispaces.com/\">http://schuchert.wikispaces.com/</a><br/>\n<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Elliotte Harold &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elharo@...\">elharo@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSent: Thursday, August 17, 2006 5:09:45 AM<br/>\nSubject: Re: [junit] Test-friendly, but not caller-friendly?<br/>\n<br/>\nCédric Beust ♔ wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This goes against my direct experience and against the widely accepted<br/>\n&gt; recommendations that have emerged in the Java world these past years.<br/>\n<br/>\n </span></blockquote>If I recall, your most recent direct experience is at Google, and given <br/>\nthe people Google is hiring these days, I&#39;m not surprised that&#39;s what <br/>\nyou see. Google&#39;s a hotbed of the sort of programmers who like to read <br/>\nand write books about OO theory and language design. But most of the <br/>\nworld is not Google.<br/>\n<br/>\nThere are certainly widely promulgated recommendations to use <br/>\ninterfaces. I&#39;m not sure these recommendations are actually accepted by <br/>\nanyone except the people promulgating them, though. In particular, what <br/>\nI see is a lot of relatively smart people quietly blaming themselves for <br/>\nnot understanding the complexity that&#39;s being foisted on them, and <br/>\nthinking they must be stupid for not understanding it. They may use <br/>\ninterfaces when forced to do so by the frameworks, but they don&#39;t like <br/>\nit; and they certainly don&#39;t make it the first choice in their own code.<br/>\n<br/>\nInterfaces have their place, but that place has been vastly overdrawn in <br/>\nthe Java world. Most classes simply do not need more than one <br/>\nimplementation.<br/>\n<br/>\n-- <br/>\n﻿Elliotte Rusty Harold elharo@metalab. unc.edu<br/>\nJava I/O 2nd Edition Just Published!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafeaula\">http://www.cafeaula</a> it.org/books/ javaio2/<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon\">http://www.amazon</a> com/exec/ obidos/ISBN= 0596527500/ ref=nosim/ cafeaulaitA/<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 17486, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1155827480", 
    "canDelete": false, 
    "nextInTopic": 17488, 
    "prevInTopic": 17486, 
    "headers": {
        "inReplyToHeader": "PDQ0RTQ0MDY5LjYwNTA0QG1ldGFsYWIudW5jLmVkdT4=", 
        "messageIdInHeader": "PDIwMDYwODE3MTUxMTIwLjE3MTI3LnFtYWlsQHdlYjU0MTA5Lm1haWwueWFob28uY29tPg=="
    }
}