{
    "numMessagesInTopic": 287, 
    "nextInTime": 17499, 
    "senderId": "EAFIKXBd8qXTuw44Fybqrdq2HIGI6CbJJ9oSlKlimaUT3IB75dGQOcfVFYSwHroybmOwjE6GG-MVQGUIGMoLyYWbRuBGumYlkah7VxYS5w", 
    "systemMessage": false, 
    "subject": "Re: [junit] Test-friendly, but not caller-friendly?", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... I m unsure about that analogy. If the trained professionals in India provided the same experience as talking directly to programmers, then it would be just", 
    "msgId": 17498, 
    "profile": "nails762", 
    "topicId": 17266, 
    "spamInfo": {
        "reason": "4", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-119383971\">Elliotte Harold wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; YUCK! That&#39;s like making your tech support user friendly by outsourcing<br/>\n&gt; it to trained professionasl in India rather than letting your clients<br/>\n&gt; talk directly to the developers. There&#39;s a ton of theory (i.e.<br/>\n&gt; rationalizations) to support doing that, and it&#39;s completely<br/>\n&gt; counterproductive in practice.<br/>\n<br/>\n </span></blockquote>I&#39;m unsure about that analogy. If the trained professionals in India <br/>\nprovided the same experience as talking directly to programmers, then it <br/>\nwould be just fine. Obviously, that doesn&#39;t happen, but I can implement <br/>\nan interface two different ways to provide experiences similar enough <br/>\nthat the client can&#39;t tell the difference. (Example: XStream object <br/>\nstorage compared to a relational database.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Interfaces are very popular among the most theoretical programmers: i.e.<br/>\n&gt; exactly the sort of programmers who are likely to write books, read<br/>\n&gt; books about OO theory, and hang out on lists like this one.<br/>\n<br/>\n </span></blockquote>I find it difficult not to interpret this as a (very mild) personal <br/>\nattack. You seem to imply that we are not also practitioners. I suspect <br/>\nyou&#39;re not an asshole, so I imagine you mean something else. I would <br/>\nappreciate you clarifying this position. Is it necessarily the case, <br/>\nthen, that &quot;the sort of programmers who... hang out on lists like this <br/>\none&quot; don&#39;t know what we&#39;re talking about, because I kinda think I do and <br/>\nI kinda think I&#39;ve proven that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; However in<br/>\n&gt; my experience concrete classes are much simpler and much preferred by<br/>\n&gt; the vast majority of pragmatic programmers just getting their jobs done.<br/>\n&gt; <br/>\n&gt; I can certainly see how making a class test-friendly could make it less<br/>\n&gt; caller-friendly. In fact, exactly how to do that is the subject of<br/>\n&gt; another perma-thread on this list. exposing methods purely for the<br/>\n&gt; convenience of testers expands a class&#39;s interface and makes it harder<br/>\n&gt; to learn, use, and understand. Minimal interfaces are simpler to<br/>\n&gt; understand and learn. Exposing additional methods purely for test<br/>\n&gt; convenience is very counter-productive to caller-convenience. The only<br/>\n&gt; public parts of a class&#39;s interface should be things that are relevant<br/>\n&gt; to client programmers.<br/>\n<br/>\n </span></blockquote>You&#39;re trivially right, in the sense that 39124 &gt; 39123. Like anything <br/>\nelse, done badly, the result is bad; but done well, the result is just <br/>\nfine. If I add a few methods just for testing, then that exposes a <br/>\nmissing abstraction, it&#39;s also likely that we can /simplify/ the design <br/>\nby reducing the average cognitive load per class/interface/unit.<br/>\n<br/>\nI would love the opportunity to pair with you to see what you do <br/>\ndifferently than I do. I know there&#39;s an opportunity to learn there.<br/>\n-- <br/>\nJ. B. (Joe) Rainsberger :: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jbrains.info\">http://www.jbrains.info</a><br/>\nYour guide to software craftsmanship<br/>\nJUnit Recipes: Practical Methods for Programmer Testing<br/>\n2005 Gordon Pask Award for contribution Agile Software Practice</div>", 
    "prevInTime": 17497, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1155854053", 
    "canDelete": false, 
    "nextInTopic": 17499, 
    "prevInTopic": 17497, 
    "headers": {
        "inReplyToHeader": "PDQ0RTMzMkM0LjMwOTAzMDVAbWV0YWxhYi51bmMuZWR1Pg==", 
        "messageIdInHeader": "PDQ0RTRFRUU1LjUwMTAyMDNAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDNGQjA4RDZBMjFCM0VDNEQ4NzQ5RUY2RDlFNjI2Mjc4NTZGN0VGQFdEQ0NQTUFJTDAxLm1hcmtldHRvb2xzLmNvbT4gPDQ0RTMzMkM0LjMwOTAzMDVAbWV0YWxhYi51bmMuZWR1Pg=="
    }
}