{
    "numMessagesInTopic": 9, 
    "nextInTime": 17610, 
    "senderId": "bSeg5JDSBC9MxVkMi2QwbWYHpluE6cMLTSA7tvTe8IY1MejaJQKQfC-zCbSmb8s6141apr4MOQFnkvUiNnW3K_shzfzDP-ULmNG7mG9wNg", 
    "systemMessage": false, 
    "subject": "Re: [junit] Can we cut short the theological rants about testing, coverage, etc.?", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... Pat, I respect your opinion, but when you complain about the noise on such a low-traffic list, I find it difficult to take you seriously. So many of the", 
    "msgId": 17609, 
    "profile": "nails762", 
    "topicId": 17593, 
    "spamInfo": {
        "reason": "4", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-556026166\">Pat Farrell wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The signal to noise ratio of this mailing list is very low.<br/>\n&gt; Some people believe in testing, some don&#39;t. There is zero chance that<br/>\n&gt; minds will be changed.<br/>\n&gt; <br/>\n&gt; JUnit is a tool. I like what it does. I&#39;d like to learn better ways to<br/>\n&gt; use it to make my life as a developer better. It is hard to find any<br/>\n&gt; useful information between all the rants.<br/>\n&gt; <br/>\n&gt; Purity tests and arguments about them are noise.<br/>\n&gt; IMHO, YMMV, etc.<br/>\n<br/>\n </span></blockquote>Pat, I respect your opinion, but when you complain about the noise on <br/>\nsuch a low-traffic list, I find it difficult to take you seriously. So <br/>\nmany of the questions on this list are from beginners too lazy to use <br/>\nGoogle that, as a balance, I like these discussions (not theological <br/>\nrants, by the way--no need to insult--I, for one, am pragmatic in my <br/>\ndiscussion, so would that be applied theology?).<br/>\n<br/>\nI understand that that&#39;s not what you want to read, and I&#39;m sorry you&#39;re <br/>\nnot getting what you want from the list right now. One option you have <br/>\nis to start a thread and ask the questions you want answered. You can <br/>\nalso ignore the threads you don&#39;t want to read. You can also leave the <br/>\nlist, although I hope you won&#39;t.<br/>\n<br/>\nJUnit is a design tool, and so naturally we will tend to discuss how <br/>\nJUnit tests affect our design. I think that&#39;s both on topic for this <br/>\nlist and important to let flower.<br/>\n<br/>\nJUnit is a testing tool, and so naturally we will tend to discuss how <br/>\nmuch we should and shouldn&#39;t test our code. I think that&#39;s both on topic <br/>\nfor this list and important to let flower.<br/>\n<br/>\nI really don&#39;t think we have let this get to the point of navel-gazing, <br/>\nbut you might disagree with that. I might be too close to the <br/>\ndiscussions to remain objective in this regard.<br/>\n<br/>\nIf we continue to mark such threads with subject lines that make it <br/>\nclear you&#39;re not interested in them, would that help you find what you <br/>\nwant from this list?<br/>\n-- <br/>\nJ. B. (Joe) Rainsberger :: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jbrains.info\">http://www.jbrains.info</a><br/>\nYour guide to software craftsmanship<br/>\nJUnit Recipes: Practical Methods for Programmer Testing<br/>\n2005 Gordon Pask Award for contribution Agile Software Practice</div>", 
    "prevInTime": 17608, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1156371262", 
    "canDelete": false, 
    "nextInTopic": 17618, 
    "prevInTopic": 17599, 
    "headers": {
        "inReplyToHeader": "PDQ0RUM3OTM2LjIwNDAzMDRAcGZhcnJlbGwuY29tPg==", 
        "messageIdInHeader": "PDQ0RUNEMzNFLjcwMzAyMDdAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDQ0RUM3OTM2LjIwNDAzMDRAcGZhcnJlbGwuY29tPg=="
    }
}