{
    "numMessagesInTopic": 9, 
    "nextInTime": 17658, 
    "senderId": "mU5RCCkeWdC6sPbhXvK-0A2jhyHYMTmv0oCXpjpjQhgCJueBoYutNVx55cVUqqNzXmOMaAaG2qA_NWoWnY788bbaQyEqH_Fwpf9n", 
    "systemMessage": true, 
    "subject": "Re: [junit] Can we cut short the theological rants about testing, coverage, etc.?", 
    "from": "David Maddox &lt;davesoftdes@...&gt;", 
    "authorName": "David Maddox", 
    "msgSnippet": "Hi, My experience in a quarter-century-plus of software development and testing, most recently solely testing, is that a laissez-faire approach to the subject", 
    "msgId": 17657, 
    "rawEmail": "Return-Path: &lt;davesoftdes@...&gt;\r\nReceived: (qmail 41722 invoked from network); 27 Aug 2006 18:04:24 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m40.grp.scd.yahoo.com with QMQP; 27 Aug 2006 18:04:24 -0000\r\nReceived: from unknown (HELO n20c.bullet.sc5.yahoo.com) (66.163.187.211)\n  by mta4.grp.scd.yahoo.com with SMTP; 27 Aug 2006 18:04:24 -0000\r\nReceived: from [66.163.187.123] by n20.bullet.sc5.yahoo.com with NNFMP; 27 Aug 2006 18:04:22 -0000\r\nReceived: from [66.218.69.2] by t4.bullet.sc5.yahoo.com with NNFMP; 27 Aug 2006 18:04:22 -0000\r\nReceived: from [66.218.66.75] by t2.bullet.scd.yahoo.com with NNFMP; 27 Aug 2006 18:04:22 -0000\r\nX-Sender: davesoftdes@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 90957 invoked from network); 26 Aug 2006 05:57:51 -0000\r\nReceived: from unknown (66.218.67.36)\n  by m37.grp.scd.yahoo.com with QMQP; 26 Aug 2006 05:57:51 -0000\r\nReceived: from unknown (HELO web39114.mail.mud.yahoo.com) (209.191.87.233)\n  by mta10.grp.scd.yahoo.com with SMTP; 26 Aug 2006 05:57:51 -0000\r\nReceived: (qmail 68082 invoked by uid 60001); 26 Aug 2006 05:57:37 -0000\r\nMessage-ID: &lt;20060826055737.68080.qmail@...&gt;\r\nReceived: from [71.208.186.220] by web39114.mail.mud.yahoo.com via HTTP; Fri, 25 Aug 2006 22:57:37 PDT\r\nDate: Fri, 25 Aug 2006 22:57:37 -0700 (PDT)\r\nTo: junit@yahoogroups.com\r\nIn-Reply-To: &lt;44ECD33E.7030207@...&gt;\r\nMIME-Version: 1.0\r\nX-eGroups-Msg-Info: 2:4:8:0\r\nFrom: David Maddox &lt;davesoftdes@...&gt;\r\nSubject: Re: [junit] Can we cut short the theological rants about testing, coverage, etc.?\r\nX-Yahoo-Group-Post: member; u=260148802; y=bwxbZKXJEVNxRQNfcgILQxKxwf6v0ew5LyCjh4novfKVDs2PQtc\r\nX-Yahoo-Profile: davesoftdes\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\nX-Yahoo-Marked-Not-Spam: \r\nX-Yahoo-Newman-Property: groups-system\r\nX-eGroups-Approved-By: mark_l_salter &lt;marksalter@...&gt; via web; 27 Aug 2006 18:04:04 -0000\r\n\r\nHi,\n   \n  My experience in a quarter-century-plus of software development and testing, most recently solely testing, is that a laissez-faire approach to the subject is what has continued the troubles that software has always had regarding quality. I&#39;m not saying wage Holy War and convert the masses, but I think it&#39;s worth discussing!\n   \n  I am on this list for two reasons. One, I am getting back into Java development, and want to employ junit properly. Two, I have worked with Java developers as a tester, and have suffered the consequences of their lack of interest in junit. Yes, I have a view on the matter. But what I want to discover, from both sides of the aisle, so to speak, is the eternal question - what makes testing worthwhile to people?\n   \n  I am, oddly enough, a human factors guy as well. I bugged Kent Beck about how people could keep up the intensity of the XP model, and he had a great answer - the &quot;Flow&quot; concept put forth by Czikszentmihalyi, which is something that many successful people in many different fields are familiar with. I&#39;m looking for something similar in the matter of testing.\n   \n  So what I&#39;m looking for in these discussions, is how can we avoid the problem of avoidable bugs making it too far downstream, or in other words, producing the code that we *intend* to produce. We can test bugs out, code review might help, reuse of tested code helps, and so forth. When I am a programmer, I get my joy out of coding - how can I keep in the &quot;flow&quot;, and yet have some faith that I am doing what I need to for the cause of quality, and producing my intended result?\n   \n  Now if that isn&#39;t a theological contemplation, I don&#39;t know what is!\n   \n  Dave\n  \n\n&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt; wrote:\n          Pat Farrell wrote:\n\n&gt; The signal to noise ratio of this mailing list is very low.\n&gt; Some people believe in testing, some don&#39;t. There is zero chance that\n&gt; minds will be changed.\n&gt; \n&gt; JUnit is a tool. I like what it does. I&#39;d like to learn better ways to\n&gt; use it to make my life as a developer better. It is hard to find any\n&gt; useful information between all the rants.\n&gt; \n&gt; Purity tests and arguments about them are noise.\n&gt; IMHO, YMMV, etc.\n\nPat, I respect your opinion, but when you complain about the noise on \nsuch a low-traffic list, I find it difficult to take you seriously. So \nmany of the questions on this list are from beginners too lazy to use \nGoogle that, as a balance, I like these discussions (not theological \nrants, by the way--no need to insult--I, for one, am pragmatic in my \ndiscussion, so would that be applied theology?).\n\nI understand that that&#39;s not what you want to read, and I&#39;m sorry you&#39;re \nnot getting what you want from the list right now. One option you have \nis to start a thread and ask the questions you want answered. You can \nalso ignore the threads you don&#39;t want to read. You can also leave the \nlist, although I hope you won&#39;t.\n\nJUnit is a design tool, and so naturally we will tend to discuss how \nJUnit tests affect our design. I think that&#39;s both on topic for this \nlist and important to let flower.\n\nJUnit is a testing tool, and so naturally we will tend to discuss how \nmuch we should and shouldn&#39;t test our code. I think that&#39;s both on topic \nfor this list and important to let flower.\n\nI really don&#39;t think we have let this get to the point of navel-gazing, \nbut you might disagree with that. I might be too close to the \ndiscussions to remain objective in this regard.\n\nIf we continue to mark such threads with subject lines that make it \nclear you&#39;re not interested in them, would that help you find what you \nwant from this list?\n-- \nJ. B. (Joe) Rainsberger :: http://www.jbrains.info\nYour guide to software craftsmanship\nJUnit Recipes: Practical Methods for Programmer Testing\n2005 Gordon Pask Award for contribution Agile Software Practice\n\n\n         \n\n \t\t\n---------------------------------\nStay in the know. Pulse on the new Yahoo.com.  Check it out. \n\n[Non-text portions of this message have been removed]\n\n\n\n\n\n", 
    "profile": "davesoftdes", 
    "topicId": 17593, 
    "spamInfo": {
        "reason": "4", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 260148802, 
    "prevInTime": 17656, 
    "contentTrasformed": false, 
    "postDate": "1156571857", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 17620, 
    "headers": {
        "inReplyToHeader": "PDQ0RUNEMzNFLjcwMzAyMDdAcm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PDIwMDYwODI2MDU1NzM3LjY4MDgwLnFtYWlsQHdlYjM5MTE0Lm1haWwubXVkLnlhaG9vLmNvbT4="
    }
}