{
    "numMessagesInTopic": 287, 
    "nextInTime": 17684, 
    "senderId": "BmzTk091crAYL6Mpg3FRc_GpbLSdK5dIb0OEoEm1Aaa9BlZaFuqCG2Fd4aVtqHzTZSHKd_hP8XSsn_nEJawr9iSjxQp7p-gWckFb6ST2ZUCO0w", 
    "systemMessage": false, 
    "subject": "Re: [junit] Test-friendly, but not caller-friendly?", 
    "from": "Michael Feathers &lt;mfeathers@...&gt;", 
    "authorName": "Michael Feathers", 
    "msgSnippet": "... I think you re mixing pedagogical techniques with working techniques. Average programmers can think in terms of interfaces.. it s a matter of acclimation.", 
    "msgId": 17683, 
    "profile": "mfeathers256", 
    "topicId": 17266, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 78021826, 
    "messageBody": "<div id=\"ygrps-yiv-642586981\">Elliotte Harold wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;J. B. Rainsberger wrote:<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n&gt;&gt;I find it difficult not to interpret this as a (very mild) personal <br/>\n&gt;&gt;attack. You seem to imply that we are not also practitioners. I suspect <br/>\n&gt;&gt;you&#39;re not an asshole, so I imagine you mean something else. I would <br/>\n&gt;&gt;appreciate you clarifying this position. Is it necessarily the case, <br/>\n&gt;&gt;then, that &quot;the sort of programmers who... hang out on lists like this <br/>\n&gt;&gt;one&quot; don&#39;t know what we&#39;re talking about, because I kinda think I do and <br/>\n&gt;&gt;I kinda think I&#39;ve proven that.<br/>\n&gt;&gt;    <br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;You do know what you&#39;re talking about, and you are practitioners, as am <br/>\n&gt;I. However you&#39;re making the classic mistake of assuming that everyone <br/>\n&gt;else is just like you, and that what works for you works for them. This <br/>\n&gt;is a *HUGE* and unrecognized fallacy that underlies a lot more than <br/>\n&gt;programming methodologies. For instance, it&#39;s largely responsible for <br/>\n&gt;the failure of modern elementary and secondary education, which works <br/>\n&gt;for maybe 5% of children. However that&#39;s those 5% that go onto become <br/>\n&gt;teachers and principles and propagate the same techniques to future <br/>\n&gt;generations, while ignoring the failure of 95% of their students.<br/>\n&gt;<br/>\n&gt;The simple fact is that people learn and think differently. No one <br/>\n&gt;technique works for everyone, but some techniques do work for more <br/>\n&gt;people. We tend to self-select into groups that think similarly and <br/>\n&gt;learn similarly to ourselves. The people who like interfaces are a <br/>\n&gt;self-selected group of programmers who think at a very high degree of <br/>\n&gt;abstraction, even for programmers (already a self-selected and abstract <br/>\n&gt;bunch). This doesn&#39;t mean they don&#39;t produce quality software. It does <br/>\n&gt;mean that you can&#39;t expect what works for them to work for all or even <br/>\n&gt;most developers.<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>I think you&#39;re mixing pedagogical techniques with working techniques.  <br/>\nAverage programmers can think in terms of interfaces.. it&#39;s a matter of <br/>\nacclimation.  Note, I&#39;m talking about average programmers.  There are, <br/>\nunfortunately, some people who really shouldn&#39;t be programming at all.<br/>\n<br/>\nI know that there are cases where you know that the people who come <br/>\nafter you in a project are going to be of uncertain caliber.  I was <br/>\ntalking to a friend a month ago who was part of a small team that <br/>\ndeliberately didn&#39;t use patterns.   They programmed for the least common <br/>\ndenominator because that was all that they could count on for <br/>\nmaintenance.  They made a calculated bet.  The thing is, though, that <br/>\nI&#39;ve seen enough teams raise their level of practice to bet on that when <br/>\nI know that they have the opportunity.<br/>\n<br/>\nMichael Feathers<br/>\nwww.objectmentor.com</div>", 
    "prevInTime": 17682, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1156854631", 
    "canDelete": false, 
    "nextInTopic": 17684, 
    "prevInTopic": 17682, 
    "headers": {
        "inReplyToHeader": "PDQ0RjM0OEUwLjcwMjA3MDBAbWV0YWxhYi51bmMuZWR1Pg==", 
        "messageIdInHeader": "PDQ0RjQzMzY3LjgwNTAyMDFAbWluZHNwcmluZy5jb20+", 
        "referencesHeader": "PDNGQjA4RDZBMjFCM0VDNEQ4NzQ5RUY2RDlFNjI2Mjc4NTZGN0VGQFdEQ0NQTUFJTDAxLm1hcmtldHRvb2xzLmNvbT4gPDQ0RTMzMkM0LjMwOTAzMDVAbWV0YWxhYi51bmMuZWR1PiA8NDRFNEVFRTUuNTAxMDIwM0Byb2dlcnMuY29tPiA8NDRGMzQ4RTAuNzAyMDcwMEBtZXRhbGFiLnVuYy5lZHU+"
    }
}