{
    "numMessagesInTopic": 1, 
    "nextInTime": 17703, 
    "senderId": "J8ni9Cer2GBBGHQdCoqu6clDJ1jLu042h4sXxkcS4JvF0EZAPe-p_hWbE9EyeJ9cYowuOSm7Oh0YBY51tFnjqhcz_tNAFzzvwUTOWmi76A", 
    "systemMessage": false, 
    "subject": "ANN: XP Day Montreal - September 23, 2006", 
    "from": "&quot;nkhanna_01&quot; &lt;niraj@...&gt;", 
    "authorName": "nkhanna_01", 
    "msgSnippet": "Hello Everyone, Diaspar Software (founded by J.B. Rainsberger) and ProjectSuccess are proud to present our 3rd installment of the XP Day North America series,", 
    "msgId": 17702, 
    "profile": "nkhanna_01", 
    "topicId": 17702, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 231521593, 
    "messageBody": "<div id=\"ygrps-yiv-130680391\">Hello Everyone,<br/>\n<br/>\nDiaspar Software (founded by J.B. Rainsberger) and ProjectSuccess are<br/>\nproud to present our 3rd installment of the XP Day North America<br/>\nseries, XP Day Montreal 2006. XP Day is a one day extreme programming<br/>\nconference to be held in Montreal, Quebec September 23, 2006.  For<br/>\nmore information see below, but for those who prefer browsing a<br/>\nwebsite instead of reading plain text, visit: xpday.info<br/>\n<br/>\nIf you are looking for an opportunity to learn more about Extreme<br/>\nProgramming without having to spend an entire week at a large<br/>\ninternational XP conference, XP Day Montreal fits the bill.  XP Day is<br/>\na one-day event with activities for anyone interested in Extreme<br/>\nProgramming, whether you&#39;re:<br/>\n<br/>\n* An executive wondering how to improve your software development<br/>\nteam&#39;s ROI.<br/>\n* A manager looking for ways to increase your team&#39;s effectiveness.<br/>\n* A skeptic, hoping to challenge some of the most experienced and<br/>\noutspoken XP practitioners.<br/>\n* A programmer itching to experience a real XP project room.<br/>\n* An experienced practitioner, hoping to exchange ideas or experiences<br/>\nwith other practitioners.<br/>\n<br/>\nFor those of you who missed out on Agile 2006, this would be an<br/>\nexcellent opportunity to meet, attend tutorial sessions and even work<br/>\nwith some of the XP community&#39;s most notable practitioners, for a<br/>\nfraction of the cost.<br/>\n<br/>\nXP Day events are interactive!<br/>\n<br/>\n- Tutorials<br/>\nWe are fortunate to have respected leaders of the XP community<br/>\nproviding world-class instruction and discussion on the fundamentals of<br/>\nXP.<br/>\n<br/>\n* Laurent Bossavit, keynote and recipient of the 2006 Gordon Pask<br/>\naward for contributions to the agile community. Laurent&#39;s keynote<br/>\naddress is entitled &quot;They do things differently there&quot; wherein we will<br/>\nspeak of cultural gaps, ways to bridge them, and why that is relevant<br/>\nto the software industry.<br/>\n<br/>\n* Michael Feathers will also provide a tutorial entitled &quot;API design<br/>\nas if testing mattered&quot; to show why the days of monolithic<br/>\napplications are over.<br/>\n<br/>\n* J.B. Rainsberger, recipient of the 2005 Gordon Pask Award, will<br/>\nprovide an &quot;Introduction to XP&quot; tutorial.<br/>\n<br/>\n- Open Space<br/>\nYou can collaborate intensively with both local and invited advanced<br/>\npractitioners on issues that challenge you most. If the tutorials<br/>\ndon&#39;t cover it, you can work through your burning questions in Open<br/>\nSpace.<br/>\n<br/>\n- Panel Discussion<br/>\nWe are pleased to offer a panel discussion entitled &quot;Your customer is<br/>\nmore important than you think&quot;. Laurent, Michael, JB, Francois<br/>\nBeauregard and Dave Rooney will discuss why an involved customer is<br/>\ncritical to the success of your software projects.<br/>\n<br/>\n- Project Room<br/>\nIf you&#39;re looking to dive in and immerse yourself in XP, join the XP<br/>\nProject Room, where you&#39;ll have the opportunity to work on project<br/>\nwith respected experts. Not sure what&#39;s going on? No problem! Join the<br/>\nproject any time and someone will bring you up to speed quickly, just<br/>\nlike on a real XP project!<br/>\n<br/>\n- Cost<br/>\nXP Day is only $249 CND. Our conference cost includes a morning<br/>\nbreakfast and a hot Indian buffet for lunch.  For those with more<br/>\ndomestic appetites, sandwiches will also be on hand. Coffee & Soft<br/>\nDrinks will also be available throughout the day.<br/>\n<br/>\nIf you&#39;re looking for more information, visit our website: xpday.info<br/>\n<br/>\nIf you have any questions with regards to this event, please don&#39;t<br/>\nhesitate to contact me at the email address listed above.<br/>\nHope to see you all there!<br/>\n<br/>\nNiraj Khanna<br/>\nXP Day Montreal.</div>", 
    "prevInTime": 17701, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1156896196", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGVkMmtrNCsybW5zQGVHcm91cHMuY29tPg=="
    }
}