{
    "numMessagesInTopic": 287, 
    "nextInTime": 17702, 
    "senderId": "-EGssY9Bxf7cK80T1mOyKgNKcA_R4YxQTknjCliwh7rA1Wm0bgem1k6qvck4C1keLN7vMS7Q-h2VfoS-fESepbpjxVqkiUlNePejsrCgh2nvKKFMuTx4WNSvAa4", 
    "systemMessage": false, 
    "subject": "Re: [junit] Test-friendly, but not caller-friendly?", 
    "from": "&quot;Rutherford, Michael&quot; &lt;michael.rutherford@...&gt;", 
    "authorName": "Rutherford, Michael", 
    "msgSnippet": "Interesting that you (or they at least) consider avoiding patterns to be programming to the LCD. I ve found that so long as you avoid getting pattern happy the", 
    "msgId": 17701, 
    "rawEmail": "Return-Path: &lt;michael.rutherford@...&gt;\r\nX-Sender: michael.rutherford@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 85609 invoked from network); 29 Aug 2006 22:48:46 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m41.grp.scd.yahoo.com with QMQP; 29 Aug 2006 22:48:46 -0000\r\nReceived: from unknown (HELO gw0.commbank.com.au) (203.17.185.170)\n  by mta6.grp.scd.yahoo.com with SMTP; 29 Aug 2006 22:48:45 -0000\r\nReceived: (from mail@localhost)\n\tby gw0.commbank.com.au (8.12.10+Sun/8.12.10) id k7TMVIOd003998\n\tfor &lt;junit@yahoogroups.com&gt;; Wed, 30 Aug 2006 08:31:18 +1000 (EST)\r\nX-Authentication-Warning: gw0.commbank.com.au: mail set sender to &lt;michael.rutherford@...&gt; using -f\r\nReceived: from UNKNOWN(172.29.102.10), claiming to be &quot;msgw01.cba.com.au&quot;\n via SMTP by bh0, id smtpdAAARpaOYh; Wed Aug 30 08:31:18 2006\r\nMessage-ID: &lt;29FBC2F4FBFC5C42A950C07EF5FD159F057F54@...&gt;\r\nTo: &quot;&#39;junit@yahoogroups.com&#39;&quot; &lt;junit@yahoogroups.com&gt;\r\nDate: Wed, 30 Aug 2006 08:46:24 +1000\r\nMIME-Version: 1.0\r\nX-Mailer: Internet Mail Service (5.5.2657.72)\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: &quot;Rutherford, Michael&quot; &lt;michael.rutherford@...&gt;\r\nSubject: Re: [junit] Test-friendly, but not caller-friendly?\r\nX-Yahoo-Group-Post: member; u=229542016; y=EmKW7APT9Y4cDJAbOQcL0NtLdet4M3V2ml58rPv3-nd3DkbTTHU\r\nX-Yahoo-Profile: mrutherfurd\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\n\r\nInteresting that you (or they at least) consider avoiding patterns to be\nprogramming to the LCD. \n \nI&#39;ve found that so long as you avoid getting pattern happy the benefits to\neven novice programmers include less time spent having to recognise what\nmany classes or methods do in relatation to &quot;nearby&quot; classes. eg the\njudicious use of factory methods to encapsulate logic for object creation.\nThis leads to faster maintenance and better understanding of the overall\nsystem as there is actually less to learn at any one time.\n \nHaving said that Pattern Abuse *is* rife eg the prevalent use of the\nAbstract Factory pattern outside of generic APIs, this pattern is major\noverkill for most application programming in my experience.\n \nIn my opinion it is similiar to the prevalent architectural design (which\n*seems* to be lessening) of specifying the use of EJBs for everything. I&#39;ve\nhad major knock-down drag-out fights over that one :-) EJBs have their uses\nbut the default choice should be to not use them.\n \nMichael Rutherfurd\n \n \n\n-----Original Message-----\nFrom: junit@yahoogroups.com [mailto:junit@yahoogroups.com] On Behalf Of\nMichael Feathers\nSent: Tuesday, 29 August 2006 10:31 PM\nTo: junit@yahoogroups.com\nSubject: [POLICY P1] Re: [junit] Test-friendly, but not caller-friendly?\n\n\n\nElliotte Harold wrote:\n\n&gt;J. B. Rainsberger wrote:\n&gt;\n&gt; \n&gt;\n&gt;&gt;I find it difficult not to interpret this as a (very mild) personal \n&gt;&gt;attack. You seem to imply that we are not also practitioners. I suspect \n&gt;&gt;you&#39;re not an asshole, so I imagine you mean something else. I would \n&gt;&gt;appreciate you clarifying this position. Is it necessarily the case, \n&gt;&gt;then, that &quot;the sort of programmers who... hang out on lists like this \n&gt;&gt;one&quot; don&#39;t know what we&#39;re talking about, because I kinda think I do and \n&gt;&gt;I kinda think I&#39;ve proven that.\n&gt;&gt; \n&gt;&gt;\n&gt;\n&gt;You do know what you&#39;re talking about, and you are practitioners, as am \n&gt;I. However you&#39;re making the classic mistake of assuming that everyone \n&gt;else is just like you, and that what works for you works for them. This \n&gt;is a *HUGE* and unrecognized fallacy that underlies a lot more than \n&gt;programming methodologies. For instance, it&#39;s largely responsible for \n&gt;the failure of modern elementary and secondary education, which works \n&gt;for maybe 5% of children. However that&#39;s those 5% that go onto become \n&gt;teachers and principles and propagate the same techniques to future \n&gt;generations, while ignoring the failure of 95% of their students.\n&gt;\n&gt;The simple fact is that people learn and think differently. No one \n&gt;technique works for everyone, but some techniques do work for more \n&gt;people. We tend to self-select into groups that think similarly and \n&gt;learn similarly to ourselves. The people who like interfaces are a \n&gt;self-selected group of programmers who think at a very high degree of \n&gt;abstraction, even for programmers (already a self-selected and abstract \n&gt;bunch). This doesn&#39;t mean they don&#39;t produce quality software. It does \n&gt;mean that you can&#39;t expect what works for them to work for all or even \n&gt;most developers.\n&gt; \n&gt;\nI think you&#39;re mixing pedagogical techniques with working techniques. \nAverage programmers can think in terms of interfaces.. it&#39;s a matter of \nacclimation. Note, I&#39;m talking about average programmers. There are, \nunfortunately, some people who really shouldn&#39;t be programming at all.\n\nI know that there are cases where you know that the people who come \nafter you in a project are going to be of uncertain caliber. I was \ntalking to a friend a month ago who was part of a small team that \ndeliberately didn&#39;t use patterns. They programmed for the least common \ndenominator because that was all that they could count on for \nmaintenance. They made a calculated bet. The thing is, though, that \nI&#39;ve seen enough teams raise their level of practice to bet on that when \nI know that they have the opportunity.\n\nMichael Feathers\nwww.objectmentor.com\n\n\n\n \n\n\n\n**************   IMPORTANT MESSAGE  **************\nThis e-mail message is intended only for the addressee(s) and contains information which may be confidential. \nIf you are not the intended recipient please advise the sender by return email, do not use or disclose the contents, and delete the message and any attachments from your system. Unless specifically indicated, this email does not constitute formal advice or commitment by the sender or the Commonwealth Bank of Australia (ABN 48 123 123 124) or its subsidiaries. \nWe can be contacted through our web site: commbank.com.au. \nIf you no longer wish to receive commercial electronic messages from us, please reply to this e-mail by typing Unsubscribe in the subject line.\n***************************************************************\n\n\n\n[Non-text portions of this message have been removed]\n\n\n", 
    "profile": "mrutherfurd", 
    "topicId": 17266, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 229542016, 
    "prevInTime": 17700, 
    "contentTrasformed": false, 
    "postDate": "1156891584", 
    "canDelete": false, 
    "nextInTopic": 17703, 
    "prevInTopic": 17699, 
    "headers": {
        "messageIdInHeader": "PDI5RkJDMkY0RkJGQzVDNDJBOTUwQzA3RUY1RkQxNTlGMDU3RjU0QGFhdW5zdzQxMC5hdS5jYmFpbmV0LmNvbT4="
    }
}