{
    "numMessagesInTopic": 287, 
    "nextInTime": 17719, 
    "senderId": "VOtsOFJj9Qg6mYMvUw7em8aNgL0Xd54crEdF1yNNMD7fkJqlB89aQHqUP6c4bt_sPbPrXmJXMx8p-ZaJfjfx7AknDUTGKeQ_MRbP5vllkQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Test-friendly, but not caller-friendly?", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... I find this statement curious. Let me explore a specific example: JDBC. JDBC consists of a generic API, mostly interfaces, and vendors implement those", 
    "msgId": 17718, 
    "profile": "nails762", 
    "topicId": 17266, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-36005180\">Elliotte Harold wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Michael Feathers wrote:<br/>\n&gt; <br/>\n&gt;  &gt; Nope. We wrapped it. Yes, we had system tests, but in order to test<br/>\n&gt;  &gt; our logic independently, we pretty much had to wrap it.<br/>\n&gt; <br/>\n&gt; I don&#39;t want the tests to be independent of the libraries they depend<br/>\n&gt; on. I want them to depend on exactly what the code depends on: no more;<br/>\n&gt; no less. That way you find bugs in the boundaries between model classes<br/>\n&gt; and libraries as well as in the model classes and libraries themselves.<br/>\n<br/>\n </span></blockquote>I find this statement curious. Let me explore a specific example: JDBC.<br/>\n<br/>\nJDBC consists of a generic API, mostly interfaces, and vendors implement <br/>\nthose interfaces. The idea is that, at least in the broad strokes, <br/>\ndifferent JDBC drivers implement the same basic concepts the same way <br/>\n(setting prepared statement parameters, getting connections, that kind <br/>\nof thing... differences in SQL are another story altogether).<br/>\n<br/>\nNow if I want to know whether I&#39;m using the JDBC API properly, it seems <br/>\nto be that testing against one vendor&#39;s implementation has the <br/>\nlimitation of assuming that the vendor has implemented the JDBC <br/>\ninterfaces properly. If I write a test against my code (using their JDBC <br/>\ndriver) and the test fails, where is the defect? In my code? In theirs? <br/>\nHunting that defect down takes time.<br/>\n<br/>\nConsider an alternative: I write interaction tests for my code that mock <br/>\nthe JDBC interfaces, based on commonly-accepted understanding of how the <br/>\nJDBC interface methods behave. Again, I&#39;m assuming that the vendor <br/>\nimplements the interfaces correctly; however, I also write a Contract <br/>\nTest that checks whether the JDBC driver indeed implements the interface <br/>\ncorrectly. When I write a test against my code and the test fails, the <br/>\ndefect is certainly in my code, because I&#39;m incorrectly using the JDBC <br/>\ninterfaces. When a Contract Test for the vendor&#39;s JDBC driver fails, the <br/>\ndefect is certainly in the vendor&#39;s driver. There is no need to look <br/>\nfurther.<br/>\n<br/>\nGiven that my project&#39;s System Tests will check our use of JDBC and our <br/>\nvendor&#39;s driver in the context of realistic business transactions, I see <br/>\nno need to duplicate that effort in my object tests.<br/>\n-- <br/>\nJ. B. (Joe) Rainsberger :: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jbrains.ca\">http://www.jbrains.ca</a><br/>\nYour guide to software craftsmanship<br/>\nJUnit Recipes: Practical Methods for Programmer Testing<br/>\n2005 Gordon Pask Award for contribution Agile Software Practice</div>", 
    "prevInTime": 17717, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1157058147", 
    "canDelete": false, 
    "nextInTopic": 17727, 
    "prevInTopic": 17716, 
    "headers": {
        "inReplyToHeader": "PDQ0RjQ1N0U3LjcwNjA4MDdAbWV0YWxhYi51bmMuZWR1Pg==", 
        "messageIdInHeader": "PDQ0Rjc0RTYzLjYwNTA2MDVAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDNGQjA4RDZBMjFCM0VDNEQ4NzQ5RUY2RDlFNjI2Mjc4NTZGN0VGQFdEQ0NQTUFJTDAxLm1hcmtldHRvb2xzLmNvbT4gPDQ0RTMzMkM0LjMwOTAzMDVAbWV0YWxhYi51bmMuZWR1PiA8NDRFNDQ0QUQuNDAxMDcwMEBtaW5kc3ByaW5nLmNvbT4gPDQ0RjM0NzVELjMwMTA5MDdAbWV0YWxhYi51bmMuZWR1PiA8NDRGNDMxMTUuMzA3MDkwMEBtaW5kc3ByaW5nLmNvbT4gPDQ0RjQzN0YyLjQwODA2MDVAbWV0YWxhYi51bmMuZWR1PiA8NDRGNDNCMzMuODAyMDQwM0BtaW5kc3ByaW5nLmNvbT4gPDQ0RjQ1N0U3LjcwNjA4MDdAbWV0YWxhYi51bmMuZWR1Pg=="
    }
}