{
    "numMessagesInTopic": 287, 
    "nextInTime": 17765, 
    "senderId": "LaANewjbAJGsLxfoJFkEUCNbQoojQhuM2M4mZmDOLD22q3gNhF9jsIRG53STxWuu7hNjD0hxTUG_EmludpvkMOV233BVNC767nsCSDlQizepsA", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Test-friendly, but not caller-friendly?", 
    "from": "Michael Feathers &lt;mfeathers@...&gt;", 
    "authorName": "Michael Feathers", 
    "msgSnippet": "... The thing that makes conversations like this so hard is that fact that the context is often left hanging.  It s particularly bad when talking about error", 
    "msgId": 17764, 
    "profile": "mfeathers256", 
    "topicId": 17266, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 78021826, 
    "messageBody": "<div id=\"ygrps-yiv-1972961860\">Elliotte Harold wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Michael Feathers wrote:<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n&gt;&gt;But back to your original point: &quot;It might sometimes be a <br/>\n&gt;&gt;NullPointerException or something else instead, but advertising a <br/>\n&gt;&gt;precondition is not an excuse for misbehavior just because you receive <br/>\n&gt;&gt;bad data.&quot; Under DbC, it is.  Fact is, if your precondition fails or you <br/>\n&gt;&gt;get a NullPointerException, there&#39;s a bug in the client.  You can have <br/>\n&gt;&gt;checking enabled, or not, but checking is not error handling. <br/>\n&gt;&gt;    <br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;Then maybe we agree more than we think. If checking is not error <br/>\n&gt;handling, then I accept that we don&#39;t need to handle the error. Indeed, <br/>\n&gt;in many cases we can&#39;t reasonably handle the error inside the method. <br/>\n&gt;However, I do think that it&#39;s important not to blindly accept a bad <br/>\n&gt;argument that violates a precondition and precede blindly ahead whatever <br/>\n&gt;happens. It is important to fail fast (and in a controlled and <br/>\n&gt;documented way via an exception) rather than let the software corrupt <br/>\n&gt;itself. Martin Fowler has written extensively about this:<br/>\n&gt;<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.martinfowler.com/ieeeSoftware/failFast.pdf\">http://www.martinfowler.com/ieeeSoftware/failFast.pdf</a><br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>The thing that makes conversations like this so hard is that fact that <br/>\nthe context is often left hanging.  It&#39;s particularly bad when talking <br/>\nabout error handling and recovery because there is no one right approach <br/>\nthere.  Some systems have to be up all of the time and fail fast <br/>\nwouldn&#39;t fly.  Jim outlines a great strategy in that article for the <br/>\ncases where it&#39;s appropriate.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;The point <br/>\n&gt;&gt;of DbC is to build software robust enough so that you don&#39;t have to <br/>\n&gt;&gt;write error handling code at each level.  Relevant section is 11.6 <br/>\n&gt;&gt;&quot;Assertions are not an input checking mechanism.&quot;<br/>\n&gt;&gt;    <br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;That&#39;s something very different. Meyer clearly means *user* input in <br/>\n&gt;that section, and I agree with him on that. Assertions very much are an <br/>\n&gt;argument/parameter checking mechanism. I don&#39;t think we&#39;re talking here <br/>\n&gt;about user input, just about how two different methods from two <br/>\n&gt;different code bases communicate.<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Yes, I should have said more.  The thing I wanted to point out in that <br/>\nsection was that when you have checking that will lead you to do <br/>\nsomething, it should be at the edges (what Meyer calls &#39;filter classes&#39;) <br/>\nand not scattered throughout the code.  Otherwise, you are back at <br/>\ndefensive coding again.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt;<br/>\n&gt;&gt;And when you say &quot;It is my job to make sure my code works. I can&#39;t do <br/>\n&gt;&gt;that if the code that calls it violates my preconditions and class <br/>\n&gt;&gt;invariants.&quot;  Most of the time, that&#39;s trying to do too much.<br/>\n&gt;&gt;    <br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;Agreed. What I really should have said is something like, &quot;It&#39;s my job <br/>\n&gt;to make sure my code works, or signals an error at the earliest possible <br/>\n&gt;opportunity if it can&#39;t work due to precondition violation&quot;<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>I think that, again, that is situational and it depends on your <br/>\ndevelopment style.  I write a lot of tests for my code and when I work <br/>\nwith teams we often get to the point that they serve as primary <br/>\ndocumentation.  If you want to see how something works, look a  test <br/>\ncase, if you can&#39;t find one, write one to make sure it works the way you <br/>\nwant to.  It&#39;s hard to describe what happens when you do that, but I <br/>\nthink the easiest thing is to say is that you are less concerned with <br/>\nthe correctness of a class, and more concerned with the correctness of <br/>\nits use.  That may sound bad, but it works because your class becomes <br/>\nthe intersection of its uses. <br/>\n<br/>\nMichael Feathers<br/>\nwww.objectmentor.com</div>", 
    "prevInTime": 17763, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1157383135", 
    "canDelete": false, 
    "nextInTopic": 17765, 
    "prevInTopic": 17763, 
    "headers": {
        "inReplyToHeader": "PDQ0RkMzNUVELjEwMzA4MDRAbWV0YWxhYi51bmMuZWR1Pg==", 
        "messageIdInHeader": "PDQ0RkM0M0RGLjYwNDA5MDhAbWluZHNwcmluZy5jb20+", 
        "referencesHeader": "PEQ5M0IwNjVGLUYwMzctNDYyNS1BOTExLTMxRUVDQkVCMTc3OEBvYmplY3RtZW50b3IuY29tPiA8NDRGQUIwMUEuODAzMDYwM0BtZXRhbGFiLnVuYy5lZHU+IDw0NEZBRDRFOC42MDIwNTA1QGlsamFwcmV1c3MuZGU+IDw0NEZCMjMyQS43MDAwNzA1QG1ldGFsYWIudW5jLmVkdT4gPDQ0RkI4M0FBLjUwMjAyMDBAbWluZHNwcmluZy5jb20+IDw0NEZCRkZBQy4zMDIwMzA3QG1ldGFsYWIudW5jLmVkdT4gPDQ0RkMyRjgwLjYwNTA3MDBAbWluZHNwcmluZy5jb20+IDw0NEZDMzVFRC4xMDMwODA0QG1ldGFsYWIudW5jLmVkdT4="
    }
}