{
    "numMessagesInTopic": 287, 
    "nextInTime": 17763, 
    "senderId": "42S28DLyKB-iyC06lyZqn8eyg_DMGCkgrc_-FZjsfxhkI6iMSqJSIYh_TJC2jJy5l8MVdO5O75A-uQ6z1pKfNQowAQzYXs4O485ggOLF1iUZ6A", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Test-friendly, but not caller-friendly?", 
    "from": "Michael Feathers &lt;mfeathers@...&gt;", 
    "authorName": "Michael Feathers", 
    "msgSnippet": "... Actually, I was going to point you to p.389 where he points out that the use of assertions is primarily methodological and a documentation aid. Java", 
    "msgId": 17762, 
    "profile": "mfeathers256", 
    "topicId": 17266, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 78021826, 
    "messageBody": "<div id=\"ygrps-yiv-1298347935\">Elliotte Harold wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Michael Feathers wrote:<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n&gt;&gt;Nope.  That&#39;s pretty much counter to Design by Contact.  Do you have a <br/>\n&gt;&gt;copy of Meyer&#39;s Object Oriented Software Construction?  If you do, I can <br/>\n&gt;&gt;point you to some text that explains it easier than I can retype it here.<br/>\n&gt;&gt;<br/>\n&gt;&gt;    <br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;Yes, I do have a copy. I suspect you&#39;re referring to p. 343-344. However <br/>\n&gt;you have to remember that Meyer is writing about a language in which <br/>\n&gt;preconditions can be specified *and enforced* outside the body of the <br/>\n&gt;method. Since Java, unlike Eiffel, does not provide extra-method <br/>\n&gt;preconditions it is therefore necessary to place the verification code <br/>\n&gt;in the method body. It&#39;s not ideal, but Java is not an ideal language.<br/>\n&gt;<br/>\n&gt;Furthermore, for most cases, Meyer recommends precondition verification <br/>\n&gt;by default. See pp. 394-398<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>Actually, I was going to point you to p.389 where he points out that the <br/>\nuse of assertions is primarily methodological and a documentation aid. <br/>\nJava doesn&#39;t support runtime monitoring natively, but to me that&#39;s okay, <br/>\nbecause it isn&#39;t the most important thing.<br/>\n<br/>\nBut back to your original point: &quot;It might sometimes be a <br/>\nNullPointerException or something else instead, but advertising a <br/>\nprecondition is not an excuse for misbehavior just because you receive <br/>\nbad data.&quot; Under DbC, it is.  Fact is, if your precondition fails or you <br/>\nget a NullPointerException, there&#39;s a bug in the client.  You can have <br/>\nchecking enabled, or not, but checking is not error handling.  The point <br/>\nof DbC is to build software robust enough so that you don&#39;t have to <br/>\nwrite error handling code at each level.  Relevant section is 11.6 <br/>\n&quot;Assertions are not an input checking mechanism.&quot;<br/>\n<br/>\nAnd when you say &quot;It is my job to make sure my code works. I can&#39;t do <br/>\nthat if the code that calls it violates my preconditions and class <br/>\ninvariants.&quot;  Most of the time, that&#39;s trying to do too much.  You&#39;ll <br/>\nlapse into defensive programming.  Again, you can easily have <br/>\npreconditions for interfaces, just write them as comments.<br/>\n<br/>\nNow, the thing that I have to admit is that I like DbC but I&#39;ve only <br/>\nused it a couple of times in the past.  And, I used it in systems which <br/>\nlapsed into a bit of defensive programming.  One was in a continuously <br/>\nrunning system that I designed that for medical instrumentation.  It was <br/>\nabout 15 years ago, and we found the documentation of preconditions <br/>\nuseful, and the checks, but there was always that issue of what to do <br/>\nwhen a precondition failed.  The system had to be designed so that it <br/>\ncouldn&#39;t go down, all we could do is log errors and patch values to keep <br/>\nit running.  We had many discussions about what failure meant and <br/>\nruntime recovery, and we concluded that although DbC is nice, it is <br/>\nreally orthogonal to those concerns.  Our recovery checking had some <br/>\noverlap with our preconditions but it was not complete.  DbC is about <br/>\ndocumentating expectations.  You write preconditions to tell people what <br/>\nyou expect, and if you do, you&#39;ve done most of the job that DbC was <br/>\ndesigned for.  The other thing we learned, is that if you are clever, <br/>\nyou can often design away preconditions and make calls less error prone.<br/>\n<br/>\nMichael Feathers<br/>\nwww.objectmentor.com</div>", 
    "prevInTime": 17761, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1157377920", 
    "canDelete": false, 
    "nextInTopic": 17763, 
    "prevInTopic": 17761, 
    "headers": {
        "inReplyToHeader": "PDQ0RkJGRkFDLjMwMjAzMDdAbWV0YWxhYi51bmMuZWR1Pg==", 
        "messageIdInHeader": "PDQ0RkMyRjgwLjYwNTA3MDBAbWluZHNwcmluZy5jb20+", 
        "referencesHeader": "PEQ5M0IwNjVGLUYwMzctNDYyNS1BOTExLTMxRUVDQkVCMTc3OEBvYmplY3RtZW50b3IuY29tPiA8NDRGQUIwMUEuODAzMDYwM0BtZXRhbGFiLnVuYy5lZHU+IDw0NEZBRDRFOC42MDIwNTA1QGlsamFwcmV1c3MuZGU+IDw0NEZCMjMyQS43MDAwNzA1QG1ldGFsYWIudW5jLmVkdT4gPDQ0RkI4M0FBLjUwMjAyMDBAbWluZHNwcmluZy5jb20+IDw0NEZCRkZBQy4zMDIwMzA3QG1ldGFsYWIudW5jLmVkdT4="
    }
}