{
    "numMessagesInTopic": 10, 
    "nextInTime": 17815, 
    "senderId": "I4Qy7J9hVZQfMe1TT_rBZmTjgxX49CqbLf1e1GGIjJS4Zw1JPYUKGY33NdaNsUpGDMpPgKNKFnHJy8-cxkV7iU-6r_IAToV7mr-P42X37f8", 
    "systemMessage": true, 
    "subject": "Re: how to show that junit works (validating junit)", 
    "from": "&quot;mvogelbusedge&quot; &lt;mvogel@...&gt;", 
    "authorName": "mvogelbusedge", 
    "msgSnippet": "... I ... important ... never ... as ... validated? ... They don t see any of our dev tools so they don t care about them being validated.  They want the test", 
    "msgId": 17814, 
    "profile": "mvogelbusedge", 
    "topicId": 17615, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 273031198, 
    "messageBody": "<div id=\"ygrps-yiv-615463699\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;Antti Karanta&quot; &lt;Antti.Karanta@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I have no experience in developing software w/ this degree of<br/>\n&gt; formalism, and this post made me curious: I&#39;d understand that all the<br/>\n&gt; validation is required of the components included w/ the software, but<br/>\n </span></blockquote>I<br/>\n<blockquote><span title=\"ireply\"> &gt; don&#39;t really understand that it is required of the development tools,<br/>\n&gt; too. Is it required that the debugger is validated? The compiler? The<br/>\n&gt; IDE? The OS? The JVM? Actually, the OS and the JVM are pretty<br/>\n </span></blockquote>important<br/>\n<blockquote><span title=\"ireply\"> &gt; for the correct functioning of the software, as is the compiler.<br/>\n&gt;<br/>\n&gt; As I see it, unit tests are a development tool - they aren&#39;t (usually)<br/>\n&gt; shipped w/ the software. You could, in principle, write and use unit<br/>\n&gt; tests, but keep their sources and binaries in a separate place and<br/>\n </span></blockquote>never<br/>\n<blockquote><span title=\"ireply\"> &gt; even tell the auditors they exist, and the auditors would not know to<br/>\n&gt; miss them. I&#39;m not suggesting you do this, I&#39;m just a little confused<br/>\n </span></blockquote>as<br/>\n<blockquote><span title=\"ireply\"> &gt; to why a development tool needs to be validated.<br/>\n&gt; Thenagain, if you want to use junit to validate your software<br/>\n&gt; formally, then I guess the validation tool itself needs to be<br/>\n </span></blockquote>validated?<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; -Antti-<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>They don&#39;t see any of our dev tools so they don&#39;t care about them being<br/>\nvalidated.  They want the test tools  validated since these are what<br/>\nthey use to validate the results of our use of the dev tools.   They<br/>\ntypically have strict rules about what versions of the JVM, OS, App<br/>\nServer, Database product, etc., can be used at run-time.  They don&#39;t<br/>\nvalidate the JVM or OS but do some kind of validation of the dev process<br/>\nof the products that run on them, e.g., they would have audited BEA if<br/>\nusing Weblogic.<br/>\n<br/>\nThe auditors want to see the evidence of unit, integration, and user<br/>\nacceptance testing.  So we could hide the tools used but when they saw<br/>\nautomated test evidence they could question the validation status of the<br/>\ntools used.  We also have to create various test plans (Master, Unit,<br/>\nUser, etc.) that document how the testing was planned.  The unit test<br/>\nplans I&#39;ve written state that we use xUnit, how the tests are organized<br/>\nand how to find the test source code since it is the definition of the<br/>\nunit tests done.<br/>\n<br/>\nI&#39;m not saying I agree with the need to validate junit since it is very<br/>\nlikely better tested than most software artifacts in existence.  <br/>\nHowever, if I could provide them with the things the QA folks and<br/>\nauditors are used to getting (requirements, traceability, test evidence)<br/>\nthen their reluctance to let us use junit would go away.  Last project I<br/>\ngot away with using junit by documenting a series of manual tests that<br/>\nparalleled the junit coded tests and showing the results were the same.<br/>\n<br/>\nSo what I need is:<br/>\n<br/>\n    * Something to serve as requirements for junit    * Something to<br/>\nserve as the design document for junit    * unit tests of the things in<br/>\nthe design doc (should be just the unit tests from a build)    *<br/>\nintegration/acceptance tests (could be my manual re-run of some of our<br/>\nproject specific unit tests plus the tests that come with a<br/>\ndistribution)    * Some way to describe the traceability from the<br/>\nrequirements to the design, requirements to acceptance tests.  Doesn&#39;t<br/>\nneed to be an actual matrix, could be just a description of the mapping.<br/>\n<br/>\nWith enough work I could create this but I&#39;m looking for help picking<br/>\nthe best artifacts and approaches to minimize my work and so that it<br/>\ndoesn&#39;t need to be redone with each release of junit.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 17813, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1157469087", 
    "canDelete": false, 
    "nextInTopic": 17987, 
    "prevInTopic": 17787, 
    "headers": {
        "inReplyToHeader": "PDY4MEZBMzcwQTM2RDgzNDM5RTE3N0JEQzAyRjBFOEI1RkRFQjlDQG53NjAubmFwYS5maT4=", 
        "messageIdInHeader": "PGVkazQyditobWxoQGVHcm91cHMuY29tPg=="
    }
}