{
    "numMessagesInTopic": 287, 
    "nextInTime": 17830, 
    "senderId": "tfpPTexu6qKJ6ZkiPXnGrEQbi7gM1OCykJ5QK-FBwtZ7EYfc9JapQABfh4VLViEh7ANcHyE0BPFGsk5Wr-Zjyy7ZWCScxHNOMS0ApI-gl9nDvA", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Test-friendly, but not caller-friendly?", 
    "from": "Michael Feathers &lt;mfeathers@...&gt;", 
    "authorName": "Michael Feathers", 
    "msgSnippet": "... I d argue that by and large, Java has been very successful.  It provided enough hand holding to allow average programmers to deliver a wide array of good", 
    "msgId": 17829, 
    "profile": "mfeathers256", 
    "topicId": 17266, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 78021826, 
    "messageBody": "<div id=\"ygrps-yiv-794106386\">Elliotte Harold wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Michael Feathers wrote:<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n&gt;&gt;Frankly, I wouldn&#39;t want to have only #5 at the API level, but I think <br/>\n&gt;&gt;that this tendency we have to believe that we can not have an agreement <br/>\n&gt;&gt;with users that is not enforced by code leads to a great deal of <br/>\n&gt;&gt;trouble. Particularly in the area of visibility.. many developers assume <br/>\n&gt;&gt;that no written agreement can be sufficient if something is made <br/>\n&gt;&gt;public.  I think that the issue is that we are not used to thinking <br/>\n&gt;&gt;about agreements beyond the code and we&#39;re not used to holding people to <br/>\n&gt;&gt;them.<br/>\n&gt;&gt;    <br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;I&#39;d rephrase that a little. We have decades of experience with <br/>\n&gt;documenting software and APIs and trying to make decrees (not agreements <br/>\n&gt;as I&#39;ll explain in another post) about how it must be used. Experience <br/>\n&gt;has proven that this doesn&#39;t work well. Consider the issues with even a <br/>\n&gt;very well-known code base like Java with very well known and documented <br/>\n&gt;design principles. How many mucked up hashCode()-equals() <br/>\n&gt;implementations do we still encounter? Ten years ago, it was even worse. <br/>\n&gt;  And don&#39;t get me started on runtime vs. checked exceptions. Even major <br/>\n&gt;APIs pushed through the JCP still get this exactly backwards. You need <br/>\n&gt;documentation, certainly, but documentation alone is not sufficient for <br/>\n&gt;robust code.<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>I&#39;d argue that by and large, Java has been very successful.  It provided <br/>\nenough hand holding to allow average programmers to deliver a wide array <br/>\nof good applications. <br/>\n<br/>\nWhen they designed Java, they knew that they were targetting the middle <br/>\nof the road... they left out a slew of features which would have made <br/>\nlife easier for more advanced developers and they did it deliberately to <br/>\nmake the language more approachable.  Despite that, there are people who <br/>\nstill screw up and they screw up precisely because the language offers <br/>\nenough freedom to screw up.  On balance, that&#39;s okay because if it <br/>\ndidn&#39;t it would probably be far less functional than it is.<br/>\n<br/>\nA lot of the backlash that we are seeing against Java right now comes <br/>\nfrom the fact that many people are discovering that they can be more <br/>\nproductive without the hand holding, and they are willing to assume <br/>\nresponsibility to leave it behind.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;By contrast, things that we can enforce in code do seem to work pretty <br/>\n&gt;well. That we also have decades of experience telling us. Garbage <br/>\n&gt;collection improves on manual memory management. Checked exceptions get <br/>\n&gt;programmers to write a lot more error handling code than documentation <br/>\n&gt;ever did. (Not quite as much as they should, of course, but a lot more <br/>\n&gt;than they used to.) Automated unit tests (ideally run without programmer <br/>\n&gt;involvement on a continuous integration server) keep programmers from <br/>\n&gt;breaking the build. Having the source code repository either verify <br/>\n&gt;formatting  or reformat code before checking it in keeps badly formatted <br/>\n&gt;code from being checked into the source code repository.<br/>\n&gt;<br/>\n&gt;These aren&#39;t absolutes. They are matters of degree. But they are large <br/>\n&gt;matters of degree. We know these things. We&#39;ve learned them through <br/>\n&gt;experience. Rules we enforce in code and systems are far more likely to <br/>\n&gt;be followed than rules we merely document.<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>True, but it is a double edged sword.  It works when people don&#39;t need <br/>\nthe freedom to deal with exceptional cases, or when they do need the <br/>\nfreedom and have it.<br/>\n<br/>\nMichael Feathers<br/>\nwww.objectmentor.com</div>", 
    "prevInTime": 17828, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1157545783", 
    "canDelete": false, 
    "nextInTopic": 17830, 
    "prevInTopic": 17828, 
    "headers": {
        "inReplyToHeader": "PDQ0RkVCMkRBLjQwODAzMDBAbWV0YWxhYi51bmMuZWR1Pg==", 
        "messageIdInHeader": "PDQ0RkVCRjM3LjIwOTA4MDlAbWluZHNwcmluZy5jb20+", 
        "referencesHeader": "PEQ5M0IwNjVGLUYwMzctNDYyNS1BOTExLTMxRUVDQkVCMTc3OEBvYmplY3RtZW50b3IuY29tPiA8NDRGQUIwMUEuODAzMDYwM0BtZXRhbGFiLnVuYy5lZHU+IDw0NEZBRDRFOC42MDIwNTA1QGlsamFwcmV1c3MuZGU+IDw0NEZCMjMyQS43MDAwNzA1QG1ldGFsYWIudW5jLmVkdT4gPDQ0RkI4M0FBLjUwMjAyMDBAbWluZHNwcmluZy5jb20+IDw0NEZCRkZBQy4zMDIwMzA3QG1ldGFsYWIudW5jLmVkdT4gPDQ0RkMyRjgwLjYwNTA3MDBAbWluZHNwcmluZy5jb20+IDw0NEZFMUY4Ri42MDQwOTA3QHJvZ2Vycy5jb20+IDw0NEZFM0NFMC4yMDkwNDAyQG1pbmRzcHJpbmcuY29tPiA8NDRGRUIyREEuNDA4MDMwMEBtZXRhbGFiLnVuYy5lZHU+"
    }
}