{
    "numMessagesInTopic": 287, 
    "nextInTime": 17828, 
    "senderId": "BwODGAIl4qAhOLV9YMYX8G_1BqG4t6XWxnDnPUz8iHs-rfya2Zs9TnwA0N31crmL2gd0quLZD7KDYXodPm3BhM8arUSqhDDMe4OiMQoLV1M_gg", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Test-friendly, but not caller-friendly?", 
    "from": "Michael Feathers &lt;mfeathers@...&gt;", 
    "authorName": "Michael Feathers", 
    "msgSnippet": "... #1 is usually a bad choice, but there are narrow cases where it applies.  There are some systems that have to run continuously, and munging a bad request", 
    "msgId": 17827, 
    "profile": "mfeathers256", 
    "topicId": 17266, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 78021826, 
    "messageBody": "<div id=\"ygrps-yiv-3154738\">belugabrain wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;#1 doesn&#39;t help anybody, in the long-term.<br/>\n&gt;It doesn&#39;t inform the client that they messed up, but merely lulls <br/>\n&gt;them into a false sense of security that their code is fine.<br/>\n&gt;There&#39;s not often a sensible default to use - and if there was, it <br/>\n&gt;probably wouldn&#39;t be to the client&#39;s liking anyway.<br/>\n&gt;The best example I can think of for how meeting criteria #1 can <br/>\n&gt;backfire is the behaviour of Internet Explorer. Give it some HTML <br/>\n&gt;with a missing &lt;/td&gt; tag and it will silently provide one for you.<br/>\n&gt;All this has done is to relieve thousands of web developers from the <br/>\n&gt;responsibility of ensuring that they produce correct markup.<br/>\n&gt;It really is a case of treating the symptoms whilst allowing the <br/>\n&gt;disease to spread in an unchecked manner.<br/>\n&gt;#5 covers a vast majority of cases - as Michael points our, we deal <br/>\n&gt;with &#39;terms and conditions&#39; in so many other parts of our life, why <br/>\n&gt;not do so whlst carry out our chosen profession.<br/>\n&gt;<br/>\n&gt;Bob<br/>\n&gt;<br/>\n&gt;P.S. If we were to implement #1, surely it would be documented by #5?<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>#1 is usually a bad choice, but there are narrow cases where it <br/>\napplies.  There are some systems that have to run continuously, and <br/>\nmunging a bad request into an action is far better than doing nothing or <br/>\nstopping.  I agree through, that is bad in general.<br/>\n<br/>\nIE is an interesting case.  Microsoft could have taken a hard line, and <br/>\nyes we probably would have been better off, but I&#39;m guessing that the <br/>\nreason they developed tolerance for bad input was purely competitive.<br/>\n<br/>\nOn #5, I mentioned earlier that my preference is to give users of an API <br/>\na better experience.  I do think it&#39;s interesting, though, that this <br/>\nissue of whether an API should be permissive leads to discussions that <br/>\nparallel contemporary politics: should rules be enforced strictly?  <br/>\nShould people be accountable for their own actions?  If they aren&#39;t, <br/>\nwill it lead to bad behavior?<br/>\n<br/>\nLawrence Lessig wrote a while ago that code is law in a way, so I guess <br/>\nit makes sense that these issues come up.<br/>\n<br/>\n<br/>\nMichael Feathers<br/>\nwww.objectmentor.com</div>", 
    "prevInTime": 17826, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1157544830", 
    "canDelete": false, 
    "nextInTopic": 17828, 
    "prevInTopic": 17826, 
    "headers": {
        "inReplyToHeader": "PGVkbHZmditrdGNtQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDQ0RkVCQjdFLjYwMTA4MDdAbWluZHNwcmluZy5jb20+", 
        "referencesHeader": "PGVkbHZmditrdGNtQGVHcm91cHMuY29tPg=="
    }
}