{
    "numMessagesInTopic": 287, 
    "nextInTime": 17831, 
    "senderId": "YtEPd9WfSVmRV0kc_oSeZTl84dyJx89kdM5tG4CtlD-q1Zk5dccu4-agrG9RnJMy7YKMS5cTwEi01yKSx2021prh7garW93Amwy-NO-jq95n5Q", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Test-friendly, but not caller-friendly?", 
    "from": "Michael Feathers &lt;mfeathers@...&gt;", 
    "authorName": "Michael Feathers", 
    "msgSnippet": "... Well, there s the Eclipse process and that seems to be working.  If a new version of Eclipse comes out and your plugin breaks because you ignored the rules", 
    "msgId": 17830, 
    "profile": "mfeathers256", 
    "topicId": 17266, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 78021826, 
    "messageBody": "<div id=\"ygrps-yiv-1165397259\">Elliotte Harold wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Michael Feathers wrote:<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n&gt;&gt;Frankly, I wouldn&#39;t want to have only #5 at the API level, but I think <br/>\n&gt;&gt;that this tendency we have to believe that we can not have an agreement <br/>\n&gt;&gt;with users that is not enforced by code leads to a great deal of <br/>\n&gt;&gt;trouble. Particularly in the area of visibility.. many developers assume <br/>\n&gt;&gt;that no written agreement can be sufficient if something is made <br/>\n&gt;&gt;public.  I think that the issue is that we are not used to thinking <br/>\n&gt;&gt;about agreements beyond the code and we&#39;re not used to holding people to <br/>\n&gt;&gt;them.<br/>\n&gt;&gt;    <br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;An agreement might work. I&#39;ve never seen anyone try one. Instead what <br/>\n&gt;I&#39;ve seen is the developers issue pronouncements from on high about how <br/>\n&gt;users must use their software and APIs, and then be appalled when users <br/>\n&gt;ignore them. Actually sitting down and invoking the users in the design, <br/>\n&gt;and getting their explicit buy-in would be an interesting exercise. Hmm, <br/>\n&gt;you know I have seen that and I have even done that, but only with a <br/>\n&gt;small subset of the user base. For a project with a large user base, I <br/>\n&gt;don&#39;t think you could ever expect meaningful discussion and agreement <br/>\n&gt;with each individual user.<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>Well, there&#39;s the Eclipse process and that seems to be working.  If a <br/>\nnew version of Eclipse comes out and your plugin breaks because you <br/>\nignored the rules of engagement, it&#39;s your responsibility, and that <br/>\nhappens.  The thing that Eclipse did do, however, is build a community <br/>\nwith enough large successes to keep the project viable despite the <br/>\nsmaller failures.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Now I&#39;m not objecting to pronouncements, mind you. I&#39;m a very <br/>\n&gt;patriarchical designer in my own APIs, and I make lots of pronouncements <br/>\n&gt;from on high. However I don&#39;t delude myself that the users have somehow <br/>\n&gt;agreed to this. That&#39;s why I enforce the pronouncements in code.<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>And it&#39;s that sort of patriarchical design that I feel is pretty much <br/>\ninappropriate these days.  None of us are omniscient.  And, in fact, <br/>\nmany of of us didn&#39;t see that people might want to write tests for code <br/>\nthat uses our APIs eventually, for instance. <br/>\n<br/>\nI&#39;m sympathetic to patriarchical design because I know that it is fun.  <br/>\nDesign is all about constraints, and one of the cool things about <br/>\nsoftware is that in much of our work we don&#39;t have terribly tight <br/>\nconstraints on the form of our solutions.  If we did, the industry&#39;s <br/>\ncode might look better.  The cool thing about API design is that it is <br/>\nan area which offers or seems to offer tight constraints: &quot;you have to <br/>\nget the API exactly right the first time or else!&quot;  It&#39;s a rush when we <br/>\nget that all right, but I think it&#39;s important to distinguish between <br/>\nwhat a problem really requires and our desire to solve hard problems.<br/>\n<br/>\nMichael Feathers<br/>\nwww.objectmentor.com</div>", 
    "prevInTime": 17829, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1157546564", 
    "canDelete": false, 
    "nextInTopic": 17831, 
    "prevInTopic": 17829, 
    "headers": {
        "inReplyToHeader": "PDQ0RkVCNDVBLjMwNTAxMDVAbWV0YWxhYi51bmMuZWR1Pg==", 
        "messageIdInHeader": "PDQ0RkVDMjQ0LjIwMTAwMDRAbWluZHNwcmluZy5jb20+", 
        "referencesHeader": "PEQ5M0IwNjVGLUYwMzctNDYyNS1BOTExLTMxRUVDQkVCMTc3OEBvYmplY3RtZW50b3IuY29tPiA8NDRGQUIwMUEuODAzMDYwM0BtZXRhbGFiLnVuYy5lZHU+IDw0NEZBRDRFOC42MDIwNTA1QGlsamFwcmV1c3MuZGU+IDw0NEZCMjMyQS43MDAwNzA1QG1ldGFsYWIudW5jLmVkdT4gPDQ0RkI4M0FBLjUwMjAyMDBAbWluZHNwcmluZy5jb20+IDw0NEZCRkZBQy4zMDIwMzA3QG1ldGFsYWIudW5jLmVkdT4gPDQ0RkMyRjgwLjYwNTA3MDBAbWluZHNwcmluZy5jb20+IDw0NEZFMUY4Ri42MDQwOTA3QHJvZ2Vycy5jb20+IDw0NEZFM0NFMC4yMDkwNDAyQG1pbmRzcHJpbmcuY29tPiA8NDRGRUI0NUEuMzA1MDEwNUBtZXRhbGFiLnVuYy5lZHU+"
    }
}