{
    "numMessagesInTopic": 21, 
    "nextInTime": 17887, 
    "senderId": "8rKKBH_kztzuHV5sKCBx7V5og-DnI5eN7cbgryv6xIU9OQFDHw_ZgGqqQ5diu6kAd3Rrrbhxr2PAJf8Yy388yGPgUwDJF4Arl4WefhUBUr7w1bOh", 
    "systemMessage": false, 
    "subject": "Re: [junit] Testing a void method....", 
    "from": "&quot;Joakim Ohlrogge&quot; &lt;joakim.ohlrogge@...&gt;", 
    "authorName": "Joakim Ohlrogge", 
    "msgSnippet": "I see it a bit differently. If I am testing class A that uses a JDBC connection I test A with the assumption that the JDBC connection works.It is not the", 
    "msgId": 17886, 
    "profile": "j0hlrogge", 
    "topicId": 17653, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 261856052, 
    "messageBody": "<div id=\"ygrps-yiv-1616543394\">I see it a bit differently. If I am testing class A that uses a JDBC<br/>\nconnection I test A with the assumption that the JDBC connection<br/>\nworks.It is not the responsibility of my test for A to also verify<br/>\nJDBC. In my experience JDBC calls are not fast compared to mock calls<br/>\nbut all is relative.<br/>\nA bigger concern of mine is that a JDBC connection generally requires<br/>\nsomething in the other end. That something can be setup on my local<br/>\nmachine. In the projects I&#39;ve been in so far that something has a lot<br/>\nof legacy and you have to bring a lot of data to your local machine.<br/>\n<br/>\nThe other option is to have thats something on a remote machine that<br/>\nis maintained centrally. My concern there is that if that remote<br/>\nmachine is down or that central something is being worked on it may<br/>\ncause my tests to fail. Also there are all kinds of issues that *may*<br/>\noccur because someone else is testing at the same time and my tests<br/>\ndon&#39;t take that into consideration. (And I don&#39;t think it adds value<br/>\nto worry about that too in my tests)<br/>\n<br/>\nAlso, I have a silly rule of mine and that is that everything that<br/>\neverything required to run the tests should be checked in together<br/>\nwith the code and the unit tests. There should be no preconditions<br/>\nthat needs to be fulfilled before running the tests which excludes<br/>\nsetting up data or configuring acces to a DB. Running the tests must<br/>\nwork from within the IDE as well as from the build. This leaves us<br/>\nwith the option of having the tests setup and tear down it&#39;s own data<br/>\n(or the less pleasant option that I&#39;m overlooking something). To me<br/>\nthis is like juggling chain saws, possible, impressive but neither<br/>\nneccesary nor safe so I rather not do that.<br/>\n<br/>\nThere is a third option, I can setup a DB for testing with something<br/>\nlocal like hyper sonic or similar but then I&#39;m not testing against the<br/>\nreal thing so I won&#39;t catch any errors in the oracle drivers (if that<br/>\nis what the something is in production) so it adds little value<br/>\ncompared to mocking.<br/>\n<br/>\nSumming it up in *my* experience including DB calls in *unit* tests<br/>\ncauses enough grief to motivate the effort of mocking it. In my<br/>\nopinion mocking JDBC is also more trouble than it is worth so I hide<br/>\nthat behind some kind of service that I mock instead. That service<br/>\nneeds to be tested of course and that happens in the integration<br/>\ntests.<br/>\n<br/>\nI know that we are talking about a close method here but generally<br/>\nthere are other things to test aswell than just close .So for<br/>\nconsistency I keep JDBC out of my unit tests, even tests for close.<br/>\n<br/>\nI believe your milage varies.<br/>\nCheers!<br/>\n/J<br/>\n<br/>\nPS. I try very hard to keep the database away from me. It usually have<br/>\nvery little to do with what my code is doing, it is just were my data<br/>\nthat happens to be persistent happens to be. DS.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 8/29/06, Cédric Beust ♔ &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cbeust@...\">cbeust@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On 8/29/06, Michael Feathers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mfeathers@...\">mfeathers@...</a>&gt; wrote:<br/>\n&gt;  &gt;<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; &gt;It will probably make your unit tests smaller, but when the bug happens,<br/>\n&gt;  &gt; it<br/>\n&gt;  &gt; &gt;will take you longer to isolate it because only your acceptance tests<br/>\n&gt;  &gt; will<br/>\n&gt;  &gt; &gt;fail, and probably in mysterious ways (such as leaking connections).<br/>\n&gt;  &gt; &gt;<br/>\n&gt;  &gt; &gt;I prefer for my tests to catch bugs as soon as possible (especially in<br/>\n&gt;  &gt; this<br/>\n&gt;  &gt; &gt;case, where invoking close() will not make them that much slower).<br/>\n&gt;  &gt; &gt;<br/>\n&gt;  &gt; &gt;<br/>\n&gt;  &gt; &gt;<br/>\n&gt;  &gt; It&#39;s not like that, though. Really, if you make your UTs look like ATs,<br/>\n&gt;  &gt; i.e., they run all of these external subsystems, you&#39;ve just pushed the<br/>\n&gt;  &gt; issue of isolating the problem into the UTs. If you write your UTs<br/>\n&gt;  &gt; isolated, you have a binary chop. When your UTs pass and your ATs fail,<br/>\n&gt;  &gt; it helps you figure out where to look.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;  We&#39;re talking about a JDBC connection here, though.  Are you saying you<br/>\n&gt;  would write a battery of unit tests that all work on a fake JDBC<br/>\n&gt;  connection?  This seems like an abuse of mock objects for two reasons:<br/>\n&gt;<br/>\n&gt;  - JDBC queries can be very fast.<br/>\n&gt;     - It&#39;s not very hard nor costly to instantiate a JDBC connection, so<br/>\n&gt;     the use of mocks is ovekill, IMO.<br/>\n&gt;<br/>\n&gt;  If you have a class that does nothing but issues SQL queries, unit testing<br/>\n&gt;  it means making sure these queries work...<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;  --<br/>\n&gt;  Cédric<br/>\n&gt;  <a rel=\"nofollow\" target=\"_blank\" href=\"http://testng.org\">http://testng.org</a><br/>\n&gt;<br/>\n&gt;  [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 17885, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1157929218", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 17735, 
    "headers": {
        "inReplyToHeader": "PGI4NmI2YTljMDYwODI5MDcxMW0zZTA1M2Q0M3MxMjBlMDMxODM3NThhNTE2QG1haWwuZ29vZ2xlLmNvbT4=", 
        "messageIdInHeader": "PGI5ZWU1ZTQxMDYwOTEwMTYwMHAxYTNjNDc0ZHRlODZiOWRlZjE1MTgzYzc2QG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PEU5REU3OTYzRTVFQTY1NDZCNDJBOTc5RUMyOEI0RDAxMjkwREE4RjJAaG91LWV4LTAyLmFkcHJvZC5ibWMuY29tPgkgPDM3NWU4ZDg4MDYwODI3MDI0MGkzMDdiODNiZnM3NDI2MWI0Mjk0NzlhOWMwQG1haWwuZ21haWwuY29tPgkgPGI4NmI2YTljMDYwODI4MDcxN28yMjFjNDg2aTc2MDUzMjBkMGU3ODgyMjlAbWFpbC5nb29nbGUuY29tPgkgPDQ0RjM2NDM0LjQwNDAxMDRAYW5kcmV3bWNkb25hZ2guZjJzLmNvbT4JIDxiODZiNmE5YzA2MDgyODE0NTRuNmRkMWUxYjZxY2ZmM2RmMjEwM2ExYjEyMUBtYWlsLmdvb2dsZS5jb20+CSA8NDRGNDQ0QjAuNjA3MDAwNEBtaW5kc3ByaW5nLmNvbT4JIDxiODZiNmE5YzA2MDgyOTA3MTFtM2UwNTNkNDNzMTIwZTAzMTgzNzU4YTUxNkBtYWlsLmdvb2dsZS5jb20+"
    }
}