{
    "numMessagesInTopic": 44, 
    "nextInTime": 17963, 
    "senderId": "7gkjoVA36i9b-TXO3NnHWl0HIVrB8VCLSEYlaaBTgKsf_0HPpEVgi2Y3TZH6qFEv4aUJFbz1-CZcgy7gwjCGzDW4AZ-LyznqofFq0C1ck3bGTuRzmx16gJ-LtZP1UQHi4rc-NXk", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: JUnit 4.x and support for Java 1.4", 
    "from": "&quot;=?UTF-8?Q?C=C3=A9dric_Beust_=E2=99=94_?=&quot; &lt;cbeust@...&gt;", 
    "authorName": "Cédric Beust ♔", 
    "msgSnippet": "Hi Marvin, Interesting conversation! ... Annotations don t hinder your capacity to apply OO principles.  Actually, they give you more flexibility since you are", 
    "msgId": 17962, 
    "profile": "cbeust", 
    "topicId": 17902, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 199443513, 
    "messageBody": "<div id=\"ygrps-yiv-162075906\">Hi Marvin,<br/>\n<br/>\nInteresting conversation!<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 9/17/06, Marvin Toll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MarvinToll@...\">MarvinToll@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; In other words, I don&#39;t want to &quot;throw out&quot; an OOP inheritance<br/>\n&gt; solution just because it also includes notating a method with &quot;test&quot;.<br/>\n<br/>\n<br/>\nAnnotations don&#39;t hinder your capacity to apply OO principles.  Actually,<br/>\nthey give you more flexibility since you are now free to extend a class of<br/>\nyour choice, and also to name your methods any way you want.<br/>\n<br/>\n&gt; It is better in this case, because munging your method names sothat a tool<br/>\n&gt; &gt; can pick them off is clearly better addressed with annotations.<br/>\n&gt;<br/>\n&gt; MDT ---&gt; Cedric - I do (respectfully) disagree with you on this<br/>\n&gt; point.  The term &quot;optimization for code completion&quot; attempts to<br/>\n&gt; capture the notion that naming of Classes and Methods can be done in<br/>\n&gt; a manner that provides more (immediate) clarity within an IDE<br/>\n&gt; context.<br/>\n&gt;<br/>\n&gt; In an earlier post - you referred to it as adding &quot;adding metadata<br/>\n&gt; to that method&quot; name.  In addition to code completion, having all<br/>\n&gt; like method names begin with a prescribed verb is useful for sorting<br/>\n&gt; methods.<br/>\n<br/>\n<br/>\nI agree.  Code completion is one of the main reasons why I enforce strictly<br/>\nthe get/set convention throughout my code and everyone around me.<br/>\n<br/>\nYou are right that currently, code completion hasn&#39;t been extended to<br/>\nannotations, so the &quot;test&quot; prefix is more convenient.  I believe it&#39;s just a<br/>\nmatter of time before IDE&#39;s catch up on that level, though, and as a matter<br/>\nof fact, Eclipse has been supporting categories since<br/>\n3.2&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://download.eclipse.org/eclipse/downloads/drops/R-3.2-200606291905/new_noteworthy/eclipse-news-part2.html\">http://download.eclipse.org/eclipse/downloads/drops/R-3.2-200606291905/new_noteworthy/eclipse-news-part2.html</a>&gt;(JavaDoc<br/>\ntags you put on top of your methods, such as &quot;getter&quot; or &quot;setter&quot;,<br/>\nand which you can then specify in the outline view).<br/>\n<br/>\nAt any rate, just because you start using annotations doesn&#39;t mean you can&#39;t<br/>\nkeep starting your test method names with &quot;test&quot;.<br/>\n<br/>\n<br/>\n&gt; The strength of your conviction in this area is causing me to<br/>\n&gt; wonder.  Am I the only Java &quot;guy&quot; that finds benefit (on a fifteen<br/>\n&gt; developer project on two continents) in having a test method begin<br/>\n&gt; with he word &quot;test&quot; - or, a callback method begin with &quot;pre&quot;<br/>\n&gt; or &quot;post&quot; - or, a transparent persistence registration begin<br/>\n&gt; with &quot;register&quot;???<br/>\n<br/>\n<br/>\nNo, you&#39;re not.  Quite a few TestNG users keep using &quot;test&quot;, and that&#39;s<br/>\nfine.<br/>\n<br/>\nI&#39;m not trying to convince anyone to abandon this idea, but I do want to<br/>\nmake a few points regarding the adequacy of using annotations in the testing<br/>\narea, because I think they are a perfect tool for this job.<br/>\n<br/>\n&gt; Following your logic, shouldn&#39;t you rename testFoo() to ignoreFoo () then?<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; Sure.  Except for the fact that &quot;test&quot; is a long-term perscription<br/>\n&gt; and &quot;ignore&quot; is (presumably) transitory.  The nuances around which<br/>\n&gt; capability is appropriatly declared and which capability is<br/>\n&gt; appropriately inherited are more subtle than a verb study.<br/>\n&gt;<br/>\n&gt; In this case, &quot;ignore&quot; is a contextual assignment.  It might<br/>\n&gt; mean, &quot;ignore until I get this test method working&quot;.  Whereas &quot;test&quot;<br/>\n&gt; means &quot;always test&quot; unless declared otherwise.  &quot;Ignore&quot; is<br/>\n&gt; (conceptual) override of &quot;test&quot;.  They are not peers - so, a<br/>\n&gt; different stylistic implementation might be warranted.<br/>\n<br/>\n<br/>\nSince we&#39;re talking stylistic issues here, I would point out that @Ignore is<br/>\na very poor choice for this purpose, since it doesn&#39;t say much about &quot;ignore<br/>\nwhat?&quot;.  Or, in this case, &quot;ignored by what?&quot;.<br/>\n<br/>\nThe equivalent in TestNG is an attribute:  @Test(enabled = false), which<br/>\nmakes more sense in my opinion.  An even better choice is to put the method<br/>\nin an ignored group (@Test(groups = {&quot;ignored&quot;}) and then exclude that group<br/>\nfrom your runs.  The benefit of this approach is that the HTML reports list<br/>\nall the groups that have been included and excluded, so it&#39;s very easy to<br/>\nget a quick list of all the methods currently being ignored.<br/>\n<br/>\n-- <br/>\nCédric<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 17961, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1158529116", 
    "canDelete": false, 
    "nextInTopic": 17963, 
    "prevInTopic": 17961, 
    "headers": {
        "inReplyToHeader": "PGVlanRzYStrZXQ3QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGI4NmI2YTljMDYwOTE3MTQzOHMxYTcyZGNmdjdmYWM5Yjc4NjYwY2E2ODdAbWFpbC5nb29nbGUuY29tPg==", 
        "referencesHeader": "PGI4NmI2YTljMDYwOTE2MTkwNGszZjlmYmE5YWg2Njc5YWZhOTNhNGExN2NkQG1haWwuZ29vZ2xlLmNvbT4JIDxlZWp0c2Era2V0N0BlR3JvdXBzLmNvbT4="
    }
}