{
    "numMessagesInTopic": 1, 
    "nextInTime": 17972, 
    "senderId": "t2PyLvgLGZBxZzqC8YFD7ETThUHTJ0JdeXIXM501NL8UcoS5ukWx12Gybd8oPhIOBbUbCVYOs8BbPvwQ7wvcFM27bWJsqxBzOH0hD4kywA", 
    "systemMessage": false, 
    "subject": "XP Day Montreal - 5 days left to register: September 23, 2006 (final post)", 
    "from": "&quot;nkhanna_01&quot; &lt;niraj@...&gt;", 
    "authorName": "nkhanna_01", 
    "msgSnippet": "Hello everyone, Just a brief and friendly reminder that there are only 5 days left to register for XP Day Montreal taking place on September 23, 2006.  If you", 
    "msgId": 17971, 
    "profile": "nkhanna_01", 
    "topicId": 17971, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 231521593, 
    "messageBody": "<div id=\"ygrps-yiv-985808340\">Hello everyone,<br/>\n<br/>\nJust a brief and friendly reminder that there are only 5 days left to<br/>\nregister for XP Day Montreal taking place on September 23, 2006.  If<br/>\nyou would like to register for XP Day Montreal, please visit<br/>\nxpday[dot]info or read on below to read the original posting and find<br/>\nout more about the conference.<br/>\n<br/>\nDiaspar Software, ProjectSuccess, GreenPepper and Pyxis are proud to<br/>\npresent XP Day Montreal, a one-day extreme programming conference to<br/>\nbe held in Montreal, Quebec on September 23, 2006. If you are looking<br/>\nfor an opportunity to learn more about extreme programming without<br/>\nhaving to spend an entire week at a large international agile<br/>\nconference, XP Day Montreal fits the bill.  XP Day is a one-day event<br/>\nwith activities for anyone interested in extreme programming, whether<br/>\nyou&#39;re:<br/>\n<br/>\n* An executive wondering how to improve your software development<br/>\nteam&#39;s ROI.<br/>\n* A manager looking for ways to increase your team&#39;s effectiveness.<br/>\n* A skeptic, hoping to challenge some of the most experienced and<br/>\noutspoken XP practitioners.<br/>\n* A programmer itching to experience a real XP project room.<br/>\n* An experienced practitioner, hoping to exchange ideas or experiences<br/>\nwith other practitioners.<br/>\n<br/>\nFor those of you who missed out on Agile 2006, this would be an<br/>\nexcellent opportunity to meet, attend tutorial sessions and even work<br/>\nwith some of the XP community&#39;s most notable practitioners, for a<br/>\nfraction of the cost.<br/>\n<br/>\nXP Day events are interactive!<br/>\n- Tutorials<br/>\nWe are fortunate to have respected leaders of the XP community<br/>\nproviding world-class instruction and discussion on the fundamentals<br/>\nof XP.<br/>\n<br/>\n* Laurent Bossavit, keynote and recipient of the 2006 Gordon Pask<br/>\naward for contributions to the agile community. Laurent&#39;s keynote<br/>\naddress is entitled &quot;They do things differently there&quot; wherein we will<br/>\nspeak of cultural gaps, ways to bridge them, and why they are relevant<br/>\nto the software industry.<br/>\n<br/>\n* Michael Feathers will also provide a tutorial entitled &quot;API design<br/>\nas if testing mattered&quot; to show how API design can be adapted to make<br/>\nsoftware more testable.&quot;<br/>\n<br/>\n* J.B. Rainsberger, recipient of the 2005 Gordon Pask Award, will<br/>\nprovide an &quot;Introduction to XP&quot; tutorial.<br/>\n<br/>\n- Open Space<br/>\nYou can collaborate intensively with both local and invited advanced<br/>\npractitioners on issues that challenge you most. If the tutorials<br/>\ndon&#39;t cover it, you can work through your burning questions in Open<br/>\nSpace.  Check out our Open Space invitation at:<br/>\nmontreal2006[dot]xpday[dot]info/OpenSpaceInvitation[dot]pdf<br/>\n<br/>\n- Panel Discussion<br/>\nWe are pleased to offer a panel discussion entitled &quot;Your customer is<br/>\nmore important than you think&quot;. Laurent, Michael, JB, Francois<br/>\nBeauregard and Dave Rooney will discuss why an involved customer is<br/>\ncritical to the success of your software projects.<br/>\n<br/>\n- Project Room<br/>\nIf you&#39;re looking to dive in and immerse yourself in XP, join the XP<br/>\nProject Room, where you&#39;ll have the opportunity to work on project<br/>\nwith respected experts. Not sure what&#39;s going on? No problem! Join the<br/>\nproject any time and someone will bring you up to speed quickly, just<br/>\nlike on a real XP project!<br/>\n<br/>\n- Cost<br/>\nXP Day is only $249 CND + GST (6%). Our conference cost includes a<br/>\nmorning breakfast and a hot Indian buffet for lunch.  For those with<br/>\nmore domestic appetites, sandwiches will also be on hand. Coffee &<br/>\nSoft Drinks will also be available throughout the day.<br/>\n<br/>\nIf you&#39;re looking for more information or would like to register,<br/>\nvisit our website: xpday[dot]info.<br/>\n<br/>\nIf you have any questions with regards to this event, please don&#39;t<br/>\nhesitate to contact me at the email address listed above.<br/>\nHope to see you all there!<br/>\n<br/>\nNiraj Khanna<br/>\nXP Day Montreal.</div>", 
    "prevInTime": 17970, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1158593552", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGVlbWU2Zys5c3NvQGVHcm91cHMuY29tPg=="
    }
}