{
    "numMessagesInTopic": 10, 
    "nextInTime": 17988, 
    "senderId": "sxMMAvPPVkZMqUGKcKfXdv0XpUxhwBOSWpVJRSO4xM0TntLvsee6otvXgPyvZ4XddGFMZwQboqV1o6l_cRzxIw", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: how to show that junit works (validating junit)", 
    "from": "David Saff &lt;saff@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "... Sorry to come late to the party here.  How has this effort gone?  What strategy did you choose?  At the time, it occurred to me that in the time it would", 
    "msgId": 17987, 
    "profile": "dsaff", 
    "topicId": 17615, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 139771899, 
    "messageBody": "<div id=\"ygrps-yiv-1468972999\">mvogelbusedge wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m not saying I agree with the need to validate junit since it is very<br/>\n&gt; likely better tested than most software artifacts in existence.  <br/>\n&gt; However, if I could provide them with the things the QA folks and<br/>\n&gt; auditors are used to getting (requirements, traceability, test evidence)<br/>\n&gt; then their reluctance to let us use junit would go away.  Last project I<br/>\n&gt; got away with using junit by documenting a series of manual tests that<br/>\n&gt; paralleled the junit coded tests and showing the results were the same.<br/>\n&gt;<br/>\n&gt; So what I need is:<br/>\n&gt;<br/>\n&gt;     * Something to serve as requirements for junit    * Something to<br/>\n&gt; serve as the design document for junit    * unit tests of the things in<br/>\n&gt; the design doc (should be just the unit tests from a build)    *<br/>\n&gt; integration/acceptance tests (could be my manual re-run of some of our<br/>\n&gt; project specific unit tests plus the tests that come with a<br/>\n&gt; distribution)    * Some way to describe the traceability from the<br/>\n&gt; requirements to the design, requirements to acceptance tests.  Doesn&#39;t<br/>\n&gt; need to be an actual matrix, could be just a description of the mapping.<br/>\n&gt;<br/>\n&gt; With enough work I could create this but I&#39;m looking for help picking<br/>\n&gt; the best artifacts and approaches to minimize my work and so that it<br/>\n&gt; doesn&#39;t need to be redone with each release of junit.<br/>\n&gt;   <br/>\n<br/>\n </span></blockquote>Sorry to come late to the party here.  How has this effort gone?  What <br/>\nstrategy did you choose?  At the time, it occurred to me that in the <br/>\ntime it would take to generate the documentation you specified, you <br/>\ncould have a mutually-trusted developer inspect the entire applicable <br/>\nJUnit code base, but that might not be standard operating procedure.<br/>\n<br/>\n    David Saff</div>", 
    "prevInTime": 17986, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1158848501", 
    "canDelete": false, 
    "nextInTopic": 18005, 
    "prevInTopic": 17814, 
    "headers": {
        "inReplyToHeader": "PGVkazQyditobWxoQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDQ1MTI5RkY1LjUwMDA5MDhAbWl0LmVkdT4=", 
        "referencesHeader": "PGVkazQyditobWxoQGVHcm91cHMuY29tPg=="
    }
}