{
    "numMessagesInTopic": 18, 
    "nextInTime": 18063, 
    "senderId": "TlZc-lV9DSF0jJXSMSdUC6Lc8apoBZkgWOzveuMHNhnCM-l70_agybl9FHpLrjI_YaCt7UF7i5lAowF6E8Hu0omTn4M7gyBCcBpkZsBOgWIXxTDPrDs", 
    "systemMessage": false, 
    "subject": "Re: [junit] Do we need to convince management of the benefits of unit tests?", 
    "from": "&quot;Simon Chappell&quot; &lt;simonpeterchappell@...&gt;", 
    "authorName": "Simon Chappell", 
    "msgSnippet": "... Ideally, every developer would do that, but we all know that doesn t happen very often. *snip* ... I want to work where you work. You see, many large", 
    "msgId": 18062, 
    "rawEmail": "Return-Path: &lt;simonpeterchappell@...&gt;\r\nX-Sender: simonpeterchappell@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 61132 invoked from network); 4 Oct 2006 14:13:48 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m28.grp.scd.yahoo.com with QMQP; 4 Oct 2006 14:13:48 -0000\r\nReceived: from unknown (HELO wr-out-0506.google.com) (64.233.184.233)\n  by mta6.grp.scd.yahoo.com with SMTP; 4 Oct 2006 14:13:48 -0000\r\nReceived: by wr-out-0506.google.com with SMTP id 71so17781wri\n        for &lt;junit@yahoogroups.com&gt;; Wed, 04 Oct 2006 07:13:46 -0700 (PDT)\r\nReceived: by 10.90.83.14 with SMTP id g14mr162472agb;\n        Wed, 04 Oct 2006 07:13:46 -0700 (PDT)\r\nReceived: by 10.90.90.15 with HTTP; Wed, 4 Oct 2006 07:13:46 -0700 (PDT)\r\nMessage-ID: &lt;8ed733900610040713n1b0d4e37mcd63b624f8a789ca@...&gt;\r\nDate: Wed, 4 Oct 2006 09:13:46 -0500\r\nTo: junit@yahoogroups.com\r\nIn-Reply-To: &lt;b9ee5e410610040640t5bf7aabao36ff790296231fac@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nContent-Disposition: inline\r\nReferences: &lt;b9ee5e410610040055x1e072edfnac1dca90b71e7548@...&gt;\n\t &lt;4523A362.40908@...&gt;\n\t &lt;b9ee5e410610040640t5bf7aabao36ff790296231fac@...&gt;\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: &quot;Simon Chappell&quot; &lt;simonpeterchappell@...&gt;\r\nSubject: Re: [junit] Do we need to convince management of the benefits of unit tests?\r\nX-Yahoo-Group-Post: member; u=211142374; y=t7KRRbea0xT6d-rm5hO8qLY0s-WnTdcLIGrT1EoGT_to2Pj59A\r\nX-Yahoo-Profile: spchappell\r\n\r\nOn 10/4/06, Joakim Ohlrogge &lt;joakim.ohlrogge@...&gt; wrote:\n&gt; &gt;\n&gt; &gt;  &gt; We make so many descisions we don&#39;t ask permission for like &quot;is it ok to\n&gt; &gt;  &gt; remove this dead code?\n&gt; &gt;\n&gt; &gt;  You don&#39;t?! I see it all the time. More specifically, I see people\n&gt; &gt;  acting as though they do /not/ have permission to remove dead code. &quot;If\n&gt; &gt;  it ain&#39;t broke, don&#39;t fix it&quot; and &quot;Don&#39;t touch it; it might break&quot;\n&gt; &gt;\n&gt;\n&gt; If I think some code needs to be removed I remove it, if I think some\n&gt; code needs to be added I add it, if I think some code needs to be\n&gt; changed I change it. If I feel uncertain I ask someone for more\n&gt; information/dig for more information before I descide what to do.\n\nIdeally, every developer would do that, but we all know that doesn&#39;t\nhappen very often.\n\n*snip*\n&gt; &gt;  Anything that a project manager in particular might perceive as /extra/\n&gt; &gt;  time is different. That includes refactoring, testing (we have a whole\n&gt; &gt;  department for that), design meetings, and so on. Of course, it depends\n&gt; &gt;  on what activities that project manager participated in himself when he\n&gt; &gt;  wrote code.\n&gt;\n&gt; Yes, I&#39;m aware of that and talking about things is usually not\n&gt; preceived as extra time since talking is free and coding costs\n&gt; money... Writing documents also costs less money then coding right? :)\n&gt;\n&gt; In my experience people are less interested in /how/ you work as long\n&gt; as you deliver. Working stuff is in general more apreachiated than\n&gt; broken stuff (but that is unfortunately not always the case since\n&gt; fixing broken stuff in the last minute can make you a hero).\n\nI want to work where you work. You see, many large American\ncorporations have coding standards and technology standards and to\nviolate them is a fast track to being unemployed. (And, yes, I have\nreceived many such emails from management, reminding me of such\nthings. At my previous employer, we even had to sign paperwork once a\nyear saying that we understood the company guidelines.) I say all that\nto explain that most of us CAN&#39;T just do whatever we want. That&#39;s why\nsome places don&#39;t even have JUnit; their management hasn&#39;t approved it\nyet. It&#39;s also why so many on this list don&#39;t use JUnit 4.x, their\ncompanies haven&#39;t even approved Java 5 yet, so JUnit 4.x is out of the\nquestion.\n\n&gt; TDD is a way of delviering things, so what keeps an individual from\n&gt; doing it? I seldom see any eyebrows raised when developers write\n&gt; main(String[] args) methods to test their code and I never saw any of\n&gt; those developers ask management for permission to do that...\n\nYou don&#39;t need permission for main() methods, but you do need\npermission for JUnit.\n\n&gt; &gt;\n&gt; &gt;  &gt; I think, if you manage to convince your team /first/ then management is as\n&gt; &gt;  &gt; good as convinced when the results start showing.\n&gt; &gt;\n&gt; &gt;  ...but in the meantime, when the team goes through the chaos period,\n&gt; &gt;  management has plenty of time and opportunity to step and say, &quot;See? I\n&gt; &gt;  told you this stuff was extra effort. Why are you doing this? Stop\n&gt; &gt;  wasting our money.&quot;\n&gt; &gt;\n&gt;\n&gt; That is true. My idea was basically that by setting a good example it\n&gt; may rub off on others and that you can evolve gently into TDD without\n&gt; chaos... That contradicts my experience from reality but I want it to\n&gt; be true...\n\nAmen. It&#39;s a pleasant dream.\n\n&gt; &gt;  &gt; I think by example is the best way to go, start with your self and influence\n&gt; &gt;  &gt; those around you.\n&gt; &gt;  &gt;\n&gt; &gt;  &gt; /if/ you are convinced about the benefits of unittesting then /not/ doing\n&gt; &gt;  &gt; unittesting would be unprofessional since you choose not to do it.\n&gt; &gt;  &gt; So start doing it and infect the others. Don&#39;t have managment inject the\n&gt; &gt;  &gt; virus into an unwilling team by placing demands on testcoverage etc.\n&gt; &gt;  &gt; That will rebound in my experience.\n&gt; &gt;  &gt;\n&gt; &gt;  &gt; So, what do you think? Should we tell the story to our fellow developers\n&gt; &gt;  &gt; instead of management?\n&gt; &gt;\n&gt; &gt;  I don&#39;t understand why you would frame the question as &quot;instead of&quot;. Why\n&gt; &gt;  not &quot;in addition to&quot;? I think my manager deserve to know what I&#39;m doing.\n&gt;\n&gt; Good point, I wanted to shift the image. Maybe I should have said\n&gt; should we tell the story to the developers /and/ management I still\n&gt; think that the biggest challenge is convincing developers. If all\n&gt; developers showed conviction that TDD is the better way to go the\n&gt; descision would be easy for management. Generally it is not like that\n&gt; and management is faced with convincing their developers that TDD\n&gt; rocks /if/ they descide to go that way and implement TDD.\n\nI still maintain that the biggest problem is that &quot;you get what you\nreward&quot;. Management reward fast development, so they get fast\ndevelopment, together with all of the bugs and problems that accompany\nit. Support is a matter of throwing the code over the internal wall\nand letting a different group pull out their hair trying to keep it\nworking. Under this philosophy, anything that isn&#39;t writing shipping\ncode is waste. Tests don&#39;t ship, so they&#39;re waste. Let the suckers in\nsupport write tests if they think that&#39;ll help.\n\n&gt; I also think that management has a right to know what I am doing. In\n&gt; addition to that I am not sure that management is interested in every\n&gt; detail about how I&#39;m doing it as long as I deliver satisfactory\n&gt; results. When we set out on crusades to convince management on the\n&gt; benefits of TDD maybe we are making too big a deal out of it? Is there\n&gt; anyway we can start out small and evolve to where we want to go?\n\nDelivering good systems and explaining that they have tests does help.\n\n&gt; I was on a company when I was able to convince management to let me\n&gt; run a TDD-pilot. Since that went well demands on unittests for all\n&gt; projects followed shortly after. The request from the projects came\n&gt; backsoon after that on some metrics that would show that the demand\n&gt; had been met. The reply came after some time that 70% test coverage\n&gt; was the demand.\n&gt;\n&gt; Cool! too bad I didn&#39;t get that having unit-tests is pretty worthless\n&gt; if the authors don&#39;t know why they are writing them (if only reason\n&gt; developers are writing them is to reach the magic number of 70%\n&gt; testcoverage). Some homework remained to be done...\n&gt;\n&gt; Summary: I don&#39;t know whats best. Sure, convince management.don&#39;t hide\n&gt; stuff (that was not what I meant) but /don&#39;t forget to get your fellow\n&gt; developers on the train/. If they are on the train convincing\n&gt; management is easier. If they are not I don&#39;t know if you have a\n&gt; case...\n\nMost corporate developers have been beaten down by years of &quot;get &#39;r\ndone&quot; dive in and start coding pushes from management. Is it any\nwonder that they don&#39;t want anything to do with something that, at\nbest, will be viewed with suspicion by management?\n\nSorry for sounding cynical, but I&#39;ve worked at too many corporations\nand I&#39;ve seen too many Dilbertesque PHBs complaining about the time\ntaken for testing.\n\nSimon\n\n-- \nsimonpeter.org | simonpeter.com | techbook.info\n\n", 
    "profile": "spchappell", 
    "topicId": 18057, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 211142374, 
    "prevInTime": 18061, 
    "contentTrasformed": false, 
    "postDate": "1159971226", 
    "canDelete": false, 
    "nextInTopic": 18063, 
    "prevInTopic": 18061, 
    "headers": {
        "inReplyToHeader": "PGI5ZWU1ZTQxMDYxMDA0MDY0MHQ1YmY3YWFiYW8zNmZmNzkwMjk2MjMxZmFjQG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PDhlZDczMzkwMDYxMDA0MDcxM24xYjBkNGUzN21jZDYzYjYyNGY4YTc4OWNhQG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PGI5ZWU1ZTQxMDYxMDA0MDA1NXgxZTA3MmVkZm5hYzFkY2E5MGI3MWU3NTQ4QG1haWwuZ21haWwuY29tPgkgPDQ1MjNBMzYyLjQwOTA4QGdtYWlsLmNvbT4JIDxiOWVlNWU0MTA2MTAwNDA2NDB0NWJmN2FhYmFvMzZmZjc5MDI5NjIzMWZhY0BtYWlsLmdtYWlsLmNvbT4="
    }
}