{
    "numMessagesInTopic": 18, 
    "nextInTime": 18062, 
    "senderId": "O5-s3ZtZeSjNsaYRVEOIh-0D7BSjka8IrXtWqZPav3C4HSv3KHxv63RyNpRf1_I1xJcHU0fiiiBEKCDdSfDFshzC0jPhJCFqkC-4Teec15RQFEIl", 
    "systemMessage": false, 
    "subject": "Re: [junit] Do we need to convince management of the benefits of unit tests?", 
    "from": "&quot;Joakim Ohlrogge&quot; &lt;joakim.ohlrogge@...&gt;", 
    "authorName": "Joakim Ohlrogge", 
    "msgSnippet": "... If I think some code needs to be removed I remove it, if I think some code needs to be added I add it, if I think some code needs to be changed I change", 
    "msgId": 18061, 
    "rawEmail": "Return-Path: &lt;joakim.ohlrogge@...&gt;\r\nX-Sender: joakim.ohlrogge@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 53818 invoked from network); 4 Oct 2006 13:40:41 -0000\r\nReceived: from unknown (66.218.67.35)\n  by m34.grp.scd.yahoo.com with QMQP; 4 Oct 2006 13:40:41 -0000\r\nReceived: from unknown (HELO wx-out-0506.google.com) (66.249.82.239)\n  by mta9.grp.scd.yahoo.com with SMTP; 4 Oct 2006 13:40:41 -0000\r\nReceived: by wx-out-0506.google.com with SMTP id t10so202287wxc\n        for &lt;junit@yahoogroups.com&gt;; Wed, 04 Oct 2006 06:40:41 -0700 (PDT)\r\nReceived: by 10.90.54.20 with SMTP id c20mr108537aga;\n        Wed, 04 Oct 2006 06:40:41 -0700 (PDT)\r\nReceived: by 10.90.81.2 with HTTP; Wed, 4 Oct 2006 06:40:40 -0700 (PDT)\r\nMessage-ID: &lt;b9ee5e410610040640t5bf7aabao36ff790296231fac@...&gt;\r\nDate: Wed, 4 Oct 2006 15:40:40 +0200\r\nTo: junit@yahoogroups.com\r\nIn-Reply-To: &lt;4523A362.40908@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nContent-Disposition: inline\r\nReferences: &lt;b9ee5e410610040055x1e072edfnac1dca90b71e7548@...&gt;\n\t &lt;4523A362.40908@...&gt;\r\nX-Google-Sender-Auth: fe2821f1c35127a9\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nX-eGroups-From: &quot;Joakim Ohlrogge&quot; &lt;joakim.ohlrogge@...&gt;\r\nFrom: &quot;Joakim Ohlrogge&quot; &lt;joakim.ohlrogge@...&gt;\r\nReply-To: joakim.ohlrogge@...\r\nSubject: Re: [junit] Do we need to convince management of the benefits of unit tests?\r\nX-Yahoo-Group-Post: member; u=261856052; y=8q6iuPuQeKKVmAf8dun9cqUssQXA3cQSEGImXNhpEqAp7XHD\r\nX-Yahoo-Profile: j0hlrogge\r\n\r\n&gt;\n&gt;  &gt; We make so many descisions we don&#39;t ask permission for like &quot;is it ok to\n&gt;  &gt; remove this dead code?\n&gt;\n&gt;  You don&#39;t?! I see it all the time. More specifically, I see people\n&gt;  acting as though they do /not/ have permission to remove dead code. &quot;If\n&gt;  it ain&#39;t broke, don&#39;t fix it&quot; and &quot;Don&#39;t touch it; it might break&quot;\n&gt;\n\nIf I think some code needs to be removed I remove it, if I think some\ncode needs to be added I add it, if I think some code needs to be\nchanged I change it. If I feel uncertain I ask someone for more\ninformation/dig for more information before I descide what to do.\n\nOf course it is easier to be certain if there are tests to verify that\nstuff works after I&#39;m done. In some systems I just don&#39;t know that the\ncode is dead... having permission to remove it doesn&#39;t make me more\ncertain so I tend to look for information rather than permission. Also\nif I get permission to do something it will still be my fault if I&#39;m\nwrong since permission is IME granted based on the infomration\npresented /only/... tough one... no wonder dead code tends to stay in\nsystems...\n\n&gt;  , can I use a factory here?,\n&gt;  &gt; can I draw a UML-diagram on the whiteboard?, can I save it in\n&gt;  &gt; documentation?, can I call a designmeeting?&quot; so why is unit-testing\n&gt;  &gt; different?\n&gt;\n&gt;  Anything that a project manager in particular might perceive as /extra/\n&gt;  time is different. That includes refactoring, testing (we have a whole\n&gt;  department for that), design meetings, and so on. Of course, it depends\n&gt;  on what activities that project manager participated in himself when he\n&gt;  wrote code.\n\nYes, I&#39;m aware of that and talking about things is usually not\npreceived as extra time since talking is free and coding costs\nmoney... Writing documents also costs less money then coding right? :)\n\nIn my experience people are less interested in /how/ you work as long\nas you deliver. Working stuff is in general more apreachiated than\nbroken stuff (but that is unfortunately not always the case since\nfixing broken stuff in the last minute can make you a hero).\n\nTDD is a way of delviering things, so what keeps an individual from\ndoing it? I seldom see any eyebrows raised when developers write\nmain(String[] args) methods to test their code and I never saw any of\nthose developers ask management for permission to do that...\n\n&gt;\n&gt;  &gt; I think, if you manage to convince your team /first/ then management is as\n&gt;  &gt; good as convinced when the results start showing.\n&gt;\n&gt;  ...but in the meantime, when the team goes through the chaos period,\n&gt;  management has plenty of time and opportunity to step and say, &quot;See? I\n&gt;  told you this stuff was extra effort. Why are you doing this? Stop\n&gt;  wasting our money.&quot;\n&gt;\n\nThat is true. My idea was basically that by setting a good example it\nmay rub off on others and that you can evolve gently into TDD without\nchaos... That contradicts my experience from reality but I want it to\nbe true...\n\n&gt;  &gt; I think by example is the best way to go, start with your self and influence\n&gt;  &gt; those around you.\n&gt;  &gt;\n&gt;  &gt; /if/ you are convinced about the benefits of unittesting then /not/ doing\n&gt;  &gt; unittesting would be unprofessional since you choose not to do it.\n&gt;  &gt; So start doing it and infect the others. Don&#39;t have managment inject the\n&gt;  &gt; virus into an unwilling team by placing demands on testcoverage etc.\n&gt;  &gt; That will rebound in my experience.\n&gt;  &gt;\n&gt;  &gt; So, what do you think? Should we tell the story to our fellow developers\n&gt;  &gt; instead of management?\n&gt;\n&gt;  I don&#39;t understand why you would frame the question as &quot;instead of&quot;. Why\n&gt;  not &quot;in addition to&quot;? I think my manager deserve to know what I&#39;m doing.\n\nGood point, I wanted to shift the image. Maybe I should have said\nshould we tell the story to the developers /and/ management I still\nthink that the biggest challenge is convincing developers. If all\ndevelopers showed conviction that TDD is the better way to go the\ndescision would be easy for management. Generally it is not like that\nand management is faced with convincing their developers that TDD\nrocks /if/ they descide to go that way and implement TDD.\n\nI also think that management has a right to know what I am doing. In\naddition to that I am not sure that management is interested in every\ndetail about how I&#39;m doing it as long as I deliver satisfactory\nresults. When we set out on crusades to convince management on the\nbenefits of TDD maybe we are making too big a deal out of it? Is there\nanyway we can start out small and evolve to where we want to go?\n\nI was on a company when I was able to convince management to let me\nrun a TDD-pilot. Since that went well demands on unittests for all\nprojects followed shortly after. The request from the projects came\nbacksoon after that on some metrics that would show that the demand\nhad been met. The reply came after some time that 70% test coverage\nwas the demand.\n\nCool! too bad I didn&#39;t get that having unit-tests is pretty worthless\nif the authors don&#39;t know why they are writing them (if only reason\ndevelopers are writing them is to reach the magic number of 70%\ntestcoverage). Some homework remained to be done...\n\nSummary: I don&#39;t know whats best. Sure, convince management.don&#39;t hide\nstuff (that was not what I meant) but /don&#39;t forget to get your fellow\ndevelopers on the train/. If they are on the train convincing\nmanagement is easier. If they are not I don&#39;t know if you have a\ncase...\n\n", 
    "profile": "j0hlrogge", 
    "topicId": 18057, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 261856052, 
    "prevInTime": 18060, 
    "contentTrasformed": false, 
    "postDate": "1159969240", 
    "canDelete": false, 
    "nextInTopic": 18062, 
    "prevInTopic": 18058, 
    "headers": {
        "inReplyToHeader": "PDQ1MjNBMzYyLjQwOTA4QGdtYWlsLmNvbT4=", 
        "messageIdInHeader": "PGI5ZWU1ZTQxMDYxMDA0MDY0MHQ1YmY3YWFiYW8zNmZmNzkwMjk2MjMxZmFjQG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PGI5ZWU1ZTQxMDYxMDA0MDA1NXgxZTA3MmVkZm5hYzFkY2E5MGI3MWU3NTQ4QG1haWwuZ21haWwuY29tPgkgPDQ1MjNBMzYyLjQwOTA4QGdtYWlsLmNvbT4="
    }
}