{
    "numMessagesInTopic": 14, 
    "nextInTime": 1811, 
    "senderId": "BO-FdFGO0kZdA1XEuCFEeJlvAT89Rerr6ZuM5f_j-cx1qY_Mn__2lR9rJk1gjkYVTiSOr8CNhdQUmotplpOF9xn4zUaJ49AuZwTPy9U8K7WDkg", 
    "systemMessage": false, 
    "subject": "Re: [junit] Including test cases with production code", 
    "from": "Vladimir Bossicard &lt;vladimir@...&gt;", 
    "authorName": "Vladimir Bossicard", 
    "msgSnippet": "... I won t give the test cases to provide a documentation to a Java API (for non open source projects) for several reasons: For you: - as a professional and", 
    "msgId": 1810, 
    "topicId": 1791, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-54788440\"><blockquote><span title=\"ireply\">&gt; I&#39;m specifically referring to products where the source code is part and <br/>\n&gt; parcel of the product or the product provides a Java API.<br/>\n<br/>\n </span></blockquote>I won&#39;t give the test cases to provide a documentation to a Java API (for non open source projects) for several reasons:<br/>\n<br/>\nFor you:<br/>\n- as a professional and for your image you want certainly to maintain your test code in sync with the latest version of JUnit -&gt; increases the work for an already tested production code (or would you ship test code only runnable with JUnit 3.2 ?)<br/>\n- the test code is generally not so well written (comments...)  But you are maybe an exception, but I&#39;m not :-)<br/>\n- you don&#39;t handle exceptions and errors in your test cases like you should treat them in a real application<br/>\n<br/>\nFor the customer:<br/>\n- if JUnit is not provided, he has to install the _right_ version if he wants to run the tests<br/>\n- what if the customer doesn&#39;t know JUnit at all?  Will he understand the test cases, asserts, test suites (...) concepts immediatly?<br/>\n- what if the customer installs JUnit, runs your tests and get a &quot;ClassCastException&quot; because he didn&#39;t overwrite the excluded.properties file?<br/>\n- and so on...<br/>\n<br/>\nInstead of test cases, I would simply write a client application that uses the product&#39;s API.  It&#39;s the best proof that the API can be used in a real application.  The customer can start from this example to make his own application.  Everybody did that, isn&#39;t it?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; their storage and bandwidth penalties.<br/>\n<br/>\n </span></blockquote>It&#39;s not a storage or bandwidth problem.  It&#39;s about how you want to communicate with your customers.<br/>\n<br/>\nI just wonder : JUnit comes only with its own test code to &quot;document and validate the use of the product&quot;...<br/>\n<br/>\n-Vladimir</div>", 
    "prevInTime": 1809, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "994448953", 
    "canDelete": false, 
    "nextInTopic": 1812, 
    "prevInTopic": 1808, 
    "headers": {
        "messageIdInHeader": "PDIwMDEwNzA2MTk0OTEzLjI0MDUwLmNwbXRhQGMwMDcuc252LmNwLm5ldD4="
    }
}