{
    "topicId": 1791, 
    "postDate": "994459052", 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "from": "Mike Clark &lt;mike@...&gt;", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "6FNJvKOnZhOTzGAn3JMo1VE5pwoHpBm1LGGx54AgvXEHzQDuVnC52H4E-I4Cshe80PTxRYdgr1cmrnKoFy5MFzINnxG_KA", 
    "nextInTime": 1813, 
    "userId": 0, 
    "prevInTime": 1811, 
    "prevInTopic": 1810, 
    "headers": {
        "messageIdInHeader": "PDNCNDYzREFDLjYwOTA0MDdAY2xhcmt3YXJlLmNvbT4=", 
        "referencesHeader": "PDIwMDEwNzA2MTk0OTEzLjI0MDUwLmNwbXRhQGMwMDcuc252LmNwLm5ldD4="
    }, 
    "authorName": "Mike Clark", 
    "numMessagesInTopic": 14, 
    "msgSnippet": "... I d rather my professional image reflect that I deliver working software that s demonstrable with a suite of tests. Another option to the versioning issue", 
    "contentTrasformed": false, 
    "msgId": 1812, 
    "nextInTopic": 1828, 
    "systemMessage": false, 
    "rawEmail": "Return-Path: &lt;mike@...&gt;\r\nX-Sender: mike@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-7_2_0); 6 Jul 2001 22:36:43 -0000\r\nReceived: (qmail 25564 invoked from network); 6 Jul 2001 22:36:42 -0000\r\nReceived: from unknown (10.1.10.142) by l10.egroups.com with QMQP; 6 Jul 2001 22:36:42 -0000\r\nReceived: from unknown (HELO chicken.mail.pas.earthlink.net) (207.217.120.114) by mta3 with SMTP; 6 Jul 2001 22:36:37 -0000\r\nReceived: from clarkware.com (dialup-209.245.6.121.Dial1.Denver1.Level3.net [209.245.6.121]) by chicken.mail.pas.earthlink.net (8.9.3/8.9.3) with ESMTP id PAA29689 for &lt;junit@yahoogroups.com&gt;; Fri, 6 Jul 2001 15:36:36 -0700 (PDT)\r\nMessage-ID: &lt;3B463DAC.6090407@...&gt;\r\nDate: Fri, 06 Jul 2001 16:37:32 -0600\r\nOrganization: Clarkware Consulting\r\nUser-Agent: Mozilla/5.0 (Windows; U; WinNT4.0; en-US; rv:0.9.1) Gecko/20010607 Netscape6/6.1b1\r\nX-Accept-Language: en-us\r\nMIME-Version: 1.0\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] Including test cases with production code\r\nReferences: &lt;20010706194913.24050.cpmta@...&gt;\r\nContent-Type: text/plain; charset=us-ascii; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nFrom: Mike Clark &lt;mike@...&gt;\r\n\r\nVladimir Bossicard wrote:\n\n&gt; \n&gt; I won&#39;t give the test cases to provide a documentation to a Java API (for non open source projects) for several reasons:\n&gt; \n\n&gt; For you:\n&gt; - as a professional and for your image you want certainly to maintain your test code in sync with the latest version of JUnit -&gt; increases the work for an already tested production code (or would you ship test code only runnable with JUnit 3.2 ?)\n\n\nI&#39;d rather my professional image reflect that I deliver working software \nthat&#39;s demonstrable with a suite of tests.\n\nAnother option to the versioning issue is to distribute a baselined \nversion of junit.jar.\n\n&gt; - the test code is generally not so well written (comments...)  But you are maybe an exception, but I&#39;m not :-)\n\n\nReally?  If anything I&#39;d think that the tests should be more well \nwritten, not just for the customer, but for the product team evolving \nthe software.  The tests document the intended use of the API, and good \ntests will tell you much more about the software than studying the API \nout of context.\n\n\n&gt; - you don&#39;t handle exceptions and errors in your test cases like you should treat them in a real application\n&gt; \n\n\nActually, testing for expected exceptions may provide better \ndocumentation as to what action should be taken when the software is \nintegrated into a real application.  In other words, by providing a test \nmethod that enumerates and tests for possible exceptions raised by the \nAPI you are effectively documenting the exception handling.\n\n\n&gt; For the customer:\n&gt; - if JUnit is not provided, he has to install the _right_ version if he wants to run the tests\n\n\nAgreed, although there are options for distributing JUnit.  Also, as \nJUnit becomes more pervasive, I think this becomes moot.\n\n\n&gt; - what if the customer doesn&#39;t know JUnit at all?  Will he understand the test cases, asserts, test suites (...) concepts immediatly?\n\n\nThis is certainly a valid point.  However, one could argue that learning \nJUnit is easier than learning the structure of vendor-specific examples.\n\n&gt; - what if the customer installs JUnit, runs your tests and get a &quot;ClassCastException&quot; because he didn&#39;t overwrite the excluded.properties file?\n&gt; - and so on...\n&gt; \n\n\nOK, there may be general installation issues that we can&#39;t predict, but \nwe can document common problems.\n\n&gt; Instead of test cases, I would simply write a client application that uses the product&#39;s API.  It&#39;s the best proof that the API can be used in a real application.  The customer can start from this example to make his own application.  Everybody did that, isn&#39;t it?\n&gt; \n\n\nIndeed, this is the common approach.  I&#39;m simply suggesting that JUnit \ntests may be more beneficial in their ability to automatically check \nresults and their well-defined structure and composability.  I&#39;ve often \nrun example client applications that did something (at least I assumed \nso by all the console messages), but I&#39;m not quite sure if it was correct.\n\n \n&gt;&gt;their storage and bandwidth penalties.\n&gt;&gt;\n&gt; \n&gt; It&#39;s not a storage or bandwidth problem.  It&#39;s about how you want to communicate with your customers.\n&gt; \n\n\nI want to communicate to my customers that what I&#39;ve delivered to them \nworks, that there are measures in place to verify that it continues to \nwork, and that they can learn how to communicate with it using concrete \nexamples.  Unit tests seem to be the most effective way to achieve this.\n\nMike\n\n-- \nMike Clark\nClarkware Consulting, Inc.\nCustom Software Architecture, Design,\nDevelopment, and Performance Consulting\nhttp://www.clarkware.com\n\n\n", 
    "subject": "Re: [junit] Including test cases with production code"
}