{
    "numMessagesInTopic": 10, 
    "nextInTime": 18192, 
    "senderId": "eKHtYz8wcw09M66ajoM7PRIEPLEvYfxIRNKgxbRlVGa5enRycR7qDTjN0fCuqGWhU5zLN5QnsPL6", 
    "systemMessage": false, 
    "subject": "Re: [junit] Behavior of optional string messages for assert methods?", 
    "from": "didoss@...", 
    "authorName": "didoss@comcast.net", 
    "msgSnippet": "What, exactly, does your assert look like your test? It sounds like you have used the signature that expects a string and the assertion argument(s), instead of", 
    "msgId": 18191, 
    "profile": "ddoss_2006", 
    "topicId": 18190, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 180862158, 
    "messageBody": "<div id=\"ygrps-yiv-1565534973\">What, exactly, does your assert look like your test?<br/>\n<br/>\nIt sounds like you have used the signature that expects a string and the assertion argument(s), instead of using the one with just the assertion argument(s),...though I&#39;ve never tried it, to see if I get the results you are seeing, and I&#39;ve never seen the results you are seeing to know of another reason why you would get it.<br/>\n<br/>\nPlease paste your assertion, so that we can help you further.<br/>\n<br/>\n<br/>\nthanks,<br/>\nDianne<br/>\n<br/>\n-------------- Original message -------------- <br/>\nFrom: &quot;yogamatt1970&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yogamatt1970@...\">yogamatt1970@...</a>&gt; <br/>\nOK, apologies in advance if this has been asked before - I searched<br/>\naround the forum here and could not find an answer to my question:<br/>\n<br/>\nI&#39;ve noticed that if I don&#39;t supply the optional string argument to<br/>\nmany (perhaps all) of Junit&#39;s assert methods, I get an error message<br/>\nthat looks like this:<br/>\n[junit] null<br/>\n[junit] junit.framework.AssertionFailedError<br/>\n<br/>\nI find this to be confusing. However, if I include the optional<br/>\nstring argument, then that message is displayed in the output.<br/>\nI have a very high opinion of the Junit framework and find it hard to<br/>\nbelieve that the null message is standard behavior. It feels so<br/>\nclunky, almost as if Junit does not check to see if the optional<br/>\nargument was passed or not. My guess is that there&#39;s a property<br/>\nsomewhere which allows me disable the null error but I can&#39;t find it.<br/>\nMy other option is to just add a string argument to all of the<br/>\nasserts in all of my unit tests (at this point, not that many although<br/>\nit would still be a pain and would probably take me at least a few hours).<br/>\nAny and all help is appreciated.<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 18190, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1161621305", 
    "canDelete": false, 
    "nextInTopic": 18195, 
    "prevInTopic": 18190, 
    "headers": {
        "messageIdInHeader": "PDEwMjMyMDA2MTYzNS4xNTI4OC40NTNDRUYzOTAwMDU4MkM5MDAwMDNCQjgyMjA2ODI0NjkzOUM5QzAxMEIwNzBCQGNvbWNhc3QubmV0Pg=="
    }
}