{
    "numMessagesInTopic": 2, 
    "nextInTime": 18219, 
    "senderId": "s6y_iOXOyMO5FxwD0srswyE-QiBSjC0x1nR9S_UqMQGTGqwwoY5P65p6MJ-VyKVnQuNaCtdgubnvUQ", 
    "systemMessage": false, 
    "subject": "Junit 4.1 and Anthill", 
    "from": "mmikedm1000@...", 
    "authorName": "mmikedm1000@aol.com", 
    "msgSnippet": "Hi, My question pertains to using the annotation based unit tests and test suites with Anthill. I am using Eclipse 3.2, Java 1.5, Junit 4.1, Ant 1.6.5, and", 
    "msgId": 18218, 
    "profile": "mitchellmichaeldavid", 
    "topicId": 18218, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 287123883, 
    "messageBody": "<div id=\"ygrps-yiv-57201659\">Hi,<br/>\n <br/>\n My question pertains to using the annotation based unit tests and test suites with Anthill.<br/>\n <br/>\n I am using Eclipse 3.2, Java 1.5, Junit 4.1, Ant 1.6.5, and Anthill. Currently I have many junit tests and test suites written in the Junit 3.8. These run fine in all environments. What I would like to do is use the Junit 4.1 annotation based testing and test suites. I have created several test classes and a test suite to run the test classes. Eclipse will run the annotation based Junit 4.1 test suite without error. When I try to run the new test suite on Anthill, they tests run correctly but the test names all appear as &#39;Unknown&#39;. I am at a loss to why.<br/>\n <br/>\n I have search Junit&#39;s and Anthill&#39;s documentation to no avail. Also I have initiated numerous searches on goggle, but I have not found anyone with a similar problem.<br/>\n <br/>\n Does anyone have any suggestions?<br/>\n <br/>\n Thanks, -Michael- <br/>\n________________________________________________________________________<br/>\nCheck out the new AOL.  Most comprehensive set of free safety and security tools, free access to millions of high-quality videos from across the web, free AOL Mail and more.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 18216, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1161793979", 
    "canDelete": false, 
    "nextInTopic": 18235, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDhDOEM2NkE1RTIyNTYxOC01QTAtNkJCQFdFQk1BSUwtREMyMS5zeXNvcHMuYW9sLmNvbT4="
    }
}