{
    "numMessagesInTopic": 45, 
    "nextInTime": 18226, 
    "senderId": "XXwwKo29ZfBZeMDMBjzOVf3DvRMlsn11cAYaM8wwv697C03mfULMh2H_o_TxXneUpE6glLlF0vW1qKYp50rSeBwCNH8epIpwQFUzYiZ8", 
    "systemMessage": true, 
    "subject": "Re: Can anyone help me see how to usefully work with JUnit in a big project, please?", 
    "from": "&quot;Tracey Annison&quot; &lt;TAnnison@...&gt;", 
    "authorName": "Tracey Annison", 
    "msgSnippet": "Just FYI for the people on this list, I also recieved another helpful reply by direct email from a list member. Assuming a wish for privacy, I won t list the", 
    "msgId": 18225, 
    "profile": "traceyannison", 
    "topicId": 18213, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 132563212, 
    "messageBody": "<div id=\"ygrps-yiv-1059444408\">Just FYI for the people on this list, I also recieved another helpful <br/>\nreply by direct email from a list member. <br/>\n<br/>\n<br/>\nAssuming a wish for privacy, I won&#39;t list the person&#39;s name, but <br/>\ntheir reply follows : <br/>\n================================================================= <br/>\nI don&#39;t think you are necessarily missing something. <br/>\n<br/>\nMy interpretation of your problem is that you&#39;re abusing unit testing <br/>\nwhile you should be doing less unit testing and more functional <br/>\ntesting. <br/>\n<br/>\nReduce the number of mocks, start working with your real objects.  <br/>\nThis should decrease the test code considerably and reduce the <br/>\npotential for errors (maintaining mock hierarchies can be very <br/>\nexpensive).  I usually recommend to *not* use mocks until you <br/>\nactually hit a barrier ( e.g. your tests take way too long).  Even <br/>\nso, tests that take a long time to run are okay in my book if what <br/>\nyou are testing actually takes a long time. <br/>\n<br/>\nAlso, have you taken a look at TestNG? ( http://testng.org) <br/>\n<br/>\nIt&#39;s more geared to functional testing than JUnit is and it might cut <br/>\ndown on your code as well, thanks to features such as DataProviders <br/>\n(data-driven testing) and dependent methods... <br/>\n<br/>\nLet me know if you have any questions. <br/>\n================================================================= <br/>\n<br/>\n<br/>\nI replied like this : <br/>\n================================================================= <br/>\nYou make some interesting points - maybe the idea of less unit <br/>\ntesting and more functional testing is it... I can see the point of <br/>\nunit testing, but it does seem to be an awful lot of work for not <br/>\nmuch return. <br/>\n<br/>\nI know what you mean about the mocks, but in order to make some of <br/>\nour objects, you need to have a pile of other objects, and other <br/>\nobjects to make those, and so on, and it kind of piles up! <br/>\nAlso, isn&#39;t the point of the tests mainly to assert what methods are <br/>\ncalled on what other objects, which you can only do with mocks? <br/>\nAnd how could I test the result of those objects misbehaving, ie that <br/>\nthe exception I expect is thrown from the service when the DAO fails <br/>\nto write and throws an exception? That&#39;s not something I could make <br/>\nhappen with a mock. And actually, I don&#39;t suppose I should try, or <br/>\nit&#39;ll go & try to write to a database, won&#39;t it? <br/>\nOr have I misunderstood or been misled here? <br/>\n<br/>\nI haven&#39;t heard of TestNG - I&#39;ll take a peek... <br/>\n================================================================= <br/>\n<br/>\nMaybe this is also helpful to someone else out there, or at least <br/>\nmildly interesting! :) <br/>\n<br/>\nCheers, <br/>\nTracey</div>", 
    "prevInTime": 18224, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1161867180", 
    "canDelete": false, 
    "nextInTopic": 18230, 
    "prevInTopic": 18223, 
    "headers": {
        "inReplyToHeader": "PGVobmRhdCtxM2NjQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGVocWIzYytoYjNwQGVHcm91cHMuY29tPg=="
    }
}