{
    "numMessagesInTopic": 45, 
    "nextInTime": 18221, 
    "senderId": "WhtBf9yg-Zi2im5ieoHIEjrMaIvyMYRkNMPCNvDaG_XQ_kXFa0qw3PD28NXcGG0ccWHS5yOOytugKKyjYmJvYSU2zuuuPezPJZfTanYL", 
    "systemMessage": true, 
    "subject": "Re: Can anyone help me see how to usefully work with JUnit in a big project, please?", 
    "from": "&quot;Tracey Annison&quot; &lt;TAnnison@...&gt;", 
    "authorName": "Tracey Annison", 
    "msgSnippet": "Hiya, Chris Thank you very much for your reply. I don t mind a bit that you ve selectively replied - any help is most welcome! Get/Set tests are a pain, but I", 
    "msgId": 18220, 
    "profile": "traceyannison", 
    "topicId": 18213, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 132563212, 
    "messageBody": "<div id=\"ygrps-yiv-874265030\">Hiya, Chris<br/>\n<br/>\nThank you very much for your reply. I don&#39;t mind a bit that you&#39;ve <br/>\nselectively replied - any help is most welcome!<br/>\n<br/>\nGet/Set tests are a pain, but I can indeed see that they&#39;re useful. <br/>\nIn fact, they turned up two of the issues that JUnit&#39;s found for me, <br/>\nby exposing copy/paste errors. I haven&#39;t seen TestUtil before, but it <br/>\nsounds interesting - I&#39;ll have a look at that. Have you used it <br/>\nyourself?<br/>\n<br/>\nThe classes and methods (outside the get/sets) are indeed typically <br/>\nquite large. Some of this is just because the DTO, Domain object and <br/>\nBean perforce contain all the properties and their get/sets, which <br/>\nseems unavoidable to me. <br/>\nBut the Service classes and their methods are also large - For <br/>\nexample, a service update method would contain code to check the <br/>\nvalues the user passes in, convert the incoming values to the proper <br/>\nformat, obtain the object they want to update, update that with each <br/>\nvalue passed in, validate the updated object, apply any rules to it, <br/>\nand return a message or a generated SOAPBean. These chunks of work <br/>\nare typically extracted into separate methods, (at least, they are in <br/>\nmy code, so I can both reuse them and only test them once) but even <br/>\nso, they&#39;re considerably larger than 10 lines...<br/>\nSounds like this is an area we should look into in more detail - <br/>\nthank you!<br/>\n<br/>\nWe are indeed not doing TDD, basically because we don&#39;t know how! The <br/>\noriginal aim was to work that way, but nobody could see how to do it. <br/>\nThank you for the link to the Squeak code - I will have a look at <br/>\nthat, and hopefully it&#39;ll give us some pointers.<br/>\n<br/>\nThank very much for your help,<br/>\nCheers<br/>\nTracey</div>", 
    "prevInTime": 18219, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1161853885", 
    "canDelete": false, 
    "nextInTopic": 18222, 
    "prevInTopic": 18216, 
    "headers": {
        "inReplyToHeader": "PDM3NWU4ZDg4MDYxMDI1MDc1Mmk2NWRlNGQwY3M5ZjU5NzdiZGU1Y2VjZjc5QG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PGVocHUzdCthazAyQGVHcm91cHMuY29tPg=="
    }
}