{
    "numMessagesInTopic": 45, 
    "nextInTime": 18235, 
    "senderId": "wD5LrWHBzhGAyT1iD-TGTvVgAy6Bjr-zjXvPx4MAfjrBcEF5oUctNSWgDbzgKu4lLd0EwrIfynWl_Qnv1XUE3wBCTCZntVqqjRwMFSxPoOIgN5Ee", 
    "systemMessage": false, 
    "subject": "Re: [junit] Can anyone help me see how to usefully work with JUnit in a big project, please?", 
    "from": "&quot;Joakim Ohlrogge&quot; &lt;joakim.ohlrogge@...&gt;", 
    "authorName": "Joakim Ohlrogge", 
    "msgSnippet": "Hi Tracey, I won t apologize for my long reply ;) First of all my complements to you for hanging in there and trying to figure out what is the cause of your", 
    "msgId": 18234, 
    "profile": "j0hlrogge", 
    "topicId": 18213, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 261856052, 
    "messageBody": "<div id=\"ygrps-yiv-331881383\">Hi Tracey,<br/>\nI won&#39;t apologize for my long reply ;)<br/>\n<br/>\nFirst of all my complements to you for hanging in there and trying to figure<br/>\nout what is the cause of your headaches. Most people I come across simply<br/>\nconclued that &quot;unit testing would be coole in other projects but in my<br/>\nparticular situation it is impossible and just slows me down&quot;. I admire<br/>\nanyone who does not give up that easilly.<br/>\n<br/>\nOne part that struck me about your mail was the amount of the setup-code and<br/>\nespecially mock-expectations. Also how fragile they seem to be. 200 lines of<br/>\nmock-setup is like 5 to 10 times more than &quot;a lot&quot; and I can see how it<br/>\nbecomes fragile and more so, hard to see the intent of each test.<br/>\nI was involved in a long discussion about this issue on the TDD list (that I<br/>\ncan also recomend). James Carr started the disussion by asking: Do<br/>\nexpectations on mocks violate encapsulation? That started s lon discussion<br/>\nthat James summed up here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://blog.james-carr.org/?p=34\">http://blog.james-carr.org/?p=34</a><br/>\n<br/>\nIt contains all the relevant links to the original discussion and external<br/>\nlinks presented in the discussion. Basically I think too many mocks and<br/>\nexpectations on them is a code-smell that sais that you are testing too many<br/>\nconcerns at once. You said in another reply that you are adding tests after<br/>\nthe code is written, that you want to test first but don&#39;t know how. I think<br/>\nthis is also why you see less value of the unit-tests especially if you are<br/>\nusing mocks.<br/>\n<br/>\nWhen retrofitting mocks to test something that has already been developed it<br/>\neasily becomes nasty. I think dynamic mock frameworks add very little value<br/>\nwhen not driving the code you are testing. Indeed that is one of the points:<br/>\nsee <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mockobjects.com\">http://www.mockobjects.com</a> (listening to opinionated software). Doing it<br/>\nwrong is supposed to hurt and you are supposed to react by designing the<br/>\nthing you test in such a way that it can be tested painlessly. That it hurts<br/>\nwhen testing it is simply your code telling you to remove your hand from the<br/>\nhot plate. How to do that is something we have to learn, the easiest thing<br/>\nthat most do when faced with this pain is just stop writing tests (turning<br/>\noff the neural system) and voila! /That/ pain is gone. And things are back<br/>\nto normal, sometimes things don&#39;t work as they should and we need to use the<br/>\ndebugger more often than not but that is how it used to be so maybe that is<br/>\nhow it is supposed to be after all :)<br/>\n<br/>\nI also found another statement in your post worth commenting on:<br/>\n&quot;In the last year of my work, JUnit has shown up a total of 5 actual<br/>\nbugs, all bar one of which would have come out immediately in<br/>\nfunctional testing, yet has taken maybe a third of my time.&quot;<br/>\n<br/>\nI think, when doing TDD the main benefit is not to find bugs it is to guide<br/>\nyour design. Also, bugs will not be /found/ doing TDD, they will be<br/>\n/prevented/. The only way you will ever find bugs with JUnit is when the<br/>\ntests are added after the code is written and if they are they didn&#39;t guide<br/>\nyour design wich makes you loose much of the benefit of unit-testing in the<br/>\nfirst place. I think your frustration lies here, your tests as you are using<br/>\nthem now don&#39;t seem add enough value to bear their own weight.<br/>\n<br/>\nRead through the blog-post I referenced klick on the link to Nat Pryce blog<br/>\nand ead through that post aswell. Take a deep breath, see if they make sense<br/>\nin your context. Read the books suggested by J.B. and find out how to<br/>\nactually get out of the situation you&#39;re in.<br/>\n<br/>\nI hope this helps and good luck!<br/>\n/Joakim Ohlrogge<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/25/06, Tracey Annison &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:TAnnison@...\">TAnnison@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   Hiya! This is an interesting list, full of lots of helpful technical<br/>\n&gt; tips - great stuff.<br/>\n&gt;<br/>\n&gt; I&#39;ve been having a browse around, but I don&#39;t seem to see anyone with<br/>\n&gt; the same questions as me... which is probably a sign that I&#39;m on the<br/>\n&gt; wrong track somehow! :)<br/>\n&gt; I know this is a long post, but I can&#39;t see how to explain it any<br/>\n&gt; shorter - sorry.<br/>\n&gt;<br/>\n&gt; I&#39;m pretty new to programming, and Java terminology isn&#39;t my strong<br/>\n&gt; point, so my apologies if I mis-word things badly. I&#39;m working on a<br/>\n&gt; fairly large project involving providing web services via SOAP and<br/>\n&gt; GUI access via JSP&#39;s to data entities, allowing database input and<br/>\n&gt; update on many tables.<br/>\n&gt; Here&#39;s how I (roughly) understand it, for a given &quot;Thing&quot; entity :<br/>\n&gt; ===========================================<br/>\n&gt; * We have a concrete Domain object for our entity, (ConcreteThing)<br/>\n&gt; with an interface above it (Thing). This has all the various<br/>\n&gt; properties (Name, Number, etc - some entities have 150 or more) and<br/>\n&gt; getters & setters for them that do basic validation, and use a DTO to<br/>\n&gt; get & set the actual data. The object also has validation methods<br/>\n&gt; that cross-check the values against various other entities, using<br/>\n&gt; their DAO&#39;s.<br/>\n&gt; * Each domain object uses a persistence DTO class (ThingDTO) which<br/>\n&gt; holds all the various properties for the Thing, and has simple<br/>\n&gt; getters & setters for them. The ConcreteThing class calls these in<br/>\n&gt; it&#39;s getters & setters.<br/>\n&gt; * Each data entity also has a ThingDAO class, with methods like<br/>\n&gt; CreateThing, SaveThing, DeleteThing, etc to actually handle the<br/>\n&gt; reading & writing of the data to the database tables, with<br/>\n&gt; standardised interfaces to allow easy access. It uses SQLMapClient<br/>\n&gt; and SQL scripts to do this, passing around the ThingDTO, and also<br/>\n&gt; uses other DAO&#39;s when it creates a new ConcreteThing. The ThingDAO is<br/>\n&gt; itself used by other Domain objects, to test validation, etc.<br/>\n&gt; * For each Web Service, we have a ThingService class that offers<br/>\n&gt; methods to the user, like GetThing, DeleteThing, GetAllThings, etc,<br/>\n&gt; using the ThingDAO to do the work. It also uses a simple<br/>\n&gt; SOAPBeanThing that is used to return values to them. The<br/>\n&gt; SOAPBeanThing holds the Thing&#39;s properties, in a simplified format<br/>\n&gt; suitable for sending via SOAP. (ie a Date rather than a YearMonthDay,<br/>\n&gt; etc) Using Axis lets us make this easily available to the outside<br/>\n&gt; world.<br/>\n&gt; * We also have a MVC layer, with FormControllers, Validators,<br/>\n&gt; Actions, etc, and JSP&#39;s & such to go along with it, also using the<br/>\n&gt; ThingDAO, but it&#39;s all much of a muchness.<br/>\n&gt; * We use Spring to tie all this together, injecting the various<br/>\n&gt; items where they&#39;re needed, except for the concrete classes, where<br/>\n&gt; they&#39;re sent as part of the constructor. And we have all sorts of<br/>\n&gt; other cool tools, like Subversion and Ant and CruiseControl for<br/>\n&gt; automatic testing and all that, but I don&#39;t think it&#39;s relevant...<br/>\n&gt; ===========================================<br/>\n&gt; So - this is all cool! Lots of layers, but it all works, and each bit<br/>\n&gt; does a nice understandable chunk of work, and they talk to each other<br/>\n&gt; fine. Plus we have some tools to help us generate the repetitive<br/>\n&gt; stuff, so that speeds it up a bit.<br/>\n&gt;<br/>\n&gt; So why have I wibbled on about all this? Because we&#39;re using JUnit<br/>\n&gt; and JMock, too! And I&#39;m having trouble with it. Technically, it works<br/>\n&gt; fine, but it takes ages, is really fragile and doesn&#39;t seem to give<br/>\n&gt; me much useful.<br/>\n&gt; I&#39;m sure it&#39;s because I&#39;m doing it all wrong somehow...<br/>\n&gt;<br/>\n&gt; The testing code is much, much larger than the actual code, quite<br/>\n&gt; complex, and doesn&#39;t seem to show up a lot of issues for the time &<br/>\n&gt; effort it takes to write. Just to get one of these objects to test<br/>\n&gt; takes a huge amount of setup code, making & calling in lots of Mock<br/>\n&gt; objects (typically DAO&#39;s) and specifying what they should do (with<br/>\n&gt; stubs and expects), and so on. To keep it all standardised and down<br/>\n&gt; to a minimum, I typically define them all at the start, and make a<br/>\n&gt; setUp method to get them built (though I&#39;m told this isn&#39;t a good<br/>\n&gt; idea by some) but it&#39;s still very large.<br/>\n&gt; In some cases, the setup for a test can be about 200 lines or more at<br/>\n&gt; the start, and a setUp method of 400 lines or more as well. To test<br/>\n&gt; one Service (under 2,000 lines of code for 7 methods using 80<br/>\n&gt; properties) that simply offers a standard set of<br/>\n&gt; Get/Create/Update/Delete methods on an entity, the tests run over 5<br/>\n&gt; files to a total length of 30,000 lines! In order to get test<br/>\n&gt; coverage above 80%, there&#39;s a large amount of test code that simply<br/>\n&gt; checks that the gets/sets work... which most of the time they can&#39;t<br/>\n&gt; help but do anyway.<br/>\n&gt;<br/>\n&gt; Tests overall are 5 to 10 times larger than the code they test, and<br/>\n&gt; incredibly fragile. The simplest change in the code of one class,<br/>\n&gt; often resulting in a tiny change in operation that causes no actual<br/>\n&gt; issues, breaks large numbers of tests all over the place.<br/>\n&gt; I know that the idea is to test a single class in isolation, but I<br/>\n&gt; don&#39;t see how to do that, when they need each other to do their work.<br/>\n&gt; For example, I can&#39;t check that the policy number on my new claim is<br/>\n&gt; valid without using the policy DAO to check it. I can&#39;t get a new<br/>\n&gt; Claim without using the getClaim method on my DAO. So I have to<br/>\n&gt; either set it up (almost impossible) or Mock it and specify exactly<br/>\n&gt; all the methods I&#39;ll use and all their parameters and their<br/>\n&gt; responses, and so on.<br/>\n&gt; Changing the type of some commonly used properties in several<br/>\n&gt; entities from Integer to BigDecimal took my colleague a fortnight,<br/>\n&gt; and a big chunk of this time was fixing JUnits.<br/>\n&gt;<br/>\n&gt; In the last year of my work, JUnit has shown up a total of 5 actual<br/>\n&gt; bugs, all bar one of which would have come out immediately in<br/>\n&gt; functional testing, yet has taken maybe a third of my time.<br/>\n&gt; I&#39;ve just gotta be doing it wrong... but I don&#39;t know how to do it<br/>\n&gt; right!<br/>\n&gt;<br/>\n&gt; The other problem for me is that I can&#39;t get my head around how to do<br/>\n&gt; TDD with this sort of structure.<br/>\n&gt;<br/>\n&gt; I can&#39;t write a test without having all the objects I need, and<br/>\n&gt; knowing exactly what parameters I need in the new methods, and<br/>\n&gt; precisely what methods with what parameters will get called on the<br/>\n&gt; other objects, and so on & so forth. Which won&#39;t even compile until<br/>\n&gt; it&#39;s all there & working. And even then, it&#39;s likely to go through<br/>\n&gt; several iterations of changes (oh, no, I need to check this thing as<br/>\n&gt; well, using this other DAO, and now I need to work this out as well,<br/>\n&gt; using that data from over there, and so on), so that even if I could<br/>\n&gt; do it, I&#39;d end up writing this huge thing four times over.<br/>\n&gt; I can understand it more from a functional viewpoint than anything<br/>\n&gt; else - &quot;this is the result I want, have I got it yet?&quot;. But to set up<br/>\n&gt; a JUnit/JMock test doesn&#39;t seem to me to really ask that - it asks<br/>\n&gt; more about how (in detail) I got to that result.<br/>\n&gt;<br/>\n&gt; I&#39;m completely bewildered by how anyone writing anything larger than<br/>\n&gt; 100 lines or so gets a benefit from doing this. You clearly ARE, but<br/>\n&gt; I just don&#39;t understand how... I must be missing something!<br/>\n&gt;<br/>\n&gt; So, given the sort of work we&#39;re doing, and the kind of structure<br/>\n&gt; I&#39;ve tried to describe, can anyone out there tell me how I&#39;ve gone so<br/>\n&gt; far off track here? Or give me some real examples of quick, useful<br/>\n&gt; test classes on stuff like this?<br/>\n&gt; I just KNOW that I must be doing it all wrong, but I can&#39;t seem to<br/>\n&gt; find any real-world examples of how to do it right on this scale. Any<br/>\n&gt; help would be gratefully recieved!<br/>\n&gt;<br/>\n&gt; Thanks VERY much,<br/>\n&gt; Cheers,<br/>\n&gt; Tracey<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 18233, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1161939717", 
    "canDelete": false, 
    "nextInTopic": 18237, 
    "prevInTopic": 18232, 
    "headers": {
        "inReplyToHeader": "PGVobmRhdCtxM2NjQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGI5ZWU1ZTQxMDYxMDI3MDIwMW83MDllY2JiYWs1ZjU2OGIwYmJiN2MyN2RAbWFpbC5nbWFpbC5jb20+", 
        "referencesHeader": "PGVobmRhdCtxM2NjQGVHcm91cHMuY29tPg=="
    }
}