{
    "numMessagesInTopic": 45, 
    "nextInTime": 18253, 
    "senderId": "CWtRWYgqlH60wg0_sDdQ60AGMlhiuh7EvkYQFN9cnUGWGJQ6dceWZyXNtcOZmiRWaAf_blox9w7RYdhMj1OydAU_PA7vzF9knOkb3Tz7Ju7eScYq", 
    "systemMessage": false, 
    "subject": "Re: [junit] Can anyone help me see how to usefully work with JUnit in a big project, please?", 
    "from": "&quot;Joakim Ohlrogge&quot; &lt;joakim.ohlrogge@...&gt;", 
    "authorName": "Joakim Ohlrogge", 
    "msgSnippet": "Hi Cédric, see comments inline. ... I said that the main benifit of TDD is to guide the design, I didn t say that it is the only benefit. I don t know if it", 
    "msgId": 18252, 
    "profile": "j0hlrogge", 
    "topicId": 18213, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 261856052, 
    "messageBody": "<div id=\"ygrps-yiv-417557179\">Hi Cédric,<br/>\nsee comments inline.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; I think, when doing TDD the main benefit is not to find bugs it is to<br/>\n&gt;  &gt; guide<br/>\n&gt;  &gt; your design.<br/>\n&gt;<br/>\n&gt;  Really?<br/>\n&gt;<br/>\n&gt;  The main reason why I write tests is to make sure that no regressions will<br/>\n&gt;  happen.  From the point where I submit my tests, I know that no matter what<br/>\n&gt;  code gets checked in after me, the functionality of the system will not<br/>\n&gt;  decrease.<br/>\n&gt;<br/>\n&gt;  Tests also help a great deal make my code more robust.<br/>\n&gt;<br/>\n </span></blockquote>I said that the main benifit of TDD is to guide the design, I didn&#39;t<br/>\nsay that it is the only benefit. I don&#39;t know if it would be worth<br/>\nwriting unit tests to the extent we do if it &quot;just&quot; shows that things<br/>\nwork and to have a regression suite. Maybe I would suffice with<br/>\nfunctional tests then. Who knows?<br/>\nRemember that TDD is not only about writing the tests, it is also<br/>\nabout refactoring and daring to do that. So by having the benefits<br/>\nthat you speak about that is exacly what you get, courge to change<br/>\nthings (right?) and of course examples to help understanding the<br/>\nclasses they test.<br/>\n<br/>\nTDD is not only unit tests either, it is also acceptancetests and<br/>\nintegrationtests so not all aspects of TDD occurs on the unit-level<br/>\nand TDD.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  But drive my design with tests? That&#39;s dangerous and can potentially lead to<br/>\n&gt;  micro-design, i.e. design without seeing the big picture (&quot;I&#39;ll use this<br/>\n&gt;  signature because the test looks cleaner then&quot;).<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I think that the micro design is also important. Going to and from<br/>\nthere you often find that the larger problems resemble the micro<br/>\nproblems or that the larger problems are easier to solve when you have<br/>\na good understanding of the micro problems.<br/>\nWhen microdesigning you&#39;re doing that for a reason, it has to fit<br/>\nsomewhere in the big picture. I haven&#39;t really experienced designing<br/>\nwithout seing the big picture. I tend to look at the big picture in<br/>\nterms of smaller problems that have to be solved in order to get where<br/>\nI want to go. When I solved one small problem I take a look again at<br/>\nthe big picture to decide where to go next. Not that seldomly with the<br/>\nnew knowledge I&#39;ve aquired I see things about the big pictire that I<br/>\ndidn&#39;t see before and how the big picture shrinks with my newly won<br/>\nvocabulary (It is funny how big problems can boil down to much fewer<br/>\nabstractions than you first thought once you start putting your teeth<br/>\nin it, isnt it?)<br/>\n<br/>\nIt is not forbidden to go to a whiteborad, sketch down UML-diagrams on<br/>\na napkin while doing TDD either.<br/>\n<br/>\nDoes that make any sense at all?</div>", 
    "prevInTime": 18251, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1162163758", 
    "canDelete": false, 
    "nextInTopic": 18253, 
    "prevInTopic": 18251, 
    "headers": {
        "inReplyToHeader": "PGI4NmI2YTljMDYxMDI3MTQyN2g0YjI4ZmM1OWxlZWRlOGMzYjQ2ZWNlODQ4QG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PGI5ZWU1ZTQxMDYxMDI5MTUxNW83OTg4MTFmY2tmYjQ2YmFhZmFhMWU5Mjc5QG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PGVobmRhdCtxM2NjQGVHcm91cHMuY29tPgkgPGI5ZWU1ZTQxMDYxMDI3MDIwMW83MDllY2JiYWs1ZjU2OGIwYmJiN2MyN2RAbWFpbC5nbWFpbC5jb20+CSA8Yjg2YjZhOWMwNjEwMjcxNDI3aDRiMjhmYzU5bGVlZGU4YzNiNDZlY2U4NDhAbWFpbC5nbWFpbC5jb20+"
    }
}