{
    "numMessagesInTopic": 45, 
    "nextInTime": 18263, 
    "senderId": "A-ppDRbZ9-QL1oLbeBYDXpT4yRi36Zpqoft3-l85Y9VNcYy6lCKCMuHiOpaDzxkt5H4zvcrAoZ7hRYrpoVclVgnDd4rSQZZGQEYnXYsE8iKFcI1a", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Can anyone help me see how to usefully work with JUnit in a big project, please?", 
    "from": "&quot;Joakim Ohlrogge&quot; &lt;joakim.ohlrogge@...&gt;", 
    "authorName": "Joakim Ohlrogge", 
    "msgSnippet": "... I don t know if I misinterpret what You wrote but I feel I need to clairfy that tests with JUnit are written by the same person that implements them and it", 
    "msgId": 18262, 
    "profile": "j0hlrogge", 
    "topicId": 18213, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 261856052, 
    "messageBody": "<div id=\"ygrps-yiv-883736982\"><blockquote><span title=\"ireply\">&gt;  So I don&#39;t see how you can write a test class that has failing tests<br/>\n&gt;  that move over to passing tests as you write the code, (as I see TDD<br/>\n&gt;  asking for) when the thing you&#39;re testing doesn&#39;t exist yet.<br/>\n<br/>\n </span></blockquote>I don&#39;t know if I misinterpret what You wrote but I feel I need to<br/>\nclairfy that tests with JUnit are written by the same person that<br/>\nimplements them and it goes &quot;test a little - code a little - refactor&quot;<br/>\nin very short iterations. Those types of tests are also called<br/>\ndeveloper-tests for that reason.<br/>\n<br/>\nIf you want to specify your system with tests &quot;up front&quot; sort of to<br/>\nhave a checklist &quot;when that thing is green it is done, take the next<br/>\nread thing and continue&quot; I think automated acceptance testing with FIT<br/>\nor similar is what you need. Those tools are complementary to<br/>\ndeveloper tests (it is not either or).<br/>\n<br/>\nI got the impression that you thought that someone else (like a<br/>\ntester) specifies what should be done as a test and then checks it in<br/>\nand someone else (a developer) implements it. When doing TDD you can<br/>\nnever check in code that does not compile or fails any developer<br/>\ntests. I got that impression reading between the lines in this<br/>\ncomment:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But practically, I can&#39;t write such a test as a Java class in Eclipse<br/>\n&gt; without it failing to compile and thus breaking our automatic build<br/>\n&gt; procedures.<br/>\n<br/>\n </span></blockquote>Compilation errors are also failures so as soon as something doesn&#39;t<br/>\ncompile you fix it but adding the code to fix the compilation problem.<br/>\nRobert C Martin puts it like this:<br/>\n<br/>\n&quot;Over the years I have come to describe Test Driven Development in<br/>\nterms of three simple rules. They are:<br/>\n<br/>\n1. You are not allowed to write any production code unless it is to<br/>\nmake a failing unit test pass.<br/>\n   2. You are not allowed to write any more of a unit test than is<br/>\nsufficient to fail; and compilation failures are failures.<br/>\n   3. You are not allowed to write any more production code than is<br/>\nsufficient to pass the one failing unit test.&quot;<br/>\n-- Robert C Martin<br/>\n<br/>\nIt is elaborated here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://butunclebob.com/ArticleS.UncleBob.TheThreeRulesOfTdd\">http://butunclebob.com/ArticleS.UncleBob.TheThreeRulesOfTdd</a><br/>\n<br/>\nOf course it is possible that I read too much between the lines.<br/>\n/Joakim Ohlrogge</div>", 
    "prevInTime": 18261, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1162208532", 
    "canDelete": false, 
    "nextInTopic": 18263, 
    "prevInTopic": 18261, 
    "headers": {
        "inReplyToHeader": "PGVpNGlmaCtkcDkyQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGI5ZWU1ZTQxMDYxMDMwMDM0MnU2ZjhmNzA1NXZjMDkzNGE1Y2VjMTBiYTlAbWFpbC5nbWFpbC5jb20+", 
        "referencesHeader": "PGI4NmI2YTljMDYxMDI4MTAzNHA2Y2I2MGViYnFhMGY3MTI1MmNjMjJhOTJhQG1haWwuZ21haWwuY29tPgkgPGVpNGlmaCtkcDkyQGVHcm91cHMuY29tPg=="
    }
}