{
    "numMessagesInTopic": 45, 
    "nextInTime": 18267, 
    "senderId": "cFJCS2wYdocsgC-51Gh4bSnluHMV6jHcFmbiDRrWAFpmwsZnwN1hgatCnDI2GW5aqJlMuPWEQ_n27gM018daRt4pEOiOLix7aP5u3kqF", 
    "systemMessage": true, 
    "subject": "Re: Can anyone help me see how to usefully work with JUnit in a big project, please?", 
    "from": "&quot;Tracey Annison&quot; &lt;TAnnison@...&gt;", 
    "authorName": "Tracey Annison", 
    "msgSnippet": "Hiya, Joakim Thanks for your reply. Hmmm... there s maybe a little misinterpretation there, yes... I was assuming that it was the same person writing the code", 
    "msgId": 18266, 
    "profile": "traceyannison", 
    "topicId": 18213, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 132563212, 
    "messageBody": "<div id=\"ygrps-yiv-291480762\">Hiya, Joakim<br/>\n<br/>\nThanks for your reply. Hmmm... there&#39;s maybe a little <br/>\nmisinterpretation there, yes... I was assuming that it was the same <br/>\nperson writing the code and the tests, NOT two different people. <br/>\nBut I&#39;d got the size of the cycle wrong, I think. I&#39;d guessed that <br/>\nyou&#39;d write tests for everything a class does, then code the class to <br/>\nsuit. But that&#39;s not what you&#39;re saying, is it...<br/>\n<br/>\nIn your world, you write a test class that just tries to make an <br/>\ninstance of the real class. But it won&#39;t compile, so you make the <br/>\nclass and then the test class does compile, and the test works. <br/>\nThen you write a test that tries to run a method, but now the test <br/>\nclass won&#39;t compile again because that method doesn&#39;t exist yet. So <br/>\nyou write the method, and now the test compiles. <br/>\nThen you add to that test to say what you expect the method to <br/>\nreturn, and the test fails. So you write the code in the method and <br/>\nnow the test passes.<br/>\nAnd so on, in teeny-tiny steps?<br/>\n<br/>\nWell, I can now see how this can practically be used! And those rules <br/>\ndo help to make it clearer. Thank you. And thanks for the FIT <br/>\npointer, too...<br/>\n<br/>\nBut, thinking about it, maybe this cold be a problem to work with, <br/>\nwhen you&#39;re trying to make a big structure with other developers? <br/>\nBecause this builds up from the bottom quite slowly, if I&#39;ve <br/>\nunderstood it. Doesn&#39;t it take a long while before it&#39;s usable in any <br/>\nway?<br/>\nWe&#39;re typically making a whole structure, with DA, DTO, Domain <br/>\nobject, MVC layer and SOAP service. One of the benefits of using <br/>\nInterfaces for us, and making whole classes at a time, is that we can <br/>\ncode the Interface for the DAO and Domain Object, offering everything <br/>\nwe&#39;d need, and use those in the other objects, then fill in the <br/>\ndetail in the actual classes. That way, we can work together on one <br/>\nentity. This would be a bit difficult to do if we built it this way, <br/>\nbuilding up bit by bit from the bottom, wouldn&#39;t it?<br/>\n<br/>\nOr maybe I need to think aboutthis some more...<br/>\n<br/>\nCheers<br/>\nTracey</div>", 
    "prevInTime": 18265, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1162210736", 
    "canDelete": false, 
    "nextInTopic": 18269, 
    "prevInTopic": 18264, 
    "headers": {
        "inReplyToHeader": "PGI5ZWU1ZTQxMDYxMDMwMDM0MnU2ZjhmNzA1NXZjMDkzNGE1Y2VjMTBiYTlAbWFpbC5nbWFpbC5jb20+", 
        "messageIdInHeader": "PGVpNHFqZyticWI3QGVHcm91cHMuY29tPg=="
    }
}