{
    "numMessagesInTopic": 45, 
    "nextInTime": 18275, 
    "senderId": "3xej9iUoCVg3gpiBlEBEVahoSvFYf10I-5JlQSzj2AIHWXyp-V8pdQP5GuYde3xmlBnlsWsXOq3mqn4oY_NNoGqsVzv0Zw", 
    "systemMessage": false, 
    "subject": "Re: [junit] Can anyone help me see how to usefully work with JUnit\tin a big project, please?", 
    "from": "Jeff Langr &lt;jeff@...&gt;", 
    "authorName": "Jeff Langr", 
    "msgSnippet": "... I know of few TDD proponents that don t do some modicum of up-front design. The amount I ve found I need to do is small, and a lot of it is in my head.", 
    "msgId": 18274, 
    "profile": "jlangr", 
    "topicId": 18213, 
    "spamInfo": {
        "reason": "3", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 238525042, 
    "messageBody": "<div id=\"ygrps-yiv-1741597027\">Quoting Cédric Beust ?  &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cbeust@...\">cbeust@...</a>&gt;:<br/>\n<blockquote><span title=\"ireply\"> &gt; I would also point out that the term &quot;Test-Driven Design&quot; strongly seems to<br/>\n&gt; imply that your tests drive your design.  Which is what I was objecting<br/>\n&gt; against, and also why I much prefer calling it &quot;Test-Driven Development&quot;<br/>\n&gt; (and I still think that it&#39;s something you should do whenever you can but<br/>\n&gt; you certainly don&#39;t need to do it 100% of the time to obtain well-tested<br/>\n&gt; code).<br/>\n<br/>\n </span></blockquote>I know of few TDD proponents that don&#39;t do some modicum of up-front  <br/>\ndesign. The amount I&#39;ve found I need to do is small, and a lot of it  <br/>\nis in my head. What most of us rail against is the notion that we need  <br/>\nto produce a complete, highly detailed up-front design.<br/>\n<br/>\nYou&#39;re incorrectly assuming that TDD is just about testing, or even  <br/>\ntesting+design, which its proponents suggest. Not considering its  <br/>\nimpact on improving how to approach design (which can feed back in the  <br/>\nability to improve upon up-front design), if that&#39;s all we got out of  <br/>\nit, TDDing 100% of the time would seem to be reasonably expensive.  <br/>\nParticularly for someone who was very good at designing, like yourself.<br/>\n<br/>\nWe also do a lot of &quot;after the fact&quot; design, i.e. we&#39;re continually  <br/>\ntrying to stay cognizant of the design impacts of every few lines of  <br/>\ncode. We try to do something about it, as opposed to the crowd that  <br/>\npresumes their up-front design is perfect.<br/>\n<br/>\nThe bigger thing TDD does is enable refactoring of code. Whether or  <br/>\nnot the design up front was good, the most significant costs lie in  <br/>\nthe implementation and extended maintenance of the system. If you ever  <br/>\nget a chance to work on systems that are more than a couple years old,  <br/>\nand where business demands keep coming, you&#39;ll find that&#39;s where the  <br/>\ntrue costs are. Most code out there is just bad, and highly, highly  <br/>\nredundant.<br/>\n<br/>\nUnfortunately, it&#39;s very dangerous for programmers to start guessing  <br/>\nwhere they don&#39;t need tests, particularly if they&#39;re not as highly  <br/>\nskilled as you obviously are. They usually guess wrong. Laziness tends  <br/>\nto take control of this guessing game, and not enough tests get  <br/>\nwritten. Maybe that&#39;s not so bad, if we have enough integration tests  <br/>\n(most systems rarely do). But the bigger impact is that lack of tests  <br/>\nsignificantly increases the risk of keeping the code clean, and the  <br/>\nsystem takes a much quicker route to complete degradation.<br/>\n<br/>\nTry working on a C++ system like this that&#39;s been around 10 years,  <br/>\nthat takes an hour just to build, and for which it takes hours to  <br/>\nfigure out where a simple chunk of code goes, and hours or days more  <br/>\nto figure out whether or not you&#39;ve broken something by making your  <br/>\nsimple change. Sweetly, and with great karma, the defects often crop  <br/>\nup in the untested areas, where we thought we were too smart to have  <br/>\nneeded tests.<br/>\n<br/>\nI also get a lot of value out of tests that programmers crafted with  <br/>\nthe intent to help me understand what the classes are about. I&#39;ve had  <br/>\nopportunities to work with systems that were comprehensively covered  <br/>\nwith unit tests. It&#39;s a breeze to find what you&#39;re looking for in such  <br/>\na system, as opposed to the typical nightmare of navigating through a  <br/>\nsystem in which no one considers the value that clean tests can  <br/>\ncreate, and for which only poor, out-of-date written documents exist.<br/>\n<br/>\nIf you&#39;re sold on the value of your level of investment in TDD, fine.  <br/>\nOthers have gotten far more out of it.<br/>\n<br/>\nJeff Langr<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://langrsoft.com\">http://langrsoft.com</a></div>", 
    "prevInTime": 18273, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1162223571", 
    "canDelete": false, 
    "nextInTopic": 18276, 
    "prevInTopic": 18273, 
    "headers": {
        "inReplyToHeader": "PGI4NmI2YTljMDYxMDI5MjE1MnY1MWVhYzk4ZnQyZmM4MjQ1M2RhN2EyNTdmQG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PDIwMDYxMDMwMDc1MjUxLmlpYjJweTg5Y3d6b2tnMGdAbG9naW4uc2lyaXVzLmx1bmFycGFnZXMuY29tPg==", 
        "referencesHeader": "PGVobmRhdCtxM2NjQGVHcm91cHMuY29tPgk8YjllZTVlNDEwNjEwMjcwMjAxbzcwOWVjYmJhazVmNTY4YjBiYmI3YzI3ZEBtYWlsLmdtYWlsLmNvbT4JPGI4NmI2YTljMDYxMDI3MTQyN2g0YjI4ZmM1OWxlZWRlOGMzYjQ2ZWNlODQ4QG1haWwuZ21haWwuY29tPgk8NDU0NTE1NkYuNjAxMDIwOEBnbWFpbC5jb20+CTxiODZiNmE5YzA2MTAyOTE3NTh5MTBjOTk0OTJ0NmVjMWY0NWY2NDU3NTY2MEBtYWlsLmdtYWlsLmNvbT4JPDQ1NDU4RUM3LjYwMDAxMDFAZ21haWwuY29tPgk8Yjg2YjZhOWMwNjEwMjkyMTUydjUxZWFjOThmdDJmYzgyNDUzZGE3YTI1N2ZAbWFpbC5nbWFpbC5jb20+"
    }
}