{
    "numMessagesInTopic": 3, 
    "nextInTime": 18318, 
    "senderId": "l8Heh77BEZQ3MJvX7K1CkiDNqPId7qDZ9FhNnFnQPd8ZNIkpvEUvbSRX8qCoIvRZlHkYENReBR3BMFt7sxYC9ZErDIgIHwP1tYabh_MW2iCbVTXo", 
    "systemMessage": false, 
    "subject": "Re: [junit] Why is it considered an error if there is no test in the file?", 
    "from": "&quot;Joakim Ohlrogge&quot; &lt;joakim.ohlrogge@...&gt;", 
    "authorName": "Joakim Ohlrogge", 
    "msgSnippet": "Hi Joseph, I m assuming that you want to do this with jUnit 4.0 since 3.x requires you to extend TestCase. Disclaimer: I m not very experienced with JUnit 4.x", 
    "msgId": 18317, 
    "profile": "j0hlrogge", 
    "topicId": 18316, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 261856052, 
    "messageBody": "<div id=\"ygrps-yiv-507285623\">Hi Joseph,<br/>\n<br/>\nI&#39;m assuming that you want to do this with jUnit 4.0 since 3.x<br/>\nrequires you to extend TestCase.<br/>\n<br/>\nDisclaimer: I&#39;m not very experienced with JUnit 4.x so there may be<br/>\npossibilities there that I&#39;m not aware of.<br/>\n<br/>\nThat is a bit of an unusual aproach and I don&#39;t think it is supported.<br/>\nIf I would want to do what you want to do I would do something similar<br/>\nto what we did in dynamic test suite in rMock:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://rmock.sourceforge.net/dynamicsuites.html\">http://rmock.sourceforge.net/dynamicsuites.html</a><br/>\n<br/>\nThe benefit with examining your classes to descide what should go into<br/>\nyour test suite is that it gives you access to information such as<br/>\nimplemented interfaces, annotations etc while in ant you can only<br/>\ndescide based on file-name and location.<br/>\n<br/>\nSo I guess I&#39;m saying that instead of trying to work around treating a<br/>\nclass that does not contain any tests like an error try to find a way<br/>\nto include only those classes that do contain tests to the runner. I<br/>\nthink you may be more successful with that.<br/>\n<br/>\nIn general I thik that jUnit is designed with a certain process in<br/>\nmind while TestNG is more flexible in that sense. It may very well<br/>\nhappen that you find that testNG suits your needs better.<br/>\n<br/>\nNow that I tried to answer your question I am curious, wouldn&#39;t having<br/>\nyour test methods sprinkled all over your code constrain you<br/>\nunneccesarily? I&#39;m thinking that you would probably need to provide<br/>\ndefault constructors in those classes that contian tests in order to<br/>\nbe able to run them for instance.<br/>\n<br/>\nWouldn&#39;t it  become confusing for someone looking at the code later.<br/>\nWouldn&#39;t it be harder to see what has to do with testing and what has<br/>\nto do with passing the tests?<br/>\n<br/>\nDon&#39;t get me wrong, try it by all means, I just saw those potential drawbacks.<br/>\nTake care!<br/>\n/Joakim Ohlrogge<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 11/8/06, Joseph Shraibman &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jks@...\">jks@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; From the faq the pattern everyone else seems to be using is that their<br/>\n&gt;  tests are in a seperate java file from their code.  I&#39;d like to<br/>\n&gt;  spinkle test methods throughout my code, so the test can be right next<br/>\n&gt;  to the code it is testing.  I&#39;d like to create a junit ant task that<br/>\n&gt;  just runs on my whole codebase, but not all of my classes will have<br/>\n&gt;  test methods and I&#39;ll get an error for each class that doesn&#39;t (and I<br/>\n&gt;  don&#39;t want to have to explictily add each class to my build.xml file<br/>\n&gt;  when I add a test).  So how do I tell junit that it isn&#39;t an error if<br/>\n&gt;  a class does not have a test method?<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 18316, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1162995382", 
    "canDelete": false, 
    "nextInTopic": 18319, 
    "prevInTopic": 18316, 
    "headers": {
        "inReplyToHeader": "PGVpcmYzaytkYXRoQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGI5ZWU1ZTQxMDYxMTA4MDYxNnQzMzlmNTQ2Y3A5YTJjNmRmZTk4NWQ3ZDc2QG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PGVpcmYzaytkYXRoQGVHcm91cHMuY29tPg=="
    }
}