{
    "numMessagesInTopic": 1, 
    "nextInTime": 18347, 
    "senderId": "7VHluQj5lpkOMxrKxnhJFjTRAH4lNSrslRhJ9xit0AQdpg-2uKOMg97TTVFaK3v7cP70aTJhMx6BXY6bmtYXZR0ylSbKhizTXkcX2xXt", 
    "systemMessage": true, 
    "subject": "Getting paid to write open source software?", 
    "from": "&quot;estherschindler&quot; &lt;esther@...&gt;", 
    "authorName": "estherschindler", 
    "msgSnippet": "Howdy, folks! I m a longtime computer industry journalist; I egotistically imagine that you ve seen my byline here-and-there, particularly when it comes to", 
    "msgId": 18346, 
    "profile": "estherschindler", 
    "topicId": 18346, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 2449560, 
    "messageBody": "<div id=\"ygrps-yiv-2004285358\">Howdy, folks! I&#39;m a longtime computer industry journalist; I egotistically imagine that <br/>\nyou&#39;ve seen my byline here-and-there, particularly when it comes to software <br/>\ndevelopment topics. (If not, please don&#39;t tell me; I&#39;ll cry.)<br/>\n<br/>\nLast week, I started a new job as senior editor at cio.com and csoonline.com, where I&#39;m <br/>\nprimarily responsible for the online communities. That doesn&#39;t keep me from writing <br/>\narticles -- and the first one that I decided to tackle is among the rough spots between <br/>\nmanagement and development staff. And I&#39;d very much like your input.<br/>\n<br/>\nI know, from Evans Data research, that a rather high percentage of software developers <br/>\nwrite open source code, whether on their own time or the company&#39;s clock; some <br/>\nmeaningful percentage of those developers also contribute the changes back to the open <br/>\nsource community. And one of the factoids mentioned in passing at the Gartner Open <br/>\nSource summit in September was that a growing percentage of corporations are paying <br/>\ntheir own developers to work on open source projects, some of whom do so full time. IBM <br/>\nis probably the easiest example, with several people on the Eclipse project employed by <br/>\nIBM.<br/>\n<br/>\nI&#39;m looking for other people in that situation -- either the salaried open source developer <br/>\nor that developer&#39;s management -- so I can write an article to provide guidance to IT <br/>\nManagers who are contemplating such options.<br/>\n<br/>\nWhat I&#39;m hoping to find (or create) are management guidelines for companies who want to <br/>\ntake advantage of open source code, and know that they need functions that aren&#39;t <br/>\ncurrently in the software. The easiest solution is to add the features they need to the <br/>\nexisting open source code base, then contribute the enhancements back to the <br/>\ndevelopment community. But doing so can raise intellectual property questions (such as <br/>\n&quot;what does it mean for &#39;work for hire&#39;?&quot;)... and perhaps several other issues that make <br/>\nlawyers and CEOs uncomfortable. I&#39;d like to get your input on what issues the open source <br/>\ndeveloper and her manager need to deal with. (Feel free to forward this to developers you <br/>\nknow who might be able to help.)<br/>\n<br/>\nNote that I&#39;m NOT looking here for people who are using open source tools at work; that <br/>\nis, I&#39;m thrilled if you write code in Eclipse or you target your site to run on the Apache Web <br/>\nserver, but I&#39;m not after the users. Rather, I&#39;m in search of someone who writes the code <br/>\n_of_ the open source software: a committer to Plone, a contributor to Drupal, a <br/>\nprogrammer who&#39;s given code to samba. And who has done so on company time, whether <br/>\nas part of the job description or simply to get the work done or for any other reason. With <br/>\nor without management approval, though I&#39;m most interested in those who can say &quot;with.&quot;<br/>\n<br/>\nSo, if you&#39;re the right person, here&#39;s the questions I&#39;m wondering about:<br/>\n<br/>\n* How did you convince management that this was a good idea? Or did they approach you?<br/>\n<br/>\n* What concerns did management have regarding intellectual property issues? How were <br/>\nthey resolved?<br/>\n<br/>\n* People issues: Were there &quot;team&quot; challenges, since the open source developer is sort-of <br/>\nworking on corporate applications (but not quite)? Have the needs of the open source <br/>\ncommunity ever presented a conflict with your company identity? Do people in the open <br/>\nsource community know for whom you work; that is, does your e-mail sig identify you as <br/>\n@... or @..., and does that have any side effects?<br/>\n<br/>\n* What other problems came up? How have you dealt with them? <br/>\n<br/>\n* In short, what should a manager know before she decides to say, &quot;Okay, we&#39;ll let you <br/>\nwork 20 hours a week on the such-and-so project&quot;?<br/>\n<br/>\nI&#39;m writing for the manager and CIO here; let&#39;s help them make the best decisions <br/>\npossible.<br/>\n<br/>\nI&#39;m hoping to post the article sometime at the beginning of December, so I&#39;d appreciate <br/>\nany advice you can offer me -- publicly or privately -- sooner rather than later. Also, let <br/>\nme know (privately if necessary) about your company and open source community <br/>\naffliations; we can work out the details of &quot;how should I refer to you&quot; one-on-one.<br/>\n<br/>\nEsther Schindler<br/>\nsenior editor, cio.com<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:eschindler@...\">eschindler@...</a></div>", 
    "prevInTime": 18345, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1163450879", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGVqYWxsditqZmE2QGVHcm91cHMuY29tPg=="
    }
}