{
    "numMessagesInTopic": 3, 
    "nextInTime": 18365, 
    "senderId": "ab04s7pBeRRtH64bpne1cFDJElJlJTF7beNH4IOq_nfC_g1ffMvOr5ltQxXBGG86lrjOtdwqeGOeCNg8PROB6cAH3w", 
    "systemMessage": true, 
    "subject": "Why should I continue to use junit.swingui.TestRunner with JUnit 4.1 ?", 
    "from": "&quot;Al May&quot; &lt;asdf4033@...&gt;", 
    "authorName": "Al May", 
    "msgSnippet": "Hi, I d like to migrate to JUnit 4.1 definitely. Before (with JUnit 3.8), I used to execute my tests by three ways: 1- within Eclipse ; 2- with a junit task in", 
    "msgId": 18364, 
    "profile": "asdf4033", 
    "topicId": 18364, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 284684096, 
    "messageBody": "<div id=\"ygrps-yiv-1968254713\">Hi,<br/>\n<br/>\nI&#39;d like to migrate to JUnit 4.1 definitely.<br/>\n<br/>\nBefore (with JUnit 3.8), I used to execute my tests by three ways:<br/>\n<br/>\n1- within Eclipse ;<br/>\n2- with a junit task in ant ;<br/>\n3- with a java task in ant executing a junit.swingui.TestRunner class.<br/>\n<br/>\nAccording to the 3.8 cookbook, if I wanted to run more than one tests<br/>\nin one shot, I had to create a TestSuite including all my tests. So my<br/>\ntest classes which were placed all around beside my business classes<br/>\nwere all refered by a hierarchy of TestSuite classes up to the root<br/>\npackage of my project. It was working fine, but now, it&#39;s different.<br/>\n<br/>\nWith 4.1, it seems that the TestSuite is no more required. Then, I<br/>\ndecided to get rid of the TestSuite classes in my project. Anyway,<br/>\nEclipse (version 3.2.1) was complaining when I was trying to run the<br/>\ntests each time it was encountering a TestSuite class. Now within<br/>\nEclipse, the only thing I have to do to run my tests is to click on<br/>\nthe package I want to test and to run it as a JUnit test; Eclipse<br/>\nseems to gather all the test classes in this particular package and it<br/>\nexecute the tests within that package. If I want to run a particular<br/>\ntest, I just have to perform the same operation on that particular<br/>\ntest. That&#39;s great and it is working fine. It seems also that it<br/>\nsearch all the tests in a hierarchical way, so I just have to &quot;run as<br/>\na Junit&quot; on the root package of my project to execute the whole bunch<br/>\nof tests in my project.<br/>\n<br/>\nThe second way to execute the test was within ant. I commented out my<br/>\nold junit target in my build.xml to change it the way they explain in<br/>\nthe FAQ.html (using the batchtest element) and it works well.<br/>\n<br/>\nMy problem is with the third way: using the junit.swingui.TestRunner<br/>\nclass present in the version 3.8. I say &quot;present in...&quot; because this<br/>\nclass isn&#39;t available anymore in the version 4.1. As I said in the<br/>\nbeginning of my post, I want to change to 4.1 definitely and I like to<br/>\nknow whether I have to forget the Swing GUI runner or not. I don&#39;t<br/>\nwant to include the java.jar of the previous version just to be able<br/>\nto run that runner. The problem is I liked to run my tests outside<br/>\nEclipse using that special Swing test runner, but if someone tell me<br/>\nthe reasons why it has been removed, I&#39;ll try to forget to use it anymore.<br/>\n<br/>\nIn that case, I&#39;ll use Eclipse as a graphical user interface<br/>\nenvironment to run my JUnit tests and I will use the console mode<br/>\nthrought ant to quickly verify my code.<br/>\n<br/>\nThanks for your advice,<br/>\nAl</div>", 
    "prevInTime": 18363, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1163623682", 
    "canDelete": false, 
    "nextInTopic": 18375, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGVqZnVlMitkdXVqQGVHcm91cHMuY29tPg=="
    }
}