{
    "numMessagesInTopic": 2, 
    "nextInTime": 18361, 
    "senderId": "Q4fFjnUKDZ0LezWvLPBEwXlmoHzvmkoWN4_oXwW1xhr3p3PY6P7u-mlP9OhXmB_NJwY0phIxaeLHHyBrkDbK0ESGlpuPpUsdR5g", 
    "systemMessage": true, 
    "subject": "Testing API implementations (and some additional questions)", 
    "from": "&quot;staaleund&quot; &lt;staaleund@...&gt;", 
    "authorName": "staaleund", 
    "msgSnippet": "I am working on making a wrapper implementation of some REST webservices from a PHP project in Java. I have 3 basic packages, the API package containing only", 
    "msgId": 18360, 
    "profile": "staaleund", 
    "topicId": 18360, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 289158934, 
    "messageBody": "<div id=\"ygrps-yiv-1936514491\">I am working on making a wrapper implementation of some REST<br/>\nwebservices from a PHP project in Java. I have 3 basic packages, the<br/>\nAPI package containing only the interfaces, that are mirrors of the<br/>\nsame objects in PHP. The XML implementation that implements the<br/>\ninterfaces, and collects data via REST web services, and the ehcache<br/>\nimplementation that uses the XML implementation to fetch data, but<br/>\ncaches it.<br/>\n<br/>\nBoth the XML and ehcache implementation implements the same<br/>\ninterfaces, so I would like to write my test once, and then run them<br/>\nover both implementations.<br/>\n<br/>\nI also have a small problem that fetching some off the Objects I am<br/>\ntesting over XML is an expensive operation. I currently fetch objects<br/>\nin the setUp method, but that gets run before each test method. What<br/>\nis the prefered way to fetch this object once and reuse in all the<br/>\ntests? The object I am currently working on having this problem is<br/>\nimmutable, so test won&#39;t modify its content.<br/>\n<br/>\nFinally, the XML test of course requires an URL to fetch data from.<br/>\nThis is dependent on the test environment. What is the normal way to<br/>\nset up and read such parameters for a test?</div>", 
    "prevInTime": 18359, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1163517203", 
    "canDelete": false, 
    "nextInTopic": 18377, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGVqY21laitxMmZtQGVHcm91cHMuY29tPg=="
    }
}