{
    "numMessagesInTopic": 8, 
    "nextInTime": 18389, 
    "senderId": "Awuu6nVTNF-A_ojsSQacQ3JDSLVGxC_0Rf1oZR6nqYta3hjxPs9G2MBhMY6fVvN0qvuBAn7lPc6DN91-0IsRi0-CwxC7x052UBMWiw", 
    "systemMessage": false, 
    "subject": "Re: Agitar Generates JUnit Tests", 
    "from": "&quot;albsavoia&quot; &lt;albsavoia@...&gt;", 
    "authorName": "albsavoia", 
    "msgSnippet": "... Hi J.B., As Agitar s co-founder and CTO, I always hesitate to jump into product discussions in this forum; but in this case it might be useful to clarify", 
    "msgId": 18388, 
    "profile": "albsavoia", 
    "topicId": 18372, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174158319, 
    "messageBody": "<div id=\"ygrps-yiv-1004604585\"><blockquote><span title=\"ireply\">&gt; I think I understand the antiquated licence scheme it&#39;s meant to <br/>\n&gt; replace, but I would rather pay a tiered subscription fee based on a <br/>\n&gt; measure of how much I use the software (say, the number of outcomes it <br/>\n&gt; detects?), rather than what the resulting design looks like.<br/>\n&gt; <br/>\n&gt; &gt; Anyway, objection noted. Thanks.<br/>\n&gt; <br/>\n&gt; You&#39;re welcome, and thank you for noting it. I know it&#39;s a knotty <br/>\n&gt; problem to solve. I can&#39;t claim to know better, but I know what I don&#39;t <br/>\n&gt; like, and I don&#39;t like this (quite). Of course, I&#39;m not exactly in <br/>\n&gt; Agitar&#39;s market for this product right now, so my opinion is largely <br/>\n&gt; theoretical in nature at present.<br/>\n<br/>\n </span></blockquote>Hi J.B.,<br/>\n<br/>\nAs Agitar&#39;s co-founder and CTO, I always hesitate to jump into product<br/>\ndiscussions in this forum; but in this case it might be useful to<br/>\nclarify some things.  Especially since the discussion seems to be<br/>\nquite civilized so far :-).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;so my opinion is largely <br/>\n&gt;theoretical in nature at present.<br/>\n<br/>\n </span></blockquote>Thank you for recognizing that, but I can see how (based on the brief<br/>\ndescription of our pricing model) you would reach your conclusions -<br/>\nso we have to fix that and be clearer.<br/>\n<br/>\nIn practice, the number of classes on which the license is based is<br/>\nmeasured more in orders or magnitudes than an very precise class<br/>\ncount.  Many of our licenses are actually enterprise-wide and for an<br/>\nunlimited number of users or classes.  In all cases, there is ample<br/>\nhead-room for adding new classes and refactoring big-old-nasty<br/>\nclasses.  As a matter of fact, one of the top uses for our JUnit<br/>\ngeneration is to help create a safety net for working with legacy<br/>\ncode; and class/method refactoring is one of the things that we<br/>\nrecommend.  You can see me giving a demo of exactly that type of<br/>\nrefactoring (at the method level) at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.agitar.com/solutions/products/agitarone_demos.html\">http://www.agitar.com/solutions/products/agitarone_demos.html</a><br/>\n<br/>\n(It&#39;s the first of the four mini-demos on that page ... No making fun<br/>\nof my accent please, and NO we did not hire Borat to do the voice over<br/>\n:-)).<br/>\n<br/>\nEvery pricing scheme has advantages and disadvantages.  Most of us<br/>\nwant to move away from per-seat licensing. I believe that a<br/>\nserver-based solution with an unlimited number of classes (or with a<br/>\nvery generous over-allotment for growth and refactoring) is a step in<br/>\nthe right direction, but we are open to exploring other suggestions<br/>\n(like the one you already made).<br/>\n<br/>\nThanks,<br/>\n<br/>\nAlberto</div>", 
    "prevInTime": 18387, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1164119868", 
    "canDelete": false, 
    "nextInTopic": 18402, 
    "prevInTopic": 18387, 
    "headers": {
        "inReplyToHeader": "PDQ1NjI5Mjg1LjUwNjAxMDlAZ21haWwuY29tPg==", 
        "messageIdInHeader": "PGVqdjJ2cys1M2loQGVHcm91cHMuY29tPg=="
    }
}