{
    "numMessagesInTopic": 31, 
    "nextInTime": 18381, 
    "senderId": "bwxei687R9Z67F8daVFPJDrmA6vyNbjdnJmyW3_4zTY2BuTYT8K093T_VZLrOH6VxzDVfGqvgo7GwQzkGwPQU_y1PmTQdEgIuBYSMLyjk-6d3_KGTMynZg", 
    "systemMessage": false, 
    "subject": "Help needed", 
    "from": "&quot;friends4ever_8in&quot; &lt;friends4ever_8in@...&gt;", 
    "authorName": "friends4ever_8in", 
    "msgSnippet": "Hi all, I am a new member to join the grp. I needed some help. Please suggest something in this regard. I have always been in testing and that too", 
    "msgId": 18380, 
    "profile": "friends4ever_8in", 
    "topicId": 9372, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 197135626, 
    "messageBody": "<div id=\"ygrps-yiv-503714916\">Hi all,<br/>\nI am a new member to join the grp.<br/>\n<br/>\nI needed some help. Please suggest something in this regard.<br/>\n<br/>\nI have always been in testing and that too functinality/manual<br/>\ntesting. So I was never involved in deveopment or automated testing.<br/>\n<br/>\nBut these days, talks are going on in our project to automate some of<br/>\nour testing tasks. For this they want to use Junit as the main testing<br/>\ntool. But also, we want to have a GUI, through which test data can be<br/>\nentered or the other option being, maintaining the test data in an xml<br/>\nfile and then automating the process of extracting values from that<br/>\nfile and using those values in test cases which can be run<br/>\ncontinuously one after the another, each time taking a different set<br/>\nof value from the file.<br/>\n<br/>\nAlso, the result of the test case should be communicated back to the<br/>\ntester.<br/>\n<br/>\nPlease suggest how this can be achieved and what sort of<br/>\nframework/design should be used for this test suite.<br/>\n<br/>\nWill be waiting for response from all the members of the group.</div>", 
    "prevInTime": 18379, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1163945375", 
    "canDelete": false, 
    "nextInTopic": 18381, 
    "prevInTopic": 10576, 
    "headers": {
        "messageIdInHeader": "PGVqcG9pdit1cWFsQGVHcm91cHMuY29tPg=="
    }
}