{
    "numMessagesInTopic": 8, 
    "nextInTime": 18403, 
    "senderId": "8CRWpKxhwbW6vrf80jr52ASBryaa8fBLugOB1g7Qw7W9YcPmoY25K25HRI6Gn1pnetkMoTLjoTn4LchSCawHJjT8dBShnaHplKMl88JeZrKo", 
    "systemMessage": false, 
    "subject": "AgitarOne&#39;s licence", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains762@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... I expect it to remain that way. I like your product, at least what I ve been able to use of it so far, and the Agitar folks I ve worked with have been", 
    "msgId": 18402, 
    "profile": "nails762", 
    "topicId": 18372, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 282027414, 
    "messageBody": "<div id=\"ygrps-yiv-730488357\">albsavoia wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; I think I understand the antiquated licence scheme it&#39;s meant to<br/>\n&gt;  &gt; replace, but I would rather pay a tiered subscription fee based on a<br/>\n&gt;  &gt; measure of how much I use the software (say, the number of outcomes it<br/>\n&gt;  &gt; detects?), rather than what the resulting design looks like.<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; &gt; Anyway, objection noted. Thanks.<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; You&#39;re welcome, and thank you for noting it. I know it&#39;s a knotty<br/>\n&gt;  &gt; problem to solve. I can&#39;t claim to know better, but I know what I don&#39;t<br/>\n&gt;  &gt; like, and I don&#39;t like this (quite). Of course, I&#39;m not exactly in<br/>\n&gt;  &gt; Agitar&#39;s market for this product right now, so my opinion is largely<br/>\n&gt;  &gt; theoretical in nature at present.<br/>\n&gt; <br/>\n&gt; Hi J.B.,<br/>\n&gt; <br/>\n&gt; As Agitar&#39;s co-founder and CTO, I always hesitate to jump into product<br/>\n&gt; discussions in this forum; but in this case it might be useful to<br/>\n&gt; clarify some things. Especially since the discussion seems to be<br/>\n&gt; quite civilized so far :-).<br/>\n<br/>\n </span></blockquote>I expect it to remain that way. I like your product, at least what I&#39;ve <br/>\nbeen able to use of it so far, and the Agitar folks I&#39;ve worked with <br/>\nhave been excellent. You even hired someone recently I&#39;d worked with at <br/>\nanother of my clients, and he&#39;s excellent, so your hiring practices are <br/>\nsound. :)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt;so my opinion is largely<br/>\n&gt;  &gt;theoretical in nature at present.<br/>\n&gt; <br/>\n&gt; Thank you for recognizing that, but I can see how (based on the brief<br/>\n&gt; description of our pricing model) you would reach your conclusions -<br/>\n&gt; so we have to fix that and be clearer.<br/>\n&gt; <br/>\n&gt; In practice, the number of classes on which the license is based is<br/>\n&gt; measured more in orders or magnitudes than an very precise class<br/>\n&gt; count.<br/>\n<br/>\n </span></blockquote>I suspected as much, but in any such scheme, eventually I will &quot;run out <br/>\nof classes&quot;, even if that number is 10,000 or 100,000. It will happen <br/>\nless frequently, sure, but the limit is nevertheless still there.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Many of our licenses are actually enterprise-wide and for an<br/>\n&gt; unlimited number of users or classes. <br/>\n<br/>\n </span></blockquote>I suspected as much, but I can only imagine where the price-point is for <br/>\nthe &quot;all access pass&quot; for AgitarOne. I&#39;m sure it&#39;s suitably high for the <br/>\nvery high value you provide.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In all cases, there is ample<br/>\n&gt; head-room for adding new classes and refactoring big-old-nasty<br/>\n&gt; classes. As a matter of fact, one of the top uses for our JUnit<br/>\n&gt; generation is to help create a safety net for working with legacy<br/>\n&gt; code; and class/method refactoring is one of the things that we<br/>\n&gt; recommend. You can see me giving a demo of exactly that type of<br/>\n&gt; refactoring (at the method level) at:<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.agitar.com/solutions/products/agitarone_demos.html\">http://www.agitar.com/solutions/products/agitarone_demos.html</a> <br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.agitar.com/solutions/products/agitarone_demos.html\">http://www.agitar.com/solutions/products/agitarone_demos.html</a>&gt;<br/>\n<br/>\n </span></blockquote>I have no doubt as to the effectiveness of your product. I even support <br/>\nit as an indispensable tool for rescuing legacy codebases. I wish more <br/>\npeople would use it that way, than see it as a replacement for writing <br/>\ntests (in general).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; (It&#39;s the first of the four mini-demos on that page ... No making fun<br/>\n&gt; of my accent please, and NO we did not hire Borat to do the voice over<br/>\n&gt; :-)).<br/>\n&gt; <br/>\n&gt; Every pricing scheme has advantages and disadvantages. Most of us<br/>\n&gt; want to move away from per-seat licensing. I believe that a<br/>\n&gt; server-based solution with an unlimited number of classes (or with a<br/>\n&gt; very generous over-allotment for growth and refactoring) is a step in<br/>\n&gt; the right direction, but we are open to exploring other suggestions<br/>\n&gt; (like the one you already made).<br/>\n<br/>\n </span></blockquote>As I wrote, I don&#39;t know of a better solution; I just know I don&#39;t like <br/>\na limit on the number of classes. There has to be a better way, but in <br/>\nthe meantime, AgitarOne&#39;s value mostly exceeds this annoyance. I suppose <br/>\nit would matter much more to me if I had a licence for up to 10,000 <br/>\nclasses, had 9,997 classes in my system and no more money to give you. <br/>\nSince I&#39;m not in that situation, I can&#39;t say much more. It might be a <br/>\ncase of &quot;Funny, it has never come up.&quot;<br/>\n<br/>\nTake care, Alberto.<br/>\n-- <br/>\nJ. B. (Joe) Rainsberger :: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jbrains.ca\">http://www.jbrains.ca</a><br/>\nYour guide to software craftsmanship<br/>\nJUnit Recipes: Practical Methods for Programmer Testing<br/>\n2005 Gordon Pask Award for contribution Agile Software Practice</div>", 
    "prevInTime": 18401, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1164462525", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 18388, 
    "headers": {
        "inReplyToHeader": "PGVqdjJ2cys1M2loQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDQ1Njg0OUJELjQwMDA3MDRAZ21haWwuY29tPg==", 
        "referencesHeader": "PGVqdjJ2cys1M2loQGVHcm91cHMuY29tPg=="
    }
}