{
    "numMessagesInTopic": 11, 
    "nextInTime": 1852, 
    "senderId": "uEWEX4s2tKdEed7fBUUa7eabIaJ_84AemTy-dhA32PVT11SN-HPt0EoDvo0p3TYU2FkuCXRyvKdoc8goye4tlSfwEllo8LLrVZvCgODRv7vfYeZsLldMzzKueXClBHNZ7t8", 
    "systemMessage": false, 
    "subject": "Support for JUnit", 
    "from": "&quot;Penny Heatherington&quot; &lt;pheatherington@...&gt;", 
    "authorName": "Penny Heatherington", 
    "msgSnippet": "My company has started to use JUnit as a testing tool for our Java development. We are considering making it an organizationally approved tool for our", 
    "msgId": 1851, 
    "topicId": 1851, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-268947874\">My company has started to use JUnit as a testing tool for our Java development. We are considering making it an &#39;organizationally approved&#39; tool for our development environment.  In order to accomplish this, we will perform a technical evaluation of the tool and submit an &#39;to be approved&#39; recommendation to our Standards Committee. A &#39;Support Plan&#39; must accompany the request for approval.  Consequently, I am researching support that is available for the tool.<br/>\n<br/>\nDo you have any specific information regarding JUnit support? Have any articles been written on the subject? Has a &quot;Support Plan&quot; been written by one of Junit&#39;s users.<br/>\n<br/>\nI have visited the SourceForge site as well as JUnit.org, so I am generally familiar with what is there.<br/>\n<br/>\nDoes anyone provide telephone support?<br/>\n<br/>\nThank you for any information you can provide.<br/>\n<br/>\nPenny Heatherington<br/>\nProject Lead<br/>\nOppenheimerFunds<br/>\n<br/>\n<br/>\nThis electronic mail transmission may contain confidential information and is intended only for the person(s) named.  Any use, copying or disclosure by any other person is strictly prohibited.  If you have received this transmission in error, please notify the sender via e-mail.</div>", 
    "prevInTime": 1850, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "994802361", 
    "canDelete": false, 
    "nextInTopic": 1853, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PHNiNGIyNjdhLjAzM0BvcHBlbmhlaW1lcmZ1bmRzLmNvbT4="
    }
}