{
    "numMessagesInTopic": 4, 
    "nextInTime": 18538, 
    "senderId": "i5PEmC51ZDv8TkvGujeKl7KJCj5ILk5MXUi_7Y95P4_zt8YGrci1P0U17lnuSX1JAmu2TJ_bObbN2eouOxynPM7UO-Rb51QR98JAvmG03A", 
    "systemMessage": true, 
    "subject": "Re: [junit] Using mock objects", 
    "from": "lightbulb432 &lt;veerukrishnan@...&gt;", 
    "authorName": "lightbulb432", 
    "msgSnippet": "Thanks for your response. I took a look at their websites, rMock in particular because it claims to take the advantages of the other two into account in this", 
    "msgId": 18537, 
    "profile": "bla12321bla", 
    "topicId": 18534, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 291963312, 
    "messageBody": "<div id=\"ygrps-yiv-333819604\">Thanks for your response.<br/>\n<br/>\nI took a look at their websites, rMock in particular because it &quot;claims&quot; to<br/>\ntake the advantages of the other two into account in this one. Whether<br/>\nthat&#39;s true or not is another discussion... (I&#39;m totally new to all this, so<br/>\nI have no idea.)<br/>\n<br/>\nWhat is the point of these mock object tools? I first read about mock<br/>\nobjects in a book on JUnit that had an example using straight JUnit to<br/>\ncreate the mock object and test it. What do these tools do that is special<br/>\nthat you can&#39;t do yourself - I haven&#39;t been able to figure out by their<br/>\nwebsites, perhaps somebody could explain it in simple terms?<br/>\n<br/>\nI&#39;m guessing it has something to do with emulating the use of another class<br/>\n(like MySQL drivers or whatnot) without actually having to program the mock<br/>\nobject yourself. What astonishes me is how these tools do that? Is it just<br/>\nthat you hope the tool you chooses supports what you need to be mocked (i.e.<br/>\nit has built-in mock objects), or do you specify the details of the class<br/>\nexcept the Java code and it just does the last step for you (i.e. generates<br/>\nthe Java code), or something else? Plese describe on a conceptual level if<br/>\nyou know.<br/>\n<br/>\nBasically, what all am I getting from one of these tools that I couldn&#39;t<br/>\nfrom just doing it myself? (I realize there are benefits, I just don&#39;t know<br/>\n- in beginner terms - what they are.)<br/>\n<br/>\nAlso, looking at the tutorials on rMock (and jMock, and easyMock which has<br/>\nthis issue but to a lesser degree), I realized that they are extremely<br/>\nsparse. Just a little more than a page is apparently enough to teach people,<br/>\nbut not me! Are people who are new to mock objects really supposed to<br/>\nunderstand it from their minimal Getting Started sections? Or is it just me?<br/>\nWhat&#39;s the best way for me to learn something like rMock?<br/>\n<br/>\nThanks.<br/>\n<br/>\n<br/>\n<br/>\nLasse Koskela wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Hi &quot;veerukrishnan&quot;,<br/>\n&gt; <br/>\n&gt; On 12/13/06, lightbulb432 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:veerukrishnan@...\">veerukrishnan@...</a>&gt; wrote:<br/>\n&gt;&gt;  I&#39;m new to JUnit, and am wondering about using mock objects with JUnit.<br/>\n&gt;&gt; I wa<br/>\n&gt;&gt;  looking at www.mockobjects.com, and on the right side of the page it<br/>\n&gt;&gt; lists<br/>\n&gt;&gt;  &quot;implementations&quot;, and for Java it says jMock, EasyMock, and rMock.<br/>\n&gt;&gt;<br/>\n&gt;&gt;  What does it mean by implementations? What standard or specification are<br/>\n&gt;&gt;  they implementing, if any?<br/>\n&gt;&gt;<br/>\n&gt;&gt;  Or are they really very different things that only use the &quot;concept&quot; of<br/>\n&gt;&gt; mock<br/>\n&gt;&gt;  objects, but implement it very differently?<br/>\n&gt; <br/>\n&gt; EasyMock, jMock and rMock are not implementations of any standard or<br/>\n&gt; specification. They&#39;re implementations of the mock object pattern<br/>\n&gt; where you define &quot;expectations&quot; (expected interaction, method calls in<br/>\n&gt; Java) for a smart test double, which can then afterwards verify<br/>\n&gt; whether those expectations were met.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; On 12/13/06, lightbulb432 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:veerukrishnan@...\">veerukrishnan@...</a>&gt; wrote:<br/>\n&gt;&gt;  Any advice for a beginner as to which of those three implementations to<br/>\n&gt;&gt; look<br/>\n&gt;&gt;  at (any difference in functionality, robustness, or any other<br/>\n&gt;&gt; criteria?).<br/>\n&gt;&gt;  Looking at their websites I couldn&#39;t really tell what the main<br/>\n&gt;&gt; differences<br/>\n&gt;&gt;  are.<br/>\n&gt; <br/>\n&gt; I&#39;ve been personally using EasyMock for a long time. The reason for me<br/>\n&gt; having used EasyMock has really been just that I disliked the<br/>\n&gt; string-based approach of jMock (which doesn&#39;t work with automated<br/>\n&gt; refactoring tools too well, not to mention modern IDE&#39;s<br/>\n&gt; auto-completion features) and rMock has just recently appeared on the<br/>\n&gt; market.<br/>\n&gt; <br/>\n&gt; Functionally all of the above frameworks are almost identical so if<br/>\n&gt; you don&#39;t have any bias towards a specific library, I&#39;d recommend<br/>\n&gt; trying each of them out by writing a small set of tests with each<br/>\n&gt; alternative. For jMock, however, be sure to use the 2.0 branch from<br/>\n&gt; their Subversion repository as the API will change completely. They&#39;re<br/>\n&gt; dumping the string-based expectation setting API in the upcoming 2.0<br/>\n&gt; release (which Nat Pryce promised would be out real soon...).<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Lasse<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>-- <br/>\nView this message in context: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nabble.com/Using-mock-objects-tf2812332.html#a7860038\">http://www.nabble.com/Using-mock-objects-tf2812332.html#a7860038</a><br/>\nSent from the JUnit - User mailing list archive at Nabble.com.</div>", 
    "prevInTime": 18536, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1166039577", 
    "canDelete": false, 
    "nextInTopic": 18542, 
    "prevInTopic": 18535, 
    "headers": {
        "inReplyToHeader": "PDM5NzVlMmQxMDYxMjEzMTAxOG8yMjg2OWEyMXA3NmVhZWQ1ZjVkMWU2YTZlQG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PDc4NjAwMzgucG9zdEB0YWxrLm5hYmJsZS5jb20+", 
        "referencesHeader": "PDc4NDgwMTUucG9zdEB0YWxrLm5hYmJsZS5jb20+IDwzOTc1ZTJkMTA2MTIxMzEwMThvMjI4NjlhMjFwNzZlYWVkNWY1ZDFlNmE2ZUBtYWlsLmdtYWlsLmNvbT4="
    }
}