{
    "numMessagesInTopic": 12, 
    "nextInTime": 18547, 
    "senderId": "jMXuKt3CM_R6ncB2-hp3BLBMLEKGognotuYKewX4sZCepI0eUgpFwm8gM3om4v3I5kmK27fXQ9ST2fN8OVEftYxyW1yzeWYc14S4NpSSkv0", 
    "systemMessage": true, 
    "subject": "Test a remote server", 
    "from": "avinash anand &lt;avinash_anand@...&gt;", 
    "authorName": "avinash anand", 
    "msgSnippet": "Hi Group Greetings to all. These days I am writting test suit for a CORBA CRM. Let me first introduce the system. There is a central ORB server and many other", 
    "msgId": 18546, 
    "profile": "avinash_anand", 
    "topicId": 18546, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 242433434, 
    "messageBody": "<div id=\"ygrps-yiv-920242875\">Hi Group<br/>\n          Greetings to all. These days I am writting test suit for a CORBA CRM. Let me first introduce the system.<br/>\n<br/>\nThere is a central ORB server and many other servers which talk to each other through vesp. ORB being the central one. Entire code base is in C++. I have to test a new server introduced in the system which is written in Java. This new server talks to the rest through JNI. As a matter of Fact none of the servers can run independently, they neccesirily have to log into the central kit and report to the the central ORB server. After validation stuff the server starts working.<br/>\n<br/>\nEven this new Java based server uses an executable file to work (Jloader.exe written in c++)<br/>\n<br/>\nThis .exe loads various .dll files in the system and in its main method calls the compiled .class files. This is the way how system functions.<br/>\n<br/>\nMy problem is that when I will write a JUnit test case in IDE (eclipse) which would operate on the actual code which has 99% dependency and cannot be tested isolated. Is there any way to test this server code while it is working under the live system and the test suite running in the eclipse IDE.<br/>\n<br/>\nHELP !!!<br/>\n<br/>\n<br/>\nThanks<br/>\nAvinash<br/>\n<br/>\n<br/>\n\t\t<br/>\n___________________________________________________________ <br/>\nNow you can scan emails quickly with a reading pane. Get the new Yahoo! Mail. <a rel=\"nofollow\" target=\"_blank\" href=\"http://uk.docs.yahoo.com/nowyoucan.html\">http://uk.docs.yahoo.com/nowyoucan.html</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 18545, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1166173481", 
    "canDelete": false, 
    "nextInTopic": 18547, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDIwMDYxMjE1MDkwNDQxLjc1Mjc4LnFtYWlsQHdlYjI2NzAyLm1haWwudWtsLnlhaG9vLmNvbT4="
    }
}