{
    "numMessagesInTopic": 1, 
    "nextInTime": 18565, 
    "senderId": "jcVFHX4Jopvqn2wh29VKpfAXhvf0rU4wGephUqg95me8kjgtGJbPPixfyCkY_46_N0PrDJ8ai2q3X0PPbwoQEVc-sLBzRaDyz5PqTWCf", 
    "systemMessage": true, 
    "subject": "Improving what&#39;s output in JUnit HTML report", 
    "from": "&quot;chuck2005_77&quot; &lt;chuck2005_77@...&gt;", 
    "authorName": "chuck2005_77", 
    "msgSnippet": "I ve been happily using JUnit for years (v3.8.1), and I currently find myself in a situation that requires me to get additional info into the JUnit HTML", 
    "msgId": 18564, 
    "profile": "chuck2005_77", 
    "topicId": 18564, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 292838104, 
    "messageBody": "<div id=\"ygrps-yiv-1313197557\">I&#39;ve been happily using JUnit for years (v3.8.1), and I currently find<br/>\nmyself in a situation that requires me to get additional info into the<br/>\nJUnit HTML report; the default HTML report is no longer sufficient for<br/>\nour uses.  Some issues I have include:<br/>\n<br/>\n1. We have many test cases and test suites, and it is common to<br/>\nduplicate a method name in more than one test case.  e.g.<br/>\ntestAccessProperties() may appear many times, so if one of them fails,<br/>\nits not readily obvious WHICH one failed.  I usually have included the<br/>\nname of the test case in the test method&#39;s name, but other developers<br/>\nhere aren&#39;t willing to do that.  e.g.<br/>\n&quot;testOurTestCase_accessProperties&quot;.  Test case info should appear in<br/>\nthe results too so that we don&#39;t have to creatively name the methods.<br/>\n<br/>\n2. I&#39;m producing one giant HTML report from the running of several<br/>\ntest suites.  Each test suite is usually named AllTests.  The<br/>\nresulting HTML shows a list of test cases all named AllTests, which<br/>\nisn&#39;t all that helpful.<br/>\n<br/>\n3. It is normal for us to run the same test suite more than once, but<br/>\nwith different data each time.  For example, our product has a common<br/>\ninterface to access more than one type of server, so the same set of<br/>\ntests are invoked against more than one server (and this is controlled<br/>\nby providing a .properties file to the tests containing different info<br/>\nabout that server).  The default behavior of the JUnit ant task<br/>\ncreated a file TEST-com.blah.AllTests.xml file which kept getting<br/>\noverwritten with each subsequent run of the tests against another<br/>\nserver; I solved this with the &quot;outfile&quot; attribute so that each XML<br/>\nfile has a slightly different name, so I can at least preserve the<br/>\ndata.  But, the one giant HTML report isn&#39;t able to show how one test<br/>\nrun is any different from another since it just lists<br/>\n&quot;com.blah.AllTests&quot; several times.  I need a way to annotate in the<br/>\ntest results what each test run was for, even just a simple text<br/>\nstring would help.<br/>\n<br/>\nI realize some of these problems could be solved just by creating<br/>\nseveral different HTML reports, each in its own directory appropriate<br/>\nnamed, and a higher-level HTML file with text descriptions and links<br/>\nto each HTML report.  Although, we&#39;d kind of like one big report.<br/>\n<br/>\nHas anyone else worked out issues like these?  I have done a small<br/>\namount of extending JUnit (custom formatters, custom runners), so I&#39;m<br/>\nnot afraid of proceeding down that path.  Anyone have tips on what has<br/>\nworked out well for them?<br/>\n<br/>\nThanks!</div>", 
    "prevInTime": 18563, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1166654334", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGVtY2UxdSs4NzRxQGVHcm91cHMuY29tPg=="
    }
}