{
    "numMessagesInTopic": 13, 
    "nextInTime": 18599, 
    "senderId": "ovllqSg43dmvkeNBpHOUhfVubO-MMQNm8S3J0XrPFX3sfjeKTVCizeTSx33s1wKjEdYo5VQPTX89zVj7pmLJQwFXs0BSyfQrkeFTFy7axY1W", 
    "systemMessage": false, 
    "subject": "Re: [junit] How JUnit runs test class", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains762@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "...  ... If the tests touch a global resource, like a database, then it s true that creating separate instances of the test does not (alone) ensure ", 
    "msgId": 18598, 
    "rawEmail": "Return-Path: &lt;jbrains762@...&gt;\r\nX-Sender: jbrains762@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 87696 invoked from network); 29 Dec 2006 02:10:18 -0000\r\nReceived: from unknown (66.218.67.35)\n  by m36.grp.scd.yahoo.com with QMQP; 29 Dec 2006 02:10:18 -0000\r\nReceived: from unknown (HELO chilco.textdrive.com) (207.7.108.242)\n  by mta9.grp.scd.yahoo.com with SMTP; 29 Dec 2006 02:10:18 -0000\r\nReceived: from [192.168.1.115] (CPE000cf1c2033e-CM0012c9daf7de.cpe.net.cable.rogers.com [74.102.135.232])\n\tby chilco.textdrive.com (Postfix) with ESMTP id 40002DBF81\n\tfor &lt;junit@yahoogroups.com&gt;; Fri, 29 Dec 2006 02:10:15 +0000 (UTC)\r\nMessage-ID: &lt;45947904.1030905@...&gt;\r\nDate: Thu, 28 Dec 2006 21:10:12 -0500\r\nUser-Agent: Thunderbird 1.5.0.9 (Macintosh/20061207)\r\nMIME-Version: 1.0\r\nTo: junit@yahoogroups.com\r\nReferences: &lt;86DF2883EC684A4C9043EE18340521FA0368DF50@...&gt;\r\nIn-Reply-To: &lt;86DF2883EC684A4C9043EE18340521FA0368DF50@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: &quot;J. B. Rainsberger&quot; &lt;jbrains762@...&gt;\r\nSubject: Re: [junit] How JUnit runs test class\r\nX-Yahoo-Group-Post: member; u=282027414; y=yHHv_vdEk3ryl4bvMHaJOpDOhKYJzRHD9PNdyLPc2uNZG_E\r\nX-Yahoo-Profile: nails762\r\n\r\nVietchau Nguyen wrote:\n\n&gt;  &gt; 1. Do you really want your tests /not/ to be isolated?\n&gt; \n&gt; Yes, I want the test cases to be isolated, that is test 2 fails and test\n&gt; 5 can still pass.. \n&lt;snip /&gt;\n&gt; \n&gt; But I don&#39;t see by create each instance of the test class can ensure\n&gt; isolation... for example, if I have a test #2 that add a new user to the\n&gt; system, and I expect an error (password not strict enough, for example),\n&gt; and this test fails, that is it adds the user to the system. Normally,\n&gt; if I have a test that adds a user, I would delete the user afterward,\n&gt; but for this case, since I didn&#39;t expect the user to be added, I don&#39;t\n&gt; do the cleaning up. Then on my test #5, I check how many users in the\n&gt; system, I would expect none, and the test will fail because the previous\n&gt; test already added the user by error. (Sure, in this simple case, I can\n&gt; check the result and if the user is successfully added, I can delete,\n&gt; but I just want to give an example, other cases may not as so easy). So,\n&gt; I don&#39;t see a benefit of create a new instance, the tests still get\n&gt; affected.\n\nIf the tests touch a global resource, like a database, then it&#39;s true \nthat creating separate instances of the test does not (alone) ensure \nisolation. This is why I tend to write fewer tests that touch a \ndatabase, preferring to use other techniques to drive flexible designs.\n\nWhat you describe is a classic testing problem, and there are a few \nsolutions:\n\n1. Write the tests to depend on the order of execution: test #1 adds a \nuser, test #2 expects that user to be there, test #3 deletes that user.\n\n2. Write the tests to restore the &quot;users&quot; table to a known state before \neach test.\n\n3. Write the tests not to use a database.\n\nWhen I started writing tests, I tried #1. After a few months, I realized \nthat it took a lot of effort to keep the tests in the correct order. I \nalso found it difficult to add more tests. I would follow this pattern:\n\n  * Add a new test that requires 2 new rows of data in a table\n  * Retrofit many of the old tests, changing their expected results to \ntake into account the 2 new rows--for example, for a &quot;find all&quot; query, \nif I used to expect 10 rows, I now expect 12\n\nAfter doing this a number of times, I decided that #2, while it cost \nmore CPU cycles, took less time, because it was much easier to maintain. \nFor this, DbUnit is my favorite tool. The slowest part of this work \nbecame running the tests and waiting for the results.\n\nAfter some more time, I learned I could do even better with an in-memory \ndatabase, because test execution speed was much better. For this, I use \nHSQLDB, which is pure Java, runs in memory and supports very recent SQL \nstandards. Once I started doing that, the slowest part of my job became \nconstructing datasets from Java objects and keeping dataset files up to \ndate as the database design changed.\n\nNext, I found out that by testing my business logic (usually Controllers \nin the MVC sense) against data access interfaces allowed me to wrote \nmost of my tests without worrying about datasets, SQL, DbUnit and \nHSQLDB. (That&#39;s #3 above.) I use JMock to do this, and although it took \nme only a few weeks to learn and understand, it took me years to truly \nmaster. This is my current favorite technique. Now I only write a few \ndozen tests that touch the real database for a medium-sized system (say, \n30 database tables), and I don&#39;t know how to go any faster.\n\n&gt;  &gt; 2. Do the tests run quickly enough even if you &quot;waste&quot; the resources?\n&gt; \n&gt; Well, right now it still runs quick enough... but I don&#39;t know if I\n&gt; write more tests into the class it will be fast or not... I have to\n&gt; parse an xml file to get all the parameters for the tests, and I rather\n&gt; parse once for all the tests to keep in the system than to parse over\n&gt; and over the file for each test case because each time a new instance is\n&gt; created.\n\nI understand this. I would tend to prefer hardcoding test parameters in \nmy tests, rather than reading them from a file. The simplest thing I can \nrecommend for your specific case is to read the XML document into a \nsingleton, then have your tests ask the singleton for test data. This is \na well-known case where a singleton is not dangerous: read-only, global \ndata. Still, I would prefer to put the test data directly into the \ntests, as I find that easier to read.\n\nTake care, and good luck.\n-- \nJ. B. (Joe) Rainsberger :: http://www.jbrains.ca\nYour guide to software craftsmanship\nJUnit Recipes: Practical Methods for Programmer Testing\n2005 Gordon Pask Award for contribution Agile Software Practice\n\n", 
    "profile": "nails762", 
    "topicId": 18565, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 282027414, 
    "prevInTime": 18597, 
    "contentTrasformed": false, 
    "postDate": "1167358212", 
    "canDelete": false, 
    "nextInTopic": 18599, 
    "prevInTopic": 18597, 
    "headers": {
        "inReplyToHeader": "PDg2REYyODgzRUM2ODRBNEM5MDQzRUUxODM0MDUyMUZBMDM2OERGNTBARVgwMDA0LkFsbHN0cmVhbUlUUy5sb2NhbD4=", 
        "messageIdInHeader": "PDQ1OTQ3OTA0LjEwMzA5MDVAZ21haWwuY29tPg==", 
        "referencesHeader": "PDg2REYyODgzRUM2ODRBNEM5MDQzRUUxODM0MDUyMUZBMDM2OERGNTBARVgwMDA0LkFsbHN0cmVhbUlUUy5sb2NhbD4="
    }
}