{
    "numMessagesInTopic": 2, 
    "nextInTime": 18684, 
    "senderId": "Y917X01Ux2QBkO6zCtwNZ_q9OGw8Lep1dLMjk3IV6V0_IQsd0aqjSmMYQ0bz3KoPO8sKGYVGud1rRPA-9NwwY1JkIg9XfZsJImBHPg", 
    "systemMessage": false, 
    "subject": "JUnitFactory - an experimental *characterization* test generator", 
    "from": "&quot;albsavoia&quot; &lt;albsavoia@...&gt;", 
    "authorName": "albsavoia", 
    "msgSnippet": "Lately there have been a lot of questions about automated test generation, so I thought a few people in this group might be interested in checking out a", 
    "msgId": 18683, 
    "profile": "albsavoia", 
    "topicId": 18683, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174158319, 
    "messageBody": "<div id=\"ygrps-yiv-1305109629\">Lately there have been a lot of questions about automated test<br/>\ngeneration, so I thought a few people in this group might be<br/>\ninterested in checking out a preview version of JUnitFactory.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.junitfactory.com\">http://www.junitfactory.com</a><br/>\n<br/>\nJUnitFactory is a free experimental project from AgitarLabs.  You send<br/>\nit Java code and it sends back JUnit characterization tests for your<br/>\ncode.<br/>\n<br/>\nWe have made our technology freely available to academic institutions<br/>\nand test researchers, but some of them don&#39;t have the spare computing<br/>\nor IT resources to set-up a test server.  So we thought it would be a<br/>\nfun experiment to set-up a dozen CPUs and have students and<br/>\nresearchers use the test generator over the web.  As the experiment<br/>\nprogresses, we plan to make APIs available so that researchers and<br/>\nanyone interested in automated test generation can experiment with<br/>\ntheir own characterization test generation algorithms and strategies.<br/>\n<br/>\nBefore anyone starts complaining about the evil of automated test<br/>\ngeneration, let me restate that JUnitFactory can only generate<br/>\ncharacterization tests; and let me clarify what is meant by<br/>\ncharacterization tests for those that may not be familiar with the<br/>\nterm or concept.<br/>\n<br/>\nIn &quot;Working With Legacy Code&quot;, Michael Feathers define<br/>\ncharacterization tests as tests that characterize and record what the<br/>\ncode actually does - not what it&#39;s *supposed* to do. They exercise the<br/>\ncode with a range of inputs, and record return values, object state,<br/>\netc., for each set of inputs.<br/>\n<br/>\nCharacterization tests are useful for working with legacy code which<br/>\nis defined, again by Michael Feathers, as any code without tests.<br/>\n<br/>\nCTs can come in handy as change detectors when there is a large body<br/>\nof code with little or no tests and provide a safety net when you need<br/>\nto make some changes to it.  If the same set of inputs results in<br/>\ndifferent behavior between the original and the revised version of the<br/>\ncode, some assertions in the characterization tests will fail. Some of<br/>\nthose failures may point to unexpected and/or unwanted changes<br/>\nin behavior that you might want to know about and address.<br/>\n<br/>\nColloquially, and in the simplest possible terms, a characterization<br/>\ntests will tell you things like the following:<br/>\n<br/>\n-----<br/>\nIn the original version of the code, &#39;Util.foobar(&quot;abc&quot;, 123)&#39;<br/>\nreturned &#39;42&#39;. After you made the change, it returns &#39;43&#39;.<br/>\n-----<br/>\n<br/>\nThe test has no idea whether the right return value is &#39;42&#39; or &#39;43&#39;,<br/>\nbut it lets you know that it has changed and you, the developer, has<br/>\nto decide which one is right and what to do about it.  Sorry, no free<br/>\nlunch.<br/>\n<br/>\nBy now it should be amply clear that automatically generated<br/>\ncharacterization tests are NOT a replacement for TDD or JUnit tests<br/>\nlovingly crafted by developers.  But, especially with some user input<br/>\nin the selection of test data and test assertions (which is possible<br/>\nwith JUnitFactory), they can give developers a valuable jump-start in<br/>\nworking with legacy code and complement their manual testing efforts.<br/>\n<br/>\nUnfortunately, for the time being, we only have a client plug-in for<br/>\nEclipse.  If enough people find the JUnitFactory useful, we plan to<br/>\nadd support for other IDEs.  As a matter of fact, if you want to help<br/>\nwith that let us know - but keep in mind that JUnitFactory is designed<br/>\nto be a free service so all clients will have to be freely available<br/>\nor, better, open-source.<br/>\n<br/>\nIf you don&#39;t use Eclipse, there&#39;s a &quot;toy&quot; web-based demo of the CT<br/>\ngeneration also - but it only works on one class with no dependencies.<br/>\n<br/>\nAnyway, if you have any interest in JUnit generation, go to the<br/>\nwebsite, request an invitation and give it a try.<br/>\n<br/>\nRemember, it&#39;s still experimental and mostly for fun so don&#39;t expect<br/>\ntoo much or bang on it too hard.<br/>\n<br/>\nAlberto</div>", 
    "prevInTime": 18682, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1168370557", 
    "canDelete": false, 
    "nextInTopic": 18685, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGVvMHExdCtyZGNwQGVHcm91cHMuY29tPg=="
    }
}