{
    "numMessagesInTopic": 80, 
    "nextInTime": 18711, 
    "senderId": "gJABpKD1aae4mHoSZwYOGNBT4pDPUz6Qk89geEuBdcr4-9XA3cxGeOLyr35bZEdXdhbnfl6fx_YzMi-OfgZXTBxd76Csj1vRDskpOGypTPWUYYbB", 
    "systemMessage": false, 
    "subject": "Re: [junit] 100%% Method Testing and Generating Unit Tests", 
    "from": "&quot;James P. Gunderson&quot; &lt;jgunders@...&gt;", 
    "authorName": "James P. Gunderson", 
    "msgSnippet": "David: When I envision a system that would extract my guide, and build the test case into the junit test set for the class I am driven by laziness. I totally", 
    "msgId": 18710, 
    "rawEmail": "Return-Path: &lt;jgunders@...&gt;\r\nX-Sender: jgunders@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 63278 invoked from network); 11 Jan 2007 20:39:57 -0000\r\nReceived: from unknown (66.218.67.36)\n  by m32.grp.scd.yahoo.com with QMQP; 11 Jan 2007 20:39:57 -0000\r\nReceived: from unknown (HELO mail2.electricstores.com) (69.2.241.19)\n  by mta10.grp.scd.yahoo.com with SMTP; 11 Jan 2007 20:39:56 -0000\r\nReceived: from [192.168.0.253] ([67.176.29.207]) by mail2.electricstores.com with Microsoft SMTPSVC(5.0.2195.6713);\n\t Thu, 11 Jan 2007 13:39:43 -0700\r\nMessage-ID: &lt;45A6A064.9010800@...&gt;\r\nDate: Thu, 11 Jan 2007 13:39:00 -0700\r\nUser-Agent: Thunderbird 1.5.0.9 (Windows/20061207)\r\nMIME-Version: 1.0\r\nTo: junit@yahoogroups.com\r\nReferences: &lt;5CB1DA918D4C6740BE051BD6FE22F2B452BF1D@...&gt;\t &lt;51d1b2de0701091822w280f4c35t540c6671aa61b54@...&gt;\t &lt;45A52395.7000604@...&gt; &lt;4f7da6b90701110806h130e95b9y701d1a9040eaa475@...&gt;\r\nIn-Reply-To: &lt;4f7da6b90701110806h130e95b9y701d1a9040eaa475@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nReturn-Path: jgunders@...\r\nX-OriginalArrivalTime: 11 Jan 2007 20:39:43.0546 (UTC) FILETIME=[9FDDE1A0:01C735C0]\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: &quot;James P. Gunderson&quot; &lt;jgunders@...&gt;\r\nSubject: Re: [junit] 100%% Method Testing and Generating Unit Tests\r\nX-Yahoo-Group-Post: member; u=193138280; y=6KPdsD1lYdDwCUOBamd_Jaxm3Xpvx9CK5ZlHr5DB85I\r\nX-Yahoo-Profile: jpg3u\r\n\r\nDavid:\n\tWhen I envision a system that would extract my guide, and build the \ntest case into the junit test set for the class I am driven by laziness. \n  I totally agree that in the simplest cases, the difference between the \nguide and a full test case is minimal as you pointed out.  But as the \nnecessary setup and preconfiguration grows in complexity I&#39;d like to be \nable to simply specify a set of inputs and a known correct result, then \nhave the computer do the work.\n\nI really believe in testing, and I always write test cases, but (oh, the \nshame) I don&#39;t really like to spend my time writing tests. So anything \nthat can reduce the hurdles between me and fully tested (both verified \nand validated) is a big win.\n\nI clearly agree with all the benefits you pointed out for generating \ntests from some structured comment format in the code itself. I agree \nwith many of the benefits of writing the tests as java/junit code \ndirectly.  We are not big on test driven design so the benefits of J2 \nare marginal; but we are strongly into test driven development. As a \nresult, being able to quickly and easily specify inputs and outputs for \ntest cases and hang them next to the implementation code would work \nreally well for our development processes, provided that we can then \nextract those guidances into fully functional test cases.  So in the \nspirit of the original &#39;and then the programmer presses a button, and \nall the tests are generated automatically&#39;, a combination of \ncharacterization tests for verification, and developer inserted \nvalidation tests seems like it might cover all the bases.  Clearly this \nis somewhat antithetical to the test driven design paradigm.\n\nI share your concern about domain specific languages so perhaps the \nnotion would be to simply write the assert into the comments (tagged in \na way that the test generator can find it) and then let something like \njunitfactory generate the test:\n\n//** assertEquals(5.0, new Point(0.0).distanceTo(new Point 3,4)); **//\n\nThis is in java/junit, it is clean, it resides in the source code, and \n(with the right tool) whatever extra is needed for the setup can be \nhandled by the generator. So it would seem to get all the benefits you \nlisted, except that tricky J2.  I guess my extreme laziness rose to the \nfore. My first thought was that  by always specifying the inputs and the \noutput, I could avoid the repeated typing of assertEquals(...), and then \nI figured that, since the comment is lexically associated with the \nfunction being tested, there was no need to repeatedly type \ndistanceTo(...), so all that was left was the parameter list and the \nexpected result.\n\nHowever, this is the slippery slope that leads to first, an overly \nspecific DSL; and then (apparently) inevitably a clunky general purpose \nlanguage that can be more trouble than it is worth. But it sure would \nmake my life easier!\n\nThanks for your insight,\nJim\n\nDavid Saff wrote:\n&gt; \n&gt; \n&gt; On 1/10/07, James P. Gunderson &lt;jgunders@... \n&gt; &lt;mailto:jgunders%40gamma-two.com&gt;&gt; wrote:\n&gt;  &gt; So I would have to manually check every\n&gt;  &gt; passing test case to make sure that it was valid. Bummer.\n&gt;  &gt;\n&gt;  &gt; I would need be able to add something like:\n&gt;  &gt;\n&gt;  &gt; //** Test Point(0,0), Point(3,4), 5.0 **//\n&gt;  &gt;\n&gt;  &gt; as a guide to the test generator as to what was expected. Then, in\n&gt;  &gt; addition to all the other valuable verification tests of corner cases,\n&gt;  &gt; etc.; it could generate the validation test.\n&gt; \n&gt; I find myself often tempted to do something like this. But then, I\n&gt; wonder if this is much better than\n&gt; \n&gt; @Test public void pythagoreanDistance() {\n&gt; assertEquals(5.0, new Point(0.0).distanceTo(new Point 3,4));\n&gt; }\n&gt; \n&gt; As I see it, the advantages of generation from comments, as you&#39;re\n&gt; proposing are:\n&gt; G1) The validation code sits close to the implementation code, making\n&gt; it easier to look at both and reason about them\n&gt; G2) Specific behavior examples can sit next to general statements\n&gt; about correct behavior, with the same syntax\n&gt; G3) A custom domain-specific language can reduce typing.\n&gt; \n&gt; The advantages of the JUnit approach are:\n&gt; J1) Java is actually usually a pretty good language for describing the\n&gt; behavior of Java programs (this is not entirely tongue-in-cheek. For\n&gt; example, bash is a rather poor language with which to describe the\n&gt; behavior of shell scripts)\n&gt; J2) When it&#39;s hard to write Java to validate my implementation code,\n&gt; sometimes that means my code has a bad design.\n&gt; J3) Not having to learn a custom domain-specific language reduces \n&gt; cognitive load\n&gt; \n&gt; I currently believe that it&#39;s easier to improve tooling around a\n&gt; JUnit-like framework to get the advantages of code generation than\n&gt; vice-versa. I think that G1, looking at tests and implementation\n&gt; simultaneously, is something that IDE&#39;s can still improve upon\n&gt; tremendously when using JUnit. Ideally, when a test failed, I would\n&gt; automatically be able to see the failure log, the test, and the\n&gt; implementation code in side-by-side windows. My Theories work is\n&gt; designed to bring the G2 advantages to people using JUnit, allowing\n&gt; general statements to be written and evaluated in a JUnit style. As\n&gt; to G3, I&#39;ve yet to see a domain-specific language (DSL) for tests that\n&gt; really excites me*, but I believe that someday I might.\n&gt; \n&gt; None of this touches on the idea of generating characterization tests,\n&gt; as with junitfactory. What I&#39;m getting at is the best way for a\n&gt; developer to write down what the implementation code should do, to get\n&gt; automated support for verifying that it does.\n&gt; \n&gt; Thanks,\n&gt; \n&gt; David Saff\n&gt; \n&gt; * (esoteric side comment) especially since I&#39;m a firm believer that\n&gt; every external DSL maintained long enough eventually becomes a poorly\n&gt; implemented general-purpose OO language. (See ant)\n&gt; \n&gt; \n&gt; \n-- \nJames P. Gunderson, Ph.D.                Cognitive Systems Architect\njgunders@...                   Gamma Two, Inc.\nwww.gamma-two.com             \t\t 303.778.7400\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n&quot;A computer is like an Old Testament god, with a lot of rules and no\nmercy.&quot; -- Joseph Campbell\n\n", 
    "profile": "jpg3u", 
    "topicId": 18605, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 193138280, 
    "prevInTime": 18709, 
    "contentTrasformed": false, 
    "postDate": "1168547940", 
    "canDelete": false, 
    "nextInTopic": 18711, 
    "prevInTopic": 18706, 
    "headers": {
        "inReplyToHeader": "PDRmN2RhNmI5MDcwMTExMDgwNmgxMzBlOTViOXk3MDFkMWE5MDQwZWFhNDc1QG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PDQ1QTZBMDY0LjkwMTA4MDBAZ2FtbWEtdHdvLmNvbT4=", 
        "referencesHeader": "PDVDQjFEQTkxOEQ0QzY3NDBCRTA1MUJENkZFMjJGMkI0NTJCRjFEQGV4Y2hhbmdlLTIuaW50ZXJuYWwuZWxlY3RyaWNzdG9yZXMuY29tPgkgPDUxZDFiMmRlMDcwMTA5MTgyMncyODBmNGMzNXQ1NDBjNjY3MWFhNjFiNTRAbWFpbC5nbWFpbC5jb20+CSA8NDVBNTIzOTUuNzAwMDYwNEBnYW1tYS10d28uY29tPiA8NGY3ZGE2YjkwNzAxMTEwODA2aDEzMGU5NWI5eTcwMWQxYTkwNDBlYWE0NzVAbWFpbC5nbWFpbC5jb20+"
    }
}