{
    "numMessagesInTopic": 1, 
    "nextInTime": 18727, 
    "senderId": "LuuqRRvB2h-FLzlf9w7TWhwXcrr_sZeollOZy4TLZwYoPzTXBR4SQ7soxlFMKCT_F9klrr-ysJVqQPl55MFEaus8Ervi1LJfToU", 
    "systemMessage": true, 
    "subject": "Test Suite Organization Advice", 
    "from": "&quot;gee2funk&quot; &lt;pgumby+yahoo@...&gt;", 
    "authorName": "gee2funk", 
    "msgSnippet": "I am trying to update (re: implement) a suite of tests that have become old and no longer run.  I am using ANT 1.6.2 and JUnit 3.8.1, but I would be willing to", 
    "msgId": 18726, 
    "profile": "gee2funk", 
    "topicId": 18726, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 264581187, 
    "messageBody": "<div id=\"ygrps-yiv-2006216356\">I am trying to update (re: implement) a suite of tests that have<br/>\nbecome old and no longer run.  I am using ANT 1.6.2 and JUnit 3.8.1,<br/>\nbut I would be willing to use JUnit 4 if it would help.  I am fairly<br/>\nnew to JUnit which is why I would like advice on which is the best way<br/>\nI should proceed.<br/>\n<br/>\nMy original attempt to create test suites was to use XDoclet to<br/>\nauto-generate 3 test suites based on category tags (unit, component,<br/>\nsystem).  For instance, UnitSuite would create a test suite that<br/>\ncontained calls to the suite methods of classes with the @... tag.  <br/>\n<br/>\nI would then run the &lt;junit&gt; ant task to execute the UnitSuite,<br/>\nComponentSuite and SystemSuite.  This approach seemed fine until I<br/>\ntried to implement the &lt;junitreport&gt; ant task and found that my<br/>\npackage structure was lost in the HTML report.<br/>\n<br/>\nI have found a few discussions on how to remedy this issue, but they<br/>\nseem rather complex to me.  I believe I have three options as<br/>\nfollows.  Any opinions/advice on any of them is greatly appreciated.<br/>\n<br/>\n1.) Implement a custom test runner, listener and xsl style sheet to<br/>\nformat the output of the tests being run.  The issue I am having with<br/>\nthis is how to break up the test suites and get the information out of<br/>\nthem.<br/>\n<br/>\n2.) Break the categories up into directories so I can tell the &lt;junit&gt;<br/>\ntask to run all tests in a directory structure.  The Unit directory<br/>\nwould contain the package structure of the classes under test and the<br/>\nComponent and System directories would use some custom directories for<br/>\ndescribing the tests they contain.  This is the option I am leaning<br/>\ntowards.<br/>\n<br/>\n3.) Naming conventions for different test categories.  I would not<br/>\nlike to impose such restrictions on the development team.<br/>\n<br/>\nI would love to hear pros and cons for any of these options or if<br/>\nthere are any more I have missed.<br/>\n<br/>\nThanks for taking the time to read this message.<br/>\n<br/>\nPatrick Gombola<br/>\n---------------<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pgumby@...\">pgumby@...</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pgombola@...\">pgombola@...</a></div>", 
    "prevInTime": 18725, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1168552398", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGVvNmJrZStiYWU2QGVHcm91cHMuY29tPg=="
    }
}