{
    "numMessagesInTopic": 1, 
    "nextInTime": 18753, 
    "senderId": "4Cdybx4_SqC6Qw2xQwCebVe626CbpD-_XTLMWYWDZSskxdcnbVf-iTFfhBtw-d-cTyb0pvf3OTGJXTcXwU4gtvWram6ezInfv1o", 
    "systemMessage": false, 
    "subject": "Looking for good presentations of Unit Testing/TDD", 
    "from": "&quot;Mark Levison&quot; &lt;mlevison@...&gt;", 
    "authorName": "Mark Levison", 
    "msgSnippet": "I ve introduced Scrum to several projects at my company (with two more in the way). While the groups that are practicing Scrum are fairly advanced and use unit", 
    "msgId": 18752, 
    "profile": "marklevison", 
    "topicId": 18752, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 190425386, 
    "messageBody": "<div id=\"ygrps-yiv-874095934\">I&#39;ve introduced Scrum to several projects at my company (with two more<br/>\nin the way). While the groups that are practicing Scrum are fairly<br/>\nadvanced and use unit testing (some even do TDD), there is still a<br/>\nbroad community within our organisation that has never even considered<br/>\nUnit Testing/TDD (some even at the bottom of services stack).<br/>\n<br/>\nI&#39;m going to organize a series of lunch and learn sessions to workshop<br/>\nJ.B.&#39;s book and help make unit testing part of the everyday culture.<br/>\nTo kick this off I need a kick ass presentation that will demonstrate<br/>\nthe value of TDD and Unit testing. The goal of the presentation: sell<br/>\npeople on TDD and motivate people to spend 10-12 weeks workshopping<br/>\nthe book at lunch. I was wondering is anyone aware of any<br/>\npresentations that would make a good starting point? Or will I have to<br/>\nwrite my own scratch?<br/>\n<br/>\nMy rough plan<br/>\n  - Discuss the benefits of Unit testing<br/>\n  - Work through a body of existing code, writing tests and<br/>\nrefactoring as we go - demonstrating how unit tests can force us to<br/>\nsimplify our code.<br/>\n<br/>\nIn addition any pointers on how people organise sessions like this<br/>\nwould also help - however I will try to make this as participant<br/>\ndriven as possible.<br/>\n<br/>\nWhat are your favorite presentations? How have you organized lunch and<br/>\nlearn sessions?<br/>\n<br/>\nBTW I have googled on the subject and haven&#39;t found anything of great<br/>\nquality. Before I sink several days of effort I thought I would ask you.<br/>\n<br/>\nThanks<br/>\nMark Levison<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.notesfromatooluser.com/\">http://www.notesfromatooluser.com/</a></div>", 
    "prevInTime": 18751, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1169157592", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGVvb3Frbyt1dHVpQGVHcm91cHMuY29tPg=="
    }
}