{
    "numMessagesInTopic": 25, 
    "nextInTime": 18764, 
    "senderId": "Ys0bhXrH-EJSC_8lDVagDaChbxaKkmqIXRe_fuvJVsfzWZZUqyd4fffLlKrWIIkmiy9uTuiAZ4y2f3Haf4mW_bpg1tb3GhZkE54ZaQ", 
    "systemMessage": false, 
    "subject": "Test genes, test infected rates, and test-resistant managers", 
    "from": "&quot;albsavoia&quot; &lt;albsavoia@...&gt;", 
    "authorName": "albsavoia", 
    "msgSnippet": "I am still surprised that, as we near the 10th, anniversary of JUnit (later this year) developer/unit testing, despite its obvious benefits and the fact that", 
    "msgId": 18763, 
    "rawEmail": "Return-Path: &lt;albsavoia@...&gt;\r\nX-Sender: albsavoia@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 79815 invoked from network); 24 Jan 2007 02:29:38 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m26.grp.scd.yahoo.com with QMQP; 24 Jan 2007 02:29:38 -0000\r\nReceived: from unknown (HELO n16a.bullet.sp1.yahoo.com) (69.147.64.121)\n  by mta1.grp.scd.yahoo.com with SMTP; 24 Jan 2007 02:29:37 -0000\r\nReceived: from [216.252.122.218] by n16.bullet.sp1.yahoo.com with NNFMP; 24 Jan 2007 02:28:51 -0000\r\nReceived: from [66.218.69.1] by t3.bullet.sp1.yahoo.com with NNFMP; 24 Jan 2007 02:28:51 -0000\r\nReceived: from [66.218.66.87] by t1.bullet.scd.yahoo.com with NNFMP; 24 Jan 2007 02:28:51 -0000\r\nDate: Wed, 24 Jan 2007 02:28:50 -0000\r\nTo: junit@yahoogroups.com\r\nMessage-ID: &lt;ep6g92+3k5d@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:6:0:0\r\nFrom: &quot;albsavoia&quot; &lt;albsavoia@...&gt;\r\nSubject: Test genes, test infected rates, and test-resistant managers\r\nX-Yahoo-Group-Post: member; u=174158319; y=Q3fyosm8sS695IGo_22_nuo8QcT6RK1bLemwRGv_4mBe0Ela\r\nX-Yahoo-Profile: albsavoia\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\n\r\n\nI am still surprised that, as we near the 10th, anniversary of JUnit\n(later this year) developer/unit testing, despite its obvious benefits\nand the fact that &quot;it&#39;s the right thing to do&quot;, is still only practiced\nby a minority of developers in a minority of organizations.  And, by\npracticed I mean, SERIOUSLY practiced.  I talk with a lot of groups who\nsay they *do* unit testing but have just a handful of test, rarely run,\nand no consistency, idea of code coverage, etc.\n\nI gave talks on JUnit and the developer testing revolution at two\nJavaOne conferences (2004 and 2006) where I talked about the three\npossible outcomes for the future of developer/unit testing:\n\n\nLong-Term Defeat:  Theidea of developer testing was a noble, notable,\nbut ultimately short-lived blipin the history of software development.\nAlmost all developers went back to the old way of thinking: testing\nisfor QA.\n\n\n\nMinor Victory: Developer testing does not disappear, but it remains a\nnicheactivity.  Practiced only by a devoutminority of test-infected\ndevelopers.\n\n\n\nMajor Victory: Developer testing becomes a standardsoftware development\npractice.  The rule,instead of the exception.  Releasingsoftware without\nunit/developer testing is as unthinkable as releasing softwarewithout\nQA.\n\nI am rooting, of course, for the major victory, but I am starting to\nhave my doubts, and wondering why progress is so slow.  Below is my\nanalysis of what I believe is happening and I&#39;d be very interested in\nyour opinion.\n\nIn the past few years, I&#39;ve noticed that some developers are easily\n&quot;test-infected&quot;, others require longer exposure and some encouragement\nbut eventually &quot;get it&quot; , and one group seems to have a built-in\nimmunity.\n\nIt&#39;s as if there are 3 basic types of test genes:\n\nT1 - Very susceptpible to test infection.  Show them a single JUnit\nexample and they get it immediately - and start using it regularly and\nwith great fervor.  When time pressure hits, they fight hard for enough\ntime to test and would rather quit than produce code without tests. \nThey often have framed pictures of Kent Beck on their desk :-).\n\nT2 - Somewhat susceptible to test infection.  Show them how to use\nJUnit/TDD, give them some encouragement and time to appreciate the\nbenefits and rewards; eventually they will become regular users.  When\ntime pressure hits, however, they often revert to no-test mode without\ntoo much kicking and screaming.\n\nT3 -  Immune to test infection. There&#39;s no amount of showing and\nconvincing that will get them to practice developer testing on their own\nwith any regularity - if at all.  Many of them would rather quit than\nhave to write tests on a regular basis.\n\nI would love to be able to say that these genes are somewhat evenly\ndistributed.  A rough Gaussian distribution.  Something like this:\n\nT1: 30%\nT2: 40%\nT3: 30%\n\nBut my experience is that developers with the T3 gene outnumber the\ncombined number of those with T2 and T1 gene.\n\nThis spells trouble because I have also found that when developers\nbecome managers they bring with them their attitudes toward developer\ntesting.  And a T3 manager is not going to provide an environment where\nthe T2 (the ones that require some time and encouragement) can become\ntest infected.   And this might explain why developer testing is still\npracticed by a minority of developers in a minority of organizations.\n\nFeedback?\n\nAlberto\n\nhttp://www.junitfactory.com\nGenerate JUnit tests. Free.\nSend us Java. Get back JUnit.\n\n\n\n\n\n\n\n[Non-text portions of this message have been removed]\n\n\n", 
    "profile": "albsavoia", 
    "topicId": 18763, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174158319, 
    "prevInTime": 18762, 
    "contentTrasformed": false, 
    "postDate": "1169605730", 
    "canDelete": false, 
    "nextInTopic": 18770, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGVwNmc5MiszazVkQGVHcm91cHMuY29tPg=="
    }
}