{
    "numMessagesInTopic": 25, 
    "nextInTime": 18774, 
    "senderId": "Z3GK-LvfST94DNJ-SPRw8iBpAqETN1iYKPMNIp1Wfy0rhqNtcDefc71M3vSS5B880Li5J6CqPWu6xSN6rZDn-3iEziE", 
    "systemMessage": false, 
    "subject": "Re: Test genes, test infected rates, and test-resistant managers", 
    "from": "&quot;ponczak&quot; &lt;ponczak@...&gt;", 
    "authorName": "ponczak", 
    "msgSnippet": "... even ... across ... TDD. ... metric). ... Alberto, It does seem that unit testing is still in the early adopter stage. Developers and managers that I", 
    "msgId": 18773, 
    "profile": "ponczak", 
    "topicId": 18763, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 220031274, 
    "messageBody": "<div id=\"ygrps-yiv-604927911\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;albsavoia&quot; &lt;albsavoia@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;gabrielcooper&quot; gabriel.cooper@ wrote:<br/>\n&gt; ...<br/>\n&gt; &gt; TDD may have a place in every organization, but IMHO in some the<br/>\n&gt; &gt; amount of work required to implement it is monumental and perhaps<br/>\n </span></blockquote>even<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; prohibitive. If your codebase is dozens of 1000 line files of<br/>\n&gt; &gt; function-less spaghetti code maintained by mulitple programmers<br/>\n </span></blockquote>across<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; multiple teams in various geographical locations... You (and your<br/>\n&gt; &gt; organization) have a lot of work ahead of you before you can push<br/>\n </span></blockquote>TDD.<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;...<br/>\n&gt;<br/>\n&gt; Hi Gabriel.<br/>\n&gt;<br/>\n&gt; Just to be clear, I was not restricting my argument to TDD infection.<br/>\n&gt; I believe that the TDD1 gene, let&#39;s call it that, is considerably more<br/>\n&gt; rare than the T1 gene. At this point in time I&#39;d be thrilled to see<br/>\n&gt; the majority of developers writing and running unit tests on a regular<br/>\n&gt; basis; whether they write them before, during, or after the code is<br/>\n&gt; done. At this stage of the game test-first is less important than<br/>\n&gt; having the tests in the first place - gotta walk before you run.<br/>\n&gt;<br/>\n&gt; I agree that most projects out there consist of 1,000s of classes with<br/>\n&gt; no tests.  I love Michael Feathers&#39;s definition: code without tests ==<br/>\n&gt; legacy code.  This definition makes 95%+ of Java code legacy code.<br/>\n&gt; &quot;Legacy code, is not just COBOL anymore&quot; :-).<br/>\n&gt;<br/>\n&gt; Seriously, I can, and do, sympathize that sometimes the task looks<br/>\n&gt; &quot;monumental and even prohibitive&quot;. But only if you think that you have<br/>\n&gt; to go from zero tests to 1,000s of tests right away.  I don&#39;t know why<br/>\n&gt; many people think in terms of all-or-nothing when it comes to testing.<br/>\n&gt; You have to start somewhere, and something is better than nothing.<br/>\n&gt; 10,000 Java classes and 1 JUnit test is better than 10,000 Java<br/>\n&gt; classes and 0 JUnit tests.  2 tests are better than 1, and so<br/>\n&gt; forth.  And look at the bright side, at least those 2 tests will run<br/>\n&gt; quickly.<br/>\n&gt;<br/>\n&gt; If you are stuck in a project like the one you describe, it&#39;s probably<br/>\n&gt; counter-motivating to even look at metrics like<br/>\n&gt; numberOfTests/numberOfClasses, or code coverage: &quot;Hey, we achieved 5%<br/>\n&gt; code coverage. Where&#39;s the Champagne?&quot;.  Instead focus on the absolute<br/>\n&gt; number of tests (a simple, positive, monotonically growing test<br/>\n </span></blockquote>metric).<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; While the &quot;monumental pile of untested spaghetti code&quot; does not help,<br/>\n&gt; I believe a lot of people just use that as an excuse to not get<br/>\n&gt; started. I have seen developers rejecting regular unit testing even in<br/>\n&gt; greenfield projects, so there is something more fundamental at play.<br/>\n&gt;<br/>\n&gt; Alberto<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.junitfactory.com\">http://www.junitfactory.com</a><br/>\n&gt; Generate JUnit tests. Free.<br/>\n&gt; Send us Java. Get back JUnit.<br/>\n&gt;<br/>\n </span></blockquote>Alberto,<br/>\nIt does seem that unit testing is still in the &#39;early adopter&#39; stage.  <br/>\nDevelopers and managers that I talk to and work with  understand the<br/>\nbenefits to unit testing, metrics, coverage, CI, ... but do not adopt<br/>\nthem consistently on their projects.<br/>\n<br/>\nI do believe that unit testing is very much a market-driven event and I<br/>\nsay that because of all the opinions I have heard. Most of the people I<br/>\nhave talked to completely agree with the benefits of unit testing and<br/>\nTDD *in theory*, but do not implement a solution because of pressure<br/>\nfrom investors, customers or other market factors.  After all, isn&#39;t all<br/>\nsoftware buggy?<br/>\n<br/>\nThere are enough studies to show people the value of a good unit testing<br/>\nprogram (TDD or not). There are also studies that show high risk may<br/>\nresult in high reward, which unit testing can possibly hinder.<br/>\n<br/>\nI may be reaching here, but the question in my mind revolves around the<br/>\n&#39;event&#39; that will change people&#39;s mind.  The plublicized class action<br/>\nlawsuit against a software company because of a major defect (security,<br/>\nlogic, whatever) will open the floodgates especially since membership in<br/>\nthe ABA Law Group has experienced exponential growth.  Lawyers have to<br/>\ndo something, right :)<br/>\n<br/>\nYou started an interesting thread, and I look forward to the other<br/>\nresponses.<br/>\n<br/>\nJoe<br/>\n<br/>\nwww.codign.com</div>", 
    "prevInTime": 18772, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1169691619", 
    "canDelete": false, 
    "nextInTopic": 18781, 
    "prevInTopic": 18772, 
    "headers": {
        "inReplyToHeader": "PGVwOG5xYys5b2IyQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGVwOTQ1MytwazgzQGVHcm91cHMuY29tPg=="
    }
}