{
    "numMessagesInTopic": 25, 
    "nextInTime": 18771, 
    "senderId": "AZ5AamibhjBUJcRMeG5X5cBstt_5ula27ciOZ-TYS_cre8D430pszJDMgoYR2pNm77n-VqH8DkHM-jmG2kEJg3l2ifb5tdEyfGGkaD09ew", 
    "systemMessage": false, 
    "subject": "Re: Test genes, test infected rates, and test-resistant managers", 
    "from": "&quot;gabrielcooper&quot; &lt;gabriel.cooper@...&gt;", 
    "authorName": "gabrielcooper", 
    "msgSnippet": "... Keeping in mind you re preaching to the choir... ;-) TDD may have a place in every organization, but IMHO in some the amount of work required to implement", 
    "msgId": 18770, 
    "profile": "gabrielcooper", 
    "topicId": 18763, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 294114387, 
    "messageBody": "<div id=\"ygrps-yiv-1666697181\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;albsavoia&quot; &lt;albsavoia@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; I am still surprised that, as we near the 10th, anniversary of JUnit<br/>\n&gt; (later this year) developer/unit testing, despite its obvious benefits<br/>\n&gt; and the fact that &quot;it&#39;s the right thing to do&quot;, is still only practiced<br/>\n&gt; by a minority of developers in a minority of organizations.  And, by<br/>\n&gt; practiced I mean, SERIOUSLY practiced.  I talk with a lot of groups who<br/>\n&gt; say they *do* unit testing but have just a handful of test, rarely run,<br/>\n&gt; and no consistency, idea of code coverage, etc.<br/>\n<br/>\n </span></blockquote>Keeping in mind you&#39;re preaching to the choir... ;-)<br/>\n<br/>\nTDD may have a place in every organization, but IMHO in some the<br/>\namount of work required to implement it is monumental and perhaps even<br/>\nprohibitive. If your codebase is dozens of 1000 line files of<br/>\nfunction-less spaghetti code maintained by mulitple programmers across<br/>\nmultiple teams in various geographical locations... You (and your<br/>\norganization) have a lot of work ahead of you before you can push TDD. <br/>\n<br/>\nWith that in mind, /starting/ effective code testing becomes the<br/>\nhardest part, especially if nobody on your team--or even entire<br/>\ncompany--has experience with unit testing. Further, if your codebase<br/>\nisn&#39;t one that lends itself to testing, the programmers that developed<br/>\nit probably need coding guidance before their code will be able to be<br/>\neffectively tested.<br/>\n<br/>\nFollowing another thread of thought... <br/>\n<br/>\nTDD relies on &quot;Type 1&quot; people, as you called them (those that actively<br/>\nchampion TDD). Mentors. Champions. Zealots. It&#39;s amazing (and<br/>\nsometimes scary, depending on context...) how receptive people are to<br/>\nguidance from those that simply demand to be listened to. <br/>\n<br/>\nIf you&#39;re in an environment where TDD is not used/respected, do it<br/>\nanyway, but not in a vacuum. Talk about it and mentor others in<br/>\nunderstanding how to effectively write tests and /testable code/.<br/>\nFurther, demand that those around you do as well. Bring it up in<br/>\nmeetings. Admit your &quot;failures&quot;--when your code fails your own unit<br/>\ntests. Count the number of times this happens. When bugs come up in<br/>\napps, &quot;remind&quot; the programmer fixing it to &quot;be sure to write a unit<br/>\ntest for this so it doesn&#39;t happen again.&quot;<br/>\n<br/>\nIf you&#39;re interested in the big picture, identify those programmers<br/>\nyou think are most likely to leave your work environment and make sure<br/>\nthey understand and follow unit testing practices, knowing they&#39;ll be<br/>\nthe champion of unit testing (if not TDD) at the next place they go to.<br/>\n<br/>\nGabriel.</div>", 
    "prevInTime": 18769, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1169655812", 
    "canDelete": false, 
    "nextInTopic": 18772, 
    "prevInTopic": 18763, 
    "headers": {
        "inReplyToHeader": "PGVwNmc5MiszazVkQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGVwODE2NCtwY2hoQGVHcm91cHMuY29tPg=="
    }
}