{
    "numMessagesInTopic": 25, 
    "nextInTime": 18799, 
    "senderId": "oIOwr8iI1Xe0FWiBQ7lz5AJNeDR0Od_c36auftgUC0vVZuULM4z5XTP5xYkjE-wY9TbZEcumJSzl0mj2E8CaOALp", 
    "systemMessage": false, 
    "subject": "Re: [junit] Test genes, test infected rates, and test-resistant managers", 
    "from": "&quot;David Saff&quot; &lt;saff@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "One missing link: 1) All Objects of a given type that are .equals should return equal .hashCodes  Well, here s my self-plug.  This statement could be handled", 
    "msgId": 18798, 
    "profile": "dsaff", 
    "topicId": 18763, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 139771899, 
    "messageBody": "<div id=\"ygrps-yiv-55327635\">One missing link:<br/>\n<br/>\n1) &quot;All Objects of a given type that are .equals should return equal<br/>\n.hashCodes&quot;  Well, here&#39;s my self-plug.  This statement could be<br/>\nhandled by a Theory runner, like Marat and I described at<br/>\n<br/>\nhttp://shareandenjoy.saff.net/2006/12/new-paper-practice-of-theories.html<br/>\n<br/>\nThanks,<br/>\n<br/>\n   David Saff<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 1/29/07, David Saff &lt;saff@...&gt; wrote:<br/>\n&gt; Alberto,<br/>\n&gt;<br/>\n&gt; There are all sorts of things that keep developers from testing their<br/>\n&gt; own code, and you touched on some of them.  Here&#39;s some other<br/>\n&gt; thoughts, mostly around the technology for testing.<br/>\n&gt;<br/>\n&gt; Many developers like the idea of testing their own code, but just<br/>\n&gt; don&#39;t see how they can in their particular situation.  One of the most<br/>\n&gt; gratifying moments I&#39;ve had as a consultant was being able to go from<br/>\n&gt; bug report to failing acceptance test to failing unit test to code fix<br/>\n&gt; to passing unit test to passing acceptance test to check-in to bug<br/>\n&gt; fixed in about 20-30 minutes while my team-mates watched on a<br/>\n&gt; projector.  This kick-started a lot of interest in developer testing,<br/>\n&gt; and TDD, that hadn&#39;t been there before.  As a matter of fact, my first<br/>\n&gt; meeting with the team had actually contained the exchange:<br/>\n&gt;<br/>\n&gt; &quot;You can&#39;t test that&quot;<br/>\n&gt; &quot;If you watch, I&#39;ll show how we could...&quot;<br/>\n&gt; &quot;No, you can&#39;t&quot;<br/>\n&gt; &quot;Yes, we can!&quot;<br/>\n&gt;<br/>\n&gt; It took about a month and several dozen bug fixes (client-facing bugs,<br/>\n&gt; mind you) to get familiar with each other and patch up the design for<br/>\n&gt; testability before the above could happen.  This would have been a<br/>\n&gt; big, risky investment, if the manager hadn&#39;t bought in to the idea<br/>\n&gt; beforehand.  Ironically, for someone familiar with the wider landscape<br/>\n&gt; of software methodology, some teams are simply too focused on<br/>\n&gt; incremental results to justify that kind of Big Cleanup Up Front.<br/>\n&gt; What can we do for them?  I&#39;d like to see tools that move us toward a<br/>\n&gt; world where if you can easily think it, you can easily write the test.<br/>\n&gt;  What kinds of things can I easily think, but not easily test?<br/>\n&gt;<br/>\n&gt; 1) &quot;All Objects of a given type that are .equals should return equal<br/>\n&gt; .hashCodes&quot;  Well, here&#39;s my self-plug.  This statement could be<br/>\n&gt; handled by a Theory runner, like Marat and I described at<br/>\n&gt;<br/>\n&gt; 2) &quot;This package should have the same behavior today that it did when<br/>\n&gt; we released version 3.2.&quot;  We&#39;re getting there.  JUnitFactory<br/>\n&gt; (http://www.junitfactory.com) does a good job of generating JUnit<br/>\n&gt; tests where none exist.  If you generate tests on version 3.2, you can<br/>\n&gt; run them on today&#39;s version, and catch a lot of regressions.  [Full<br/>\n&gt; disclosure: I&#39;m a research fellow at Agitar, which produces JUnit<br/>\n&gt; Factory.  It&#39;s still very cool.]<br/>\n&gt;<br/>\n&gt; 3) &quot;During debugging, I noticed that thisUser.password was null.  It<br/>\n&gt; should have been &#39;myPassword&#39;, instead.&quot;  There are research debuggers<br/>\n&gt; that allow statements like this to be built and verified, but we&#39;re<br/>\n&gt; still waiting for them to reach the mainstream.<br/>\n&gt;<br/>\n&gt; 4) &quot;I can&#39;t call my code directly without an packagex.HttpContext and<br/>\n&gt; a packagex.UserSession and a...&quot;  This is possibly the biggest failing<br/>\n&gt; of library and framework providers today.  The ability to test code<br/>\n&gt; that depends on Package X is an important part of Package X&#39;s<br/>\n&gt; functionality, but it far too often is left to the developer of the<br/>\n&gt; package&#39;s client programs to create a testing harness, often with a<br/>\n&gt; lot of work.  Ruby on Rails ships with a built-in testing framework,<br/>\n&gt; which I think has part of the success of the framework itself and its<br/>\n&gt; integrators.  Ditto for Eclipse&#39;s plug-in development environment.  In<br/>\n&gt; my experience so far, Java web frameworks are way behind in this, but<br/>\n&gt; I&#39;d be happy to find out that there is a framework that ships with a<br/>\n&gt; usable test framework.  However, I think we can go even farther<br/>\n&gt; here--these frameworks are both better suited to acceptance tests than<br/>\n&gt; isolated unit tests.<br/>\n&gt;<br/>\n&gt; In the end, I think that if developer testing scores a Major Victory,<br/>\n&gt; it may end up being a developer-driven victory, more like version<br/>\n&gt; control or automated builds, rather than a manager-driven victory,<br/>\n&gt; like QA (of course an over-simplification).<br/>\n&gt;<br/>\n&gt;    David Saff<br/>\n&gt;<br/>\n&gt; On 1/23/07, albsavoia &lt;albsavoia@...&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; I am still surprised that, as we near the 10th, anniversary of JUnit<br/>\n&gt; &gt; (later this year) developer/unit testing, despite its obvious benefits<br/>\n&gt; &gt; and the fact that &quot;it&#39;s the right thing to do&quot;, is still only practiced<br/>\n&gt; &gt; by a minority of developers in a minority of organizations.  And, by<br/>\n&gt; &gt; practiced I mean, SERIOUSLY practiced.  I talk with a lot of groups who<br/>\n&gt; &gt; say they *do* unit testing but have just a handful of test, rarely run,<br/>\n&gt; &gt; and no consistency, idea of code coverage, etc.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I gave talks on JUnit and the developer testing revolution at two<br/>\n&gt; &gt; JavaOne conferences (2004 and 2006) where I talked about the three<br/>\n&gt; &gt; possible outcomes for the future of developer/unit testing:<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Long-Term Defeat:  Theidea of developer testing was a noble, notable,<br/>\n&gt; &gt; but ultimately short-lived blipin the history of software development.<br/>\n&gt; &gt; Almost all developers went back to the old way of thinking: testing<br/>\n&gt; &gt; isfor QA.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Minor Victory: Developer testing does not disappear, but it remains a<br/>\n&gt; &gt; nicheactivity.  Practiced only by a devoutminority of test-infected<br/>\n&gt; &gt; developers.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Major Victory: Developer testing becomes a standardsoftware development<br/>\n&gt; &gt; practice.  The rule,instead of the exception.  Releasingsoftware without<br/>\n&gt; &gt; unit/developer testing is as unthinkable as releasing softwarewithout<br/>\n&gt; &gt; QA.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I am rooting, of course, for the major victory, but I am starting to<br/>\n&gt; &gt; have my doubts, and wondering why progress is so slow.  Below is my<br/>\n&gt; &gt; analysis of what I believe is happening and I&#39;d be very interested in<br/>\n&gt; &gt; your opinion.<br/>\n&gt; &gt;<br/>\n&gt; &gt; In the past few years, I&#39;ve noticed that some developers are easily<br/>\n&gt; &gt; &quot;test-infected&quot;, others require longer exposure and some encouragement<br/>\n&gt; &gt; but eventually &quot;get it&quot; , and one group seems to have a built-in<br/>\n&gt; &gt; immunity.<br/>\n&gt; &gt;<br/>\n&gt; &gt; It&#39;s as if there are 3 basic types of test genes:<br/>\n&gt; &gt;<br/>\n&gt; &gt; T1 - Very susceptpible to test infection.  Show them a single JUnit<br/>\n&gt; &gt; example and they get it immediately - and start using it regularly and<br/>\n&gt; &gt; with great fervor.  When time pressure hits, they fight hard for enough<br/>\n&gt; &gt; time to test and would rather quit than produce code without tests.<br/>\n&gt; &gt; They often have framed pictures of Kent Beck on their desk :-).<br/>\n&gt; &gt;<br/>\n&gt; &gt; T2 - Somewhat susceptible to test infection.  Show them how to use<br/>\n&gt; &gt; JUnit/TDD, give them some encouragement and time to appreciate the<br/>\n&gt; &gt; benefits and rewards; eventually they will become regular users.  When<br/>\n&gt; &gt; time pressure hits, however, they often revert to no-test mode without<br/>\n&gt; &gt; too much kicking and screaming.<br/>\n&gt; &gt;<br/>\n&gt; &gt; T3 -  Immune to test infection. There&#39;s no amount of showing and<br/>\n&gt; &gt; convincing that will get them to practice developer testing on their own<br/>\n&gt; &gt; with any regularity - if at all.  Many of them would rather quit than<br/>\n&gt; &gt; have to write tests on a regular basis.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I would love to be able to say that these genes are somewhat evenly<br/>\n&gt; &gt; distributed.  A rough Gaussian distribution.  Something like this:<br/>\n&gt; &gt;<br/>\n&gt; &gt; T1: 30%<br/>\n&gt; &gt; T2: 40%<br/>\n&gt; &gt; T3: 30%<br/>\n&gt; &gt;<br/>\n&gt; &gt; But my experience is that developers with the T3 gene outnumber the<br/>\n&gt; &gt; combined number of those with T2 and T1 gene.<br/>\n&gt; &gt;<br/>\n&gt; &gt; This spells trouble because I have also found that when developers<br/>\n&gt; &gt; become managers they bring with them their attitudes toward developer<br/>\n&gt; &gt; testing.  And a T3 manager is not going to provide an environment where<br/>\n&gt; &gt; the T2 (the ones that require some time and encouragement) can become<br/>\n&gt; &gt; test infected.   And this might explain why developer testing is still<br/>\n&gt; &gt; practiced by a minority of developers in a minority of organizations.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Feedback?<br/>\n&gt; &gt;<br/>\n&gt; &gt; Alberto<br/>\n&gt; &gt;<br/>\n&gt; &gt; http://www.junitfactory.com<br/>\n&gt; &gt; Generate JUnit tests. Free.<br/>\n&gt; &gt; Send us Java. Get back JUnit.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Yahoo! Groups Links<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 18797, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1170104375", 
    "canDelete": false, 
    "nextInTopic": 18799, 
    "prevInTopic": 18797, 
    "headers": {
        "inReplyToHeader": "PDRmN2RhNmI5MDcwMTI5MTI1N2s1ODM0N2NmN3BkMGRkOGY5NzQ1NzRlNjdkQG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PDRmN2RhNmI5MDcwMTI5MTI1OXYzMzBhOWM5ZnYzZGQ4NzhiNGIzYTE1YWE0QG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PGVwNmc5MiszazVkQGVHcm91cHMuY29tPgkgPDRmN2RhNmI5MDcwMTI5MTI1N2s1ODM0N2NmN3BkMGRkOGY5NzQ1NzRlNjdkQG1haWwuZ21haWwuY29tPg=="
    }
}