{
    "numMessagesInTopic": 5, 
    "nextInTime": 189, 
    "senderId": "zUqxm_YRBAckKzuQOCue_vUL7NhAUpz01bOVfWmJQQqoNecHihqGUYT3yYSNnvGwrVpyVktig2zPQvLDvFAuyteCvFyaMk_M", 
    "systemMessage": false, 
    "subject": "Re: [junit] Digest Number 43", 
    "from": "&quot;Steve Freeman&quot; &lt;steve@...&gt;", 
    "authorName": "Steve Freeman", 
    "msgSnippet": "... Are the 100 separate test cases really impractical? Can you refactor your test code to make new tests easy to write? Perhaps writing several test classes", 
    "msgId": 188, 
    "topicId": 188, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1425988738\"><blockquote><span title=\"ireply\">&gt; The motivation for this extension is that most test cases \r<br/>\n&gt; contain a whole bunch of assertions following the code \r<br/>\n&gt; that is being tested.  I am actually writing several hundred \r<br/>\n&gt; test cases for code written by someone else - working \r<br/>\n&gt; this way it makes much more sense to test a feature to \r<br/>\n&gt; death in a single test case rather than writing a separate \r<br/>\n&gt; test case for each aspect of a feature.  I have test cases \r<br/>\n&gt; that include 100 assertions with up to like 80 failures \r<br/>\n&gt; (I currently have to comment out lines containing failures \r<br/>\n&gt; in order to continue processing).  Writing 100 separate \r<br/>\n&gt; test cases would not be practical and would actually \r<br/>\n&gt; make the test results harder to interpret.\r<br/>\n\r<br/>\n </span></blockquote>Are the 100 separate test cases really impractical? Can you refactor your test code to make new tests easy to write? Perhaps writing several test classes to cover different aspects of the target code? The test-per-method makes things very obvious, gives you somewhere to put a name for the test and can be easier to manage as your code evolves.\r<br/>\n\r<br/>\nSteve</div>", 
    "prevInTime": 187, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "978648324", 
    "canDelete": false, 
    "nextInTopic": 189, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDAwNjMwMWMwNzZhMCQxNzViYTFlMCQwMTgwYTRjMEBnYXRld2F5Pg==", 
        "referencesHeader": "PDk3ODYzMzI4Mi40Mjk3QGVncm91cHMuY29tPg=="
    }
}