{
    "numMessagesInTopic": 51, 
    "nextInTime": 18916, 
    "senderId": "hXvCuqg-geGsnV1RsAhEgFqund8ihkOowjLZxBEcQiKXkS6QuxQ085QZZ4ZJfS2Fu_hNA_DGgrqOFPczX3Ae7g53g5HJRZTUJqlCbuWL_Zebag", 
    "systemMessage": false, 
    "subject": "Re: [junit] Future of testing tools", 
    "from": "Michael Feathers &lt;mfeathers@...&gt;", 
    "authorName": "Michael Feathers", 
    "msgSnippet": "A while ago, I saw something that looks like it has a place in the future.  It was a demo of a programming environment called Subtext. Subtext is really the", 
    "msgId": 18915, 
    "profile": "mfeathers256", 
    "topicId": 18842, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 78021826, 
    "messageBody": "<div id=\"ygrps-yiv-228088940\">A while ago, I saw something that looks like it has a place in the <br/>\nfuture.  It was a demo of a programming environment called Subtext.<br/>\n<br/>\nSubtext is really the intersection of a bunch of different ideas, but <br/>\nthe key one, at least regarding testing and TDD, is that environments <br/>\ncan really give us much more information than they do currently.  In <br/>\nSubtext, your program is represented in little graphic elements that are <br/>\nsort of like the cells in a spreadsheet.  The cool part is that as you <br/>\nmanipulate your program, it is continually working on visible example <br/>\nvalues.  They change as you change your code in much the same way that a <br/>\nspreadsheet recalculates.<br/>\n<br/>\nTo me, it seems that this is a really a great idea to pursue.  When we <br/>\ndo TDD, one of the benefits is the immediacy of feedback.  We type a <br/>\ntest, we press a button and see it fail, we write some code and see it <br/>\npass.  With one of these &#39;immediate&#39; environments, you are working on <br/>\nexamples the whole time, so it brings feedback to another level.  I <br/>\nsuppose that example values could be captured as invariants (tests) as <br/>\nyou write your code.<br/>\n<br/>\nJohn Edwards (the guy behind Subtext) has a set of demos here: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://subtextual.org/\">http://subtextual.org/</a><br/>\nHere&#39;s a good one to start with: <a rel=\"nofollow\" target=\"_blank\" href=\"http://subtextual.org/demo1.html\">http://subtextual.org/demo1.html</a><br/>\n<br/>\nAt this point, Subtext is science fiction.  It&#39;s demo stage only.  <br/>\nJohn&#39;s playing with the ideas and trying to get people interested in <br/>\nthem.  But it&#39;s well worth a look.<br/>\n<br/>\nIn general, I think it would be great to see environments which give us <br/>\nmuch more information about our programs.  Another example.. a while ago <br/>\nI was talking to Ivan Moore (of Jester fame) and he was saying that he <br/>\nhad an idea for a tool that would go through your Java code and <br/>\n&#39;privitize&#39; it; that is, make all methods private that could be <br/>\nprivate.  In the spirit of the thing he was thinking of calling it <br/>\nThatcher :-)  We were talking about it with a few other people who, like <br/>\nme, are very annoyed by the fact that private gets in the way when its <br/>\nin someone else&#39;s mangled code and you don&#39;t have the opportunity to <br/>\npeel it off, and we thought, well, wouldn&#39;t it be nice if your <br/>\nenvironment just told you which methods weren&#39;t used elsewhere in the <br/>\nsystem?  Sort of, &quot;this one could be private if you wanted it to be.&quot;<br/>\n<br/>\nTDD has this neat emotional feel..  you work in little transactions with <br/>\nthe code.. and you get a lot of feedback.  I think that there are more <br/>\nopportunities for that sort of feedback if we make our environments smarter.<br/>\n<br/>\nMichael Feathers<br/>\nwww.objectmentor.com</div>", 
    "prevInTime": 18914, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1171462375", 
    "canDelete": false, 
    "nextInTopic": 18926, 
    "prevInTopic": 18913, 
    "headers": {
        "inReplyToHeader": "PDU4ODkzMC41OTA3MC5xbUB3ZWI2MDcyMy5tYWlsLnlhaG9vLmNvbT4=", 
        "messageIdInHeader": "PDQ1RDMxOEU3LjIwMTA3MDlAbWluZHNwcmluZy5jb20+", 
        "referencesHeader": "PDU4ODkzMC41OTA3MC5xbUB3ZWI2MDcyMy5tYWlsLnlhaG9vLmNvbT4="
    }
}