{
    "numMessagesInTopic": 51, 
    "nextInTime": 18928, 
    "senderId": "EFA8lQuFecQevV8qIiriozjHrbvtlsbkMUzAXNP93dVV32JMaBN4ThQDqJ2r8FS2fUSDCmyWky6498eeE72nMgma-NkC76VFo__DKA", 
    "systemMessage": true, 
    "subject": "Re: Future of testing tools", 
    "from": "&quot;Gilles Scokart&quot; &lt;gscokart@...&gt;", 
    "authorName": "Gilles Scokart", 
    "msgSnippet": "For me there are some areas where testing tools could do more. The first area is the integration in the IDE.  I would like to have quickly an overview of the", 
    "msgId": 18927, 
    "profile": "gscokart", 
    "topicId": 18842, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 298263068, 
    "messageBody": "<div id=\"ygrps-yiv-63276354\">For me there are some areas where testing tools could do more.<br/>\n <br/>\nThe first area is the integration in the IDE.  I would like to have<br/>\nquickly an overview of the test of the selected object.<br/>\nFor example in eclipse, we can have an overview of a class that we are<br/>\nusing.  We should have similar shortcut to view the tests (maybe with<br/>\nsome descriptions?)<br/>\n<br/>\n <br/>\nA second area concerns the creation of test values.  In some domain,<br/>\nit is not unusual to have functions taking very &#39;long&#39; value object as<br/>\ninput.  Some might argue that it should be avoided, but it is not<br/>\nalways possible.  A good example where that can&#39;t be avoided is the<br/>\ntest of business rules in the insurance domain.  An insurance contract<br/>\ncontains really a lot of data, and the business rules often use<br/>\ntotally unrelated part of the contract.<br/>\nFor such a case, I would like to have a very simple editor to easily<br/>\nedit the test value and store them into a file.  I think that some<br/>\nadapted &quot;bean editors&quot; could do that, but I don&#39;t know if anybody has<br/>\nalready experiment this aproach.<br/>\n<br/>\n <br/>\nFinally, my last &quot;dream&quot; is probably much less clear than the two<br/>\nprevious points, and certainly more complex.<br/>\nI would like to see TDD colaborates with design by contract to give an<br/>\nintermediate aproach taking the best of the two world.<br/>\nI would like to be able to define somehow the contract of an<br/>\ninterface, and I would like to have this contract validated when I run<br/>\nthe test, and that even when I stub or mock the object.  I&#39;m convinced<br/>\nthat would allow to write more powerful tests that would be less brillant.<br/>\nAnd ho, I forgot! My dream is to see that in java. :-)<br/>\n<br/>\n<br/>\nRegards,<br/>\nGilles<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;Kent Beck&quot; &lt;kentb@...&gt; wrote:<br/>\n&gt; <br/>\n&gt; One thing missing from the discussion was much talk about the hopes and<br/>\n&gt; dreams of users, so I thought I would open up the question here.<br/>\nWhat is it<br/>\n&gt; you wish your testing tool would do for you that it doesn&#39;t? </span></blockquote></div>", 
    "prevInTime": 18926, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1171614408", 
    "canDelete": false, 
    "nextInTopic": 18941, 
    "prevInTopic": 18926, 
    "headers": {
        "messageIdInHeader": "PGVyM3BzOCtpdTJmQGVHcm91cHMuY29tPg=="
    }
}