{
    "numMessagesInTopic": 7, 
    "nextInTime": 18946, 
    "senderId": "5axjSuMInpXzmNEDXZkDEGM7BYoFzhyesV-v0146MbR7mfX67g1H6nEWUvsaMFy15OwylCFv-DA_Sd-cfrusbCxTxLkz45gP9F75dypg2E-2", 
    "systemMessage": false, 
    "subject": "Re: [junit] additional expenses", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains762@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... Many people have said there is no clear answer , and I agree. Instead, let me offer you a few variables to consider when guessing about the time you ll", 
    "msgId": 18945, 
    "rawEmail": "Return-Path: &lt;jbrains762@...&gt;\r\nX-Sender: jbrains762@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 28402 invoked from network); 19 Feb 2007 22:38:04 -0000\r\nReceived: from unknown (66.218.66.72)\n  by m34.grp.scd.yahoo.com with QMQP; 19 Feb 2007 22:38:04 -0000\r\nReceived: from unknown (HELO chilco.textdrive.com) (207.7.108.242)\n  by mta14.grp.scd.yahoo.com with SMTP; 19 Feb 2007 22:38:04 -0000\r\nReceived: from [192.168.1.113] (CPE000cf1c2033e-CM0012c9daf7de.cpe.net.cable.rogers.com [74.102.135.232])\n\tby chilco.textdrive.com (Postfix) with ESMTP id 182A8DCB1B\n\tfor &lt;junit@yahoogroups.com&gt;; Mon, 19 Feb 2007 22:37:52 +0000 (UTC)\r\nMessage-ID: &lt;45DA26B8.5000400@...&gt;\r\nDate: Mon, 19 Feb 2007 17:37:44 -0500\r\nUser-Agent: Thunderbird 1.5.0.9 (Macintosh/20061207)\r\nMIME-Version: 1.0\r\nTo: junit@yahoogroups.com\r\nReferences: &lt;er41bp+o5io@...&gt;\r\nIn-Reply-To: &lt;er41bp+o5io@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: &quot;J. B. Rainsberger&quot; &lt;jbrains762@...&gt;\r\nSubject: Re: [junit] additional expenses\r\nX-Yahoo-Group-Post: member; u=282027414; y=1mGrAQRPGZ5xsdt65aVw6wTNLMUPx6XyrDcQLZHh2lZ2Iuc\r\nX-Yahoo-Profile: nails762\r\n\r\nfelix3142 wrote:\n&gt; \n&gt; \n&gt; Hello,\n&gt; \n&gt; we&#39;re going to establish unit-testing (basically for web applications)\n&gt; in our company. Because we don&#39;t want to change the whole programming\n&gt; paradigm to XP we rather want to use a test-last method in the\n&gt; beginning and then watch out for further steps.\n&gt; I&#39;m now in the process of investigating the basic requirements and\n&gt; conditions.\n&gt; One question that occured is if it&#39;s possible to quantify the amount\n&gt; of extra time you need when using unit testing compared to the\n&gt; non-testing approach. I solely refer to the writing of unit tests.\n&gt; Later saving of time (by better code) shouldn&#39;t be considered. So\n&gt; what&#39;s your experience? Can anybody do a statement about time\n&gt; consumption of writing unit tests?\n\nMany people have said &quot;there is no clear answer&quot;, and I agree. Instead, \nlet me offer you a few variables to consider when guessing about the \ntime you&#39;ll need to write unit tests for code that already exists. \nYou&#39;ll spend time on each of these things:\n\n1. Learning how to write tests (the syntax of JUnit)\n2. Learning when two different tests test the same thing, and deciding \nwhen to remove one.\n3. Discovering why a test is difficult to write.\n4. Changing the design of the code to make it possible to write a test.\n5. Changing the design of the code to make it easier to write a test.\n6. Deciding which parts of the system are most important to test first.\n7. Deciding whether to remove code instead of testing it, because it \nseems that code is not in use.\n8. Deciding whether to change the design of code because it would make \ntests easier to write.\n9. Deciding whether to change the design of code because it would help \navoid writing duplicate tests (tests that look the same, but test \ndifferent layers of the application)\n10. Becoming comfortable with the fact that the first test could take 2 \ndays to write, then the second one 1/2 day, then the third one 1 hour, \nthen the rest 5 minutes each\n\nThere are more, but I hope this gives you some insight into why it&#39;s \ndifficult to answer your question. All these costs can be quite high, \ndepending on your people, the code and your current project plans.\n\nFinally, let me share a story from my past. Readers here know the story \nwell, so I will just give you the key points. I once wrote a component \nin Java in 3 months, and it didn&#39;t quite work. I rewrote it using JUnit, \ndoing the best kind of test-driven development I knew how to do at the \ntime. The second time, I spent about 150 hours, which would be perhaps \n2.5 weeks (I worked overtime back then). If I needed to do it now, I \ncould probably do it in one week.\n\nSo here is a case of writing code in 3 months (probably 600 hours), \nspending at most 150 hours to test it (while learning how to write \ntests). I imagine that 150 hours to test 600 hours&#39; worth of code is a \ngood performance--it could have taken 1500 hours, if the codebase was \nbigger and more complex. This was Java code I wrote that integrated a \nthird-party Java tool, so it was low complexity, overall.\n\nI hope that helps you. Good luck.\n-- \nJ. B. (Joe) Rainsberger :: http://www.jbrains.ca\nYour guide to software craftsmanship\nJUnit Recipes: Practical Methods for Programmer Testing\n2005 Gordon Pask Award for contribution Agile Software Practice\n\n", 
    "profile": "nails762", 
    "topicId": 18928, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 282027414, 
    "prevInTime": 18944, 
    "contentTrasformed": false, 
    "postDate": "1171924664", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 18939, 
    "headers": {
        "inReplyToHeader": "PGVyNDFicCtvNWlvQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDQ1REEyNkI4LjUwMDA0MDBAZ21haWwuY29tPg==", 
        "referencesHeader": "PGVyNDFicCtvNWlvQGVHcm91cHMuY29tPg=="
    }
}