{
    "numMessagesInTopic": 51, 
    "nextInTime": 18942, 
    "senderId": "OT1fWsYfSaG8sMdGKasOjU1u8pXJqCKOq8OPM7rnJvkQRKoiRAsaP7KdX4GEkNqver9IDMdCz5x_ju2mNG7wf8BFtZ6yR-5D8xpOcOQ_MNqQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Future of testing tools", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains762@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... Perhaps I don t want separate tools, but a way to separate the tests into two categories: essential and coverage. The essential tests are the ones that", 
    "msgId": 18941, 
    "profile": "nails762", 
    "topicId": 18842, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 282027414, 
    "messageBody": "<div id=\"ygrps-yiv-1434269425\">Kent Beck wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think my testing tool IS my design tool. When I make design decisions, I<br/>\n&gt; notate them as part of my tests. Since in my style of development I iterate<br/>\n&gt; between design, implement, and test several times a minute, I don&#39;t think<br/>\n&gt; I&#39;d like separate tools. I use the feedback from the results of each<br/>\n&gt; activity to improve my decisions in the other activities.<br/>\n&gt; <br/>\n&gt; What I can see clearly is the need to be able to view and manipulate the<br/>\n&gt; specification/design/tests in different ways to suit different purposes. For<br/>\n&gt; example, you can translate a test or set of tests into a sequence diagram.<br/>\n&gt; Sometimes I would like to see a summary of the design implications of my<br/>\n&gt; tests in this or some other graphical format.<br/>\n<br/>\n </span></blockquote>Perhaps I don&#39;t want separate tools, but a way to separate the tests <br/>\ninto two categories: essential and coverage. The essential tests are the <br/>\nones that drove my design decisions, while the coverage tests are the <br/>\nones that I added to protect against future refactorings. I think I see <br/>\nthis more as a teaching technique than a practice technique, so I&#39;ll try <br/>\nthinking of it that way for a while, rather than assuming I&#39;d want this <br/>\nin my &quot;professional practice&quot;.<br/>\n<br/>\nAs an aside, I don&#39;t remember the mood I was one when I wrote my <br/>\noriginal reply, and I don&#39;t really feel that way now, so I&#39;m left a <br/>\nlittle confused. Perhaps it was a case of wanting to look smart by <br/>\nsaying something profound-sounding. (Kent, you really bring out the <br/>\naccountability instinct in me. I imagine that will trip me up eventually <br/>\nsomehow.)<br/>\n<br/>\nTake care.<br/>\n-- <br/>\nJ. B. (Joe) Rainsberger :: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jbrains.ca\">http://www.jbrains.ca</a><br/>\nYour guide to software craftsmanship<br/>\nJUnit Recipes: Practical Methods for Programmer Testing<br/>\n2005 Gordon Pask Award for contribution Agile Software Practice</div>", 
    "prevInTime": 18940, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1171923363", 
    "canDelete": false, 
    "nextInTopic": 18956, 
    "prevInTopic": 18927, 
    "headers": {
        "inReplyToHeader": "PDQ1ZDI4MTk3LjQzMjcxODI0Ljc4YzMuNGY1ZFNNVFBJTl9BRERFREBteC5nb29nbGUuY29tPg==", 
        "messageIdInHeader": "PDQ1REEyMUEzLjMwNjA5MDRAZ21haWwuY29tPg==", 
        "referencesHeader": "PDQ1ZDI4MTk3LjQzMjcxODI0Ljc4YzMuNGY1ZFNNVFBJTl9BRERFREBteC5nb29nbGUuY29tPg=="
    }
}