{
    "numMessagesInTopic": 51, 
    "nextInTime": 18960, 
    "senderId": "EGfyCLygviqjfUtxduef29o5EqWDhpnlNyWtJzXwN1U8BWjOACR900sOokNdkXGhSqK7517Dm7SfH5oMkBgLTwBUrSARaXlc299LuaMkTjc0Dw", 
    "systemMessage": false, 
    "subject": "Re: [junit] Future of testing tools", 
    "from": "Michael Feathers &lt;mfeathers@...&gt;", 
    "authorName": "Michael Feathers", 
    "msgSnippet": "... You could use it either way and as long as a language has private, people would probably move to one or the other style. I think that the core issue behind", 
    "msgId": 18959, 
    "profile": "mfeathers256", 
    "topicId": 18842, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 78021826, 
    "messageBody": "<div id=\"ygrps-yiv-811622838\">David Saff wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;On 2/14/07, Michael Feathers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mfeathers@...\">mfeathers@...</a>&gt; wrote:<br/>\n&gt;  <br/>\n&gt;<br/>\n&gt;&gt;In general, I think it would be great to see environments which give us<br/>\n&gt;&gt;much more information about our programs.  Another example.. a while ago<br/>\n&gt;&gt;I was talking to Ivan Moore (of Jester fame) and he was saying that he<br/>\n&gt;&gt;had an idea for a tool that would go through your Java code and<br/>\n&gt;&gt;&#39;privitize&#39; it; that is, make all methods private that could be<br/>\n&gt;&gt;private.  In the spirit of the thing he was thinking of calling it<br/>\n&gt;&gt;Thatcher :-)  We were talking about it with a few other people who, like<br/>\n&gt;&gt;me, are very annoyed by the fact that private gets in the way when its<br/>\n&gt;&gt;in someone else&#39;s mangled code and you don&#39;t have the opportunity to<br/>\n&gt;&gt;peel it off, and we thought, well, wouldn&#39;t it be nice if your<br/>\n&gt;&gt;environment just told you which methods weren&#39;t used elsewhere in the<br/>\n&gt;&gt;system?  Sort of, &quot;this one could be private if you wanted it to be.&quot;<br/>\n&gt;&gt;    <br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;Michael,<br/>\n&gt;<br/>\n&gt;Very interesting.  Are you suggesting this tool would allow you to<br/>\n&gt;make more things private, or allow you to leave fewer things private,<br/>\n&gt;while still having the documentary benefit from the IDE of an &quot;only<br/>\n&gt;used locally&quot; marker?<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>You could use it either way and as long as a language has private, <br/>\npeople would probably move to one or the other style.<br/>\n<br/>\nI think that the core issue behind all of this is what we choose to <br/>\nthink of as the program.  For languages like Java which are file-based, <br/>\nthat have representation outside the IDE, I suppose there will always be <br/>\npeople who want to see those semantics in the source.  The thing that is <br/>\ninteresting to consider, though, is that if our IDEs can infer this <br/>\ninformation, is there much merit in the idea of having the programmer <br/>\nspecify it?  Could it be enough to say, well, you can access whatever <br/>\nyou want, but the uses will be immediately apparent when people look at <br/>\nthe code.<br/>\n<br/>\nTyping &#39;private&#39; is a like a little ritual.  You are documenting a <br/>\ndecision.  But, if you have control over the code, you can &quot;untype&quot; it <br/>\nwhenever you want to.  This is pretty much the same as having the IDE <br/>\ninfer it for you.  The only way that private has teeth is when you don&#39;t <br/>\nhave control over the code that uses it.  And, as a guy who runs into <br/>\ntesting dilemmas all the time, I have to say that those teeth feel very <br/>\nsharp.<br/>\n<br/>\nOne way out of this might be to let IDEs manage private the way that <br/>\nEclipse manages imports.  I haven&#39;t thought that through yet.. might be <br/>\nneat though.<br/>\n<br/>\nMichael Feathers<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.objectmentor.com\">http://www.objectmentor.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://michaelfeathers.typepad.com\">http://michaelfeathers.typepad.com</a></div>", 
    "prevInTime": 18958, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1171984578", 
    "canDelete": false, 
    "nextInTopic": 18960, 
    "prevInTopic": 18958, 
    "headers": {
        "inReplyToHeader": "PDRmN2RhNmI5MDcwMjIwMDY0OWczMmNmZmZiMmhiMWZhNDlhMTg3NDdkODZkQG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PDQ1REIxMEMyLjkwNDA1MDlAbWluZHNwcmluZy5jb20+", 
        "referencesHeader": "PDU4ODkzMC41OTA3MC5xbUB3ZWI2MDcyMy5tYWlsLnlhaG9vLmNvbT4JIDw0NUQzMThFNy4yMDEwNzA5QG1pbmRzcHJpbmcuY29tPiA8NGY3ZGE2YjkwNzAyMjAwNjQ5ZzMyY2ZmZmIyaGIxZmE0OWExODc0N2Q4NmRAbWFpbC5nbWFpbC5jb20+"
    }
}