{
    "topicId": 188, 
    "postDate": "978655056", 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "from": "&quot;Scott Eade&quot; &lt;seade@...&gt;", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "38T3qdiyLM7tk0jc9ndo3eTwrV8BL-_0uSYe-zKkS4cbOcN9hTvSgFWYd_VIV_9Hp_Y7DV7mhr4-THR296dwvTsLt7vD21TCpiA", 
    "nextInTime": 190, 
    "userId": 0, 
    "prevInTime": 188, 
    "prevInTopic": 188, 
    "headers": {
        "messageIdInHeader": "PDAxODcwMWMwNzZhZiRiNDM2MzY2MCQwMTAwYThjMEBzY29vYnkwMD4=", 
        "referencesHeader": "PDk3ODYzMzI4Mi40Mjk3QGVncm91cHMuY29tPiA8MDA2MzAxYzA3NmEwJDE3NWJhMWUwJDAxODBhNGMwQGdhdGV3YXk+"
    }, 
    "authorName": "Scott Eade", 
    "numMessagesInTopic": 5, 
    "msgSnippet": "... that is being tested.  I am actually writing several hundred test cases for code written by someone else - working this way it makes much more sense to", 
    "contentTrasformed": false, 
    "msgId": 189, 
    "nextInTopic": 190, 
    "systemMessage": false, 
    "rawEmail": "Return-Path: &lt;seade@...&gt;\r\nX-Sender: seade@...\r\nX-Apparently-To: junit@egroups.com\r\nReceived: (EGP: mail-6_3_1_3); 4 Jan 2001 23:39:24 -0000\r\nReceived: (qmail 3558 invoked from network); 4 Jan 2001 23:39:22 -0000\r\nReceived: from unknown (10.1.10.142) by l10.egroups.com with QMQP; 4 Jan 2001 23:39:22 -0000\r\nReceived: from unknown (HELO mr14.vic-remote.bigpond.net.au) (24.192.1.29) by mta3 with SMTP; 5 Jan 2001 00:40:27 -0000\r\nReceived: from scooby00 (CPE-61-9-178-83.vic.bigpond.net.au [61.9.178.83]) by mr14.vic-remote.bigpond.net.au (Pro-8.9.3/8.9.3) with SMTP id KAA10301 for &lt;junit@egroups.com&gt;; Fri, 5 Jan 2001 10:39:18 +1100 (EDT)\r\nMessage-ID: &lt;018701c076af$b4363660$0100a8c0@scooby00&gt;\r\nTo: &lt;junit@egroups.com&gt;\r\nReferences: &lt;978633282.4297@egroups.com&gt; &lt;006301c076a0$175ba1e0$0180a4c0@gateway&gt;\r\nSubject: Re: [junit] Digest Number 43\r\nDate: Fri, 5 Jan 2001 10:37:36 +1000\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Priority: 3\r\nX-MSMail-Priority: Normal\r\nX-Mailer: Microsoft Outlook Express 5.00.2919.6700\r\nX-MimeOLE: Produced By Microsoft MimeOLE V5.00.2919.6700\r\nFrom: &quot;Scott Eade&quot; &lt;seade@...&gt;\r\n\r\n&gt; &gt; The motivation for this extension is that most test cases contain a whole bunch of assertions following the code\nthat is being tested.  I am actually writing several hundred test cases for code written by someone else - working this\nway it makes much more sense to test a feature to death in a single test case rather than writing a separate test case\nfor each aspect of a feature.  I have test cases that include 100 assertions with up to like 80 failures (I currently\nhave to comment out lines containing failures in order to continue processing).  Writing 100 separate test cases would\nnot be practical and would actually make the test results harder to interpret.\n&gt;\n&gt; Are the 100 separate test cases really impractical? Can you refactor your test code to make new tests easy to write?\nPerhaps writing several test classes to cover different aspects of the target code? The test-per-method makes things\nvery obvious, gives you somewhere to put a name for the test and can be easier to manage as your code evolves.\n\nI do have many smaller test cases but there quite a few that do include a lot of assertions (say 150 out of 400 test\ncases).  The fact that so many assertions fail is symptomatic of the fact that the testing code is being written\nseparately from the application code and that the application is the initial prototype of something that is unlikely to\nbecome a product for quite a while yet.\n\nWhile I could cut the test into a number of pieces there are a some good reasons as to why I have not done so:\n1. A single application method invocation often has multiple effects that need several assertions to test - no matter\nwhich assertions fail, the same piece of functionality (or chunk of application code) needs to be fixed.  I imagine this\nis a fairly common scenario but that it doesn&#39;t normally generate too many assertions.\n2. In this particular instance I have to deal with application methods whose arguments are encoded in String objects - a\nsingle method may have a varying number of encoded arguments of different types but as far as Java is concerned they\ntake a single String argument.  Now no matter which form of the encoded arguments is being used a single piece of\nfunctionality (application code) is involved.  I think it makes sense to test all combinations of the encoded arguments\nin a single test case - the developer should keep running the test case and fixing their code until it runs all the way\nthrough.\n3. Often we have a bunch of related methods that each take the same variations of encoded arguments - there is a high\nprobability that these are all going to behave in the same way, i.e. if one works they will all work but if one fails...\nIt makes sense to me to group these into a single test case - why have several test cases fail that all point to the\nsame problem.\n4. Often we have a set of methods whose effect on a common set of data values is closely coupled.  It seems to me that\nthese methods should work in complete harmony or not at all and thus I have grouped the testing of these methods\ntogether in the same test case.\n\nI agree that as a rule you should attempt to make your test cases as small and specific as possible but I think in this\nparticular instance I have some good reasons for writing larger test cases that include large numbers of assertions.\n\nThe desire to have JUnit continue running a method after an assertion failure is simply to get a metric of test success\nto use across testing runs.  A developer may fix some aspect of a method but the test case will continue to fail - if\nhowever they could see that the number of failures in the test case had decreased then they would have some idea that\nthey were making progress.\n\nScott\n\n\n", 
    "subject": "Re: [junit] Digest Number 43"
}