{
    "numMessagesInTopic": 5, 
    "nextInTime": 19136, 
    "senderId": "l8VliLqIJBkwuWP6fa48aeWMTc7HT9KVYeZWG4v3cjOcG-Xir7_z5Vm4hPdhDCeOaNXZi_Z5aMHa8Pi9GIMBwmjA", 
    "systemMessage": false, 
    "subject": "Re: [junit] Testing/Debugging JNLP Applications: can it be done?", 
    "from": "&quot;David Saff&quot; &lt;saff@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "Luigi, Have you tried using mock objects to implement the JNLP services?  I don t have experience with JNLP, but Eclipse plug-ins have many of the same", 
    "msgId": 19135, 
    "profile": "dsaff", 
    "topicId": 19132, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 139771899, 
    "messageBody": "<div id=\"ygrps-yiv-2084071869\">Luigi,<br/>\n<br/>\nHave you tried using mock objects to implement the JNLP services?  I<br/>\ndon&#39;t have experience with JNLP, but Eclipse plug-ins have many of the<br/>\nsame restrictions (it&#39;s impossible to get most services without a<br/>\nsignficant container start-up overhead), and mocks really help me<br/>\nthere.<br/>\n<br/>\nGood luck,<br/>\n<br/>\n   David Saff<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 3/23/07, Luigi Lauro &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luigi.lauro@...\">luigi.lauro@...</a>&gt; wrote:<br/>\n&gt; I&#39;ve found out on my own skin that it&#39;s very hard to test JNLP-enabled applications (Java<br/>\n&gt; Web Start).<br/>\n&gt;<br/>\n&gt; This is because the jnlp service implementations such  as PersistenceServiceImpl and<br/>\n&gt; BasicServiceImpl get only loaded at JVM  startup time when java is launched from the<br/>\n&gt; javaws executable, which needs a full fledged jnlp package (.jnlp file, jar archives, etc...).<br/>\n&gt;<br/>\n&gt; This makes testing jnlp-based classes very hard,  since automated testing with JUnit or<br/>\n&gt; debugging with an IDE is out of discussion AFAIK.<br/>\n&gt;<br/>\n&gt; I&#39;ve tried manually including my Mac OS X Java6 javaws.jar (which  contains the system-<br/>\n&gt; dependent implementation classes for the JNLP  interfaces) and manually initializing and<br/>\n&gt; loading the services, but it all fails horribly because of several missing things (mostly<br/>\n&gt; missing system properties, which impl classes expect, and are  probably set up by javaws<br/>\n&gt; or some other yet-to-be-found class).<br/>\n&gt;<br/>\n&gt; It can _PROBABLY_ be done by tinkering with it and slowly adding everything needed by<br/>\n&gt; going exception and after exception manually  putting in the tidbits impl classes expect,<br/>\n&gt; but it&#39;s for sure a long  and tedious work, and I guess it would be strongly platform-<br/>\n&gt; dependent (for example, I&#39;ve noticed the impl classes in javaws varies consistently  on the<br/>\n&gt; various platforms, and so do JNLP expected system properties).<br/>\n&gt;<br/>\n&gt; Or, maybe, if I am REALLY lucky, I can find a JNLPInitializerWhatever class, with a<br/>\n&gt; &#39;startmeup&#39; method for setting  everything. Dreaming is not a crime you know? :P<br/>\n&gt;<br/>\n&gt; Any help here is SERIOUSLY appreciated, I&#39;m currently losing hours and hours each day<br/>\n&gt; because I have to deploy a full JNLP java package in order to test jnlp-enabled application,<br/>\n&gt; and I can&#39;t debug them at all.<br/>\n&gt;<br/>\n&gt; Also, automated JUnit testing can&#39;t presently be done AFAIK.<br/>\n&gt;<br/>\n&gt; Anyone knows a solution, or can give me some hints about this problem?<br/>\n&gt;<br/>\n&gt; Thanks in advance for any answer<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 19134, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1174690816", 
    "canDelete": false, 
    "nextInTopic": 19136, 
    "prevInTopic": 19134, 
    "headers": {
        "inReplyToHeader": "PGV1MGE1NytiZ244QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDRmN2RhNmI5MDcwMzIzMTYwMHMyNjM3MzQxY282YzYxMjhiNzY1MjBjOGYzQG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PGV1MGE1NytiZ244QGVHcm91cHMuY29tPg=="
    }
}