{
    "numMessagesInTopic": 5, 
    "nextInTime": 19135, 
    "senderId": "gNlr-NzFRwMcQHlrE6A-UzP3uEqLr3Sp2vZKbK7D0-xwidSrAy-N2xbXoQOox8eSEH-PnXFwEhhYx0nyvabeKINncoWtXIMNTWqlNA", 
    "systemMessage": false, 
    "subject": "Re: Testing/Debugging JNLP Applications: can it be done?", 
    "from": "&quot;Luigi Lauro&quot; &lt;luigi.lauro@...&gt;", 
    "authorName": "Luigi Lauro", 
    "msgSnippet": "... THanks Tim for the answer, but unluckily I think the approach there is different. AFAIK that plugin allows for automated GUI testing by starting java web", 
    "msgId": 19134, 
    "profile": "devomero", 
    "topicId": 19132, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 256049434, 
    "messageBody": "<div id=\"ygrps-yiv-716897771\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, Timothy Wall &lt;twall@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Vincent Massol wrote a plugin for maven that enabled the abbot  <br/>\n&gt; library for GUI testing for web-started applications, so there might  <br/>\n&gt; be something there that could be generalized (or maybe already is)  <br/>\n&gt; for generic JUnit tests (abbot is a junit extension for testing UI  <br/>\n&gt; components).<br/>\n<br/>\n </span></blockquote>THanks Tim for the answer, but unluckily I think the approach there is different.<br/>\n<br/>\nAFAIK that plugin allows for automated GUI testing by starting java web start itself in a <br/>\nstandard way, and just automates the GUI testing by providing a sort of &#39;programmed bot&#39; <br/>\nwhich test the GUI.<br/>\n<br/>\nMy goal is completely different. I do not want to test a JWS application in a standard JWS <br/>\nenvironment, since that will require to have a full jnlp deployment (jnlp file, jar archives <br/>\ndone, etc...) each time I have to test.<br/>\n<br/>\nI would love to test my application in a standard java environment inside my IDE for <br/>\ndebugging/automated junit testing.<br/>\n<br/>\nThis can be easily done for a java web start application, since it&#39;s a standard java <br/>\napplication after all. The problem is when you make use of specific jnlp APIs: even though <br/>\nthe interfaces are available in the jnlp.jar included with every JVM, the implementation <br/>\nclasses along with all the needed system properties and tidbits gets loaded ONLY when the <br/>\napplication is started from the javaws executable.<br/>\n<br/>\nThis effectively forbid you to use automated testing/debugging inside your usual IDE (I use <br/>\neclipse), and you are forced to make up a jnlp package EACH TIME you want to test, for <br/>\nevery single line of code you modify.<br/>\n<br/>\nI have yet to find a way to test JNLP classes INSIDE an IDE without requiring a full <br/>\ndeployment, and have yet to find how can I do some automated testing with JUnit for these <br/>\nclasses as well.<br/>\n<br/>\nThis is my problem :)</div>", 
    "prevInTime": 19133, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1174666260", 
    "canDelete": false, 
    "nextInTopic": 19135, 
    "prevInTopic": 19133, 
    "headers": {
        "inReplyToHeader": "PDk2RUIwNUVDLTk3MTYtNDlCMS04NzhELTZCNkM3NkFEMTg2M0B1c2Vycy5zZi5uZXQ+", 
        "messageIdInHeader": "PGV1MHU2ayttcW8xQGVHcm91cHMuY29tPg=="
    }
}