{
    "numMessagesInTopic": 2, 
    "nextInTime": 19300, 
    "senderId": "rTQFlMgd4Cz7ZaOk-ruMbUECger7WU1ckg8UujothMGr2VJikS8IQuC-5GY84gftvzdiTJ-3hS-ThL5GoiMBF83p2NkLa8Rp4-ekfsQ", 
    "systemMessage": true, 
    "subject": "utility class vs. base class", 
    "from": "&quot;Scott Glaser&quot; &lt;sglaser@...&gt;", 
    "authorName": "Scott Glaser", 
    "msgSnippet": "I have a question about designing JUnit tests. I have some common setup and teardown tasks that are shared amongst several test classes. For example I read", 
    "msgId": 19299, 
    "profile": "rsg00usa", 
    "topicId": 19299, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 234825028, 
    "messageBody": "<div id=\"ygrps-yiv-876613503\">I have a question about designing JUnit tests. I have some common setup and<br/>\nteardown tasks that are shared amongst several test classes. For example I<br/>\nread test data from an xml file used by each test class that contains global<br/>\ninformation like Locale and Timezone. Another is removing test data from the<br/>\ndb. These are not tasks I want to do once per test class but once per test<br/>\nmethod in several test classes. I would think it makes more sense to pull<br/>\nout these common tasks from each test class and either put them in a<br/>\nutility/helper class or create a base test class that each test class will<br/>\ninherit. The dilemma I have is which approach is better. Creating a utility<br/>\nclass or creating a base test class that is inherited. The common tasks are<br/>\nnot package specific, meaning they are not targeting a specific suite of<br/>\ntest classes so my initial thought is to create a utility class for these<br/>\ncommon tasks to reside. This may seem to be more of a general java design<br/>\nquestion but was hoping someone can give me some pointers.<br/>\n <br/>\nThanks,<br/>\nScott<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 19298, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1177602589", 
    "canDelete": false, 
    "nextInTopic": 19300, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDAwMTgwMWM3ODgxYSQ4NWUxMjMwMCRkZmY4MTVhY0Bkcy5jb3JwLnlhaG9vLmNvbT4="
    }
}