{
    "numMessagesInTopic": 1, 
    "nextInTime": 19299, 
    "senderId": "mhKVejnf96ZEqsvOFJyA4k743jS9veLrDDtgDgbuvV9m3zp1_FPJIFn95C8HA2p8Y0DzCYUBWOvBKJ731S9m8bnIpl8h8v4Un8xccS9WfQ", 
    "systemMessage": false, 
    "subject": "ANN: XP Day Toronto, May 12th 2007", 
    "from": "&quot;nkhanna_01&quot; &lt;niraj@...&gt;", 
    "authorName": "nkhanna_01", 
    "msgSnippet": "My apologies if you ve already received this as a member of another Yahoo group. What: Diaspar Software is proud to present the fourth installment of the XP", 
    "msgId": 19298, 
    "profile": "nkhanna_01", 
    "topicId": 19298, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 231521593, 
    "messageBody": "<div id=\"ygrps-yiv-648263411\">My apologies if you&#39;ve already received this as a member of another<br/>\nYahoo group.<br/>\n<br/>\nWhat: Diaspar Software is proud to present the fourth installment of<br/>\nthe XP Day North America series: XP Day Toronto taking place on May<br/>\n12, 2007.<br/>\n<br/>\nWhy Might you Care:  We&#39;re a small conference that focuses on three<br/>\nthings:<br/>\n1) Helping people who are XP curious to start practicing XP in their<br/>\ncurrent work environments.<br/>\n2) Bringing together current XP Practitioners to exchange ideas and<br/>\nshare their experiences amongst the attendees.<br/>\n3) Accessibility of field experts.  Deep insightful answers typically<br/>\nonly cost 1 beer :-).<br/>\n<br/>\n4 more reasons why you should attend XP Day Toronto:<br/>\n1) Presenting at XP Day will be: Brian Marick, Gil Broza & J.B.<br/>\nRainsberger.<br/>\n2) Deborah Hartmann runs our fantastic open space, which has always<br/>\nbeen full of interesting topics and lively conversation.<br/>\n3) We limit our attendance to 125 registrants to ensure reasonable<br/>\naccess to guest speakers and special invitees. <br/>\n4) It&#39;s inexpensive.  $265 gets you in the door and that includes<br/>\ncontinental breakfast, lunch and snacks.<br/>\n<br/>\nInterested?  If you prefer a website as opposed to plain text, please<br/>\nvisit <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.xpday.info\">http://www.xpday.info</a> for all the details.  If you&#39;re too tired<br/>\nto enter the link, keep reading.<br/>\n<br/>\nIf you are looking for an opportunity to learn more about Extreme<br/>\nProgramming without having to spend an entire week at a large<br/>\ninternational XP conference, XP Day Toronto fits the bill.  XP Day is<br/>\na one-day event with activities for anyone interested in Extreme<br/>\nProgramming, whether you&#39;re:<br/>\n<br/>\n* A programmer who has heard about XP and wants to find out more.<br/>\n* An executive wondering how XP can improve the contribution your<br/>\nsoftware organization makes to the bottom line.<br/>\n* A manager looking for ways to increase your team&#39;s effectiveness.<br/>\n* A skeptic, hoping to challenge the most experienced and outspoken XP<br/>\npractitioners.<br/>\n* A programmer itching to experience a real XP project room.<br/>\n* An experienced practitioner, hoping to share ideas with other<br/>\nexperienced practitioners.<br/>\n<br/>\nWe know Agile 2007 is coming up, but XP Day Toronto is an excellent<br/>\nopportunity to meet, attend tutorial sessions and even work with some<br/>\nof the XP community&#39;s most notable practitioners.  Not to mention that<br/>\nDeb Hartmann&#39;s open space has always received rave reviews!  All this<br/>\nfor $265 (continental breakfast & lunch included).<br/>\n<br/>\nXP Day events are interactive!<br/>\n<br/>\n- Tutorials<br/>\n<br/>\nWe are fortunate to have respected leaders of the XP community<br/>\nproviding world-class instruction in the fundamentals of XP.  Check<br/>\nout our website for bios!<br/>\n<br/>\n* Brian Marick, keynote: &quot;Six Years Later: What the Agile Manifesto<br/>\nLeft out&quot;<br/>\n* Gil Broza: &quot;XP: Where do I start?&quot;<br/>\n* J. B. Rainsberger will provide an introduction to XP.<br/>\n<br/>\n- Open Space<br/>\n<br/>\nThere&#39;s plenty of room, the space is run superbly and the conversation<br/>\nis typically lively.  You can collaborate intensively with both local<br/>\nand invited advanced practitioners on issues that challenge you most.<br/>\nIf the tutorials don&#39;t cover it, you can work through your burning<br/>\nquestions in Open Space.<br/>\n<br/>\n- Project Room<br/>\n<br/>\nIf you&#39;re looking to dive in and immerse yourself in XP, join the XP<br/>\nProject Room, where you&#39;ll have the opportunity to work on project<br/>\nwith respected experts. Not sure what&#39;s going on? No problem! Join the<br/>\nproject any time and someone will bring you up to speed quickly, just<br/>\nlike on a real XP project!<br/>\n<br/>\nIf you&#39;re looking for more information, visit our website:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.xpday.info\">http://www.xpday.info</a><br/>\n<br/>\nIf you have any questions with regards to this event, please don&#39;t<br/>\nhesitate to contact me at the email address listed above.<br/>\n<br/>\nHope to see you all there!<br/>\n<br/>\nNiraj.</div>", 
    "prevInTime": 19297, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1177505690", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGYwbmoycSttNzRsQGVHcm91cHMuY29tPg=="
    }
}