{
    "numMessagesInTopic": 48, 
    "nextInTime": 19522, 
    "senderId": "I2dq4SppQBSU_egOnevlyAH54r_BRiN2fxUU3JT-cAsNo9JjiFKEd8HdKt6Ck2IxSwGkw8sJB8ao4yEqql1n46F0cyd8lm920wIIwg", 
    "systemMessage": false, 
    "subject": "Test Grouping/Partitioning", 
    "from": "&quot;Christian Nelson&quot; &lt;cnelson@...&gt;", 
    "authorName": "Christian Nelson", 
    "msgSnippet": "I have a feeling I m about to bring up a much discussed topic, however, I wasn t able to find any related topics by searching this mailing list.  My apologies", 
    "msgId": 19521, 
    "profile": "xianpants", 
    "topicId": 19521, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 72761229, 
    "messageBody": "<div id=\"ygrps-yiv-419206736\">I have a feeling I&#39;m about to bring up a much discussed topic,<br/>\nhowever, I wasn&#39;t able to find any related topics by searching this<br/>\nmailing list.  My apologies in advance if this has been hashed out before.<br/>\n<br/>\nWhile generally thinking that its not a great idea, I occasionally<br/>\ncome into a situation where I genuinely need to partition my tests<br/>\ninto more than one group or partition or suite.  The latest example is<br/>\nwith a client who has many unit style tests as well as a number of<br/>\ntests which require specific network connectivity only available from<br/>\na subset of machines (the outgoing requests must come from a specific<br/>\nip address).  We call these the &quot;online tests&quot;.<br/>\n<br/>\nWe want to be able to group our tests into two groups, &quot;unit tests&quot;<br/>\nand &quot;online tests&quot;.  In some case we want to run only &quot;unit tests&quot; or<br/>\nonly &quot;online tests&quot;, and in other cases we want to run both (or all).<br/>\n<br/>\nI understand that this functionality is available using JUnit 4&#39;s<br/>\n@RunWith(Suite.class) and @SuiteClasses(TestClass1.class, ...). <br/>\nHowever, manually adding test classes to a suite is clunky because the<br/>\nlist of  test classes becomes huge.  It&#39;s also error prone; it&#39;s easy<br/>\nfor developers to write a test but forget to add it to @SuiteClass. <br/>\nLastly, test runners will run test in suites multiple times when told<br/>\nto &quot;run all tests&quot;.  That&#39;s hardly the desired behavior.<br/>\n<br/>\nWhat I really would like to see is the concept of suite (or group in<br/>\nTestNG terms) be promoted to a first class citizen.  Honestly, I think<br/>\n I would prefer it to be at the test class level (unlike TestNG which<br/>\nis at the test method level), since the mechanism should be used for<br/>\nhigh-level organization IMHO.<br/>\n<br/>\nIs there any chance something like this might make its way into JUnit?<br/>\nWhat can I do to help?<br/>\n<br/>\nThanks,<br/>\nChristian</div>", 
    "prevInTime": 19520, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1183485320", 
    "canDelete": false, 
    "nextInTopic": 19522, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGY2ZTJpOCtnZzVrQGVHcm91cHMuY29tPg=="
    }
}