{
    "numMessagesInTopic": 48, 
    "nextInTime": 19566, 
    "senderId": "MHZhsXBrMiO2b9KQ08JJzrhI8qUbQKOlQFWoEO6B6KdNcvTwSKxC43fo50MEva1rfwDkn07Lrt_obgz_PBouz13U", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Test Grouping/Partitioning", 
    "from": "&quot;David Saff&quot; &lt;saff@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "... Thanks for coming back! ... As I remember it, the mapping is: IDEA project = Eclipse workspace IDEA module = Eclipse project Can someone confirm or deny", 
    "msgId": 19565, 
    "rawEmail": "Return-Path: &lt;david.saff@...&gt;\r\nX-Sender: david.saff@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 78904 invoked from network); 17 Jul 2007 14:50:25 -0000\r\nReceived: from unknown (66.218.66.72)\n  by m49.grp.scd.yahoo.com with QMQP; 17 Jul 2007 14:50:25 -0000\r\nReceived: from unknown (HELO wa-out-1112.google.com) (209.85.146.181)\n  by mta14.grp.scd.yahoo.com with SMTP; 17 Jul 2007 14:50:25 -0000\r\nReceived: by wa-out-1112.google.com with SMTP id j40so2109032wah\n        for &lt;junit@yahoogroups.com&gt;; Tue, 17 Jul 2007 07:50:25 -0700 (PDT)\r\nDKIM-Signature: a=rsa-sha1; c=relaxed/relaxed;\n        d=gmail.com; s=beta;\n        h=domainkey-signature:received:received:message-id:date:from:sender:to:subject:in-reply-to:mime-version:content-type:content-transfer-encoding:content-disposition:references:x-google-sender-auth;\n        b=kud2dODYstfwBWgQbCtufgj3zlJj9jRRbVwJP/tlkrbKMTqDqwQ1wplGu7j75M8qpUxC4HMeSUJuVr5Oadh5PV15+GRB7Bcv42eq1gfQYxr43EDCxaQ3RthfNY5D83tpzffNZ5n4ZArDb8/LDOEi5c75f/8XvcVFMs1fiOFVcqM=\r\nReceived: by 10.115.111.1 with SMTP id o1mr470140wam.1184683825004;\n        Tue, 17 Jul 2007 07:50:25 -0700 (PDT)\r\nReceived: by 10.114.134.7 with HTTP; Tue, 17 Jul 2007 07:50:24 -0700 (PDT)\r\nMessage-ID: &lt;4f7da6b90707170750i7eaf7c0dp230d7a4f1fe25877@...&gt;\r\nDate: Tue, 17 Jul 2007 10:50:24 -0400\r\nTo: junit@yahoogroups.com\r\nIn-Reply-To: &lt;f7hlph+qqdr@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nContent-Disposition: inline\r\nReferences: &lt;4f7da6b90707090917l255476cay32154ca77342d346@...&gt;\n\t &lt;f7hlph+qqdr@...&gt;\r\nX-Google-Sender-Auth: af7fa3200a36750b\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: &quot;David Saff&quot; &lt;saff@...&gt;\r\nSubject: Re: [junit] Re: Test Grouping/Partitioning\r\nX-Yahoo-Group-Post: member; u=139771899; y=1jonciRzuqVTCyMEnBEkpFy0KcKnTeGKrigpo8OvXPs\r\nX-Yahoo-Profile: dsaff\r\n\r\nOn 7/17/07, Christian Nelson &lt;cnelson@...&gt; wrote:\n&gt; I apologize for instigating this conversation and then disappearing! :)\n\nThanks for coming back!\n\n&gt; I&#39;m now realizing that this is a trickier problem than I originally\n&gt; thought.  It&#39;s made more complicated by the fact that most of our\n&gt; projects are multi-module.  For example, I tried cpsuite and it only\n&gt; finds tests in a single module.\n\nAs I remember it, the mapping is:\n\nIDEA project = Eclipse workspace\nIDEA module = Eclipse project\n\nCan someone confirm or deny that?\n\nIn that case, this is interesting.  Eclipse _can&#39;t_ run all tests in a\nworkspace, which was one of Johannes&#39;s main motivations for creating\ncpsuite.  Ironic that the opposite holds in IDEA land.  To be clear,\ndo you have one module that includes all the other testing modules in\nits classpath?  If so, and cpsuite still isn&#39;t working, IDEA must be\ndoing its classloading in a new and fascinating way.\n\n&gt; While I could craft a negation to\n&gt; exclude &quot;*OnlineTest&quot;, it wouldn&#39;t run all of the tests across\n&gt; modules.  I looked at JunitExt&#39;s Category and it seemed like it only\n&gt; provided a way to organize the result of the tests, not filter which\n&gt; tests are executed (maybe I missed something).\n\nThe tutorial is somewhat silent on the point, but take a look at\n\nhttp://groups.google.com/group/junitext-dev/browse_thread/thread/212fdca83fbcc33f\n\n&gt; [snip]\n&gt; ** Another take on describing an ideal\n&gt;\n&gt; I guess what I&#39;d find in an ideal world is a way to optionally group\n&gt; test classes (or specific tests) with a textual group-name and then be\n&gt; able to pass one or more group-name to a test runner which would then\n&gt; execute only the tests tagged appropriately.  The test runner would\n&gt; also support negation so that you could express &quot;not online tests&quot;.\n\nIf you could get all the above without special IDE support (for\nexample, you could edit annotations on a target &quot;FilteredSuite&quot; class,\nor twiddle command-line parameters), how much of your problem\nwould that solve?  On the one hand, you might be concerned about\nhaving to edit a file under source control in order to change the\nsubset of tests run, but it sounds like you&#39;re doing that with Ant\nanyway.\n\nThe reasons I ask are:\n1) We can move more quickly within JUnit itself than I would expect\nthe IDE vendors to move\n2) I can imagine (without thinking deeply) that the API required would\nbe different if customized to IDE interface.\n\nMy personal preference would be to solve the cpsuite / IDEA impasse,\nso that JUnit+IDEA+cpsuite could solve your problem without\nsignificant change to IDEA.\n\n&gt; ** Grouping by class or string?\n&gt;\n&gt; I don&#39;t like the idea of specifying a group using a class because it\n&gt; doesn&#39;t feel like a class to me.  It&#39;s meta-data not code; the fact\n&gt; that it&#39;s an empty class has a bit of a smell to me.  The thing I&#39;m\n&gt; describing really seems like it&#39;s a tag (ala flickr etc) that is used\n&gt; to organize tests.  I like the fact that it&#39;s loose (as all tags are)\n&gt; so that you can establish a convention across modules without having\n&gt; to share actual classes.  If you want refactor-safety, you could\n&gt; create a static class with constants (e.g. @Test(group =\n&gt; TestSuites.DATABASE)).  Users would have the option.\n\nAh.  Good call on the constant class.\n\n&gt; So, the thing I realized which is important is that what I&#39;m really\n&gt; looking for is tag/group support in the Eclipse and IDEA custom test\n&gt; runners (sure, ant and maven would be nice too, it&#39;s secondary to me\n&gt; though).  I don&#39;t see how a junit extension like cpsuite could solve\n&gt; the &quot;all tests with tag &#39;foo&#39; across all modules&quot; problem.  It&#39;s one\n&gt; level out from there (at the junit ant task, maven surefire, idea, or\n&gt; eclipse level).\n\nI (in my own head) call Eclipse, IDEA, ant, and maven the &quot;runner UIs&quot;\nfor JUnit.  I&#39;d break down the job three ways:\n\n1) &quot;All classes&quot;: this must be done at the Runner UI level--the user\nis communicating with the runner UI which are the classes of interest,\nand where to find them.\n2) &quot;All classes which are Tests&quot;: this can be done at the Runner UI\nlevel (all the Runner UI&#39;s support it in some sense), or at the JUnit\nextension level (with cpsuite, or a future enhanced version thereof).\nI like the second, since the Runner UI&#39;s aren&#39;t in agreement about how\nto store their preferences\n3) &quot;All classes which are Tests with tag foo&quot;: JUnitExt provides some\nsupport for this, and it should get easier in JUnit 4.4, which allows\nFilters to run directly against class and method annotations.  None of\nthe Runner UI&#39;s have direct support for &quot;Run classes A, B, and C with\nfilter F&quot;, and the JUnit-internal API for filters is pretty clunky as\nwell.  So something needs to be done here.\n\n&gt; The only way eclipse/idea would support something\n&gt; like this is if someone writes an entirely new test runner plugin\n&gt; (seems like a big waste of time) or if the group/tag feature makes its\n&gt; way into junit core.  Then all of the various runners would likely\n&gt; build in support.\n&gt;\n&gt; Sorry for the long winded message.  There are a few ideas in here.\n&gt; What do you think?\n\nTo proceed, I&#39;d love to get you able to run the tests you want to run\nas soon as possible, and then see how we can make that solution easier\n/ prettier / more obvious for everyone&#39;s next project.  My idea:\n\n- One IDEA module called allTests that includes on its classpath all\nthe other modules with tests\n- cpsuite to gather tests from the classpath\n- JUnitExt to filter by category\n\nIf this is too much work on your side, let the list know, and we&#39;ll\nsee if another volunteer will try it--it might be me in a couple\nweeks, or maybe someone else has done it.  It&#39;s possible that there\nare bugs in one or all of the above modules that prevent that from\nworking, and we should fix those first.\n\nIf it does work, then the possibilities for improvement include:\n\n- Improving IDEA so that the &quot;allTests&quot; module is not necessary\n- Changing JUnit&#39;s Filter API so that using JUnitExt is cleaner.\n- Absorbing one or both of cpsuite and JUnitExt&#39;s category support\ninto JUnit core, to cut down on the number of separate moving parts.\n\nThanks,\n\n   David Saff\n\n", 
    "profile": "dsaff", 
    "topicId": 19521, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 139771899, 
    "prevInTime": 19564, 
    "contentTrasformed": false, 
    "postDate": "1184683824", 
    "canDelete": false, 
    "nextInTopic": 19568, 
    "prevInTopic": 19564, 
    "headers": {
        "inReplyToHeader": "PGY3aGxwaCtxcWRyQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDRmN2RhNmI5MDcwNzE3MDc1MGk3ZWFmN2MwZHAyMzBkN2E0ZjFmZTI1ODc3QG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PDRmN2RhNmI5MDcwNzA5MDkxN2wyNTU0NzZjYXkzMjE1NGNhNzczNDJkMzQ2QG1haWwuZ21haWwuY29tPgkgPGY3aGxwaCtxcWRyQGVHcm91cHMuY29tPg=="
    }
}