{
    "numMessagesInTopic": 48, 
    "nextInTime": 19561, 
    "senderId": "dPM7zrOdf0cBWWVoGhB83GOPLm8t74LvWQZrTnSffNq979fi7qgJEZhg6DvgD2jPVuP2giT3FB0V2wzwrq5-uuZmkexeeO-1fJHD1Q", 
    "systemMessage": true, 
    "subject": "Re: Test Grouping/Partitioning", 
    "from": "&quot;Christian Nelson&quot; &lt;cnelson@...&gt;", 
    "authorName": "Christian Nelson", 
    "msgSnippet": "I apologize for instigating this conversation and then disappearing! :) ** Some background I use IDEA (and my current client uses Eclipse).  IDEA can run tests", 
    "msgId": 19560, 
    "profile": "xianpants", 
    "topicId": 19521, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 72761229, 
    "messageBody": "<div id=\"ygrps-yiv-925127303\">I apologize for instigating this conversation and then disappearing! :)<br/>\n<br/>\n** Some background<br/>\n<br/>\nI use IDEA (and my current client uses Eclipse).  IDEA can run tests<br/>\nin a variety of ways, including all tests across all modules in this<br/>\nproject (a project may have one or more modules).  That&#39;s how I<br/>\n*usually* run my tests.  We also run our tests from Maven 2 (and<br/>\nsometimes Ant for older projects).<br/>\n<br/>\nI&#39;m now realizing that this is a trickier problem than I originally<br/>\nthought.  It&#39;s made more complicated by the fact that most of our<br/>\nprojects are multi-module.  For example, I tried cpsuite and it only<br/>\nfinds tests in a single module.  While I could craft a negation to<br/>\nexclude &quot;*OnlineTest&quot;, it wouldn&#39;t run all of the tests across<br/>\nmodules.  I looked at JunitExt&#39;s Category and it seemed like it only<br/>\nprovided a way to organize the result of the tests, not filter which<br/>\ntests are executed (maybe I missed something).<br/>\n<br/>\nThinking out loud:<br/>\n<br/>\nFrom Ant and Maven, I can simply use filename inclusion/exclusion to<br/>\nexclude my &quot;Online&quot; tests.  The aggregation of tests across modules is<br/>\nhandled by a parent script or pom.  All is generally well from the<br/>\ncommand line (for now).<br/>\n<br/>\nFrom IDEA, I can use something like cpsuite (JUnit 4 tests) or JUnit<br/>\nAddons&#39; DirectorySuiteBuilder (JUnit 3 tests).  But there&#39;s no way to<br/>\nrun all tests across all modules, excluding &quot;*Online*&quot;, unless the<br/>\nJetBrains folks implement this feature<br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jetbrains.net/jira/browse/IDEA-13558)\">http://www.jetbrains.net/jira/browse/IDEA-13558)</a>.<br/>\n<br/>\nI&#39;m not entirely sure what Eclipse does to run tests across modules. <br/>\nI suspect it has similar limitations.<br/>\n<br/>\n** Another take on describing an ideal<br/>\n<br/>\nI guess what I&#39;d find in an ideal world is a way to optionally group<br/>\ntest classes (or specific tests) with a textual group-name and then be<br/>\nable to pass one or more group-name to a test runner which would then<br/>\nexecute only the tests tagged appropriately.  The test runner would<br/>\nalso support negation so that you could express &quot;not online tests&quot;.<br/>\n<br/>\nBoth the Eclipse and IDEA developers could enhance their test runners<br/>\nto support execution filtering by group.  They would be able to<br/>\ncontinue to provide their special &quot;run all tests across all modules&quot;<br/>\nfeature, and it could apply the group filters across all modules.<br/>\n<br/>\n** Grouping by class or string?<br/>\n<br/>\nI don&#39;t like the idea of specifying a group using a class because it<br/>\ndoesn&#39;t feel like a class to me.  It&#39;s meta-data not code; the fact<br/>\nthat it&#39;s an empty class has a bit of a smell to me.  The thing I&#39;m<br/>\ndescribing really seems like it&#39;s a tag (ala flickr etc) that is used<br/>\nto organize tests.  I like the fact that it&#39;s loose (as all tags are)<br/>\nso that you can establish a convention across modules without having<br/>\nto share actual classes.  If you want refactor-safety, you could<br/>\ncreate a static class with constants (e.g. @Test(group =<br/>\nTestSuites.DATABASE)).  Users would have the option. <br/>\n<br/>\n<br/>\nSo, the thing I realized which is important is that what I&#39;m really<br/>\nlooking for is tag/group support in the Eclipse and IDEA custom test<br/>\nrunners (sure, ant and maven would be nice too, it&#39;s secondary to me<br/>\nthough).  I don&#39;t see how a junit extension like cpsuite could solve<br/>\nthe &quot;all tests with tag &#39;foo&#39; across all modules&quot; problem.  It&#39;s one<br/>\nlevel out from there (at the junit ant task, maven surefire, idea, or<br/>\neclipse level).  The only way eclipse/idea would support something<br/>\nlike this is if someone writes an entirely new test runner plugin<br/>\n(seems like a big waste of time) or if the group/tag feature makes its<br/>\nway into junit core.  Then all of the various runners would likely<br/>\nbuild in support.<br/>\n<br/>\nSorry for the long winded message.  There are a few ideas in here. <br/>\nWhat do you think?<br/>\n<br/>\nChristian<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;David Saff&quot; &lt;saff@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Christian,<br/>\n&gt; <br/>\n&gt; Thank you for the feature request.  Let&#39;s discuss further here, and<br/>\n&gt; then summarize to the bug posting--I&#39;ve indicated as such to the<br/>\n&gt; tracker listing.<br/>\n&gt; <br/>\n&gt; Just to make sure I&#39;m hearing you right, it sounds like you were using<br/>\n&gt; a method to run all the tests, without having to enumerate them<br/>\n&gt; individually.  Is that right?  What were you using?  Eclipse?  Ant?<br/>\n&gt; <br/>\n&gt; It seems there&#39;s two concerns you bring up, and JUnit doesn&#39;t handle<br/>\n&gt; either natively: Suite construction (find all the tests I might want<br/>\n&gt; to run) and suite subdivision (only run the tests I actually want to<br/>\n&gt; run).<br/>\n&gt; <br/>\n&gt; *** Suite construction ***<br/>\n&gt; <br/>\n&gt; It&#39;s really important for me that it&#39;s clear how to run all my tests,<br/>\n&gt; so I&#39;ve often had to start with an AllTests suite from the very<br/>\n&gt; beginning.  Maintaining those suites can be annoying, so in some of my<br/>\n&gt; projects, I&#39;ve used Johannes Link&#39;s excellent ClasspathSuite:<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.johanneslink.net/cpsuite.html\">http://www.johanneslink.net/cpsuite.html</a><br/>\n&gt; <br/>\n&gt; This allows me to run all tests in a package without having to<br/>\n&gt; enumerate them.  Eclipse and ant do this &quot;in the UI&quot;, but I prefer<br/>\n&gt; doing it in the suite definition itself, so other developers can run<br/>\n&gt; my tests without matching the UI.<br/>\n&gt; <br/>\n&gt; *** Suite subdivision<br/>\n&gt; <br/>\n&gt; Once we can find all the tests we might want to run, how do we<br/>\n&gt; restrict which are actually run?  There are two out-of-the-box<br/>\n&gt; solutions I know of.<br/>\n&gt; <br/>\n&gt; First, I accomplish what you discuss through package organization: I<br/>\n&gt; can run test.unit.**, test.online.**, or test.** to get everything.<br/>\n&gt; This doesn&#39;t match every conceivable need, but it does match every<br/>\n&gt; need I&#39;ve had so far.  Would it handle your current situation?<br/>\n&gt; <br/>\n&gt; Second, JUnitExt claims to add a @Category annotation that does almost<br/>\n&gt; exactly what you promise.  Would that handle your situation?  One<br/>\n&gt; thought I have is that perhaps we&#39;d want to base groups on class<br/>\n&gt; names, so that automated refactoring can help if we decide to use a<br/>\n&gt; more informative name, and to provide an obvious place to document and<br/>\n&gt; extend a category definition.  That is, rather than<br/>\n&gt; <br/>\n&gt; @Category(&quot;online tests&quot;) public class MyTest {<br/>\n&gt; <br/>\n&gt; We could have<br/>\n&gt; <br/>\n&gt; @Category(OnlineTests.class) public class MyTest {<br/>\n&gt; <br/>\n&gt; Or even just<br/>\n&gt; <br/>\n&gt; @OnlineTest public class MyTest {<br/>\n&gt; <br/>\n&gt; So, questions for the community:<br/>\n&gt; <br/>\n&gt; 1) Should something like ClasspathSuite be incorporated into JUnit?<br/>\n&gt; 2) Should something like JUnitExt&#39;s categories be incorporated into<br/>\nJUnit?<br/>\n&gt; 3) If yes to the above, what should the API look like?<br/>\n&gt; <br/>\n&gt; Remember that we strive to have JUnit be the intersection of all<br/>\n&gt; useful testing frameworks, not their union.  Thanks,<br/>\n&gt; <br/>\n&gt;    David Saff<br/>\n&gt; <br/>\n&gt; On 7/5/07, Christian Nelson &lt;cnelson@...&gt; wrote:<br/>\n&gt; &gt; I&#39;ve created a new feature request describing what I think better<br/>\n&gt; &gt; suite/group support would look like:<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"https://sourceforge.net/tracker/index.php?func=detail&aid=1748683&group_id=15278&atid=365278\">https://sourceforge.net/tracker/index.php?func=detail&aid=1748683&group_id=15278&atid=365278</a><br/>\n&gt; &gt;<br/>\n&gt; &gt; Please chime in and share your thoughts on the subject.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Christian<br/>\n&gt; &gt;<br/>\n&gt; &gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;Christian Nelson&quot; &lt;cnelson@&gt; wrote:<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; I have a feeling I&#39;m about to bring up a much discussed topic,<br/>\n&gt; &gt; &gt; however, I wasn&#39;t able to find any related topics by searching this<br/>\n&gt; &gt; &gt; mailing list.  My apologies in advance if this has been hashed out<br/>\n&gt; &gt; before.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; While generally thinking that its not a great idea, I occasionally<br/>\n&gt; &gt; &gt; come into a situation where I genuinely need to partition my tests<br/>\n&gt; &gt; &gt; into more than one group or partition or suite.  The latest<br/>\nexample is<br/>\n&gt; &gt; &gt; with a client who has many unit style tests as well as a number of<br/>\n&gt; &gt; &gt; tests which require specific network connectivity only available<br/>\nfrom<br/>\n&gt; &gt; &gt; a subset of machines (the outgoing requests must come from a<br/>\nspecific<br/>\n&gt; &gt; &gt; ip address).  We call these the &quot;online tests&quot;.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; We want to be able to group our tests into two groups, &quot;unit tests&quot;<br/>\n&gt; &gt; &gt; and &quot;online tests&quot;.  In some case we want to run only &quot;unit<br/>\ntests&quot; or<br/>\n&gt; &gt; &gt; only &quot;online tests&quot;, and in other cases we want to run both (or<br/>\nall).<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; I understand that this functionality is available using JUnit 4&#39;s<br/>\n&gt; &gt; &gt; @RunWith(Suite.class) and @SuiteClasses(TestClass1.class, ...).<br/>\n&gt; &gt; &gt; However, manually adding test classes to a suite is clunky<br/>\nbecause the<br/>\n&gt; &gt; &gt; list of  test classes becomes huge.  It&#39;s also error prone; it&#39;s<br/>\neasy<br/>\n&gt; &gt; &gt; for developers to write a test but forget to add it to @SuiteClass.<br/>\n&gt; &gt; &gt; Lastly, test runners will run test in suites multiple times when<br/>\ntold<br/>\n&gt; &gt; &gt; to &quot;run all tests&quot;.  That&#39;s hardly the desired behavior.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; What I really would like to see is the concept of suite (or group in<br/>\n&gt; &gt; &gt; TestNG terms) be promoted to a first class citizen.  Honestly, I<br/>\nthink<br/>\n&gt; &gt; &gt;  I would prefer it to be at the test class level (unlike TestNG<br/>\nwhich<br/>\n&gt; &gt; &gt; is at the test method level), since the mechanism should be used for<br/>\n&gt; &gt; &gt; high-level organization IMHO.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; Is there any chance something like this might make its way into<br/>\nJUnit?<br/>\n&gt; &gt; &gt; What can I do to help?<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; Thanks,<br/>\n&gt; &gt; &gt; Christian<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Yahoo! Groups Links<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 19559, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1184651889", 
    "canDelete": false, 
    "nextInTopic": 19564, 
    "prevInTopic": 19549, 
    "headers": {
        "inReplyToHeader": "PDRmN2RhNmI5MDcwNzA5MDkxN2wyNTU0NzZjYXkzMjE1NGNhNzczNDJkMzQ2QG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PGY3aGxwaCtxcWRyQGVHcm91cHMuY29tPg=="
    }
}