{
    "numMessagesInTopic": 18, 
    "nextInTime": 1959, 
    "senderId": "XOWOfd0K6GQ9R_fUTLQOu8QDQD5n46zHYKA6cd8dxt66WgIvUdDYYDSp0yjbinad6gWKWGkxPrmsWN3cKRzO0Lp3VE9hwpyqfhbRzKaAyw", 
    "systemMessage": false, 
    "subject": "RE: [junit] How do I implement a test case for a thrown exception ?", 
    "from": "Robert Watkins &lt;robertw@...&gt;", 
    "authorName": "Robert Watkins", 
    "msgSnippet": "... Mike, I agree with what you are trying to do, but I disagree violently to how you are trying to accomplish it. The problem with your pattern is that, while", 
    "msgId": 1958, 
    "topicId": 1924, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-461829339\">Mike Duffy wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I agree with the point that listing all the possible exceptions<br/>\n&gt; greatly increases code maintenance.  The goal was to know what<br/>\n&gt; exception was thrown if the specific exception being tested is not<br/>\n&gt; thrown (without having to go to a stack trace).  This goal can be<br/>\n&gt; accomplished by catching Exception with a fail in the catch block and<br/>\n&gt; including the name of the exception in the fail message.<br/>\n<br/>\n </span></blockquote>Mike,<br/>\n<br/>\nI agree with what you are trying to do, but I disagree violently to how you<br/>\nare trying to accomplish it.<br/>\n<br/>\nThe problem with your pattern is that, while you know the name of the<br/>\nexception, you&#39;ve lost all other information. You have no way of knowing<br/>\nfrom the output which line in the test caused the exception or which line in<br/>\nthe code actually threw the exception. In order to find out this<br/>\ninformation, you either have to use a debugger or modify the test. 9 times<br/>\nout of 10, the stack trace is more useful than the mere knowledge of what<br/>\nexception was actually thrown (which you don&#39;t lose anyway...<br/>\n<br/>\nAll this information is available in the framework already. All you need to<br/>\ndo is modify the TestRunner, or use a different one. For example, if you run<br/>\nyour unit tests from an Ant script, you will find that the TestRunner<br/>\nprovided by Ant provides the class name, the message, and the stack trace.<br/>\n<br/>\nRobert.<br/>\n<br/>\n-- <br/>\n     &quot;Duct tape is like the Force: it has a light side, a dark side,<br/>\n                   and it holds the universe together&quot;<br/>\n  Robert Watkins     <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robertdw@...\">robertdw@...</a>     <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robertw@...\">robertw@...</a></div>", 
    "prevInTime": 1957, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "995324824", 
    "canDelete": false, 
    "nextInTopic": 1959, 
    "prevInTopic": 1938, 
    "headers": {
        "messageIdInHeader": "PENGMkJDMTM1RkIzN0Q1MTE5N0Q0MDA1MDhCQUY1MjE3MDlCQjFFQGF1Ym5tc3gwMS5xc2kuY29tLmF1Pg=="
    }
}