{
    "numMessagesInTopic": 38, 
    "nextInTime": 1967, 
    "senderId": "P8qHRnoo78qBlVOs1aSgOxjM0E0vqg7H59ws5KnwJPjN-jUaoXpLDku5KTaYtXWNjUudV4aF9Ul55KcUxjnLDabSH_7IlChShzIwSTA", 
    "systemMessage": false, 
    "subject": "RE: [junit] Why doesn&#39;t JUnit count asserts?", 
    "from": "Andrew Inggs &lt;Andrew.Inggs@...&gt;", 
    "authorName": "Andrew Inggs", 
    "msgSnippet": "... I d like to argue against this.  Having many assertions per test makes it more difficult to see where the problem is.  With simple, well name tests it is", 
    "msgId": 1966, 
    "topicId": 1950, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-817827571\">Di Iorio, Matthew (ISS Atlanta) wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; As an aside, we count asserts instead of tests becase it&#39;s a<br/>\n&gt; finer grained metric.  Right now we only have 8 functional<br/>\n&gt; test methods, but 170 assertions.  When we add to a functional<br/>\n&gt; test we don&#39;t create a new test method, we add some more<br/>\n&gt; assertions to an already existing test.  It would be harder to<br/>\n&gt; see progress if we tracked test cases.<br/>\n<br/>\n </span></blockquote>I&#39;d like to argue against this.  Having many assertions per test<br/>\nmakes it more difficult to see where the problem is.  With<br/>\nsimple, well name tests it is often enough to see the name and<br/>\nknow exactly where to look in your code.  With long complicated<br/>\ntests, you&#39;ll probably have to read the *test* again before you<br/>\neven start looking in the code.  I also often write several<br/>\nrelated tests that build on each other -- if the first fails I<br/>\nexpect the others in the group to fail too.  If only the first<br/>\nfails, it is a hint that there may be a problem with that test.<br/>\n<br/>\nI just don&#39;t see a good reason to count asserts.  There&#39;s no<br/>\nmagic ratio of asserts to tests that is better than another.  As<br/>\nfor impressing the boss with bigger numbers, that&#39;s not a good<br/>\nreason to incorporate it into the framework :-).<br/>\n<br/>\n-- Andrew</div>", 
    "prevInTime": 1965, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "995364861", 
    "canDelete": false, 
    "nextInTopic": 1968, 
    "prevInTopic": 1962, 
    "headers": {
        "messageIdInHeader": "PDc3RDk0QTlCRENFRkQzMTE5REYxMDBEMEI3M0VBNkE4NTQxMzJCQHRlbGVjYTEyNj4="
    }
}