{
    "numMessagesInTopic": 43, 
    "nextInTime": 19682, 
    "senderId": "KBGcnWOv9eA5DPjrhLOYLNrwnP_A_caSrGtMzQAV1GokMeBvQ8mfrITNYxIjErASsTcfqJX7PK_vGueHkCT6LXcyrTUcWKpEj3z0KPj-m5Im", 
    "systemMessage": false, 
    "subject": "Re: [junit] Testing singleton patterns", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains762@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... OK. It didn t take long to get to the organizational dysfunction in play. ... Not necessarily: the more modularized the system, the less complex the ", 
    "msgId": 19681, 
    "profile": "nails762", 
    "topicId": 19636, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 282027414, 
    "messageBody": "<div id=\"ygrps-yiv-1492841201\">Carfield Yim wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; It is. If you have 100 XML documents, you&#39;re almost certainly doing<br/>\n&gt;  &gt; something wrong. The most obvious question I&#39;d ask is &quot;How big is the<br/>\n&gt; <br/>\n&gt; Yes, I think in same way, but I still ordered to move more code to XML<br/>\n&gt; to make it more configurable. Yes, ordered.<br/>\n<br/>\n </span></blockquote>OK. It didn&#39;t take long to get to the organizational dysfunction in play.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; application?&quot; It might be too big and needs to be modularized. Another<br/>\n&gt;  &gt; question I&#39;d ask is &quot;What do your layers look like?&quot; It might be poorly<br/>\n&gt;  &gt; layered.<br/>\n&gt; <br/>\n&gt; Very likely there are room of improvement. However, I think, if the<br/>\n&gt; management put configurable as the highest priority, moving most class<br/>\n&gt; member to XML configuration (spring in our case) . No matter how well<br/>\n&gt; the modularized / layering, there still a lot of config file and make<br/>\n&gt; thing more complicate than it should be.<br/>\n<br/>\n </span></blockquote>Not necessarily: the more modularized the system, the less complex the <br/>\nconfiguration would be. I&#39;m willing to bit there&#39;s at least one piece of <br/>\nconfiguration information you have to specify in XML that either never <br/>\nchanges or you&#39;d never want to change, but you have to put it there <br/>\nbecause something else in the same class needs to be configurable. <br/>\nThat&#39;s a sign of the layering problem I have in mind.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; Also, why do we need to test our configuration files? I was under the<br/>\n&gt;  &gt; impression that the goal of externalizing configuration is to make it<br/>\n&gt;  &gt; /easy/ to change how the application behaves. If that&#39;s no longer easy,<br/>\n&gt;  &gt; we must stop externalizing configuration data and figure out what we&#39;re<br/>\n&gt;  &gt; doing wrong.<br/>\n&gt; <br/>\n&gt; Interesting it can be easier in some organization, once the<br/>\n&gt; application pressed UAT and if some thing required code change, we<br/>\n&gt; need to complete a number of process like &quot;permit to build&quot; , &quot;user<br/>\n&gt; approval&quot;, &quot;cost estimation&quot; ...... Moving code to config in fact<br/>\n&gt; provide &quot;hole&quot; to bypassed all those procedures to make quick change.<br/>\n&gt; And that is the reason why management prefer more config.<br/>\n<br/>\n </span></blockquote>Aha! Another organizational dysfunction. They&#39;re everywhere! :)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I can understand, what I think we can improve is there are some<br/>\n&gt; variable that is just not make sense to be configurable, like change<br/>\n&gt; the default will break the application, but we still ordered to make<br/>\n&gt; it configurable just because there are possible to change.....<br/>\n<br/>\n </span></blockquote>I would want to learn more about the two organizational problems you <br/>\ndescribed to me first. Why are you being ordered to do something that <br/>\nyou strongly believe is a bad idea? Why does your team have to create <br/>\nholes in the design to get around testing? What you describe is a <br/>\nclassic case of trying to solve people problems by changing code. It <br/>\ndoesn&#39;t work for long. :)<br/>\n<br/>\nI sympathize with your position. It&#39;s not easy.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Actually it is off-topic a lot. in fact I just like to make the point<br/>\n&gt; that IoC framework is not magic and there are cases that using pattern<br/>\n&gt; like &quot;only create once&quot; is better to make it configurable. In fact, I<br/>\n&gt; think this case is a lot more than we expect.<br/>\n<br/>\n </span></blockquote>I don&#39;t know whether it&#39;s so off-topic: introducing JUnit into an <br/>\norganization tends to get people asking more interesting questions. I <br/>\nsee it over and over again.<br/>\n<br/>\nBack to your comment, of course it&#39;s the case: DI containers are no more <br/>\nmagic than any other code. It&#39;s also false, though, that DI containers <br/>\nforce you to have 100 XML configuration files. I just wanted to be sure <br/>\nboth sides were represented in the discussion.<br/>\n<br/>\nGood luck... I mean that.<br/>\n-- <br/>\nJ. B. (Joe) Rainsberger :: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jbrains.ca\">http://www.jbrains.ca</a><br/>\nYour guide to software craftsmanship<br/>\nJUnit Recipes: Practical Methods for Programmer Testing<br/>\n2005 Gordon Pask Award for contribution Agile Software Practice</div>", 
    "prevInTime": 19680, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1186000912", 
    "canDelete": false, 
    "nextInTopic": 19682, 
    "prevInTopic": 19680, 
    "headers": {
        "inReplyToHeader": "PGI0NTAzYzE3MDcwNzMxMTAwNWozOTJlNWQ3Nmg1NDJiYTg1OTdjNDkzZGFAbWFpbC5nbWFpbC5jb20+", 
        "messageIdInHeader": "PDQ2QjBGMDEwLjQwNDA2MDhAZ21haWwuY29tPg==", 
        "referencesHeader": "PDQ2QUI0MTZDLjIwNDA0MDBAcGZhcnJlbGwuY29tPiA8NDZBQzlBQTUuNzA2MDJAaWxqYXByZXVzcy5kZT4JIDxiODZiNmE5YzA3MDcyOTA5MDNyMzAzNmIzNzFpNWU3OGI2NGE4Njk0NTlkMUBtYWlsLmdtYWlsLmNvbT4JIDw0NkFDQzRGNy44MDgwMTAwQGlsamFwcmV1c3MuZGU+CSA8YjQ1MDNjMTcwNzA3MzAwOTEwczc2M2M2YzQzdzI4ZmQzMDQ2YWM3NTM3Y2FAbWFpbC5nbWFpbC5jb20+CSA8NDZBRThDOTUuMzA0MDYwM0BwZmFycmVsbC5jb20+IDw0NkFFQjczQi40MDgwMTA1QGdtYWlsLmNvbT4gPGI0NTAzYzE3MDcwNzMxMTAwNWozOTJlNWQ3Nmg1NDJiYTg1OTdjNDkzZGFAbWFpbC5nbWFpbC5jb20+"
    }
}