{
    "numMessagesInTopic": 2, 
    "nextInTime": 19740, 
    "senderId": "WWZL7i9tIUt8BEf1IJbYTzTQ_3tbVK2ZF5sS3XMNNmgWdKe7vnKYJx0ZkfXrWPt8GOaRsbnzWNASDsXzxBQ_9wEZ", 
    "systemMessage": false, 
    "subject": "Re: [Junit-devel] JUnit 4.4 released", 
    "from": "&quot;David Saff&quot; &lt;saff@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "Mauro, ... Actually, on my latest project, I ve just been using the matchers in junit-4.4.jar, and it s been going great.  So at least this user is doing fine", 
    "msgId": 19739, 
    "profile": "dsaff", 
    "topicId": 19739, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 139771899, 
    "messageBody": "<div id=\"ygrps-yiv-1821448045\">Mauro,<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 8/9/07, Mauro Talevi &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mauro.talevi@...\">mauro.talevi@...</a>&gt; wrote:<br/>\n&gt; - you ae selling as a benefit having a single jar as opposed to two - junit and hamcrest-core - when<br/>\n&gt; the user would still have to download separatedly hamcrest-library.  Does not make a big difference<br/>\n&gt; to download 2 or 3 files, IMHO.<br/>\n<br/>\nActually, on my latest project, I&#39;ve just been using the matchers in<br/>\njunit-4.4.jar, and it&#39;s been going great.  So at least this user is<br/>\ndoing fine with one jar.  :-)<br/>\n<br/>\nDo you yourself need hamcrest-library for what you&#39;re doing?<br/>\n<br/>\n&gt; - the classpath problems would not manifest themselves if the hamcrest-core dependency was missing,<br/>\n&gt; or in any case it would be easy to spot fail-fast problems, as opposed to really nasty problems due<br/>\n&gt; to different versions of hamcrest-core, one embedded and one not, in the classpath.<br/>\n<br/>\nIt is easy to spot fail-fast problems, but not necessarily easy to fix<br/>\nthem--we have at least one user a month who posts to the user list<br/>\nconfused about how to get just the single junit.jar on their<br/>\nclasspath.<br/>\n<br/>\nI&#39;m saying that both are problems, and any solution is a trade-off.<br/>\nMy personal hunch is that if you ask Java developers the first jar<br/>\nthey ever put on their classpath, JUnit scores high, and I&#39;m very<br/>\nconcerned about making that experience any more complicated than<br/>\nnecessary.<br/>\n<br/>\nOn the other hand, so much of the complexity here is unnecessary.  I<br/>\nbelieve that a vanilla Java installation should include a jpkg command<br/>\nline, so that the answer to the first JUnit FAQ could be:<br/>\n<br/>\njpkg install junit<br/>\n<br/>\nIt would be great if end-users didn&#39;t have to care how many jar files<br/>\nwere installed to make that work, or even what a jar file is.<br/>\n<br/>\n&gt;<br/>\n&gt; - by bundling hamcrest-core you are also surrendering the advantage of a clear versioned dependency<br/>\n&gt;     structure, which is extremely important with so many open-source libraries, all interconnected<br/>\n&gt; among them.  A lot of people nowadays use maven or maven-like repositories for their project<br/>\n&gt; dependencies.<br/>\n<br/>\nI&#39;d love to see more people use maven (it&#39;s the closest thing to the<br/>\nmythical jpkg we have), so making life hard for them is not good.<br/>\nHowever, I think that there&#39;s still more people who are downloading<br/>\nthe jar manually from the website, and still more who just use<br/>\nwhatever ships with their IDE, so balance is important.<br/>\n<br/>\n&gt; Ideally, I would like to see junit released with all its constituent libraries - mandatory or<br/>\n&gt; optional - separate.  And perhaps have a junit-all that bundles all of the them, including<br/>\n&gt; hamcrest-library, as a utility packaging for those that choose to use it.  Other users may choose<br/>\n&gt; not to.<br/>\n&gt;<br/>\n&gt; Alternately, I would be grateful if junit could also release the unbundled jar - call it junit-dep<br/>\n&gt; or whatever, which requires the external dependency to be present in the classpath.<br/>\n<br/>\nI think that the second is the right solution.  Look for further news<br/>\nsoon.  Thanks,<br/>\n<br/>\n   David </span></blockquote></div>", 
    "prevInTime": 19738, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1187016143", 
    "canDelete": false, 
    "nextInTopic": 19750, 
    "prevInTopic": 0, 
    "headers": {
        "inReplyToHeader": "PGY5ZnRzaCRta3EkMkBzZWEuZ21hbmUub3JnPg==", 
        "messageIdInHeader": "PDRmN2RhNmI5MDcwODEzMDc0Mms2OTcxNTY3MnMyMTI3NTU2NWYwZDFkNGI1QG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PDRmN2RhNmI5MDcwNzE4MTM1N3k1ZGQzOTcyOW0xNzI3YmYzZmVlYzUyNmE2QG1haWwuZ21haWwuY29tPgkgPGY4aWxhZSQ4c3YkMUBzZWEuZ21hbmUub3JnPgkgPDRmN2RhNmI5MDcwODA5MDkzNXQzNDBiMmZjMGxhNDIxMWFhYjQzODQzZmNjQG1haWwuZ21haWwuY29tPgkgPGY5ZnRzaCRta3EkMkBzZWEuZ21hbmUub3JnPg=="
    }
}