{
    "numMessagesInTopic": 6, 
    "nextInTime": 19886, 
    "senderId": "Gbpw0I7YYmlIj8JzzbiQ6Nihw0proORT-YB1psUhIacEv7OYYiytNXf23nbi0YkR0JODJadZSjDtGpDFswrxXv3QGJann7DU", 
    "systemMessage": false, 
    "subject": "Re: JUnit add-on for historical/statistical/trend analysis?", 
    "from": "&quot;David Jones&quot; &lt;david@...&gt;", 
    "authorName": "David Jones", 
    "msgSnippet": "... Kirk, DevCreek can show a detailed review of the past day s testing and also historical charts with trending information. The complete history of test run", 
    "msgId": 19885, 
    "profile": "arctor69", 
    "topicId": 19803, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 318949107, 
    "messageBody": "<div id=\"ygrps-yiv-1952979409\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;David Saff&quot; &lt;saff@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Is DevCreek anything like what you&#39;re looking for?<br/>\n&gt; <br/>\n&gt; On 8/27/07, kirkandsheila &lt;kirk@...&gt; wrote:<br/>\n&gt; &gt; Hi all,<br/>\n&gt; &gt;<br/>\n&gt; &gt; I&#39;m doing some research to determine what products/projects are out<br/>\n&gt; &gt; there to perform historical/statistical/trend analysis on JUnit<br/>\n&gt; &gt; results. Ideally, I&#39;d like to be able to break down the JUnit results<br/>\n&gt; &gt; that can be filtered, aggregated, and so forth for reports.<br/>\n<br/>\n </span></blockquote>Kirk, DevCreek can show a detailed review of the past day&#39;s testing<br/>\nand also historical charts with trending information. The complete<br/>\nhistory of test run and test method executions are recorded for each<br/>\ndeveloper on the team. Every test run inside of the developer&#39;s IDE is<br/>\nrecorded rather than just those triggered by the build process after<br/>\ncheck-in. We have an Eclipse Java plug-in ready for use with JUnit,<br/>\nand a web API to collect JUnit or other metrics from outside of<br/>\nEclipse. We would be happy to work with you if you are using JUnit<br/>\nfrom an alternative IDE or text editor. If you are happy sharing your<br/>\ndata with the community then the service is free to use.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://devcreek.com\">http://devcreek.com</a><br/>\n<br/>\nYou can get detailed feedback on your recent testing either in Eclipse<br/>\nor on the website. We present each executed test run, whether it was<br/>\nsuccessful or not and the number of tests involved. This can help you<br/>\nto become more aware of how you are testing, alert you when you are<br/>\nstraying from your preferred behaviour (for example when you are lost<br/>\nin the debugger for hours on end rather than writing a new test), or<br/>\nact as a measure for adopting a new testing style. We also show some<br/>\nsimple heuristics and a list of added test methods. The intention is<br/>\nthat this data can feed back into your own and your team&#39;s learning<br/>\npractices.<br/>\n<br/>\nI haven&#39;t done much coding the last few days, but feel free to get an<br/>\nidea of the recorded activity by looking at the DevCreek project<br/>\nitself (TestCreek is an earlier project name for DevCreek):<br/>\n<br/>\nProject activity: <a rel=\"nofollow\" target=\"_blank\" href=\"https://devcreek.com/project/TestCreek\">https://devcreek.com/project/TestCreek</a><br/>\n<br/>\nMy own testing activity:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"https://devcreek.com/principalActivity/TestCreek/DGJ\">https://devcreek.com/principalActivity/TestCreek/DGJ</a><br/>\n<br/>\nThe other side is historical charts. We keep a history of the test<br/>\nexecutions for the entire duration of the project. We have number of<br/>\nbuilt-in reports that <br/>\n<br/>\ncover a range of testing analyses. For example total test methods,<br/>\nfrequency of test run <br/>\n<br/>\nexecutions, test durations, results and so on. We also have some<br/>\nreports that get closer to <br/>\n<br/>\nquality and process measures such as time taken to fix broken tests,<br/>\nthe cost for adding a <br/>\n<br/>\nnew test method (by number of executed tests/new test method), testing<br/>\nby hour-of-day or <br/>\n<br/>\nday-of-week and so on.<br/>\n<br/>\nCurrently there isn&#39;t much control over filtering and manipulating<br/>\nthese charts though we intend to move to a more interactive mechanism.<br/>\n You can download your project&#39;s data as XML for custom analysis. You<br/>\ncan also explore any of the open projects to learn how they are<br/>\ntesting. We have collected about 25 person years of testing activity<br/>\nso far. This sort of <br/>\n<br/>\ndata is so new, we are all still exploring the<br/>\nspace to find the gems, so getting as many people involved as possible<br/>\nis very useful.<br/>\n<br/>\nHere are the reports collected so far during the development of<br/>\nDevCreek itself:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"https://devcreek.com/reports/projects/TestCreek/index.html\">https://devcreek.com/reports/projects/TestCreek/index.html</a><br/>\n<br/>\nAll of the open projects, such as DevCreek/TestCreek, are open to the<br/>\npublic for us all to learn from. Feel free to click around.<br/>\n<br/>\nWe have also put together a short animation of the first nine months<br/>\nof testing while developing DevCreek. It&#39;s not a report but does<br/>\nattempt to provide an alternative kind of view onto the development<br/>\nprocess.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"https://community.devcreek.com/space/David+Jones/blog/2007-09-10_1\">https://community.devcreek.com/space/David+Jones/blog/2007-09-10_1</a><br/>\n<br/>\n<br/>\nIf you have any questions about JUnit integration, or alternative<br/>\nreports please ask.<br/>\n<br/>\nCheers<br/>\nDavid Jones</div>", 
    "prevInTime": 19884, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1189610479", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 19816, 
    "headers": {
        "inReplyToHeader": "PDRmN2RhNmI5MDcwODI5MTM1M2kxMmY2YjY2ZXM0ZTViNmFkYThiM2ZmMGVmQG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PGZjOTA1ZisxbTI3QGVHcm91cHMuY29tPg=="
    }
}