{
    "numMessagesInTopic": 6, 
    "nextInTime": 19933, 
    "senderId": "rd9kebKH1WJCWBu_nA2GAGqqMITnYSISuBSy1L-5mpYaGtyVfIJMEOjbS7ieKax1hbRh1lbMvFL_Jm98TWBQIiXjFGDKd_KcCVUoxXCOrBmX", 
    "systemMessage": false, 
    "subject": "pattern for testing code in a JAR that I don&#39;t have until after the test starts", 
    "from": "&quot;Bradley, Todd&quot; &lt;todd.bradley@...&gt;", 
    "authorName": "Bradley, Todd", 
    "msgSnippet": "Hi, we use JUnit to do some system testing (in addition to unit testing).  And even though I ve used JUnit every work day for the past 3 years, I have a new", 
    "msgId": 19932, 
    "profile": "todd404", 
    "topicId": 19932, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 184154431, 
    "messageBody": "<div id=\"ygrps-yiv-271912038\">Hi, we use JUnit to do some system testing (in addition to unit<br/>\ntesting).  And even though I&#39;ve used JUnit every work day for the past 3<br/>\nyears, I have a new problem I&#39;m not sure how to approach.<br/>\n<br/>\nI need to write some tests of a Java API that we&#39;re going to deliver to<br/>\nour customer.  And so my basic plan is to write some JUnit test cases<br/>\nthat will interact with our product through this Java API, just as a<br/>\ncustomer would.  But I don&#39;t want to have any of our product source code<br/>\nchecked out to do this.  Instead, I want my JUnit test case&#39;s setUp() to<br/>\nfind the appropriate JAR file on a remote system, fetch it locally, and<br/>\nthen start running tests against it.  That way, whenever the JAR file on<br/>\nthe remote system (our system-under-test) changes, I know I&#39;ll be<br/>\ntesting the latest API code.<br/>\n<br/>\nI&#39;ve got all the tools at hand to find and fetch the JAR file, but I&#39;m<br/>\nnot sure what my approach should be to load the JAR at runtime AFTER my<br/>\ntest (and thus the JVM it&#39;s running in) has already started.  Any advice<br/>\nfor me?<br/>\n<br/>\n<br/>\nTodd.<br/>\n----<br/>\nTodd Bradley - Polycom, Inc.<br/>\nReadiVideo QA Lead</div>", 
    "prevInTime": 19931, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1191016847", 
    "canDelete": false, 
    "nextInTopic": 19936, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PEFBQkVCMjMyRjk1MzM4NDk5REY4RjUxM0VFMkIyQzc4QjM5N0M3QFdTVEVYQ0gwMC53ZXN0bWluc3Rlci5wb2x5Y29tLmNvbT4="
    }
}