{
    "numMessagesInTopic": 2, 
    "nextInTime": 20050, 
    "senderId": "L3nm4EPECJs5QhSMizQHiB-Vza2_5k4ccDPYx5R37wOZHxi_bHxSYC08YQrQoNmvzPSZZsxdhhkzqBMalZ3Mor5LUY6QE4pj", 
    "systemMessage": false, 
    "subject": "Re: [junit] Collecting tests at run-time.", 
    "from": "&quot;Nat Pryce&quot; &lt;nat.pryce@...&gt;", 
    "authorName": "Nat Pryce", 
    "msgSnippet": "Why can t you run your unit tests using JET Excelsior?  Does the ahead-of-time compiler remove reflection information that JUnit needs or something? And why", 
    "msgId": 20049, 
    "profile": "nat_pryce", 
    "topicId": 20048, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 216973656, 
    "messageBody": "<div id=\"ygrps-yiv-447726373\">Why can&#39;t you run your unit tests using JET Excelsior?  Does the<br/>\nahead-of-time compiler remove reflection information that JUnit needs or<br/>\nsomething?<br/>\n<br/>\nAnd why did the acceptance tests not catch the error?<br/>\n<br/>\n--Nat<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 01/11/2007, Buddha Buck &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:blaisepascal@...\">blaisepascal@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   We discovered something disheartening from a testing standpoint: our<br/>\n&gt; development and production environments are different in ways which can,<br/>\n&gt; and<br/>\n&gt; do, change the manner of execution of our project. As such, we&#39;d like to<br/>\n&gt; run our unit tests as part of the execution of our final product, and not<br/>\n&gt; just through our IDE.<br/>\n&gt;<br/>\n&gt; We develop using Eclipse 3.3, using the JUnit4 plugin. We compile for<br/>\n&gt; production and acceptance testing using the JET Excelsior ahead-of-time<br/>\n&gt; compiler, which is Java SE 5 compatible. There are occasions when we have<br/>\n&gt; run into SE6/SE5 compatibility problems but they had a tendency to cause<br/>\n&gt; the<br/>\n&gt; compile to fail, not cause incorrect execution, so we didn&#39;t worry much<br/>\n&gt; about it.<br/>\n&gt;<br/>\n&gt; We started using the XStream XML serialization library. In its default<br/>\n&gt; mode<br/>\n&gt; of operation, it actually tests to see what JVM and what libraries it is<br/>\n&gt; running with to determine what execution mode it wants to run in -- with<br/>\n&gt; certain JVMs, it can use different APIs for increased performance and<br/>\n&gt; capabilities. In our development environment, it was able to run in<br/>\n&gt; &quot;enhanced mode&quot; because it was using a recognized JVM (Sun Java 1.6). In<br/>\n&gt; our production environment, it did not detect a &quot;blessed&quot; JVM, and ran in<br/>\n&gt; &quot;pure java mode&quot;. Our product passed all tests, but failed badly when<br/>\n&gt; pushed to our Customer because our tests didn&#39;t catch that it wasn&#39;t in<br/>\n&gt; enhanced mode.<br/>\n&gt;<br/>\n&gt; I saw from the JUnit 4 API that it is possible to directly run a<br/>\n&gt; testrunner<br/>\n&gt; on a class, invoking all the tests in the class. The @...()<br/>\n&gt; annotation (and the @RunWith annotation) allows one to make test suites<br/>\n&gt; which consist of several classes, allowing one invocation of the<br/>\n&gt; testrunner<br/>\n&gt; to cover all the classes in the suite. Those techniques seem suited to<br/>\n&gt; allowing us to run the tests using our production JVM. But those seem to<br/>\n&gt; require manual updating of the class lists in order to add new classes.<br/>\n&gt;<br/>\n&gt; The problem is that we currently have over 500 tests, spread among many<br/>\n&gt; classes in many packages. I see a maintenance nightmare using @<br/>\n&gt; Suite.classes() because everytime we add a test class (which we do<br/>\n&gt; routinely) we&#39;d have to manually find a suite to add it to. I don&#39;t see a<br/>\n&gt; way to conveniently say &quot;for all classes in this package (or package<br/>\n&gt; hierarchy), run the unit tests&quot;.<br/>\n&gt;<br/>\n&gt; Is there a way to do what we want that isn&#39;t a maintenance nightmare?<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 20048, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1193995053", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 20048, 
    "headers": {
        "inReplyToHeader": "PGYyYmRhYWExMDcxMTAxMTUxNWk2NGU4MDJlOHlmZWI5OWY1ZTEzYTI0MDcwQG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PDE3ZmE1M2QwNzExMDIwMjE3bjQ5ZTk1ZDE5cjZlNGYyMjI0NjQyNDQ2ZDBAbWFpbC5nbWFpbC5jb20+", 
        "referencesHeader": "PGYyYmRhYWExMDcxMTAxMTUxNWk2NGU4MDJlOHlmZWI5OWY1ZTEzYTI0MDcwQG1haWwuZ21haWwuY29tPg=="
    }
}