{
    "numMessagesInTopic": 26, 
    "nextInTime": 20055, 
    "senderId": "p3EUVtv3BbqGa-F_f_WGkGQTYMvAtFucYM3u3vHG1ELmXCxMRf0qxxalyaZPstFmqQtvIpNdH0dyHLA6uia0XgQ9PhT37QuKcqc", 
    "systemMessage": true, 
    "subject": "Re: [junit] Crap4j - Feedback and suggestions wanted", 
    "from": "&quot;Joel Neely&quot; &lt;joel.neely@...&gt;", 
    "authorName": "Joel Neely", 
    "msgSnippet": "Hi, Alberto, I ve downloaded and run it on some code with which I work, and also shown the results to some of my co-workers. I believe the idea is a useful one", 
    "msgId": 20054, 
    "profile": "joelneely", 
    "topicId": 20045, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 236637683, 
    "messageBody": "<div id=\"ygrps-yiv-974602087\">Hi, Alberto,<br/>\n<br/>\nI&#39;ve downloaded and run it on some code with which I work, and also<br/>\nshown the results to some of my co-workers. I believe the idea is a<br/>\nuseful one (once they get past the name and the logo ;-).<br/>\n<br/>\nI understand that this is a work in process, and therefore don&#39;t plan<br/>\nto beat you up over exact coefficient and exponent values until I&#39;ve<br/>\nhad some more experience with it myself. Thanks for taking the first<br/>\nsteps.<br/>\n<br/>\nOne question which I&#39;ve heard multiple times is, &quot;Now what?&quot; I think<br/>\nit would be great if the web site had content (even if wiki-mediated)<br/>\ndescribing common patterns / code structures which cause a high<br/>\nC.R.A.P. index and suggestions for corrective action. Many of my<br/>\nco-workers don&#39;t spend their days thinking about cyclomatic complexity<br/>\nand don&#39;t want to start by reading up on graph theory. Ergo a few<br/>\n&quot;case study&quot; examples would be helpful, showing before-and-after code<br/>\nwhere C.R.A.P. index drops and the resulting code is clearly more<br/>\nmaintainable.<br/>\n<br/>\nFinally, I&#39;d really like to be able to get more information on how the<br/>\ntesting measurement is derived (and the resulting side-effects). In<br/>\none project with lots of unit tests, including some which persisted<br/>\nresults to disk, the output directories were left in a state I did not<br/>\nexpect/understand. Knowing some of the basics here would be helpful to<br/>\nsomeone who wants to take effective action as a result of the reported<br/>\nindex.<br/>\n<br/>\nAgain, thanks for your work on the tool. I hope to see more from it.<br/>\n<br/>\n-jn-<br/>\n<br/>\n-- <br/>\nProgramming is the art of writing essays in crystal clear prose and<br/>\nmaking them execute. - Per Brinch Hansen</div>", 
    "prevInTime": 20053, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1194270988", 
    "canDelete": false, 
    "nextInTopic": 20055, 
    "prevInTopic": 20053, 
    "headers": {
        "inReplyToHeader": "PGZnZDFsayt1MDlvQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDVlMGI5NjhhMDcxMTA1MDU1NnQ2NWNlYmVjMXZlNzVkMDY1YjJkNGEyOGFjQG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PGZnZDFsayt1MDlvQGVHcm91cHMuY29tPg=="
    }
}