{
    "numMessagesInTopic": 3, 
    "nextInTime": 20153, 
    "senderId": "E8xxHYiV2CnICqo8F41rOWbVQsX7vnMnF-Kp8VqLDVwjiPu2p2nndiGTrmOAcctyYrr0tahOm2L4jQY9-uisICyS79nOZpoHajU", 
    "systemMessage": true, 
    "subject": "JUnit test executor.", 
    "from": "&quot;bty906759&quot; &lt;ljsheppard@...&gt;", 
    "authorName": "bty906759", 
    "msgSnippet": "Hi everyone, I m currently working on a test management application which aims to provide a common, simple to use GUI to execute tests on a multitude of test", 
    "msgId": 20152, 
    "profile": "bty906759", 
    "topicId": 20152, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 212006033, 
    "messageBody": "<div id=\"ygrps-yiv-575112728\">Hi everyone,<br/>\n<br/>\nI&#39;m currently working on a test management application which aims to <br/>\nprovide a common, simple to use GUI to execute tests on a multitude <br/>\nof test tools. <br/>\n<br/>\nThere are a few of us developing this application and its initial <br/>\nconcept was born out of the need to drive hardware test tools in a <br/>\ntelecoms lab, so our previous efforts have been to drive these <br/>\nhardware tools (MGTS, DCT & EVO). Though we feel there is scope to <br/>\nbroaden its use and we aim to develop &quot;interfaces&quot; to control <br/>\nsoftware test tools (such as JUnit).<br/>\n<br/>\nSince the application itself is developed in Java and we already <br/>\nhave a suite of JUnit tests; we thought writing a JUnit interface <br/>\nwould be a good first step. Though before we get too far in to it, <br/>\nit would be good to get other peoples views / thoughts on such a <br/>\ntool for JUnit?<br/>\n<br/>\nWithout going into too much detail, the application would <br/>\neffectively provide a web based test management front-end for JUnit <br/>\n(i.e. high level test case creation, execution and results). There <br/>\nwould be some initial setup, as users would need to mirror (either <br/>\nmanually or by using helper scripts) their JUnit test / class names <br/>\nin our application (so the application knows which method / class to <br/>\nexecute for each test / suite of tests and what to store the result <br/>\nagainst), but once that&#39;s done it would just be a case of executing <br/>\nall your JUnit tests through our GUI.<br/>\n<br/>\nIf anyone gets a spare few minutes, it would be good to get some <br/>\nthoughts on what people think about the general concept? i.e. <br/>\nproviding a graphical, simple to use test executor / results store <br/>\n(including metrics and chart generation) tool for JUnit. Do people <br/>\nthink it will be beneficial?<br/>\n<br/>\nI&#39;ll be more than happy to provide more information on the <br/>\napplication etc and we will be looking for people to try the system <br/>\n(with JUnit) in the New Year.<br/>\n<br/>\nCheers,<br/>\nLes.</div>", 
    "prevInTime": 20151, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1197034292", 
    "canDelete": false, 
    "nextInTopic": 20153, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGZqYmh2ayt2aWg3QGVHcm91cHMuY29tPg=="
    }
}