{
    "numMessagesInTopic": 2, 
    "nextInTime": 20155, 
    "senderId": "s6Ivba6Wwqm8FHUAgu6cC84TtGvSDqyKZ6t5ROE-DpeSfimBvFcX5cTsPt0Dhhfp6PwG64lFcG8wRN5mK3VGv62yZjlBz_pfnTUIKA", 
    "systemMessage": false, 
    "subject": "How to get developers to test - FOR SOFTWARE MANAGERS ONLY!!!", 
    "from": "&quot;albsavoia&quot; &lt;albsavoia@...&gt;", 
    "authorName": "albsavoia", 
    "msgSnippet": "If you are just a measly developer, please stop reading here and get back to work.  This post is for the hard and conscientious workers who achieved the rank", 
    "msgId": 20154, 
    "profile": "albsavoia", 
    "topicId": 20154, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 174158319, 
    "messageBody": "<div id=\"ygrps-yiv-574945568\">If you are just a measly developer, please stop reading here and get back to work.  This <br/>\npost is for the hard and conscientious workers who achieved the rank of managers (i.e. <br/>\npeople like your boss).  Work hard and smart and, one day, you too might be a manager.<br/>\n<br/>\n--- Software managers ONLY beyond this point ---<br/>\n<br/>\nA lot of software managers, even those smart enough to get their teams to practice unit <br/>\ntesting, are often afraid or reluctant to use software metrics to track progress and <br/>\ncompliance.<br/>\n<br/>\nI can understand lazy and incompetent developers being afraid of having their work <br/>\nmeasured objectively. But, for the life of me, I can&#39;t imagine why someone with the <br/>\nsuperior brains and skills required to rise from a lowly programmer to the position of <br/>\nmanager would not want to use metrics like code coverage, or lines of unit test code, in <br/>\nperforming their sacred duties.  Who are these metricophobics? Methinks that they are <br/>\njust spineless namby pambies who can&#39;t handle the truth and are afraid of having to take <br/>\ndecisive management action based on actual facts and figures.<br/>\n<br/>\nIf you are one of those jelly-fish managers who indulges in touchy-feely employee <br/>\nreviews and gentle feedback based on abstract and highly-subjective criteria, you need to <br/>\nshape up or get out of software management altogether. We don&#39;t need you, and we don&#39;t <br/>\nwant you!<br/>\n<br/>\nHow do you shape up? You can start by watching, and learning from, a real software <br/>\nmanager in action (i.e. me).<br/>\n<br/>\nIn the following video, you can see how I use the time-tested C.R.A.P. software metric to <br/>\nhandle a developer who refuses to play by the rules.  The C.R.A.P. metric combines code <br/>\ncoverage with cyclomatic complexity to detect overly complex code that is not adequately <br/>\ntested.  Do you want overly complex code without tests in your project?  Of course you <br/>\ndon&#39;t. Then you better make sure that developers don&#39;t get away with it.<br/>\n<br/>\nHere&#39;s the link to the video: <a rel=\"nofollow\" target=\"_blank\" href=\"http://youtube.com/watch?v=JIASiZQR3nI\">http://youtube.com/watch?v=JIASiZQR3nI</a><br/>\n<br/>\nWatch it and learn. CAPISCE!<br/>\n<br/>\nAlberto</div>", 
    "prevInTime": 20153, 
    "specialLinks": [
        {
            "url": "http://www.youtube.com/embed/JIASiZQR3nI?wmode=opaque", 
            "type": "VIDEO"
        }
    ], 
    "contentTrasformed": false, 
    "postDate": "1197472545", 
    "canDelete": false, 
    "nextInTopic": 20155, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGZqb3R2MSs3dTcwQGVHcm91cHMuY29tPg=="
    }
}