{
    "topicId": 1950, 
    "postDate": "995578033", 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "from": "Shane Duan &lt;sduan@...&gt;", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "4KAbcZrZP3ofXE4j6BH6Nny5nIkGlZGg0dq8ZMRfdf8S0av2ImbCVqOSrthN809cHdTW35p7xf0q_iKER8nl3pVevXEW", 
    "nextInTime": 2024, 
    "userId": 0, 
    "prevInTime": 2022, 
    "prevInTopic": 2014, 
    "headers": {
        "messageIdInHeader": "PDNCNTc1MEIxLjlFOUVCMzk0QGJvcmxhbmQuY29tPg==", 
        "referencesHeader": "PE5FQkJLTERKTUxLT0lJQktNUExOS0VKTUNBQUEuanRyeW9uQGhvbWUuY29tPg=="
    }, 
    "authorName": "Shane Duan", 
    "numMessagesInTopic": 38, 
    "msgSnippet": "I think I was carried away yesterday for all the discussions (and sorry about the mistake on Tryon s name. :)  ). Later I calmed down and thought it through", 
    "contentTrasformed": false, 
    "msgId": 2023, 
    "nextInTopic": 2027, 
    "systemMessage": false, 
    "rawEmail": "Return-Path: &lt;sduan@...&gt;\r\nX-Sender: sduan@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-7_2_0); 19 Jul 2001 21:24:39 -0000\r\nReceived: (qmail 91157 invoked from network); 19 Jul 2001 21:23:26 -0000\r\nReceived: from unknown (10.1.10.27) by l10.egroups.com with QMQP; 19 Jul 2001 21:23:26 -0000\r\nReceived: from unknown (HELO sv-mta1.inprise.com) (207.105.72.219) by mta2 with SMTP; 19 Jul 2001 21:23:21 -0000\r\nReceived: from borland.com ([10.143.14.38]) by sv-mta1.inprise.com (iPlanet Messaging Server 5.1 (built May  7 2001)) with ESMTP id &lt;0GGQ00NKPOQT1I@...&gt; for junit@yahoogroups.com; Thu, 19 Jul 2001 14:23:17 -0700 (PDT)\r\nDate: Thu, 19 Jul 2001 14:27:13 -0700\r\nSubject: Re: [junit] Why doesn&#39;t JUnit count asserts?\r\nTo: junit@yahoogroups.com\r\nMessage-id: &lt;3B5750B1.9E9EB394@...&gt;\r\nOrganization: Borland Software Corporation\r\nMIME-version: 1.0\r\nX-Mailer: Mozilla 4.7 [en] (WinNT; U)\r\nContent-type: text/plain; charset=us-ascii\r\nContent-transfer-encoding: 7BIT\r\nX-Accept-Language: en\r\nReferences: &lt;NEBBKLDJMLKOIIBKMPLNKEJMCAAA.jtryon@...&gt;\r\nFrom: Shane Duan &lt;sduan@...&gt;\r\n\r\nI think I was carried away yesterday for all the discussions (and sorry about\nthe mistake on Tryon&#39;s name. :)  ).\n\nLater I calmed down and thought it through and here is what I think.\n\nFirst, I think I need to show you how exactly the tests are written in the XP\ngroup I was in.  So that you know where I am coming from.\n\nAfter we have the stories, assigned the task cards, we sat down and started\ncoding.  However, we don&#39;t exactly do the &#39;DESIGN&#39; part.  Sure we think of the\nstructure a little bit but we do that just to write down the steps that we need\nto achieve in order to finish the task card in hand.\n\nWith the each step, which is normally a functionality we want to add into a\nclass, we write a test method to do waht we call &#39;break the code&#39;.  The test\nwould fail and the only way to pass it is to &#39;fix&#39; the code, or actaully add the\nnew functionality we planned.  Then on the second step we add another test to\nbreak another part of the code (which can be another class), and then fix the\ncode the pass the test.  This break-and-fix pattern keeps going untill all the\nsteps are finished.\n\nSo for this order example, say we have two classes to carry out the task:  Order\nclass get an instance of Product class, which has all the product information.\n\n        Order ---- (uses) ---&gt; Product\n\nAnd to add the logic we want, we use TestOrder and MockProduct to test the Order\nclass, so it is now like this (how to &#39;trick&#39; Order class into using MockProduct\nis another story):\n\n        TestOrder --(uses)--&gt; Order --- (uses) ---&gt; MockProduct\n\nSo we add a testCreateOrder_Unavailable method, we set MockProduct to return\nUNAVAILABLE whenever the getStatus is called, and then assert that an exception\nis thrown when createOrder is called (or some other kind of errors).  The test\nwill fail and the only way to &#39;fix&#39; the code is to add the logic into Order\nclass.\n\nSo as you can see, we are concentrating on the Order class and this class only\nfor this test method.  And that is why Order class itself is considered as a\nunit.  In this way, even if a bug is introduced later into Product class, the\ntests for Order would never fail because it doesn&#39;t care what exactly the real\nProduct is.  And if the tests for Order fail anytime, we would pretty much know\nthat it has to be in either the Order class implementation or the test methods\nimpletation.\n\nHopefully, I understand Tryon&#39;s way correctly, that is:\n\n       TestClass  ---(uses)---&gt; Order ---(uses)---&gt; Product ---(uses)---&gt; ...\n\nSo that&#39;s why you consider the whole module as a unit.  The TestClass here is\nsupposed to test all the functionality (or all the possible result) from the\nbeginnig to the end.  And I think that is what the AT(Acceptance Test) or\nFunctional Test is about.\n\nMy current group is also doing this way because we have a pretty good QA team\ndedicated in writing those tests and the product is kind of too big to spend all\nthe development time on writing unit test for everything now.\n\n\n\n\nJason Tryon wrote:\n\n&gt; My premise is that the tests are the design, not simply related thereto.  We\n&gt; have a list of possible results of creating an order.  These possible\n&gt; outcomes determine the things we have to test.  In creating the tests, we\n&gt; create the design.  It then becomes the tests that drive the design rather\n&gt; than being a trailing afterthought to determine whether we anwered the\n&gt; requirements.\n&gt;\n&gt; Conventional Methodology:\n&gt;\n&gt;        Requirements ----&gt; Design ----&gt; Construction ----&gt; Testing -- --&gt;\n&gt; Delivery\n&gt;                             ^                                       |\n&gt;                             |-----------&lt;  Revision of Design &lt;-----|\n&gt;\n&gt; Suggested Methodology :\n&gt;\n&gt;        Request ----&gt; Tests ----&gt; Design ----&gt; Construction -- --&gt; Delivery\n&gt;                        ^                                     |\n&gt;                        |---------&lt; Revision of Tests &lt;-------|\n&gt;\n&gt; By devising the tests before construction, a couple of things are gained.\n&gt; First, the request, tests and designs are closer together in the process.\n&gt; This improves communication and the reliability of the design.  Second, the\n&gt; tests drive the development process instead of a logical design improving\n&gt; both the quality of the design and the answer the solution provides to the\n&gt; original request.\n&gt;\n&gt; Regards,\n&gt;\n&gt; Jason Tryon\n&gt;\n&gt; P.S.  It&#39;s pronounced Try - on ... like to try on a hat.  :)\n\n\n", 
    "subject": "Re: [junit] Why doesn&#39;t JUnit count asserts?"
}