{
    "numMessagesInTopic": 8, 
    "nextInTime": 20268, 
    "senderId": "4-A7-aHq0bF-EDedW1Cu01ye7j6dZCGjYZefq66UJxLxpvRA3zS3cQ4AXOHP66-jK9jeYioek3CngjyWaURPJckohCZ1wpjH_evM", 
    "systemMessage": true, 
    "subject": "Re: [junit] How do you test your Java EE 5 applications?", 
    "from": "&quot;Kent Larsson&quot; &lt;kent.larsson@...&gt;", 
    "authorName": "Kent Larsson", 
    "msgSnippet": "... most ... new ... EJB ... EJB ... I m ... not ... makes ... broken ... to ... This sounds very interesting! And it s the recommended way in the book ", 
    "msgId": 20267, 
    "profile": "tpbtnek", 
    "topicId": 20253, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 334658005, 
    "messageBody": "<div id=\"ygrps-yiv-2101947884\"><blockquote><span title=\"ireply\">&gt; On 23/01/2008, Joakim Ohlrogge &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joakim.ohlrogge@...\">joakim.ohlrogge@...</a>&gt; wrote:<br/>\n&gt; &gt;  I&#39;m currently doing some basic EJB 3.0 testing and I found that<br/>\n </span></blockquote>most<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;  of the issues I had with the previous specification are gone. The<br/>\n </span></blockquote>new<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;  session beans are just pojos with dependency injection and the<br/>\n </span></blockquote>EJB<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;  stuff is merely visible as anotations.<br/>\n&gt; ...<br/>\n&gt; &gt;  I&#39;m also interested in any issues people may have had with testing<br/>\n </span></blockquote>EJB<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;  3.0 stuff, it would be nice to know what to watch out for before<br/>\n </span></blockquote>I&#39;m<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;  in the middle of it :)<br/>\n&gt; <br/>\n&gt; The issue we&#39;ve had with EJB3 is that the API designers completely<br/>\n&gt; misunderstood dependency injection.  The container really does<br/>\n&gt; *inject* dependencies, bypassing encapsulation, the constructor and<br/>\n&gt; all the other language features that exist to help you manage<br/>\n&gt; dependencies.<br/>\n&gt; <br/>\n&gt; The result of this is that to unit test an session or message-driven<br/>\n&gt; bean you have to duplicate the container&#39;s reflectopornographic<br/>\n&gt; injection mechanism.  This is quite a bit of work.<br/>\n&gt; <br/>\n&gt; Another downside is that you don&#39;t get any indication that you&#39;ve<br/>\n </span></blockquote>not<br/>\n<blockquote><span title=\"ireply\"> &gt; provided all the dependencies to an object in a unit-test.  This<br/>\n </span></blockquote>makes<br/>\n<blockquote><span title=\"ireply\"> &gt; tests brittle.  Simple changes to an object cause a cascade of<br/>\n </span></blockquote>broken<br/>\n<blockquote><span title=\"ireply\"> &gt; tests. You can&#39;t add dependencies by using the IDEs refactoring<br/>\n&gt; features to introduce new constructor parameters.  Instead you have<br/>\n </span></blockquote>to<br/>\n<blockquote><span title=\"ireply\"> &gt; annotate a field or setter method, and then manually go through<br/>\n&gt; everywhere the object is used to check whether all the dependencies<br/>\n&gt; have been set up correctly.<br/>\n&gt; <br/>\n&gt; So, I still find it useful to completely decouple the business logic<br/>\n&gt; from the J2EE layer.<br/>\n&gt; <br/>\n&gt; --Nat<br/>\n<br/>\n </span></blockquote>This sounds very interesting! And it&#39;s the recommended way in the book<br/>\n&quot;Mastering Enterprise JavaBeans 3.0&quot; as well if I interpret it<br/>\ncorrectly.<br/>\n<br/>\nI haven&#39;t found a lot of (not a single one in fact) tutorials<br/>\nexplaining how to do this kind of out of container testing of EJB 3.0<br/>\nstuff (and the book only mentioned it briefly). Perhaps it&#39;s self<br/>\nexplainatory to everyone except me, but I am more leaning on it still<br/>\nbeing a fairly new technology. In either case I do need to discuss this<br/>\na bit more before I&#39;m able to use the method.<br/>\n<br/>\nThis is how I understand it so far. I broke it up into many smaller<br/>\nparagraphs so that it would be easier to comment. If I have understood<br/>\nsomething/most wrong I would appreciate if someone could correct me:<br/>\n<br/>\n//--- How I think it works - Start<br/>\n<br/>\nYou separate your logic from your session bean so that your session<br/>\nbean will become a mere forwarder of requests and replies as well as a<br/>\nhandler of EJB 3.0 components creation.<br/>\n<br/>\nYour logic POJO class will implement the same interface(s) as its<br/>\nsession bean.<br/>\n<br/>\nYour logic POJO class may require other session beans, or more<br/>\naccurately put, it may require other classes which implements the same<br/>\ninterface(s) as said session beans.<br/>\n<br/>\nDuring normal operation the needed real session beans will be injected<br/>\ninto the session bean which requires them. The session beans will then<br/>\nbe passed to the logic POJO class through its constructor.<br/>\n<br/>\nDuring unit testing you&#39;re unable to create the needed real session<br/>\nbeans. Instead you will create the logic POJO class versions of the<br/>\nneeded session beans. These will then be passed to the logic POJO class<br/>\nthrough its constructor.<br/>\n<br/>\n//--- How I think it works - End<br/>\n<br/>\nAnd I also have some questions:<br/>\n<br/>\n1. What should I do with the EntityManager? Should one out-of-container<br/>\nEntityManager be created before each of my unit tests (and destroyed<br/>\nwhen it&#39;s done)? Have you got any tips on how one is created which<br/>\nideally works as the in container one? What about transactions, what<br/>\nshould be one?<br/>\n<br/>\n2. We have cases where the communication is &quot; servlet &lt;-&gt;<br/>\nbusinessSessionBean &lt;-&gt; pojoIntegration &quot; where the pojoIntegration<br/>\nhandles entity beans and database queries and the businessSessionBean<br/>\nmerely acts as a forwarder of requests and responses. In these cases.<br/>\nShould we test the methods of businessSessionBean?<br/>\n<br/>\n3. Do you know any good material which discusess testnig Java EE 5<br/>\napplications this way?<br/>\n<br/>\nThanks for your time reading this post! I hope and would appreciate if<br/>\nyou have something to contribue. <br/>\n<br/>\nBest regards,<br/>\nKent</div>", 
    "prevInTime": 20266, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1201685074", 
    "canDelete": false, 
    "nextInTopic": 20268, 
    "prevInTopic": 20258, 
    "headers": {
        "messageIdInHeader": "PHM3YTA1MDZjLjA2M0BzbXRwZ3cudHBiLnNlPg=="
    }
}