{
    "numMessagesInTopic": 8, 
    "nextInTime": 20269, 
    "senderId": "t-s57cRiqPCWPK08ki-Dyt6iSxBTDgHGTp21aS-2sbkU9B_7EKq1r2eHadPKtZJ4Kk-G3CNg-pDWMSRwFsIwVah2fMNmwB71", 
    "systemMessage": false, 
    "subject": "Re: [junit] How do you test your Java EE 5 applications?", 
    "from": "&quot;Nat Pryce&quot; &lt;nat.pryce@...&gt;", 
    "authorName": "Nat Pryce", 
    "msgSnippet": "... That s what I do. ... I d not do that. However, I m using message-driven, so it might be different for remote object interfaces. The reason I d not have my", 
    "msgId": 20268, 
    "rawEmail": "Return-Path: &lt;nat.pryce@...&gt;\r\nX-Sender: nat.pryce@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nX-Received: (qmail 87155 invoked from network); 30 Jan 2008 10:31:25 -0000\r\nX-Received: from unknown (69.147.108.201)\n  by m57.grp.scd.yahoo.com with QMQP; 30 Jan 2008 10:31:25 -0000\r\nX-Received: from unknown (HELO an-out-0708.google.com) (209.85.132.249)\n  by mta2.grp.re1.yahoo.com with SMTP; 30 Jan 2008 10:31:25 -0000\r\nX-Received: by an-out-0708.google.com with SMTP id d26so36019and.69\n        for &lt;junit@yahoogroups.com&gt;; Wed, 30 Jan 2008 02:31:25 -0800 (PST)\r\nX-Received: by 10.100.214.15 with SMTP id m15mr1257452ang.25.1201689084853;\n        Wed, 30 Jan 2008 02:31:24 -0800 (PST)\r\nX-Received: by 10.100.154.12 with HTTP; Wed, 30 Jan 2008 02:31:24 -0800 (PST)\r\nMessage-ID: &lt;17fa53d0801300231v1e61c9d1sbe3d59c716a2b7dc@...&gt;\r\nDate: Wed, 30 Jan 2008 10:31:24 +0000\r\nTo: junit@yahoogroups.com\r\nIn-Reply-To: &lt;s7a0506c.063@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Transfer-Encoding: 7bit\r\nContent-Disposition: inline\r\nReferences: &lt;s7a0506c.063@...&gt;\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Nat Pryce&quot; &lt;nat.pryce@...&gt;\r\nSubject: Re: [junit] How do you test your Java EE 5 applications?\r\nX-Yahoo-Group-Post: member; u=216973656; y=s8sFHe6Z643tFjNDL7KHhfmNowRQER3Ylj6BXeLzQl6oB3Yl\r\nX-Yahoo-Profile: nat_pryce\r\n\r\nOn 30/01/2008, Kent Larsson &lt;kent.larsson@...&gt; wrote:\n&gt;  I haven&#39;t found a lot of (not a single one in fact) tutorials\n&gt;  explaining how to do this kind of out of container testing of EJB 3.0\n&gt;  stuff (and the book only mentioned it briefly). Perhaps it&#39;s self\n&gt;  explainatory to everyone except me, but I am more leaning on it still\n&gt;  being a fairly new technology. In either case I do need to discuss this\n&gt;  a bit more before I&#39;m able to use the method.\n&gt;\n&gt;  This is how I understand it so far. I broke it up into many smaller\n&gt;  paragraphs so that it would be easier to comment. If I have understood\n&gt;  something/most wrong I would appreciate if someone could correct me:\n&gt;\n&gt;  //--- How I think it works - Start\n&gt;\n&gt;  You separate your logic from your session bean so that your session\n&gt;  bean will become a mere forwarder of requests and replies as well as a\n&gt;  handler of EJB 3.0 components creation.\n\nThat&#39;s what I do.\n\n&gt;  Your logic POJO class will implement the same interface(s) as its\n&gt;  session bean.\n\nI&#39;d not do that. However, I&#39;m using message-driven, so it might be\ndifferent for remote object interfaces.\n\nThe reason I&#39;d not have my objects implement the remote interface is\nthat the remote interface declares exceptions that report errors to\nthe client.  They are no good for reporting errors to the implementor\nof the service with enough information to let the implementor interact\nwith the transaction manager appropriately.\n\n&gt;  Your logic POJO class may require other session beans, or more\n&gt;  accurately put, it may require other classes which implements the same\n&gt;  interface(s) as said session beans.\n\nThe Java classes that I create inside the EJB object don&#39;t directly\ncall other EJB APIs.  I pass them references to interfaces that I have\ndesigned and that make sense in terms of my domain model, but which\nare implemented as wrappers around EJB APIs.\n\nE.g. I wouldn&#39;t pass in an EntityManager.  I would pass in a\nimplementation of SalesLedger that used an EntityManager to implement\nthe abstraction using JPA.\n\n&gt;  During normal operation the needed real session beans will be injected\n&gt;  into the session bean which requires them. The session beans will then\n&gt;  be passed to the logic POJO class through its constructor.\n\nAs above, I&#39;d wrap any types that rely on the JavaEE APIs with\ninterfaces that are closer to my domain, or allow me to throw\nexceptions internally that let me interact with the transaction\nmanager cleanly.\n\n&gt;  During unit testing you&#39;re unable to create the needed real session\n&gt;  beans. Instead you will create the logic POJO class versions of the\n&gt;  needed session beans. These will then be passed to the logic POJO class\n&gt;  through its constructor.\n\nIn unit testing I use mock implementations of the domain abstractions\nthat I pass to the internal objects.\n\nI also have end-to-end and integration tests that exercise the glue\ncode between the app container and my own code and the classes that\nimplement domain abstractions by wrapping JavaEE services.\n\n&gt;  And I also have some questions:\n&gt;\n&gt;  1. What should I do with the EntityManager? Should one out-of-container\n&gt;  EntityManager be created before each of my unit tests (and destroyed\n&gt;  when it&#39;s done)? Have you got any tips on how one is created which\n&gt;  ideally works as the in container one? What about transactions, what\n&gt;  should be one?\n\nIn unit tests I don&#39;t use an entity manager.  I use jMock to mock out\nthe domain abstractions that are implemented with JPA in the real\nsystem.\n\nIn integration tests I create an entity manager by instantiating the\nclasses of the JPA implementation (e.g. Hibernate or Toplink) in JUnit\ntests.\n\n&gt;  2. We have cases where the communication is &quot; servlet &lt;-&gt;\n&gt;  businessSessionBean &lt;-&gt; pojoIntegration &quot; where the pojoIntegration\n&gt;  handles entity beans and database queries and the businessSessionBean\n&gt;  merely acts as a forwarder of requests and responses. In these cases.\n&gt;  Should we test the methods of businessSessionBean?\n\nI would test them in integration or end-to-end tests.\n\n&gt;  3. Do you know any good material which discusess testnig Java EE 5\n&gt;  applications this way?\n\nNo.  It&#39;s something we worked out as we developed JavaEE applications.\n\nI hope that&#39;s some help.\n\nCheers,\n    --Nat\n\n", 
    "profile": "nat_pryce", 
    "topicId": 20253, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 216973656, 
    "prevInTime": 20267, 
    "contentTrasformed": false, 
    "postDate": "1201689084", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 20267, 
    "headers": {
        "inReplyToHeader": "PHM3YTA1MDZjLjA2M0BzbXRwZ3cudHBiLnNlPg==", 
        "messageIdInHeader": "PDE3ZmE1M2QwODAxMzAwMjMxdjFlNjFjOWQxc2JlM2Q1OWM3MTZhMmI3ZGNAbWFpbC5nbWFpbC5jb20+", 
        "referencesHeader": "PHM3YTA1MDZjLjA2M0BzbXRwZ3cudHBiLnNlPg=="
    }
}