{
    "numMessagesInTopic": 12, 
    "nextInTime": 20330, 
    "senderId": "U2-bjq1DhyL4v8tqt8UMl1AE-G3SpTi2Q1y1HPQQUoS9BkJHANZ7b0zyoPRvuBp0XsVgN4iPJHU2dmj5Av2MhZxGELoUlTl4D5i7oU_tqqPq", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Scope of the unit test case", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains762@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... The two are similar enough to call them the same for now. I have found through years of practice that end-to-end tests are ineffective at finding", 
    "msgId": 20329, 
    "profile": "nails762", 
    "topicId": 20323, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 282027414, 
    "messageBody": "<div id=\"ygrps-yiv-2040740205\">On Feb 20, 2008, at 16:38 , edu_kumar wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Hey Nat,<br/>\n&gt;<br/>\n&gt; Thanks for your clarifications, but I have couple of questions  <br/>\n&gt; though..<br/>\n&gt;<br/>\n&gt; 1) The end-to-end testing sounds more like functional testing to me ,<br/>\n&gt; am I correct ?<br/>\n&gt;<br/>\n </span></blockquote>The two are similar enough to call them the same for now. I have found  <br/>\nthrough years of practice that end-to-end tests are ineffective at  <br/>\nfinding integration defects caused by incorrect understanding of the  <br/>\ncontract between pairs of objects. I use a design technique based on  <br/>\ncollaboration tests and contract tests that drive out integration  <br/>\ndefects without integration tests, but it took me a few years of TDD  <br/>\npractice before I felt comfortable with the technique. It&#39;s not for  <br/>\nbeginners.<br/>\n<blockquote><span title=\"ireply\"> &gt; 2) I was thinking TDD is only used to develop functionality by writing<br/>\n&gt; unit tests first and then the code, can it be more generic to apply<br/>\n&gt; for functional testing ?<br/>\n&gt;<br/>\n </span></blockquote>I tried doing TDD starting with end-to-end tests, and I found that it  <br/>\nencouraged me to try to write exhaustive end-to-end tests, and that&#39;s  <br/>\nwhere the big problem lies. In order to test a system exhaustively  <br/>\nwith end-to-end tests, you typically need a huge number of tests.  <br/>\nThousands to millions. I can get the same confidence from hundreds to  <br/>\nthousands of object tests. As a result, I use end-to-end tests as a  <br/>\nway to protect against obvious, wide-spread problems, rather than as a  <br/>\nway to check a system carefully for defects. I certainly don&#39;t use  <br/>\nthem as a starting point for TDD.<br/>\n<blockquote><span title=\"ireply\"> &gt; 3) I need to understand more on this &#39;end-to-end&#39; testing, are there<br/>\n&gt; any tools available ? or I should rely on the build process for<br/>\n&gt; executing all the test cases for me?<br/>\n&gt;<br/>\n </span></blockquote>An end-to-end test is simply a test that runs the entire system from  <br/>\nend to end. There&#39;s no need for specific tools, although there is  <br/>\ngenerally a wider selection of appropriate tools for end-to-end  <br/>\ntesting compared to more focused object testing.<br/>\n<br/>\nAs for the build executing all the tests, I prefer it, but once again,  <br/>\nif we have too many end-to-end tests, then we become tempted to have  <br/>\ntwo different builds: a continuous build that doesn&#39;t run the end-to- <br/>\nend tests (because they&#39;re too slow) and a nightly build that does run  <br/>\nthem (because it takes hours to run them). This slows down feedback  <br/>\nwhile giving us the illusion of continuous feedback, and I find it too  <br/>\neasy to make serious mistakes that way. This is another reason I  <br/>\nlooked for ways to avoid integration defects without end-to-end tests.<br/>\n<blockquote><span title=\"ireply\"> &gt; Actually, I&#39;ve been started using unit-testing tools like Junit<br/>\n&gt; recently for the newly added API in our product but rest of the code<br/>\n&gt; is pretty much legacy in nature. So, i was wondering are there any<br/>\n&gt; tools for doing this end-to-end testing ? just like Junit ?<br/>\n&gt;<br/>\n </span></blockquote>If you have a Java interface for your application, you can use Java- <br/>\nbased tools like JUnit. For web applications, you could use HtmlUnit  <br/>\nor HttpUnit among others. I&#39;m no longer an expert on available tools,  <br/>\nso I&#39;ll let others answer this question better than I could.<br/>\n<br/>\nTake care.<br/>\n----<br/>\nJ. B. (Joe) Rainsberger :: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jbrains.ca\">http://www.jbrains.ca</a><br/>\nYour guide to software craftsmanship<br/>\nJUnit Recipes: Practical Methods for Programmer Testing<br/>\n2005 Gordon Pask Award for contributions to Agile Software Practice</div>", 
    "prevInTime": 20328, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1203606533", 
    "canDelete": false, 
    "nextInTopic": 20330, 
    "prevInTopic": 20326, 
    "headers": {
        "inReplyToHeader": "PGZwaTZsZSs3ZG9xQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDFDNDlCRTkxLTlFM0UtNDM3RC1BQzJELTM0MTMwMTEzMTZEOUBnbWFpbC5jb20+", 
        "referencesHeader": "PGZwaTZsZSs3ZG9xQGVHcm91cHMuY29tPg=="
    }
}