{
    "numMessagesInTopic": 12, 
    "nextInTime": 20332, 
    "senderId": "ZN7iIzKnNlD5uopK9NK9c0hU9YkTOka6jEAftW2XDdOgltRjsAZMeaKk1JA_1xrjq4ZEycpW2epc_OFOulf_O57WYhwmZNRZptQ", 
    "systemMessage": true, 
    "subject": "Re: Scope of the unit test case", 
    "from": "&quot;edu_kumar&quot; &lt;sarat.beesa@...&gt;", 
    "authorName": "edu_kumar", 
    "msgSnippet": "Thank you all for your responses, I think your suggestions, pretty much answered all my questions.. ... writing", 
    "msgId": 20331, 
    "profile": "edu_kumar", 
    "topicId": 20323, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 225062034, 
    "messageBody": "<div id=\"ygrps-yiv-1978652322\">Thank you all for your responses, I think your suggestions, pretty<br/>\nmuch answered all my questions..  <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;Nat Pryce&quot; &lt;nat.pryce@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; On 20/02/2008, edu_kumar &lt;sarat.beesa@...&gt; wrote:<br/>\n&gt; &gt;  1) The end-to-end testing sounds more like functional testing to me ,<br/>\n&gt; &gt;  am I correct ?<br/>\n&gt; <br/>\n&gt; Yes.  An end-to-end test is a test that tests the system from outside.<br/>\n&gt;  &quot;Edge-to-edge&quot; might be a better term because most systems don&#39;t have<br/>\n&gt; &quot;front&quot; and &quot;back&quot; ends.<br/>\n&gt; <br/>\n&gt; &quot;End-to-end&quot; also applies to the development process.  I like my<br/>\n&gt; end-to-end test run to build the system from source into deployable<br/>\n&gt; packages and automatically deploy those into a production-like<br/>\n&gt; environment in the same way as a real production release.<br/>\n&gt; <br/>\n&gt; &gt;  2) I was thinking TDD is only used to develop functionality by<br/>\nwriting<br/>\n&gt; &gt;  unit tests first and then the code, can it be more generic to apply<br/>\n&gt; &gt;  for functional testing ?<br/>\n&gt; <br/>\n&gt; In TDD you drive all development with tests.  So, if you want the<br/>\n&gt; system to have a feature you first write a test that demonstrates that<br/>\n&gt; the system doesn&#39;t have that feature.  You then work out which classes<br/>\n&gt; need to be be added/modified and do those changes by repeatedly<br/>\n&gt; writing unit-tests, implementing the code, refactoring, and deciding<br/>\n&gt; the next change to make, until eventually the end-to-end test passes.<br/>\n&gt; You then write another end-to-end test.<br/>\n&gt; <br/>\n&gt; End-to-end tests give you most feedback about the system&#39;s external<br/>\n&gt; quality.  Unit tests give you most feedback about the system&#39;s<br/>\n&gt; internal quality.  They also allow you to maximise branch coverage by<br/>\n&gt; running fast (so you can exercise the code with many different input<br/>\n&gt; values) and letting you inject faults (by making mock objects throw<br/>\n&gt; exceptions that are hard to cause in a real system).<br/>\n&gt; <br/>\n&gt; In my experience you need both.  System tests tell you when the system<br/>\n&gt; has stopped working.  Unit tests narrow down precisely where the fault<br/>\n&gt; has been introduced.<br/>\n&gt; <br/>\n&gt; As the system gets larger, you may use subsystem tests that cover<br/>\n&gt; coarse-grained components like servers, MDBs, etc. However, I have<br/>\n&gt; found those only necessary in systems that were not originally written<br/>\n&gt; with TDD.  In systems that were written from the start with TDD,<br/>\n&gt; components are usually loosely coupled enough to let you run<br/>\n&gt; subsystems in a unit-test fixture.<br/>\n&gt; <br/>\n&gt; &gt;  3) I need to understand more on this &#39;end-to-end&#39; testing, are there<br/>\n&gt; &gt;  any tools available ? or I should rely on the build process for<br/>\n&gt; &gt;  executing all the test cases for me?<br/>\n&gt; &gt;<br/>\n&gt; &gt;  Actually, I&#39;ve been started using unit-testing tools like Junit<br/>\n&gt; &gt;  recently for the newly added API in our product but rest of the code<br/>\n&gt; &gt;  is pretty much legacy in nature. So, i was wondering are there any<br/>\n&gt; &gt;  tools for doing this end-to-end testing ? just like Junit ?<br/>\n&gt; <br/>\n&gt; I use JUnit and a lot of helper code and support libraries to run<br/>\n&gt; end-to-end tests and have the automated build run all the tests, unit<br/>\n&gt; tests and end-to-end tests.  There are many tools for testing<br/>\n&gt; applications end to end, like GUI automation tools, but I&#39;ve not found<br/>\n&gt; them to fit into a TDD process very well.<br/>\n&gt; <br/>\n&gt; --Nat<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 20330, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1203813191", 
    "canDelete": false, 
    "nextInTopic": 20332, 
    "prevInTopic": 20330, 
    "headers": {
        "inReplyToHeader": "PDE3ZmE1M2QwODAyMjMwNTQzbzJhYTA1Yzg2cDRmMTVmNzEzNjA0YTBkNjhAbWFpbC5nbWFpbC5jb20+", 
        "messageIdInHeader": "PGZwcWUwNytia3EzQGVHcm91cHMuY29tPg=="
    }
}