{
    "numMessagesInTopic": 2, 
    "nextInTime": 20354, 
    "senderId": "juSq_2ijIwpUpn2NgDnCPMJF607LDlRnSQI1pfAbIAyJdhcOnK4m_UJD7tFkZtCn6ADp9b_gm6SVknc7G4zd1SBoUtBjhRwY", 
    "systemMessage": true, 
    "subject": "Recording method calls and their return values like recording makros", 
    "from": "name zero &lt;namezero911@...&gt;", 
    "authorName": "name zero", 
    "msgSnippet": "Hi there. I know this is not the really correct place for this, but what I actually need is an advice from people who are in the unit testing business in JAVA", 
    "msgId": 20353, 
    "profile": "namezero911", 
    "topicId": 20353, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 218740893, 
    "messageBody": "<div id=\"ygrps-yiv-949378375\">Hi there.<br/>\n<br/>\nI know this is not the really correct place for this, but what I actually need is an advice from people who are in the unit testing business in JAVA for a while now. There is this common problem when testing:<br/>\n<br/>\nI want to test a method of a class. Imagine this class is my business layer which needs to gather information from the database, which is done by another class which communicates with the database itself, and then modifies/evaluates this information. However, this database communication is not the issue which I want to test, but I want to test the business layer itself (and the stuff it does with the gathered information from the database). As most of you know, I could use a mock object for the database layer. I&#39;ve looked around and found some reasonable frameworks like JMock or EasyMock. However, you need to tell the mock object which method calls it has to expect (and with which parameters) and you have to tell it the return values ... and you have to do this all MANUALLY, there&#39;s no automation.<br/>\n<br/>\nHowever, imagine the returned object from the database is something very complex (and also imagine the database structure would change every once in a while). It would be a very difficult job to always keep the returned object (which you create manually in the particular test method) in sync.<br/>\n<br/>\nWhat I am looking for is a way to &quot;record&quot; (like recording macros in M$ Office) all interactions with a specific class (including all its methods), which means that it records the invoked method calls itself, the parameters, as well as the returned result(object)s. The workflow would be easy: I make sure that the database layer and the layer I want to test works (it has to call the correct database-layer methods) and then I run the test in &quot;record-mode&quot;. After that I can start the tests in replay mode, I don&#39;t need to use the database object itself anymore but instead the cached results are returned, however, still with the mock-object characteristics (if the methods of the mockobject aren&#39;t called in the correct order or with wrong parameters I would get an exception). <br/>\n<br/>\nTo keep my question simple: I am looking for a way to have the code that is often seen in these frameworks like<br/>\nexpect(mock.voteForRemoval(&quot;Document&quot;)).andReturn((byte) 42);<br/>\n<br/>\nto be autmatically generated from a &quot;first test run&quot;. Is there such a framework and I&#39;ve just not found it yet?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      ____________________________________________________________________________________<br/>\nBe a better friend, newshound, and <br/>\nknow-it-all with Yahoo! Mobile.  Try it now.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ\">http://mobile.yahoo.com/;_ylt=Ahu06i62sR8HDtDypao8Wcj9tAcJ</a> <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 20352, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1204644915", 
    "canDelete": false, 
    "nextInTopic": 20354, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDkyOTc0NS40NTEyOC5xbUB3ZWI1NDEwNy5tYWlsLnJlMi55YWhvby5jb20+"
    }
}