{
    "numMessagesInTopic": 6, 
    "nextInTime": 20386, 
    "senderId": "pCavuvXBbhJg0s0gUAREr4jlLjz9yZTUBBFs4OyFfENiSQk41WpedLRzxlK7nKkeF-CeUck0ZZOKTzEHp-OxfZcMeLE-hFt35AiBP3_Kv4I", 
    "systemMessage": true, 
    "subject": "Looking for advice on testing scenario", 
    "from": "&quot;techstuff1971&quot; &lt;techstuff1971@...&gt;", 
    "authorName": "techstuff1971", 
    "msgSnippet": "Hi, I am new to JUNIT and although I ve read all of the docs (save the javadoc) it s not entirely clear to me how to proceed or even if JUNIT is appropriate", 
    "msgId": 20385, 
    "profile": "techstuff1971", 
    "topicId": 20385, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 341005950, 
    "messageBody": "<div id=\"ygrps-yiv-23798774\">Hi,<br/>\n<br/>\nI am new to JUNIT and although I&#39;ve read all of the docs (save the<br/>\njavadoc) it&#39;s not entirely clear to me how to proceed or even if JUNIT<br/>\nis appropriate for my needs.  I will explain the situation and was<br/>\nhoping that maybe someone could point me in the right direction.<br/>\n<br/>\nI have written a SQL parser which parses a SQL query and builds an<br/>\nobject model representation of same which it returns as the result of<br/>\na parse.  The object model has the ability to print itself and so long<br/>\nas the parser works correctly what it prints will be very close to the<br/>\ninput query.  A single test case then consists of parsing a query,<br/>\ncalling printMe( ) on the resultant tree and comparing it&#39;s output to<br/>\nwhat was expected, which again, is very similar to but not identical<br/>\nto the original query.<br/>\n<br/>\nSo, first a general question: I know that his is closer to end to end<br/>\ntesting than it is to the sort of fine grained class level tests JUNIT<br/>\nis designed for.  Is JUNIT even appropriate?  Assuming the answer is<br/>\nyes, I&#39;ll continue.<br/>\n<br/>\nThe pseudo code for a single test case would look like this:<br/>\n<br/>\nString orgnlQry = &quot;Select * from MyTable.MyColumn&quot;;<br/>\nString expectedQry = &quot;Select * from MyColumn&quot;;<br/>\nParser myParser = new Parser( );<br/>\n// A bunch of code to construct Parser and connect to data store<br/>\nmyParser.parse(orgnlQry);<br/>\nSQLTree tree = myParser.getTree( );<br/>\nString outQry = tree.printMe( );<br/>\nassertEquals(outQry, expectedQry);<br/>\n<br/>\nI&#39;d like all of my test cases to use the same parser instance so that<br/>\nI only have to initialize it once.  The only variables for each test<br/>\nthan are the orgnl/expectedQry pairs of which I&#39;ve got about 120.  <br/>\n<br/>\nI&#39;m able to get a single test case running but I can&#39;t figure out how<br/>\nto eliminate duplicate code.  I&#39;m also no sure how to organize the<br/>\ntests.  Shold there really be 120 different test methods or is there<br/>\nsome way to call the same test method 120 times with different input<br/>\nstrings?  <br/>\n<br/>\nThanks in advance for any suggestions anyone can provide.<br/>\n<br/>\n-ts1971</div>", 
    "prevInTime": 20384, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1206051918", 
    "canDelete": false, 
    "nextInTopic": 20387, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGZydW84ZStqbnUzQGVHcm91cHMuY29tPg=="
    }
}