{
    "numMessagesInTopic": 6, 
    "nextInTime": 20390, 
    "senderId": "XYR7Z_kGUzh27i4HZapPnAH_NVFSgRUkVMIav6NYHPPqDs9DETSUxjU5rCoOe0OpUDLsX_CJvv3uulicIGkZZU1dXax8L2C7vS20Fw", 
    "systemMessage": true, 
    "subject": "Re: Looking for advice on testing scenario", 
    "from": "&quot;toalexsmail&quot; &lt;toalexsmail@...&gt;", 
    "authorName": "toalexsmail", 
    "msgSnippet": "... Yes, you are write. There are also one-time setUp and tearDown methods that was in TestSetup object in JUnit 3.8. See code examples above. ... You can do", 
    "msgId": 20389, 
    "profile": "toalexsmail", 
    "topicId": 20385, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 340165037, 
    "messageBody": "<div id=\"ygrps-yiv-2080738302\"><blockquote><span title=\"ireply\">&gt; &gt;<br/>\n&gt; <br/>\n&gt; - You can separate initializing code  to setup/teardown method, this<br/>\n&gt; will eleminate some  duplication.<br/>\n&gt; (about setup and teardown method, look here<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://junit.sourceforge.net/doc/faq/faq.htm#organize_3)\">http://junit.sourceforge.net/doc/faq/faq.htm#organize_3)</a><br/>\n </span></blockquote>Yes, you are write. There are also one-time setUp and tearDown methods<br/>\nthat was in TestSetup object in JUnit 3.8. See code examples above.<br/>\n<br/>\n <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; - For 120 different test case, if it has same format and  is in text<br/>\n&gt; file, I recommend writing another class to process reading it and<br/>\n&gt; return turn each pair. <br/>\n&gt; <br/>\n&gt; Let test case use this class to load those test cases, this will save<br/>\n&gt; amount of time instead of doing them all by hand.<br/>\n </span></blockquote>You can do it using @Parametrized method. You can write separate class<br/>\nand use in @Parametrized method or you can write an actual code their.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; - Another issue, I think  it&#39;s better to divide those 120  cases into<br/>\n&gt; different catagories (ie. simple selection, selection with where<br/>\n&gt; clause etc...) . Write a test case for each catagory.  So that when<br/>\n&gt; your code break you can analyse which kind of sql query is the reason.<br/>\n&gt; <br/>\n&gt; I&#39;m quite new to JUnit too, so if some expert see any mistakes or any<br/>\n&gt; recommends.  <br/>\n&gt; <br/>\n&gt; Hope it helps<br/>\n&gt;<br/>\n </span></blockquote>This is very deep point. When you write your tests with parametrized<br/>\nmethod, that is when your test your class with different inputs, you<br/>\nshould divide your input in to EQUIVALENCE CLASSES. <br/>\nLet me explain this in more simple example. Suppose, you want to check<br/>\nMath.sqrt(double a) methods. What values should you check? First of<br/>\nall, you have to notice, that valid input is only [0, +Inf). So, all<br/>\nvalues are spitted down at least to (-Inf, 0), [0, +Inf). This are<br/>\nyour equivalence class in first approximation. You should try, say -7<br/>\nfrom (-Inf, ), +20 from [0, +Inf). You should also try value that is<br/>\nin boundary of your interval, that is 0. Sometimes, it is reasonable<br/>\nto test also value that are &quot;near&quot; boundary, for example 1 and -1. It<br/>\ncan be the case, that this separation is not enough. First of all,<br/>\nwhat about special double values such as NaN? What about -Inf and<br/>\n+Inf? And if you test them, perhaps it is worth to test<br/>\nDouble.MAX_VALUE and Double.MIN_VALUE as &quot;nearest&quot; values? It can be<br/>\nalso reasonable to test the quadratic integer numbers separately.<br/>\n(Quadratic number is number that is exact square, that is a is<br/>\nQuadratic number iff exist number x such that x*x=a) (Run<br/>\nSystem.out.println(Math.pow(Math.sqrt(15), 2)); to see why this can be<br/>\nimportant). So, your equivalence class will be (-Inf, 0), {0},<br/>\n(0,1,2,4,9, 16,... all quadratic numbers}=QI, (0, +Inf)&#92;quadratic<br/>\nnumbers QI, {NaN}, {-Inf}, {+Inf}.<br/>\nIn your case is up to your to decide how to divide to equivalence<br/>\nclasses. Partition to simple selection, selection with where clause<br/>\netc can be or can be not useful just as in the example with<br/>\nMath.sqrt() and quadratic numbers.</div>", 
    "prevInTime": 20388, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1206286678", 
    "canDelete": false, 
    "nextInTopic": 20390, 
    "prevInTopic": 20388, 
    "headers": {
        "inReplyToHeader": "PGZzMnIxNytubnVrQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGZzNXRnbSs0YWZvQGVHcm91cHMuY29tPg=="
    }
}