{
    "numMessagesInTopic": 3, 
    "nextInTime": 20392, 
    "senderId": "H2xM7o-Xmyc_4bz-DJYoQgIVaq1dHijqTSyzeXRxA2WRYlggVrVmjcrRSVFUsUYvJ5XMNGpHYv8pcy3GlmHTyKDgTc1gjAFCB2Msck30XtghDRXduBq1Ab5l", 
    "systemMessage": true, 
    "subject": "Testing part of a private or public method...", 
    "from": "&quot;sunburned.surveyor&quot; &lt;sunburned.surveyor@...&gt;", 
    "authorName": "sunburned.surveyor", 
    "msgSnippet": "I m still rather new to JUnit (although I ve purchased at least two (2) JUnit books)and I m finally getting around to actually using unit tests for my code. ", 
    "msgId": 20391, 
    "profile": "sunburned.surveyor", 
    "topicId": 20391, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 316038725, 
    "messageBody": "<div id=\"ygrps-yiv-1964001010\">I&#39;m still rather new to JUnit (although I&#39;ve purchased at least two <br/>\n(2) JUnit books)and I&#39;m finally getting around to actually using unit <br/>\ntests for my code.<br/>\n<br/>\nI&#39;ve ran into a puzzling situation, and I&#39;m looking for suggestions <br/>\non how to [1] properly test code using JUnit or [2] refactor my code <br/>\nso that it can be tested.<br/>\n<br/>\nThe class in question parses a fairly complex text file and <br/>\nconstructs a single Java object from it. There is a single public <br/>\nparse method that returns an instance of this object. Inside this <br/>\npublic parse method several private helper methods are called. <br/>\nBasically the job of the public method is to call the private helper <br/>\nmethods in the correct sequence, based on the contents of the file <br/>\nbeing parsed.<br/>\n<br/>\nHere is my question: I want to verify that the logic in parts of <br/>\nthese private helper methods does what I intend. Although I know a <br/>\nfailure of any of these &quot;logic parts&quot; in a private helper method <br/>\nwould be reflected in a failure of the public method. However, I want <br/>\nto pinpoint which of the &quot;logic parts&quot; failing.<br/>\n<br/>\nHave I left the realm of unit testing and moved on to some type of <br/>\nfunctional testing? Do I need to refactor these &quot;logic parts&quot; into <br/>\ntheir own private methods, and then use a framework like JUnitX to <br/>\ntest these private methods? Do I write some beanshell scripts that <br/>\ntest this logic instead?<br/>\n<br/>\nThanks for any suggestions on how to proceed. I know this problem is <br/>\ndue to my lack of experience with software testing, and is not a <br/>\nproblem with JUnit.<br/>\n<br/>\nThe Sunburned Surveyor</div>", 
    "prevInTime": 20390, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1206401653", 
    "canDelete": false, 
    "nextInTopic": 20392, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGZzOWRwbCtjdWc2QGVHcm91cHMuY29tPg=="
    }
}