{
    "numMessagesInTopic": 1, 
    "nextInTime": 2041, 
    "senderId": "VhGd6OdgMYbEI5ksfWbLlRpZWwqZwoZgj5CmFcSnOXYHV42q95-oiTEsrzBbjd5_YfS9x15tndMjDIG7Tn-Czx9YGidbjDo", 
    "systemMessage": false, 
    "subject": "XP Universe - XP Adoption Panel Discussion - Program Change", 
    "from": "Paul Hodgetts &lt;prh@...&gt;", 
    "authorName": "Paul Hodgetts", 
    "msgSnippet": "For anyone who is going to XP Universe this coming week... There is a slight program change to the session on Tuesday morning, 8:30 to 10:00 AM, entitled", 
    "msgId": 2040, 
    "topicId": 2040, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-544937593\">For anyone who is going to XP Universe this coming week...<br/>\n<br/>\nThere is a slight program change to the session on Tuesday morning,<br/>\n8:30 to 10:00 AM, entitled &quot;eXtreme Adoption eXperiences of a B2B<br/>\nStart Up.&quot;<br/>\n<br/>\nWe are opening up the topic of this discussion to include any XP<br/>\nadoption experiences, not just those of B2B start ups, or Escrow.com<br/>\nin particular.  We believe this will make the session more generally<br/>\ninteresting to a larger group of the attendees.<br/>\n<br/>\nAlong with the topic change, we have opened up the panel to include<br/>\nother folks from the industry with XP adoption experience, in<br/>\naddition to the original panelists from Escrow.com.  We believe this<br/>\nwill provide the session attendees with access to a wider range of<br/>\nopinions and experiences.<br/>\n<br/>\nWe&#39;d love to have you attend.  We believe there will be some great<br/>\ndiscussions of the challenges and successes of adopting XP.  If<br/>\nyou&#39;re considering adopting XP, you can pick up some tips from folks<br/>\nwho have been through it.  If you&#39;ve adopted XP, it&#39;s a chance to<br/>\nshare your experiences as well as compare your experiences to others.<br/>\n<br/>\nIf you&#39;re interested in participating as a panelist, please contact<br/>\nme directly.<br/>\n<br/>\n-Paul Hodgetts<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:prh@...\">prh@...</a></div>", 
    "prevInTime": 2039, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "995727072", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDQuMi4yLjIwMDEwNzIxMDczNjU3LjAwYzUxNDcwQG1haWwuenp5enh0ZWsuY29tPg=="
    }
}