{
    "numMessagesInTopic": 6, 
    "nextInTime": 20438, 
    "senderId": "lSMp1-fs2DqyREIZLndZVpmUUGBkY4dzkmrpQu-DRH0yaJK2ecTZmFnEkhraLGmYiTJ8d8nqMXXAjF7KXLYOL7XGsSjCmdS6XmiOIQ", 
    "systemMessage": true, 
    "subject": "Re: Parameterized test with default value", 
    "from": "&quot;toalexsmail&quot; &lt;toalexsmail@...&gt;", 
    "authorName": "toalexsmail", 
    "msgSnippet": "... What Parameterized runner does it takes a Collection that returns by @Parameterized method run over it, for each Object[] calls constructor of your class", 
    "msgId": 20437, 
    "profile": "toalexsmail", 
    "topicId": 20436, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 340165037, 
    "messageBody": "<div id=\"ygrps-yiv-1024777227\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;kelvsyc&quot; &lt;kelvsyc@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;ve just gotten into parameterized testing and customized JUnit4<br/>\n&gt; Runners, but I have a few questions:<br/>\n&gt; <br/>\n&gt; How do I go about making a parameterized test for which a single<br/>\n&gt; default parameter value is provided if a list of parameter values is<br/>\n&gt; not given?  (It appears to me that you may need to have a custom<br/>\n&gt; runner that&#39;s similar to Parameterized)<br/>\n&gt; <br/>\n&gt; Furthermore, suppose I have a subclass of this test, which defines a<br/>\n&gt; second parameter, which, unlike the first, is a required parameter<br/>\n&gt; (ie. I can choose to have my list of parameters as either two values<br/>\n&gt; or a single, which would assume the usage of a default value).  How<br/>\n&gt; would I go about doing that?  (Would I need to use a different runner?)<br/>\n&gt; <br/>\n&gt; How would I generalize this to any number of parameters (required and<br/>\n&gt; optional)?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>What Parameterized runner does it takes a Collection that returns by<br/>\n@Parameterized method run over it, for each Object[] calls constructor<br/>\nof your class with supplied variables (that initialize data-members<br/>\nthat will be used by your test method) and calls test method. The<br/>\nnaive way to handle it is to define couple of constructor that will<br/>\ncall one to another and supplying default values. For each entry in<br/>\nCollecion appropriate constructor will be called. It is nice, but<br/>\nunfortunately is not working. It happens that Parameterized runner<br/>\nenforce you to have only one constructor. Under these circumstances<br/>\nyour question is equivalent how can you supplied default values to the<br/>\nattribute in the function (constructor in your case). In Java there is<br/>\nno way to do it (other then overloading). So there is no way out for<br/>\nnow, at least as far as I know.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Finally, what if I wanted my parameterized tests to be named via some<br/>\n&gt; naming function (instead of serially numbered like Parameterized)?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Parameterized runner is written is such a way that there is no easy to<br/>\nextend it in order to achieve this. The main obstacle is that you<br/>\ncan&#39;t override &quot;new TestClassRunnerForParameters(...)&quot; in private<br/>\nstatic runners method, so you actually hast to rewrite this class<br/>\ncompletely.</div>", 
    "prevInTime": 20436, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1207863930", 
    "canDelete": false, 
    "nextInTopic": 20438, 
    "prevInTopic": 20436, 
    "headers": {
        "inReplyToHeader": "PGZ0a2lzaitydHB0QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGZ0bTFwcStmZzZhQGVHcm91cHMuY29tPg=="
    }
}