{
    "numMessagesInTopic": 6, 
    "nextInTime": 20506, 
    "senderId": "NMiFxf82Lm_y1J7YEeudGruYapSf4d4yamVWMoD0aoA7qTw3sZiab0qCJNwVImx-aYnnrTdFzjNFSNNaYvKi2TedKvHZLFV9DEPyiODUCeWK", 
    "systemMessage": false, 
    "subject": "Re: [junit] Help requested in organizing a TDD learning session", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains762@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... I would ask the team whether they want to work on a real feature in order to learn TDD. If they do, then iteration 1 is building something simple that runs", 
    "msgId": 20505, 
    "profile": "nails762", 
    "topicId": 20503, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 282027414, 
    "messageBody": "<div id=\"ygrps-yiv-536838747\">On May 29, 2008, at 14:09 , Mark Levison wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve been asked to organize a half-day/day long session to help a team<br/>\n&gt; at my organization really learn TDD. They have all been to a TDD<br/>\n&gt; course but for a variety of reasons didn&#39;t learn enough to pick up the<br/>\n&gt; habit. The developers all think that TDD is a worthy idea but don&#39;t<br/>\n&gt; know enough to practice it day to day.<br/>\n&gt;<br/>\n&gt; To make this worthwhile I think we need a more interesting example<br/>\n&gt; than the typical factorial example and a location that encourages<br/>\n&gt; pairing. I could start with the team&#39;s existing code and tasks but I<br/>\n&gt; think we would spend a lot of time on non-trivial edge cases without<br/>\n&gt; really hitting TDD. Instead I think I will offer to pair with people<br/>\n&gt; to tackle these problems.<br/>\n&gt;<br/>\n&gt; I&#39;m looking for any and all ideas, but have some specific questions:<br/>\n&gt; - What example would you use? Brian Marick had mentioned one:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.exampler.com/blog/2007/06/26/a-workbook-for-practicing-test-driven-design-draft/\">http://www.exampler.com/blog/2007/06/26/a-workbook-for-practicing-test-driven-design-draft/</a><br/>\n&gt; but the downloads are broken.<br/>\n&gt; - Do you have an example that would demonstrate any of these difficult<br/>\n&gt; issues: abstracting the database, test driving bits of the GUI?<br/>\n&gt; - Do you have good examples to help demonstrate Test Driven<br/>\n&gt; Refactoring aka Michael Feathers and Legacy code.<br/>\n&gt; - Would you go off site? They don&#39;t have a team room yet.<br/>\n&gt; - Would a boardroom setup work well to encourage pairing?<br/>\n&gt; - How long would you make the session? Half day? Full day?<br/>\n&gt;<br/>\n&gt; What would you do?<br/>\n&gt;<br/>\n </span></blockquote>I would ask the team whether they want to work on a real feature in  <br/>\norder to learn TDD. If they do, then iteration 1 is building something  <br/>\nsimple that runs in memory and focuses on the mechanics of TDD and a  <br/>\nfew of the early hiccups. Start with something that involves a handful  <br/>\nof objects working together. I use an example in my &quot;Architecture  <br/>\nWithout Trying&quot; demo that shows MVC/MVP emerging without my pushing in  <br/>\nthat direction, but simply by paying attention to duplication and  <br/>\nnames. The entire demo takes maybe 2 hours.<br/>\n<br/>\nAfter they practice for a while, I offer to spend an hour doing the  <br/>\nsame demo, but Presenter-First style, designing the Model and View  <br/>\ninterfaces, usually using a dynamic mock framework. This takes about  <br/>\nan hour.<br/>\n<br/>\nSo I would definitely expect to take an entire day. If you can  <br/>\nidentify a small feature that involves displaying data from a model,  <br/>\nthen you can do Architecture Without Trying and it might really  <br/>\nimpress them.<br/>\n<br/>\nIn between the demos, ask them to TDD something--anything--and check  <br/>\nin with them every 40 minutes or so. By letting them choose, they get  <br/>\nto learn what they need to learn at the moment they need it. After 40  <br/>\nminutes, spend 10 minutes answering questions or sharing tips and  <br/>\ntricks related to observations you made about their progress: common  <br/>\nquestions, that kind of thing. Then give them a 10-minute break.  <br/>\nRepeat this hour as much as needed.<br/>\n<br/>\nAs for offsite/onsite, do whatever it takes to give them room to be  <br/>\ncomfortable, space to work in pairs, and have a whiteboard or  <br/>\nflipchart handy.<br/>\n<br/>\nI hope that helps you.<br/>\n<br/>\nTake care.<br/>\n----<br/>\nJ. B. (Joe) Rainsberger :: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jbrains.ca\">http://www.jbrains.ca</a><br/>\nYour guide to software craftsmanship<br/>\nJUnit Recipes: Practical Methods for Programmer Testing<br/>\n2005 Gordon Pask Award for contributions to Agile Software Practice</div>", 
    "prevInTime": 20504, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1212108298", 
    "canDelete": false, 
    "nextInTopic": 20506, 
    "prevInTopic": 20503, 
    "headers": {
        "inReplyToHeader": "PGY1Y2M0MWNhMDgwNTI5MTIwOXI1NDZhZWNkZnYzNDQwNDJjZGFkZWUyNTcxQG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PDhCRjAzM0UyLUMzRjktNEM1OC1BRUQ0LTIzREQ4Q0M4REE1OEBnbWFpbC5jb20+", 
        "referencesHeader": "PGY1Y2M0MWNhMDgwNTI5MDgzMm4zMjRkMmQ5YXUyZGU3ZTNmMmNmN2NiZTgxQG1haWwuZ21haWwuY29tPiA8ZjVjYzQxY2EwODA1MjkxMjA5cjU0NmFlY2RmdjM0NDA0MmNkYWRlZTI1NzFAbWFpbC5nbWFpbC5jb20+"
    }
}