{
    "numMessagesInTopic": 39, 
    "nextInTime": 20551, 
    "senderId": "REU6Gq8MCmmjez4uTNF663pLReaNEGjxrPfqyyEh1nEDq4t-yIYfwEATsKkxwNdJFjcm2jreBOUDvHuwE5Duyido6Q9J6nPKxyTUhB0", 
    "systemMessage": true, 
    "subject": "Re: A case for adding logging of assertions to junit", 
    "from": "&quot;Phil Surette&quot; &lt;philsurette@...&gt;", 
    "authorName": "Phil Surette", 
    "msgSnippet": "I take your general point that simpler tests are better. But I ve seen lots of complex tests and admit that I am not always strong enough myself to keep them", 
    "msgId": 20550, 
    "profile": "PhilSurette", 
    "topicId": 20531, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 100046987, 
    "messageBody": "<div id=\"ygrps-yiv-1588630662\">I take your general point that simpler tests are better. <br/>\nBut I&#39;ve seen lots of complex tests and admit that I am not <br/>\nalways strong enough myself to keep them simple. <br/>\n<br/>\nThe art of writing good unit tests develops over time. If you<br/>\nalready consistently write very small, well-named, tightly<br/>\nfocused unit tests and never have to look at any test code<br/>\nthat is written to a lesser standard, maybe you will never want to<br/>\nlook at an assertion log. But while you are developing that<br/>\nskill, an assertion log might be useful.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you aren&#39;t going to think about the failure message when you write  <br/>\n&gt; it, then don&#39;t write one.<br/>\n<br/>\n </span></blockquote>It is often the case that you do not realize how uninformative<br/>\na message is until you see it in action. On a larger scale this<br/>\nis why people have to write many drafts. If the first time<br/>\nyou see a message is 10 months after your wrote the assertion,<br/>\nchances are it won&#39;t be as informative as if you&#39;d happened<br/>\nto read it at least once before you committed it.<br/>\n<br/>\nAs for why anyone would write to the console when writing a<br/>\ntest case, I don&#39;t know, but I have often seen it and in<br/>\nfact have often seen the system out being used where an<br/>\nassert should have been used. This generally occurs when<br/>\npeople are first being introduced to unit testing, probably<br/>\nbecause they have prior experience writing the &quot;I&#39;ll just eyeball it&quot;<br/>\nkind of &quot;test&quot;. Maybe if by writing an assertion<br/>\n(generally the same amount of code) they could have got something<br/>\nwritten to the console as a side effect, they would write assertions<br/>\ninstead and the net result would be a better test case.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;J. B. Rainsberger&quot; &lt;jbrains762@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; On 2008-06-09, at 07:23 , Phil Surette wrote:<br/>\n&gt; <br/>\n&gt; &gt; I&#39;d like to make a case for adding logging of assertions into junit.<br/>\n&gt; &gt; I&#39;ve been using junit for many years, and something that I&#39;ve found<br/>\n&gt; &gt; both for myself and for people who I&#39;ve mentored in XP practices is<br/>\n&gt; &gt; that it is often helpful to get warm fuzzy feedback that your tests<br/>\n&gt; &gt; are running and asserting what you think they are asserting.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I notice that I&#39;m not alone in this; I see there are several threads<br/>\n&gt; &gt; where people were looking for this feature<br/>\n&gt; &gt; (<a rel=\"nofollow\" target=\"_blank\" href=\"http://tech.groups.yahoo.com/group/junit/message/17845\">http://tech.groups.yahoo.com/group/junit/message/17845</a> &quot;how to log<br/>\n&gt; &gt; junit tests&quot;, <a rel=\"nofollow\" target=\"_blank\" href=\"http://tech.groups.yahoo.com/group/junit/message/18762\">http://tech.groups.yahoo.com/group/junit/message/18762</a><br/>\n&gt; &gt; &quot;junit 4 & logging&quot;,<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://tech.groups.yahoo.com/group/junit/message/12000\">http://tech.groups.yahoo.com/group/junit/message/12000</a> &quot;Log4J Logging<br/>\n&gt; &gt; in JUnit&quot;)<br/>\n&gt; &gt;<br/>\n&gt; I am just going to be frank here. Yes, many people have said they want  <br/>\n&gt; to log assertions in tests because they want the warm fuzzy feedback  <br/>\n&gt; that their tests are running and assertion what they think they are  <br/>\n&gt; asserting. Logging is just one, and in my opinion a bad, way to do  <br/>\n&gt; this. I believe it is much better to write simpler tests.<br/>\n&gt; &gt; 1) eliminating redundant logging statements - Many logging statements<br/>\n&gt; &gt; in a JUnit test case simply output information that you&#39;ve already<br/>\n&gt; &gt; told JUnit about in your assertions. Developers often put these in as<br/>\n&gt; &gt; a &#39;sanity check&#39; to verify that the test is doing what they expected.<br/>\n&gt; &gt;<br/>\n&gt; If your tests need such a sanity check, then I believe they should be  <br/>\n&gt; simpler.<br/>\n&gt; &gt; 2) improving assertion messages - it&#39;s often the case that the<br/>\n&gt; &gt;<br/>\n&gt; &gt; first time you see the message for an assertion will be when the<br/>\n&gt; &gt; assertion fails, which may not happen until you run a regression test<br/>\n&gt; &gt; many moons after you coded the test. Unless you see the message<br/>\n&gt; &gt; displayed when you are developing the test, you won&#39;t realize that the<br/>\n&gt; &gt; message - if you provided one - is not be very helpful. Better<br/>\n&gt; &gt; assertion messages also help to communicate to a developer what the<br/>\n&gt; &gt; point of the assertion is both when it fails and when reading the  <br/>\n&gt; &gt; test.<br/>\n&gt; &gt;<br/>\n&gt; If you aren&#39;t going to think about the failure message when you write  <br/>\n&gt; it, then don&#39;t write one.<br/>\n&gt; &gt; 3) see finer-grain test results. Every assertion is a mini-test on its<br/>\n&gt; &gt; own, but JUnit these mini-tests are invisible until they fail.<br/>\n&gt; &gt;<br/>\n&gt; Absolutely not. Assertions are not mini-tests. A test is a test. If  <br/>\n&gt; you have multiple unrelated assertions in a test, then move them into  <br/>\n&gt; their own tests. This leads to a number of benefits (more accurate  <br/>\n&gt; test count metrics, more information when a test fails, easier to  <br/>\n&gt; isolate the cause of a failure).<br/>\n&gt; &gt; 4) by making logging easy, it can help to avoid the<br/>\n&gt; &gt; using-system-outs-instead-of-asserts syndrome, where new junit test<br/>\n&gt; &gt; writers will write &quot;test cases&quot; that actually just write a bunch of<br/>\n&gt; &gt; stuff to the console that the test writer then eyeballs for expected<br/>\n&gt; &gt; results<br/>\n&gt; &gt;<br/>\n&gt; Why would anyone use JUnit to spit things out to the console? If they  <br/>\n&gt; want output on the console, and they&#39;re not just using that as a way  <br/>\n&gt; to learn to use JUnit, then they shouldn&#39;t use JUnit.<br/>\n&gt; &gt; There are some problems with logging assertions that I have  <br/>\n&gt; &gt; encountered:<br/>\n&gt; &gt;<br/>\n&gt; &gt; 1) if iterating over a collection and asserting each element, your log<br/>\n&gt; &gt; can be overwhelmed. Maybe it would be useful to have some way of<br/>\n&gt; &gt; hinting that a particular assertion should not create notifications;<br/>\n&gt; &gt; maybe not.<br/>\n&gt; &gt;<br/>\n&gt; I don&#39;t even want to think about how slowly tests will run, and how  <br/>\n&gt; much time I would waste deciding which tests should log what and when.  <br/>\n&gt; It&#39;s much easier just to add logging where I want it.<br/>\n&gt; &gt; Is there any appetite out there for adding assertion logging (or<br/>\n&gt; &gt; assertion notification) into the junit 4 framework? I would be<br/>\n&gt; &gt; happy to do the work if I thought it would be accepted into the<br/>\n&gt; &gt; main junit distribution. Or maybe this capability already exists<br/>\n&gt; &gt; in some way in junit 4 that I am not aware of?<br/>\n&gt; &gt;<br/>\n&gt; Yes, there is such an appetite, but I hope there is a bigger appetite  <br/>\n&gt; not to include it.<br/>\n&gt; ----<br/>\n&gt; J. B. (Joe) Rainsberger :: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jbrains.ca\">http://www.jbrains.ca</a><br/>\n&gt; Your guide to software craftsmanship<br/>\n&gt; JUnit Recipes: Practical Methods for Programmer Testing<br/>\n&gt; 2005 Gordon Pask Award for contributions to Agile Software Practice<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 20549, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1213072000", 
    "canDelete": false, 
    "nextInTopic": 20551, 
    "prevInTopic": 20549, 
    "headers": {
        "inReplyToHeader": "PDIwN0ZCQkM4LTFGMjctNEU4NC1BOUQ5LTgyRTNERUU2OTE4MkBnbWFpbC5jb20+", 
        "messageIdInHeader": "PGcya3ZxMCt0c3MyQGVHcm91cHMuY29tPg=="
    }
}