{
    "numMessagesInTopic": 39, 
    "nextInTime": 20564, 
    "senderId": "D0gWqupDL2eRhOgvymqfLZMVsfD-I_BNeq66C4lJp2QypZxaS060RgNrhvF4sVDokXFHgKBUmBRvc5J64HldG-S9pvrGkk_pLU7Mag", 
    "systemMessage": true, 
    "subject": "Re: A case for adding logging of assertions to junit", 
    "from": "&quot;toalexsmail&quot; &lt;toalexsmail@...&gt;", 
    "authorName": "toalexsmail", 
    "msgSnippet": "... say I ... I have read carefully all the posts so far and I tend to agree with Robert. I am wonder whether I miss something important too. I want to be", 
    "msgId": 20563, 
    "profile": "toalexsmail", 
    "topicId": 20531, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 340165037, 
    "messageBody": "<div id=\"ygrps-yiv-1958957156\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, Robert Wenner &lt;robert.wenner@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; On Monday 09 June 2008 21:18, Cédric Beust  wrote:<br/>\n&gt; &gt; &gt; If I have to go through umpteen thousand lines of log, I may as well<br/>\n&gt; &gt; &gt; test everything manually.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Nobody says you have to, but the fact that your tests pass doesn&#39;t<br/>\n&gt; &gt; guarantee that you are testing what you think you are testing.<br/>\n&gt; <br/>\n&gt; Well. If the log is important, I have to go through it, or I miss <br/>\n&gt; something important. If it is not important (and I don&#39;t have to go <br/>\n&gt; through it) I can skip it altogether. So what do you mean when you<br/>\n </span></blockquote>say I <br/>\n<blockquote><span title=\"ireply\"> &gt; don&#39;t have to go through it?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I have read carefully all the posts so far and I tend to agree with<br/>\nRobert. I am wonder whether I miss something important too.<br/>\nI want to be clear, so I will take one step backward. What is the MAIN<br/>\npurpose of JUnit? The answer is to be able to write AUTOMATIC unit<br/>\ntest. Unit test should be written is the correct way, that is<br/>\ncorrectly design. This has nothing to do with logging. Making unit<br/>\ntest AUTOMATIC contradict using logging.<br/>\n<br/>\n&lt;you can skip the this paragraph&gt;<br/>\nI want to step aside for a while. Let assume that you&#39;re not using<br/>\nJUnit at all and write small main function to test. I don&#39;t want to<br/>\ncounter why you shouldn&#39;t do this, let focus on what tools you do use<br/>\nin this approach. In the most cases you will add System.out both to<br/>\nthe code and to the main. If you&#39;re using C++, for instance, you will<br/>\nuse preprocessor to switch on or off these output to the console. More<br/>\nadvance option will be to use logging mechanism and to change it<br/>\nconfiguration depends on the environment your program run (that is to<br/>\nturn on many of your log statement only in development). Everything is<br/>\ngreat until your program is actually fails. Again, from the experience<br/>\nit is almost always the case that existing System.outs are not enough,<br/>\nthat you need more information or you should add some more output<br/>\nearly in the code. So, in this point you have to option to run your<br/>\nprogram AGAIN with debugger or to add more System.outs and to run it<br/>\nas is. In both cases it can be the case that you should rerun your<br/>\nprogram again (if you use debugger you could simply not pointed out<br/>\nwhen some data changed and in the System.out case you can figure out<br/>\nthat you need more System.outs).<br/>\n<br/>\nFrom the paragraph above one should conclude that when one write unit<br/>\ntest there is 2 different phases. First is to write them down in the<br/>\nhope that everything will be ok (it doesn&#39;t mean, that you design<br/>\nshould be poor or you shouldn&#39;t supply appropriate messages to assert<br/>\nstatements etc) and the second phase is to rerun your test if your<br/>\ntest fails. Lets see how logging will help you.<br/>\n<br/>\nIn the first phase I see the only purpose using logs is for &#39;sanity<br/>\ncheck&#39; that is to ensure that you actually test what your think is you<br/>\ntest. If you want to make something more than just &#39;sanity check&#39; you<br/>\nshould write unit test to your unit test, that is pretty silly.<br/>\nMoreover, you need to make such &#39;sanity check&#39; only when you actually<br/>\nwrite this test.  For this purpose logging is appropriate approach, IMHO.<br/>\n<br/>\nIn the second phase, when you rerun your unit test when it fails, you<br/>\nshould consider to add more assert statement and more clearly<br/>\ndiagnostic messages first. When you done and you don&#39;t see how to<br/>\nimprove the design (recall I consider that design is correct) you can<br/>\nadd log statement manually. But in this case they will not be part of<br/>\nnew mechanism, because no more asserts will be added. So this new<br/>\nfeature will not be in use!<br/>\n<br/>\nUsing logging in the assert statement ONLY for &#39;sanity check&#39; is<br/>\noverkill, I think. As for me I make such &#39;sanity check&#39; in the<br/>\nfollowing way. First of all, I use log4j MANUALLY that is as addition<br/>\nto JUnit asserts. They don&#39;t duplicate what asserts does they supply<br/>\nadditional information, such as what assertion was already done. In<br/>\nthis case when assertion will fail afterwards I can look on the log to<br/>\nsee in what part of unit test it happened and what tests passed. I go<br/>\neven further and use JDK 1.4 assert statement to document<br/>\nprecondition, postcondition and invariants both in the code and in the<br/>\nunit test.<br/>\n<br/>\nThe bottom line is that I see the sense using logs as a COMPLETION to<br/>\nthe JUnit and only for &#39;sanity check&#39;. This use is not duplicates<br/>\nJUnit assert statements and could be written manually.</div>", 
    "prevInTime": 20562, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1213129247", 
    "canDelete": false, 
    "nextInTopic": 20564, 
    "prevInTopic": 20561, 
    "headers": {
        "inReplyToHeader": "PDIwMDgwNjA5MjIzNC4wNzA2MS5yb2JlcnQud2VubmVyQGdteC5kZT4=", 
        "messageIdInHeader": "PGcybW5uMCtzdWZhQGVHcm91cHMuY29tPg=="
    }
}