{
    "numMessagesInTopic": 8, 
    "nextInTime": 20591, 
    "senderId": "6USQ_WWV3SjF43yZPkvg3QYspc-VrW8gYu2H1NgKIEfoLFWFh4jVYTtCJjeVtPIje1oVovycv18Cfvw27_-2k6X3G2MbPe2se2u6prElPKw", 
    "systemMessage": true, 
    "subject": "Testing code that depends on today&#39;s date", 
    "from": "Per Jacobsson &lt;perjacobsson@...&gt;", 
    "authorName": "Per Jacobsson", 
    "msgSnippet": "Hi, This has been annoying me for a while and I can t think of a clean solution for it. Hope this makes sense: I have some code that returns different results", 
    "msgId": 20590, 
    "topicId": 20590, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 282257561, 
    "messageBody": "<div id=\"ygrps-yiv-621228795\">Hi,<br/>\nThis has been annoying me for a while and I can&#39;t think of a clean solution for it. Hope this makes sense: I have some code that returns different results depending on what today&#39;s date is (the number of days since a user first registered, etc). The simple approach is to just create a new instance of java.util.Date whenever I need to know the current date, but that tends to make both unit and automated functional testing difficult.<br/>\n<br/>\nI&#39;m currently injecting today&#39;s date into the classes that need it, and then the tests can just use a static date. It gets pretty ugly though, a lot of times this date has to be dragged along deep into the domain model.<br/>\n<br/>\nAn alternative would be to take the old school approach and have a static factory that everything that needs to know today&#39;s date calls, and allow the unit tests to override with a test date. Of course, then you run into all the other issues that dependency injection solves.<br/>\n<br/>\nAny thoughts?<br/>\nThanks,<br/>\n/ Per<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 20589, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1213720080", 
    "canDelete": false, 
    "nextInTopic": 20591, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDg2MEQ0N0Y4OTA0RjYwNDFBRUVFNTVGOUI2ODQ2NjdGMTYyRDQ2RUYwNUBFWENIQU5HRS1WUzEuZWhhcm1vbnkuY29tPg=="
    }
}