{
    "numMessagesInTopic": 3, 
    "nextInTime": 20610, 
    "senderId": "jL3Ww9T9kF4Z7SIzpzZNq4Tw-j1V6wIQaOwScI7AHsKpQ_6jKVZ6GQ7-p_4Th-eSNrHLADrMGpX-GeSbh9NHWFfuSKFn_zWWhvAA-RVv_aqp", 
    "systemMessage": false, 
    "subject": "Re: [junit] JUnit for Unit Testing and Integration Testing seperation", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains762@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... I have separate source trees and build output folders for categories of tests. I start with two categories: fast and slow. I put any test that runs", 
    "msgId": 20609, 
    "profile": "nails762", 
    "topicId": 20607, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 282027414, 
    "messageBody": "<div id=\"ygrps-yiv-1991897724\">On 2008-06-20, at 08:59 , milesy1981 wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Good Afternoon,<br/>\n&gt;<br/>\n&gt; I am trying to implement a better JUnit strategy here, and I was<br/>\n&gt; wondering if anyone has any tried and test ways of seperating out<br/>\n&gt; their different classes of testing. The line here is very fuzzy<br/>\n&gt; between what is an actual unit test and what is an integration test<br/>\n&gt; and I am trying to make that much more clearer.<br/>\n&gt;<br/>\n&gt; I want to have a bunch of test cases which purely test classes in<br/>\n&gt; isolation and test that their behaivour is as expected from an API<br/>\n&gt; standpoint, but I also want another set of tests which will test the<br/>\n&gt; actual functional and integration of things like making sure the<br/>\n&gt; integration with Spring and Hibernate is actually working and as I<br/>\n&gt; expect.<br/>\n&gt;<br/>\n&gt; Has anyone done this kind of seperation here before. I am just<br/>\n&gt; looking for any methodologies for seperation of these tests in<br/>\n&gt; regards to packaging, and running them etc. I run my tests from<br/>\n&gt; maven and it would be good to run the two sets of tests seprately<br/>\n&gt; from each other.<br/>\n&gt;<br/>\n </span></blockquote>I have separate source trees and build output folders for categories  <br/>\nof tests. I start with two categories: fast and slow. I put any test  <br/>\nthat runs entirely in memory in the &quot;fast&quot; bucket and the rest in the  <br/>\n&quot;slow&quot; bucket. I run all the fast tests on each important edit and all  <br/>\nthe tests (fast and slow) at least every 15-30 minutes and, of course,  <br/>\nbefore committing a change.<br/>\n<br/>\nOver time, I want to replace tests in the &quot;slow&quot; bucket with tests in  <br/>\nthe &quot;fast&quot; bucket and hand the &quot;slow&quot; tests off to whoever does system  <br/>\ntesting.<br/>\n<br/>\nI like to keep it that simple. Some find it necessary to have multiple  <br/>\ncategories of &quot;slow&quot; tests, but I strongly doubt anyone who wants  <br/>\nmultiple categories of &quot;fast&quot; tests. Fast tests run at least 200 per  <br/>\nsecond. A slow test run would be 2000 tests in 10 seconds. If you have  <br/>\nthat many fast tests, you probably have too big a project or too much  <br/>\nduplication in the tests. Introduce libraries with their own build  <br/>\nschedule and refactor your code to get back under 2000 fast tests.<br/>\n<br/>\nTake care.<br/>\n----<br/>\nJ. B. (Joe) Rainsberger :: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.jbrains.ca\">http://www.jbrains.ca</a><br/>\nYour guide to software craftsmanship<br/>\nJUnit Recipes: Practical Methods for Programmer Testing<br/>\n2005 Gordon Pask Award for contributions to Agile Software Practice</div>", 
    "prevInTime": 20608, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1214001897", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 20608, 
    "headers": {
        "inReplyToHeader": "PGczZ2Q0dSs5ZHJhQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PEMxNzkwMkE2LUQ3QjEtNEFBNC1BMDg2LTg2NDhDMDY1N0RCRUBnbWFpbC5jb20+", 
        "referencesHeader": "PGczZ2Q0dSs5ZHJhQGVHcm91cHMuY29tPg=="
    }
}