{
    "numMessagesInTopic": 3, 
    "nextInTime": 20608, 
    "senderId": "JkQsMO5DJsv3D6dGi5Dg4YXC5aVCOLl8_zq2T9pR1nOEncpnSm4G4HCssEeXVaqnXkLjjfLdFVuoMpXEAByJY-SREto1o7NvaG8QQr6cuvGM", 
    "systemMessage": true, 
    "subject": "JUnit for Unit Testing and Integration Testing seperation", 
    "from": "&quot;milesy1981&quot; &lt;chrismiles@...&gt;", 
    "authorName": "milesy1981", 
    "msgSnippet": "Good Afternoon, I am trying to implement a better JUnit strategy here, and I was wondering if anyone has any tried and test ways of seperating out their", 
    "msgId": 20607, 
    "profile": "milesy1981", 
    "topicId": 20607, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 277712959, 
    "messageBody": "<div id=\"ygrps-yiv-1366688182\">Good Afternoon,<br/>\n<br/>\nI am trying to implement a better JUnit strategy here, and I was <br/>\nwondering if anyone has any tried and test ways of seperating out <br/>\ntheir different classes of testing. The line here is very fuzzy <br/>\nbetween what is an actual unit test and what is an integration test <br/>\nand I am trying to make that much more clearer.<br/>\n<br/>\nI want to have a bunch of test cases which purely test classes in <br/>\nisolation and test that their behaivour is as expected from an API <br/>\nstandpoint, but I also want another set of tests which will test the <br/>\nactual functional and integration of things like making sure the <br/>\nintegration with Spring and Hibernate is actually working and as I <br/>\nexpect.<br/>\n<br/>\nHas anyone done this kind of seperation here before. I am just <br/>\nlooking for any methodologies for seperation of these tests in <br/>\nregards to packaging, and running them etc. I run my tests from <br/>\nmaven and it would be good to run the two sets of tests seprately <br/>\nfrom each other.<br/>\n<br/>\nMany Thanks.<br/>\n<br/>\nChris</div>", 
    "prevInTime": 20606, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1213970397", 
    "canDelete": false, 
    "nextInTopic": 20608, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGczZ2Q0dSs5ZHJhQGVHcm91cHMuY29tPg=="
    }
}