{
    "numMessagesInTopic": 1, 
    "nextInTime": 20665, 
    "senderId": "yFGlXfO8rrdznoaJHOeLwmxNSEbaQe2pu7XDy1Xce2EL9XBb9CgmD7n8lTs3EtTx5csXr5qOhh9VQYzOcAF6zgtRoYOcdmFGvw", 
    "systemMessage": true, 
    "subject": "Forked Java VM exited abnormally", 
    "from": "Nikhil Deval &lt;ndeval@...&gt;", 
    "authorName": "Nikhil Deval", 
    "msgSnippet": "Hi All, I am using jdk 1.5 build 6 with ant 1.7 version. when i am executing my test framework i am getting following error... Forked Java VM exited", 
    "msgId": 20664, 
    "profile": "nikhil_deval", 
    "topicId": 20664, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 324864468, 
    "messageBody": "<div id=\"ygrps-yiv-1981634257\">Hi All,<br/>\n<br/>\nI am using jdk 1.5 build 6 with ant 1.7 version. when i am executing my <br/>\ntest framework i am getting following error...<br/>\n<br/>\n&quot;Forked Java VM exited abnormally. Please note the time in the report <br/>\ndoes not reflect the time until the VM exit.<br/>\n|junit.framework.AssertionFailedError: Forked Java VM exited abnormally. <br/>\nPlease note the time in the report does not reflect the time until the <br/>\nVM exit.&quot;<br/>\n<br/>\n|Any suggestions?<br/>\n<br/>\n-- <br/>\nThanks & Regards,<br/>\nNikhil<br/>\n<br/>\nThe information contained in this electronic message and any attachments to this message are intended for the exclusive use of the addressee(s) and may contain proprietary, confidential or privileged information. If you are not the intended recipient, you should not disseminate, distribute or copy this e-mail. Please notify the sender immediately and destroy the original message all copies of this message and any attachments.<br/>\nWARNING: Computer viruses can be transmitted via email. The recipient should check this email and any attachments for the presence of viruses. The company accepts no liability for any damage caused by any virus transmitted by this email.<br/>\n<br/>\nPlease do not print this email unless it is absolutely necessary.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 20663, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1215424549", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDQ4NzFFODI1LjYwODAwMDlAdmVydGV4LmNvLmluPg=="
    }
}