{
    "numMessagesInTopic": 7, 
    "nextInTime": 20704, 
    "senderId": "Ai6ISWbhJDWCuJGwZIniPB-hzoKUoDIyKVFxQqeorY6vF3ovzZAgEsJdWGP1JODTt7BgsVSWejBiyMV7IHdbg48aOeph4qprE2S6uhRXuryDFN4oFuMjPbzkEcQqGDex1QQePOlmL5oU", 
    "systemMessage": false, 
    "subject": "RE: [junit] Newbie wants to take some JUnit group. Some basic questions.", 
    "from": "=?iso-8859-1?Q?B=F6hm=2C_Martin?= &lt;martin.boehm@...&gt;", 
    "authorName": "Böhm, Martin", 
    "msgSnippet": "Hi, you are on the right way, because testing starts with asking ;-) Nevertheless I would recommend you http://xunitpatterns.com/ The subtitle may suggest", 
    "msgId": 20703, 
    "profile": "martinboehmsonneberg", 
    "topicId": 20700, 
    "spamInfo": {
        "reason": "3", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 334026059, 
    "messageBody": "<div id=\"ygrps-yiv-842600236\">Hi,<br/>\n<br/>\nyou are on the right way, because testing starts with asking ;-)<br/>\n<br/>\nNevertheless I would recommend you <a rel=\"nofollow\" target=\"_blank\" href=\"http://xunitpatterns.com/\">http://xunitpatterns.com/</a><br/>\nThe subtitle may suggest that&#39;s only about refactoring and<br/>\ntuning test code but moreover it presents excellent examples<br/>\nfor the well known testing problems dbs, network and so on.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -----Original Message-----<br/>\n&gt; From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>] On <br/>\n&gt; Behalf Of serethos_0<br/>\n&gt; Sent: Montag, 21. Juli 2008 21:19<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\n&gt; Subject: [junit] Newbie wants to take some JUnit group. Some <br/>\n&gt; basic questions.<br/>\n&gt; <br/>\n&gt; Hello!<br/>\n&gt; <br/>\n&gt; I am an quite experienced programmer but new to the <br/>\n&gt; philosophy of unit testing. An issue I want to change.<br/>\n&gt; I read some articles and took some orientation on Frank <br/>\n&gt; Westphal&#39;s very good book about that topic. But in practice, <br/>\n&gt; I always run into similar problems, which seem to disturb my <br/>\n&gt; view of unit testing. So some thought and questions I would <br/>\n&gt; like to discuss.<br/>\n&gt; <br/>\n&gt; 1. Recently I read that a unit test is no one if you have to <br/>\n&gt; touch network, db or filesystem. I understand the point that <br/>\n&gt; these accesses really can slow the tests down and usually <br/>\n&gt; need extra work of configuration, but how to avoid this?<br/>\n&gt; An example of my daily work. I have quite a common task: <br/>\n&gt; Fetch some xmls from an ftp server, parse the content and map <br/>\n&gt; it into db and vice versa. So the business logic is quite <br/>\n&gt; thin. More important is good exception handling and the <br/>\n&gt; transport of all data in the right structures. <br/>\n<br/>\n </span></blockquote>Fetch, parse, map and persist the output are all different<br/>\ntasks. Maybe its not only a testing problem just as well a<br/>\noo-design-issue. -- Because testing is thinking about design<br/>\nand testabilty depends on design, I&#39; m sure it&#39;s a problem ;-)<br/>\n<br/>\nTo do all the steps, I think its important to identify the<br/>\nprocess, its outpu and input and the subordinate processes as<br/>\nwell.<br/>\nSo you get very finegrained units for different concerns<br/>\ndoing different work. And therefore you are able to mock each<br/>\nother piece of unit, that cumbers you in testing your unit under<br/>\ntest in isolation.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Actually the slowdown of a real ftp transport and the <br/>\n&gt; configuration and injection overhead of the db-connection is <br/>\n&gt; a major drawback. But on the other hand I see no good way to <br/>\n&gt; mock the behaviour of these endpoints. <br/>\n&gt; I could try to mock a database, but how to test, if an <br/>\n&gt; sql-statement is correct (especially for a wider range of queries)?<br/>\n<br/>\n </span></blockquote>Let&#39;s assume you have to options:<br/>\n- On a restricted range of sql-Queries validation of sql:<br/>\n  So you have to test the validator and the database connection.<br/>\n<br/>\n- On the full range of sql-Queries catch the output of the<br/>\n  wrong sqls.<br/>\n  So you have to test your error catcher to react and handle<br/>\n  appropriatly on sql-exceptions.<br/>\n<br/>\nGet it correct and/or react on inconsistency.<br/>\nCan you see the different concerns?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It also is a very hard work to write stubs or mocks, which <br/>\n&gt; can answer with all error-states an ftp-server/network can <br/>\n&gt; generate (timeout, access denied, authentication etc) to test <br/>\n&gt; the correct error handling of my code.<br/>\n<br/>\n </span></blockquote>Have you tried out Mock-Frameworks like jMock or EasyMock?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 2. Another question points to a basic principle of unit <br/>\n&gt; testing: the opening of a class in small and public methods. <br/>\n&gt; I see an advantage in the possibility to inject every aspect <br/>\n&gt; of a class (manually or e.g.<br/>\n&gt; via spring) and the code can benefit from a better <br/>\n&gt; readability through a chain of self-explanatory method calls.<br/>\n&gt; But in some cases I want to hide implementation details from the user.<br/>\n<br/>\n </span></blockquote>First I would ask you, why you want to hide the implementation details?<br/>\nWhen you try to hide them, then I assume thats not important for the<br/>\nuser and so I also assume its not a concern of the class under<br/>\ntest. Its the odd man out.<br/>\nThen maybe its only a subtask or a task to delegate.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Taking my Importer/Exporter example a second time, it is more <br/>\n&gt; a cron script than an application: Doing a defined job in a <br/>\n&gt; robust and understandable manner but neither designed as a <br/>\n&gt; basis for wide enhancements nor for ultimate flexibility. <br/>\n&gt; So there are methods which start the whole work of an <br/>\n&gt; importer over the whole lifecycle (connect, fetch data, map <br/>\n&gt; data etc). Methods, which are necessary for getting the <br/>\n&gt; object in a usable state (e.g.<br/>\n&gt; connection established) are hidden away. To ensure that there <br/>\n&gt; must be the correct state before executing the main task I <br/>\n&gt; can lead the user with parameterized constructors (e.g. <br/>\n&gt; MyImporter(host, port)).<br/>\n<br/>\n </span></blockquote>&quot;Whole&quot; sounds like a megajob, thats not a good practice in<br/>\nunit testing. Maybe the lifecycle is a separate object that<br/>\ncontrols different tasks; the connections and fetchers are<br/>\nserviceobjects that do something with your data objects.<br/>\n<br/>\nAll objects/units are easilier to test if they have one<br/>\nobjectiv, that you can test separatly.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; To say it more generally I think that it is a common way to <br/>\n&gt; restrict the use of classes which need to be handled in <br/>\n&gt; correct order because of their state. This saves a lot of <br/>\n&gt; additional exception handling (e.g. executing before connecting). <br/>\n&gt; But following this thought it gets very hard to isolate testing units.<br/>\n&gt; Even when I separate the tasks within the class to units <br/>\n&gt; (connecting, disconnecting etc) they would be not accessible <br/>\n&gt; and would need to be tested from within.<br/>\n<br/>\n </span></blockquote>Why you would test from within? If the units do their thing,<br/>\nthey do it also within. To ensure that they do it, test it<br/>\nin isolation, to be sure, that they do it really.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is only a very simple and not a perfect example but I <br/>\n&gt; think my point should be clear. I hope that some of you take <br/>\n&gt; some time to read it. I really would appreciate some thoughts!<br/>\n<br/>\n </span></blockquote>Helps you to think about it?<br/>\n<br/>\nBest Regards<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;  <br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 20702, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1216715554", 
    "canDelete": false, 
    "nextInTopic": 20705, 
    "prevInTopic": 20702, 
    "headers": {
        "inReplyToHeader": "PGc2Mm5lYis1NWl0QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDE0OUM4RDRDN0NENkQ0NEZCOUUyNkNERUY0NDY5RDJFMDFGRjRDODBAc2RyZXhjMS5zYWx0LXNvbHV0aW9ucy5kZT4=", 
        "referencesHeader": "PGc2Mm5lYis1NWl0QGVHcm91cHMuY29tPg=="
    }
}