{
    "numMessagesInTopic": 1, 
    "nextInTime": 20806, 
    "senderId": "YmHnivADJ7e47-BaVHoRXEoh5POVsSIHXqxkSXukCqmCAbB1huZy-QGm9340VT3achs4NpeMUsunO3uQgqmTGLEWso4tP776", 
    "systemMessage": true, 
    "subject": "running a single JUnit  test in Eclipse", 
    "from": "&quot;Sam&quot; &lt;sam.quiring@...&gt;", 
    "authorName": "Sam", 
    "msgSnippet": "I have a test class with two methods, each prefixed with @Test.  In Eclipse I right-click on one of these methods and select Run As Unit Test .  It runs both", 
    "msgId": 20805, 
    "profile": "sbq0", 
    "topicId": 20805, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 356305054, 
    "messageBody": "<div id=\"ygrps-yiv-1507146019\">I have a test class with two methods, each prefixed with @Test.  In <br/>\nEclipse I right-click on one of these methods and select &quot;Run As Unit <br/>\nTest&quot;.  It runs both methods, not just the one I clicked on.  This is <br/>\nusing the JUnit that comes with Eclipse Ganymede out of the box.<br/>\n<br/>\nIs this how it supposed to work?  I was expecting it to run only the <br/>\none method on which I right-clicked.  Is my expectation incorrect?<br/>\n<br/>\nI&#39;m working on a custom Runner.  If the user does what I did above, I <br/>\nsee how the test runner gets notified of the class, but not the name of <br/>\nthe method.  I&#39;ve seen some JUnit 4 docs talking about filtering, so I <br/>\nthought maybe the JUnit framework would look through the Description <br/>\nobject returned by the runner and only execute the method which the <br/>\nuser right-clicked.  The class JUnit4TestMethodReference does save a <br/>\nDescription object that contains the method name, but I don&#39;t see where <br/>\nthat is used.  Am I missing something?<br/>\n<br/>\n-Sam</div>", 
    "prevInTime": 20804, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1218835780", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGc4NHNnNCtjY3BmQGVHcm91cHMuY29tPg=="
    }
}