{
    "numMessagesInTopic": 15, 
    "nextInTime": 20834, 
    "senderId": "HJVtIvqp0CjCuLKRkJrIQ9JT3i4J-iHsXswrjTYIu2zKmcKwgmVrjrb42xfKe3olHmnhsrd4pJY9AZiQ0-Vjbm88oLV8nAxaD0z-JfWYCnUOhA", 
    "systemMessage": true, 
    "subject": "Re: [junit] JUnit And Larger Scale Tests", 
    "from": "&quot;Dennis Lloyd Jr&quot; &lt;dennislloydjr@...&gt;", 
    "authorName": "Dennis Lloyd Jr", 
    "msgSnippet": "Hi Jan, I won t claim to be the official position of the JUnit community, but I will offer my thoughts. It is okay to use JUnit for other kinds of testing,", 
    "msgId": 20833, 
    "profile": "dennis_lloyd_jr", 
    "topicId": 20830, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 328428134, 
    "messageBody": "<div id=\"ygrps-yiv-1972393029\">Hi Jan,<br/>\nI won&#39;t claim to be the official position of the JUnit community, but I will<br/>\noffer my thoughts.<br/>\n<br/>\nIt is okay to use JUnit for other kinds of testing, however I avoid putting<br/>\nmy unit tests and integration or system tests in the same source folders.<br/>\nThe reason for this is, I&#39;d rather be able to run my unit tests very<br/>\nfrequently and therefore they need to be very fast. Separating them allows<br/>\nme to pick what to run.<br/>\n<br/>\nHonestly, I&#39;ve been giving some thought to the concept of integration<br/>\ntesting and wondering myself where it fits in (after some thought-provoking<br/>\ncomments from Joe Rainsberger). Right now my thinking is that it is a<br/>\nvaluable testing practice to do white-box integration testing and automating<br/>\nthose tests using a tool such as JUnit is probably a good idea. However, I&#39;m<br/>\nnot sure that TDD integration testing is the right thing - anyone else have<br/>\nthoughts on this? (Maybe I should start another thread...)<br/>\n<br/>\nAs for user acceptance tests, I try not to do these in JUnit at all. The<br/>\nreason is, I want the user to be able to read them. Therefore, I use tools<br/>\nsuch as Fitnesse, and now I&#39;m trying out Concordian.<br/>\n<br/>\nUltimately you&#39;ll need to find what works for you and your team, and you&#39;ll<br/>\nprobably change your strategy several times as you learn the &#39;feel&#39; of TDD.<br/>\nIt takes some time to learn, but has been the most valuable practice I&#39;ve<br/>\nfound in software design. Welcome to TDD.<br/>\n<br/>\nHope this helps!<br/>\n-Dennis<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 9/2/08, Jan Kroeze &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:thejcwk@...\">thejcwk@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   Hi all!<br/>\n&gt;<br/>\n&gt; I&#39;m a bit of a newb to the whole TDD thing, but I understand that unit<br/>\n&gt; tests<br/>\n&gt; are supposed to be blazingly fast and not access the hard drive, network,<br/>\n&gt; database or anything external to the code itself. To this end, I understand<br/>\n&gt; that a framework such as jMock can be used.<br/>\n&gt;<br/>\n&gt; So far, so good. But I find JUnit to be extremely useful for writing<br/>\n&gt; integration, system and user acceptance tests as well.<br/>\n&gt;<br/>\n&gt; Here&#39;s my question: what is the official position of the JUnit community on<br/>\n&gt; using JUnit to do larger scale tests? Is there a better framework, or is it<br/>\n&gt; common practice to use JUnit for these tests as well?<br/>\n&gt;<br/>\n&gt; --<br/>\n&gt; Jan Kroeze<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 20832, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1220381877", 
    "canDelete": false, 
    "nextInTopic": 20837, 
    "prevInTopic": 20830, 
    "headers": {
        "inReplyToHeader": "PGVlYWRlYTJmMDgwOTAyMDEwNHk1NjhiMmNmOGoxZmRjNTM1Y2I5OGRjMzgyQG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PGYyYzZiMGU4MDgwOTAyMTE1N3QyMWUzYmZiM3RkOWUyNTNlOTk0YzE2YjkzQG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PGVlYWRlYTJmMDgwOTAyMDEwNHk1NjhiMmNmOGoxZmRjNTM1Y2I5OGRjMzgyQG1haWwuZ21haWwuY29tPg=="
    }
}