{
    "numMessagesInTopic": 3, 
    "nextInTime": 20856, 
    "senderId": "bJxpcg-L4QnIvJ6EElQAzxOI3SQZZUA9PLPmVnj_lsvjvoJE9E-QNWMjuPAdUT4zXM0m8BLmJXWwbRidFiJJoAMrz3I", 
    "systemMessage": false, 
    "subject": "Data needed on long-running suites", 
    "from": "&quot;kentb&quot; &lt;kentb@...&gt;", 
    "authorName": "kentb", 
    "msgSnippet": "All, David and I are working on ways to shorten the validation phase of the inner programming loop (feature - test - code - validate). One of the ideas is ", 
    "msgId": 20855, 
    "profile": "kentlbeck", 
    "topicId": 20855, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 173198504, 
    "messageBody": "<div id=\"ygrps-yiv-290073754\">All,<br/>\n<br/>\nDavid and I are working on ways to shorten the validation phase of the inner<br/>\nprogramming loop (feature -&gt; test -&gt; code -&gt; validate). One of the ideas is<br/>\nto find a general way to run suites faster by running tests in parallel. To<br/>\nfind effective parallelization strategies, we need data on test run times.<br/>\nRather than build big infrastructure to do this (which would undoubtedly be<br/>\ncool), I&#39;d like to start with the simplest thing that could possibly work.<br/>\nSo:<br/>\n<br/>\nIf you have a long-running test suite and<br/>\nYou run it using Ant and<br/>\nYou can use the XML formattter (&quot;&lt;formatter type=&quot;xml&quot;/&gt;&quot;) and<br/>\nYou don&#39;t mind sharing your test names with me confidentially<br/>\n<br/>\nWould you please zip your reports and email them to me. If they&#39;re too big<br/>\nfor email, please let me know and we&#39;ll figure out a backup plan. I&#39;d<br/>\nappreciate any context you can provide--how long the suite has been in<br/>\ndevelopment, the experience level of the developers, whatever else you think<br/>\nwe might need to know.<br/>\n<br/>\nThe first data set I looked at was from DevCreek--&gt;90M test runs from<br/>\nproduction coding representing more than 50 person-years of development. To<br/>\nmy surprise, the test runs exhibit a power law distribution (way lots of<br/>\nfast tests, a few very long running tests, plot a histogram log-log and you<br/>\nget a straight line). I have no idea what this means, but it brings to mind<br/>\nthe Asimov quote, &quot;The most exciting phrase to hear in science, the one that<br/>\nheralds new discoveries, is not &#39;Eureka!&#39; (I found it!) but &#39;That&#39;s funny<br/>\n...&#39;&quot; I&#39;ve found many power law distributions in the static and dynamic<br/>\nstructure of code, but the mechanisms influencing test run times seem to be<br/>\ncompletely different than those influencing code structure.<br/>\n<br/>\nAnyway, I&#39;d love to validate those findings. The Ant XML format seems like a<br/>\ngood place to start. Alternatively, you could send me one or more files with<br/>\ntest run times one per line.<br/>\n<br/>\nQuestions and comments appreciated.<br/>\n<br/>\nYours in science,<br/>\n<br/>\nKent Beck<br/>\nThree Rivers Institute</div>", 
    "prevInTime": 20854, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1220917981", 
    "canDelete": false, 
    "nextInTopic": 20879, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDQ4Q0E4RTE0MjhCRjQ3MTRBMzM3RTkwMDU4QjREMTk1QGtlbnRzcGF2aWxpb24+"
    }
}