{
    "numMessagesInTopic": 8, 
    "nextInTime": 2090, 
    "senderId": "MVHFr1aEbAndrgNYyJSybvN46qLMeZ41CcYkokSci0HvPK40OjStRUUYv-vwuZmXCTg-g70yqPk_dqV5GXQATOUcvq6dMjFQ0Dr1tPiBp09w6w", 
    "systemMessage": false, 
    "subject": "Re: [junit] Proposition (?) [WAS Re: Why doesn&#39;t JUnit count asserts]", 
    "from": "Vladimir Bossicard &lt;vladimir@...&gt;", 
    "authorName": "Vladimir Bossicard", 
    "msgSnippet": "... and it will be a real mess... I don t think that plug-ins are the way to go for counting assertions.  If you want to throw events each time you evaluates", 
    "msgId": 2089, 
    "topicId": 2043, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1805206090\"><blockquote><span title=\"ireply\">&gt; Of course, even if the counting is not done in the assert class, the assert<br/>\n&gt; class still has to be modified to emit the an event or something similar.<br/>\n<br/>\n </span></blockquote>and it will be a real mess... I don&#39;t think that plug-ins are the way to go for counting assertions.  If you want to throw events each time you evaluates an assert you have to modify the assert class and have static listener.  If you don&#39;t have static listeners, as a TestCase object is created for each test method, you have to register each listener to the new TestCase object... what a mess!<br/>\n<br/>\nI really think that counting assertions is not an issue.  It&#39;s not because you have x,000 assertions that your program is well tested.  An open-source coverage tool (does one exist?) is the tool to develop.<br/>\n<br/>\nI am personally against the count of assertions because:<br/>\n- the count is not consistant between failed and successful runs<br/>\n- the count does not tell you anything about the quality of your tests<br/>\n<br/>\nAs I said: a coverage tool with automatic coverage % analysis will make everybody much happier.<br/>\n<br/>\nI am ready to change my mind if somebody can prove me that counting assertions provides more information than analysing the coverage percentage.<br/>\n<br/>\n-Vladimir</div>", 
    "prevInTime": 2088, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "996016238", 
    "canDelete": false, 
    "nextInTopic": 2093, 
    "prevInTopic": 2086, 
    "headers": {
        "messageIdInHeader": "PDIwMDEwNzI0MjMxMDM4LjIwODU3LmNwbXRhQGMwMDcuc252LmNwLm5ldD4="
    }
}