{
    "numMessagesInTopic": 1, 
    "nextInTime": 210, 
    "senderId": "_ZPLfuop6_xznYGdDlH56j5vjpIl6Rl8jv3mf6zvQOyxRNVvVIe4gEwdX9jMk9jLs3sw_9bv_AyKDVISwgda5svMdFqcFxpgM_E", 
    "systemMessage": false, 
    "subject": "Re: [junit]", 
    "from": "&quot;Scott Eade&quot; &lt;seade@...&gt;", 
    "authorName": "Scott Eade", 
    "msgSnippet": "... Keith s comment was a direct hit for me too. I evaluated a commercial tool but found it to be limited in a couple of important areas - the tool was able to", 
    "msgId": 209, 
    "topicId": 209, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1492518179\">Todd Jonker wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;It&#39;s clear that jUnit isn&#39;t complete support for XP-ish functional testing. <br/>\n&gt;That requires something that can track pass rates over time, make sure <br/>\n&gt;previously-passing tests don&#39;t start failing, maybe print some reports for <br/>\n&gt;the Customer to review... <br/>\n&gt;So what tools are people using to support functional testing? <br/>\n<br/>\n </span></blockquote>Keith&#39;s comment was a direct hit for me too.<br/>\n<br/>\nI evaluated a commercial tool but found it to be limited in a couple of <br/>\nimportant areas - the tool was able to interact with JUnit test cases so <br/>\nwe decided that using JUnit would preserve the option of using the <br/>\ncommercial tool at a later stage.  Having made that decision I am now <br/>\nenhancing JUnit to provide additional functionality to make it more <br/>\nsuitable for the task at hand.  This includes:<br/>\n<br/>\n- filtering the junit methods from the stack trace output.<br/>\n- causing the stack trace to be output for all assertion failures and fails.<br/>\n- making the test cases continue after an assertion failure or fail (the <br/>\nskeleton code for this was provided by jpulley (Thanks Jerry) - see: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"https://sourceforge.net/forum/forum.php?thread_id=64361&forum_id=48543)\">https://sourceforge.net/forum/forum.php?thread_id=64361&forum_id=48543)</a><br/>\n<br/>\nThe last thing on my list of things to implement (the others are done) <br/>\nis to store the test results in a database to allow the tracking of pass <br/>\nrates over time.  I haven&#39;t given too much thought to how I might do <br/>\nthis yet but I would imagine it would be an extension to TestRunner.<br/>\nI am not sure I will get to this just yet as other priorities are on the rise.<br/>\n<br/>\nI confess to little knowledge of XP - just what you come across in <br/>\nthe JUnit documentation.<br/>\n<br/>\nScott</div>", 
    "prevInTime": 208, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "978993738", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDAwNjgwMWMwNzljNCQ0MzkxNzE1MCQ1MTNiZmVhOUBzY29vYnkwMD4=", 
        "referencesHeader": "PDZGQTQ5OUI1OUJDM0QzMTE5MDM3MDA5MDI3RENDQUFBNDlGNzhEQHpwZ2hleGNoYW5nZS5waXR0c2J1cmdoLnplZmVyLmNvbT4="
    }
}