{
    "numMessagesInTopic": 4, 
    "nextInTime": 20949, 
    "senderId": "X8jeYrRClDG13PfzehivwDdebqGxxR5ZAWaglKSQSVAUbK8mhBgw-D8nyf3lsh6tg8fNZL7kDj6S3-8LzqcqQtTtvkqrkBWZIYps", 
    "systemMessage": true, 
    "subject": "Re: [junit] Re: JUnit and Eclipse Newbie Info Needed", 
    "from": "&quot;John van V.&quot; &lt;john.van.v@...&gt;", 
    "authorName": "John van V.", 
    "msgSnippet": "wennnnke wrote: I think the book Test-Driven Development by Example is a good start point. Thanks, I think I should add that the most successful", 
    "msgId": 20948, 
    "profile": "john_van_v", 
    "topicId": 20936, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 325109429, 
    "messageBody": "<div id=\"ygrps-yiv-1801669912\">wennnnke wrote:<br/>\n<br/>\nI think the book &quot;Test-Driven Development by Example&quot; is a good start<br/>\npoint.<br/>\n<br/>\nThanks, I think I should add that the most successful administration<br/>\nthat I did was all based on &quot;images.&quot;  I say images because I cannot<br/>\nthink of a better word.<br/>\n<br/>\nThe GNU crowd was insisting on source code distribution, and then Red<br/>\nHat and Debian implemented binary &quot;package&quot; manager tools, but I found<br/>\nthat simply creating an independent application directory (/opt had<br/>\njust been embraced) and writing to it (using tar and ssh) would<br/>\ninstall instantly a fully configured application, that would include<br/>\nall the necessary libraries, especially those that might clash with<br/>\nsystem-distributed libraries.<br/>\n<br/>\nThis would provide a fully operational (and hardened) application<br/>\n(usually server) distribution, and of course would run completely<br/>\nagainst the Windows methodology of using a &quot;registry,&quot; which<br/>\napparently defeats this kind of distribution.<br/>\n<br/>\nIn terms of Eclipse, it would be nice to have fully configured<br/>\nsub-sections, such as JUnit, that are known to run on a specific<br/>\nEclipse install so that newbies could have a running start, rather<br/>\nthan having to suffer weeks of thrashing around such as I have just<br/>\nexperienced.<br/>\n<br/>\nThe Java &quot;culture&quot; it seems goes beyond the Windows in making<br/>\nsomething simple like this impossible, and the Eclipse &quot;culture&quot;<br/>\nopenly states that their application is not tested on the latest Java<br/>\nVMs.  Paraphrasing, &quot;your application may or may not work.&quot;<br/>\n<br/>\nI have strong interest in microkernels that follow the patterns of<br/>\nLibOS, and I strongly support the idea of an image library as a<br/>\nworking repository for versions of L4.  If you are curious, my ThinMan<br/>\nidea grew out of a desire to see gaming stations become regular<br/>\nworkstations, and evolved into the idea of a fully distributed network<br/>\nwith few if any centralized servers, except perhaps support servers<br/>\nand legacy e-commerce machines.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thinman.com\">http://thinman.com</a></div>", 
    "prevInTime": 20947, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1223395888", 
    "canDelete": false, 
    "nextInTopic": 20954, 
    "prevInTopic": 20945, 
    "headers": {
        "inReplyToHeader": "PGdjZjI2disyOWEzQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDViNjAzOWI5MDgxMDA3MDkxMWhhM2VkNTA2bTgyYWFlMmFkZDE5OTkyYWNAbWFpbC5nbWFpbC5jb20+", 
        "referencesHeader": "PGdjMm1wMytscTRhQGVHcm91cHMuY29tPiA8Z2NmMjZ2KzI5YTNAZUdyb3Vwcy5jb20+"
    }
}