{
    "numMessagesInTopic": 9, 
    "nextInTime": 21074, 
    "senderId": "zxstsIH3tquyLFcansnugB1cWMjk8eQ0UrHS9PG9DTUacbQjop5Hid0_ANq3SgfUZUYoUKiUcRPXNHcP", 
    "systemMessage": true, 
    "subject": "Question about test suites", 
    "from": "Jeff &lt;jjg@...&gt;", 
    "authorName": "Jeff", 
    "msgSnippet": "Hi, I am new to this group, so if there is a FAQ or thread that addresses this, please direct me appropriately. I wrote a comprehensive set of tests in jUnit", 
    "msgId": 21073, 
    "profile": "j_j_g_1_2_3", 
    "topicId": 21073, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 114476421, 
    "messageBody": "<div id=\"ygrps-yiv-324836114\">Hi,<br/>\n<br/>\nI am new to this group, so if there is a FAQ or thread that addresses <br/>\nthis, please direct me appropriately.<br/>\n<br/>\nI wrote a comprehensive set of tests in jUnit that run under Maven. Now, <br/>\nthese run against a single backend and now several developers in my <br/>\ngroup would like to use these tests against other backends to test them. <br/>\nThe most natural way to do this is with the test suite mechanism in <br/>\njUnit. That is to say, make up a suite that requires merely that the <br/>\nbackend be set and test away. Or so I thought.<br/>\n<br/>\nThe different backends are different projects in our group and live in <br/>\ndifferent Maven modules.<br/>\n<br/>\nThe problem is that making a suite using annotations does not really <br/>\nwork so well. The annotations are not inherited. The other solution <br/>\nwhich is to have the developers make their own suites by annotations is <br/>\nalso very clunky and will probably break at some point.<br/>\n<br/>\nSo here is my question: Is there any way to make a test suite that is a <br/>\nharness and can be reused? <br/>\n<br/>\nI assume that jUnit 3.8&#39;s method of explicitly creating a suite is going <br/>\nto get deprecated soon, right? So that would be a deadend. Also, are <br/>\ntheir plans to make annotations inheritable at some point in jUnit? We <br/>\ncould maybe live with cutting and pasting for the short term if we knew <br/>\nthat this issue would get resolved at some point.<br/>\n<br/>\nThanks!<br/>\n<br/>\nJeff</div>", 
    "prevInTime": 21072, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1225742055", 
    "canDelete": false, 
    "nextInTopic": 21075, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDQ5MEY1NkU3LjgwNDAzMDNAanFob21lLm5ldD4="
    }
}