{
    "numMessagesInTopic": 1, 
    "nextInTime": 21095, 
    "senderId": "rxLxgqZe6GidEhkshp1RwS4J8JlNdouzqEe28v1WprLdTly1YjlohriwTls9j_q0AZT7j3ke9Qw4IftFcAQYv2eJ2bA", 
    "systemMessage": false, 
    "subject": "Paper on deriving unit tests from functional tests", 
    "from": "&quot;kentb&quot; &lt;kentb@...&gt;", 
    "authorName": "kentb", 
    "msgSnippet": "All, David Saff introduced me to a technique a couple of weeks ago that I d like to share. So you have a defect and a system-level test that fails. How do you", 
    "msgId": 21094, 
    "profile": "kentlbeck", 
    "topicId": 21094, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 173198504, 
    "messageBody": "<div id=\"ygrps-yiv-1125817668\">All,<br/>\n<br/>\nDavid Saff introduced me to a technique a couple of weeks ago that I&#39;d like<br/>\nto share. So you have a defect and a system-level test that fails. How do<br/>\nyou find the line(s) of code you need to change? The traditional (defined as<br/>\n&quot;what I used to do&quot;) way is to single step in a debugger. Once I find the<br/>\ndefect, though, I only have the system test&#39;s word that I&#39;ve fixed it.<br/>\n<br/>\nThe Saff Squeeze is an alternative way to find the defect. You inline the<br/>\noffending method call in the system test. Then you move the assertion to<br/>\nsomewhere in the middle of the inlined code. Then you prune the<br/>\nnow-irrelevant parts of the test. Repeat until you can&#39;t inline further<br/>\nwithout losing sight of the incorrect code. By running tests as you go along<br/>\nyou get concrete feedback about your hypothesis regarding what&#39;s wrong. The<br/>\nresulting test isolates the problem and provide a nice complementary<br/>\nregression test to the original test. That&#39;s why I titled the paper &quot;Hit &#39;Em<br/>\nHigh, Hit &#39;Em Low&quot; www.threeriversinstitute.org/HitEmHighHitEmLow.html.<br/>\n<br/>\nIf you try the Squeeze I&#39;d like to hear how it goes.<br/>\n<br/>\nCheers,<br/>\n<br/>\nKent</div>", 
    "prevInTime": 21093, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1226674060", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PEFDNUMwNDVFNzVCRjQ5NUI4NDEzNTA5RDcxNzQxMjFGQGtlbnRzcGF2aWxpb24+"
    }
}