{
    "numMessagesInTopic": 5, 
    "nextInTime": 21137, 
    "senderId": "n0FytBG4Rq12sYIJRnVxDiHm2z3Ml_74XxIUKXZKOv9ztagakGkSXHKY6zdKd5hLLhjOXwN_TzwedsqrA-EyNmHZqaazQIG-4s5XAbM44NRrFJ87LvI", 
    "systemMessage": false, 
    "subject": "JUnit List Etiquette", 
    "from": "&quot;Simon Chappell&quot; &lt;simonpeterchappell@...&gt;", 
    "authorName": "Simon Chappell", 
    "msgSnippet": "It s time for a little reminder of some of the finer points of JUnit mailing list etiquette. This will be posted now and then; not often enough to be spam, but", 
    "msgId": 21136, 
    "rawEmail": "Return-Path: &lt;simonpeterchappell@...&gt;\r\nX-Sender: simonpeterchappell@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nX-Received: (qmail 68349 invoked from network); 25 Nov 2008 23:46:10 -0000\r\nX-Received: from unknown (66.218.67.95)\n  by m48.grp.scd.yahoo.com with QMQP; 25 Nov 2008 23:46:10 -0000\r\nX-Received: from unknown (HELO ug-out-1314.google.com) (66.249.92.168)\n  by mta16.grp.scd.yahoo.com with SMTP; 25 Nov 2008 23:46:09 -0000\r\nX-Received: by ug-out-1314.google.com with SMTP id k3so1328179ugf.4\n        for &lt;junit@yahoogroups.com&gt;; Tue, 25 Nov 2008 15:46:09 -0800 (PST)\r\nX-Received: by 10.103.239.10 with SMTP id q10mr1847671mur.67.1227656768847;\n        Tue, 25 Nov 2008 15:46:08 -0800 (PST)\r\nX-Received: by 10.103.249.6 with HTTP; Tue, 25 Nov 2008 15:46:08 -0800 (PST)\r\nMessage-ID: &lt;8ed733900811251546v58b8b5efsb4d65524dbcf90a8@...&gt;\r\nDate: Tue, 25 Nov 2008 17:46:08 -0600\r\nTo: junit@yahoogroups.com\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Transfer-Encoding: 7bit\r\nContent-Disposition: inline\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Simon Chappell&quot; &lt;simonpeterchappell@...&gt;\r\nSubject: JUnit List Etiquette\r\nX-Yahoo-Group-Post: member; u=211142374; y=FHN9KZXBblCFsH3ae-6XaiMQ756zrpBW_osoSIC3Iqfg9eYWtQ\r\nX-Yahoo-Profile: spchappell\r\n\r\nIt&#39;s time for a little reminder of some of the finer points of JUnit\nmailing list etiquette. This will be posted now and then; not often\nenough to be spam, but often enough to keep our newer members aware of\nhow we conduct business around here.\n\nDear members and readers of the JUnit mailing list,\n\nAround here, we love testing. Not only do we love testing, we love to\ndiscuss any and all aspects of testing, often with enthusiasm and\npassion. This is good. This is the reason that this mailing list\nexists. On top of all this, we are very keen to help others understand\nthis strange affliction we have; medical name &quot;testus infectus&quot;,\nbetter known as being test infected. We love to answer questions and\nhelp those new to the joy move further down the road towards test\nenlightenment. In the classic spirit of hospitality, our list is your\nlist, our test cases are your test cases. Please make yourself at home\nand enjoy the journey. :-)\n\nThat said, there are some things that we don&#39;t love, so sit tight and listen up.\n\nWe don&#39;t love people who haven&#39;t, or won&#39;t, read the JUnit Frequently\nAsked Questions (FAQ) document, lovingly maintained by Mike Clark or\nthe &quot;Smart Questions&quot; document written and maintained by Eric S.\nRaymond. Here are the links, go forth and read ...\n\nhttp://junit.sourceforge.net/doc/faq/faq.htm\n\nhttp://www.catb.org/~esr/faqs/smart-questions.html\n\nWe don&#39;t love people who think that we&#39;ll do their homework\nassignments for them. Back when I was a lad, we didn&#39;t have the\nInternet and we had to do our own homework assignments without the aid\nof all the knowledge and information that you have available to you\ntoday. (And yes, now that you ask, I did walk uphill both ways to\nschool through the snow.)\n\nWe don&#39;t love people who are incapable of using a search engine, but\nare yet somehow capable of signing up onto this mailing list so that\nthey can ask questions that ten seconds of searching would reveal the\nanswer to. Learn how to use a search engine. Around here, Google seems\nquite popular. Here&#39;s a link; learn to love it and use it.\n\nhttp://www.google.com/\n\nWe don&#39;t love job postings. We do love having jobs (or at least, we\nlike the pay) and we do like to look at job postings, but we like to\nlook at them in more logical places like job websites. So, please\ndon&#39;t be upset when a moderator deletes your carefully worded prose\ndescribing yet another testing job.\n\nWe don&#39;t love thread hijacking. That&#39;s when you start a different\nsubject by replying to a previous conversation and not even changing\nthe subject line. We like to discuss a variety of subjects, so please\nfeel free to be inspired to ask side-questions during ongoing\nconversations. Just do so by starting a fresh thread with a unique\nsubject line.\n\nLastly, we don&#39;t love people who whine, moan and generally sound like\npetulant children after they&#39;ve been told that they have violated one\nof the &quot;laws of the land&quot; around here. It&#39;s a big old Internet; feel\nfree to take your questions and/or tantrums somewhere else if you\ndon&#39;t like the way we do things around here.\n\nSimon\n(One of the JUnit mailing list moderators)\n\n-- \nsimonpeter.org | simonpeter.com | newlife-upc.org | wisconsindistrictnews.org\n\n", 
    "profile": "spchappell", 
    "topicId": 18530, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 211142374, 
    "prevInTime": 21135, 
    "contentTrasformed": false, 
    "postDate": "1227656768", 
    "canDelete": false, 
    "nextInTopic": 21251, 
    "prevInTopic": 20786, 
    "headers": {
        "messageIdInHeader": "PDhlZDczMzkwMDgxMTI1MTU0NnY1OGI4YjVlZnNiNGQ2NTUyNGRiY2Y5MGE4QG1haWwuZ21haWwuY29tPg=="
    }
}