{
    "numMessagesInTopic": 6, 
    "nextInTime": 21151, 
    "senderId": "qe835Pd2t9-Utrigq4VStz6TjeC2NZgAokxsSSnwwdFxsexBSj-kIdZt2NtWiOJED1XLywGdzbNj3HeO", 
    "systemMessage": true, 
    "subject": "Re: [junit] US DoD and jUnit", 
    "from": "Jeff &lt;jjg@...&gt;", 
    "authorName": "Jeff", 
    "msgSnippet": "Argh. Years back I was a contractor for the DoD. This statement means one of a few possible things: 1. We don t know what jUnit it, so we re against it 2.", 
    "msgId": 21150, 
    "profile": "j_j_g_1_2_3", 
    "topicId": 21144, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 114476421, 
    "messageBody": "<div id=\"ygrps-yiv-809431507\">Argh. Years back I was a contractor for the DoD. This statement means <br/>\none of a few possible things:<br/>\n<br/>\n1. &quot;We don&#39;t know what jUnit it, so we&#39;re against it&quot;<br/>\n2. &quot;We heard of something like jUnit that is actually banned, so just in <br/>\ncase we&#39;ll say jUnit is banned too.&quot;<br/>\n3. &quot;It&#39;s late, let&#39;s go home.&quot;<br/>\n<br/>\nI would suggest that since none of the people here who work with jUnit <br/>\nhave heard of this ban, plus jUnit is pretty much the standard, the <br/>\npeople making the claim must corroborate it to a *legally* binding <br/>\ndegree. Nothing like a &quot;well I heard on the internet that...&quot; or &quot;some <br/>\nguy who works at some other location says...&quot; but a copy of an actual <br/>\nmemo or directive that explicitly names jUnit and explains the reason <br/>\nfor the ban.<br/>\n<br/>\nOtherwise, I would simply be a good negotiator, viz., expressions of <br/>\nsympathy (they are free) but don&#39;t give in to whatever they say until <br/>\nthey document it.<br/>\n<br/>\n---&gt; Exceptional claims require exceptional proof &lt;---<br/>\n<br/>\nNote that you should strongly take the position that jUnit is allowed, <br/>\nit is the standard and that *they* must prove their claim. Otherwise you <br/>\nwill be trying to show a negative, which is impossible and will eat up a <br/>\nlot of your time in the process.  What will you do if you come up <br/>\nempty-handed and they say they think the memo was actually classified? <br/>\nIf they are legitimate programmers then you&#39;ll get this settled pretty <br/>\nquickly and amicably. If they are non-technical but in charge, well... <br/>\nbest of luck....<br/>\n<br/>\nJeff<br/>\n<br/>\nDavid McReynolds wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; Someone popped up at a meeting this morning and announced that the US<br/>\n&gt; DoD does not allow the use of jUnit for unit testing.<br/>\n&gt;<br/>\n<br/>\n<br/>\n&gt; First, I find<br/>\n&gt; that a little hard to swallow given the second statement about junit<br/>\n&gt; being the built-in testing generator provided by java (can you say<br/>\n&gt; non-sequitor?). Secondly, I cannot corroborate that statement via google.<br/>\n&gt;<br/>\n&gt; What I need is link to a document that explicitly corroborates or<br/>\n&gt; refutes the statement. So far, it looks like the statement is false<br/>\n&gt; but I am only using deductive reasoning there.<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 21149, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1228243470", 
    "canDelete": false, 
    "nextInTopic": 21151, 
    "prevInTopic": 21148, 
    "headers": {
        "inReplyToHeader": "PGdoMWNlNitoMm1rQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDQ5MzU4MjBFLjcwM0BqcWhvbWUubmV0Pg==", 
        "referencesHeader": "PGdoMWNlNitoMm1rQGVHcm91cHMuY29tPg=="
    }
}