{
    "numMessagesInTopic": 2, 
    "nextInTime": 21157, 
    "senderId": "o_uTtU3Ek4aSuCPo9WwofXiBEXPLglYN57ix7lIhHCBx6v2y0n0jJLrMGQHn2jTifLqwt-UOWQCa9YFTqua0YOclUp8wV7t1zymHrJ38D-xqBDdlYHM", 
    "systemMessage": true, 
    "subject": "Re: [junit] Regarding unit testing in Struts application with Ibatis Data layer", 
    "from": "&quot;David McReynolds&quot; &lt;david.mcreynolds@...&gt;", 
    "authorName": "David McReynolds", 
    "msgSnippet": "The purist in me says you put the DAO interfaces in your application project (or their very own project/module/jar). The DAO impls go in their own project", 
    "msgId": 21156, 
    "profile": "dmcreyno", 
    "topicId": 21153, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 309003828, 
    "messageBody": "<div id=\"ygrps-yiv-1461652054\">The purist in me says you put the DAO interfaces in your application project<br/>\n(or their very own project/module/jar). The DAO impls go in their own<br/>\nproject (project/module/jar). Then, you write unit tests for the DAO impls<br/>\nin the dao impl project. That way, you only &quot;need&quot; the database when running<br/>\nunit tests for the DAOs, you use a mocking tool to mockup the DAO interfaces<br/>\nin your application project. At that point, you can write your service layer<br/>\nunit tests. You then mock-up the service layer interfaces and start writing<br/>\nstruts action unit tests.<br/>\n<br/>\nIf you write service layer unit tests that depend on a real database, then<br/>\nyou&#39;ve not written unit tests, you&#39;ve written integration tests. The same<br/>\ngoes for struts action tests that depend on a real service layer.<br/>\n<br/>\nThe pragmatist in me says write your DOA impl unit tests to run against the<br/>\ndatabase. Then write your service unit tests with a dependency on you<br/>\ndatabase (just recognize that these are integration tests). Skip the struts<br/>\naction unit tests. There should be NO business logic in a struts action and<br/>\nreally little other logic other than mapping and service calls.<br/>\n<br/>\nWhen you write your DAO impl unit tests, you need to make sure that you<br/>\ncircumvent the DAO layer for test setup and verification. If you use the DAO<br/>\nimplementations to setup and verify, then you are testing stuff, but you<br/>\ncannot define what you are testing.<br/>\n<br/>\n--dlm<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Dec 2, 2008 at 4:46 PM, Kenan Azam &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:azam.kenan@...\">azam.kenan@...</a>&gt; wrote:<br/>\n<br/>\n&gt;   Hi there,<br/>\n&gt; I am a developer working on a web application which utilizes Struts as the<br/>\n&gt; controller and Spring to do dependency injection at the Data Access Objects<br/>\n&gt; layer.<br/>\n&gt; I want to introduce unit tests in the application.<br/>\n&gt;<br/>\n&gt; The current design of the application is as follows<br/>\n&gt;<br/>\n&gt; JavaScript/Jsps/ ----&gt; Struts Action Forms and Struts Action Classes --&gt;<br/>\n&gt; Service Class usually has most of the logic ---&gt; DAO objects (automatically<br/>\n&gt; generated by ibatis a hibernate like framework)---&gt; Sql Maps --&gt; Database<br/>\n&gt;<br/>\n&gt; I am currently writing test cases for the Service Class which involves a<br/>\n&gt; lot<br/>\n&gt; of database transactions. Also, if I instead use StrutsTestCase and test<br/>\n&gt; the<br/>\n&gt; actions instead would that make any difference or should I try both test on<br/>\n&gt; the Action classes and the Service classes.<br/>\n&gt;<br/>\n&gt; Is anyone using unit testing in an application like the one above, any<br/>\n&gt; feedback is appreciated.<br/>\n&gt;<br/>\n&gt; Thanks, Kazam.<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n--<br/>\ndlm<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 21155, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1228316479", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 21153, 
    "headers": {
        "inReplyToHeader": "PGU4YTJjODY5MDgxMjAyMTM0NnI5NGUwMTZldGMyNDAzNDgzOWUwODE3QG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PDIwYzNmZmY1MDgxMjAzMDcwMXk3NzBlNTliZWlmMTViMmViYmJjOTMxYjJAbWFpbC5nbWFpbC5jb20+", 
        "referencesHeader": "PGU4YTJjODY5MDgxMjAyMTM0NnI5NGUwMTZldGMyNDAzNDgzOWUwODE3QG1haWwuZ21haWwuY29tPg=="
    }
}