{
    "numMessagesInTopic": 48, 
    "nextInTime": 2124, 
    "senderId": "Q_RXj62iMnU2UUQcuVe5z_j8fGTiDIbCCsQ1RaJrxmXL8LVYSB2xQrqH-rdyi9-CoFuDzSknewOGghQzaJTa4vPyP4nRy2bYpvY", 
    "systemMessage": false, 
    "subject": "Re: [junit] Reporting more then 1 failed assertion per test", 
    "from": "Thomas Obst &lt;thomas_obst@...&gt;", 
    "authorName": "Thomas Obst", 
    "msgSnippet": "... The only important thing is whether the application works. Whatever else  we evaluate, whether it is the number of asserts, the number of tests, the number", 
    "msgId": 2123, 
    "topicId": 2072, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-199078018\">Jason Rogers wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I respectfully disagree.  You assume that asserts and test cases are equal<br/>\n&gt; in their importance.  What I want to know is whether or not a test has<br/>\n&gt; passed.  ...  So, why count asserts?  Perhaps to give<br/>\n&gt; that warm, fuzzy feeling... perhaps for some other reason.<br/>\n<br/>\n </span></blockquote>The only important thing is whether the application works. Whatever else  we<br/>\nevaluate, whether it is the number of asserts, the number of tests, the number<br/>\nof test cases, or even whether we test at all, is just there to give us that<br/>\n&quot;warm, fuzzy feeling&quot; or to give us the shivers. The number of tests/asserts<br/>\ndoesn&#39;t prove anything but it does give us a hint at an appropriate body<br/>\ntemperature.<br/>\n<br/>\nI guess this whole discussion really boils down to what constitutes a test. I<br/>\nchoose to organize my tests so that I generally have one test per tested method,<br/>\nwith appropriately many asserts per test. Other programmers might want to<br/>\nrefactor my test code so that basically one assert per test was the rule. This<br/>\nis probably just a matter of taste. If so, it would be nice if JUnit would<br/>\nsupport both approaches - displaying the number of tests _and_ the number of<br/>\nasserts.<br/>\n<br/>\n- Tom</div>", 
    "prevInTime": 2122, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "996155129", 
    "canDelete": false, 
    "nextInTopic": 2124, 
    "prevInTopic": 2120, 
    "headers": {
        "messageIdInHeader": "PDNCNjAxRUY5LkQ2MTE5OUQ2QGFzZGlzLmRlPg==", 
        "referencesHeader": "PDg3RUU2QjIxQzYyNEQ1MTFCNzI0MDAxMDRCQ0YxRUIwMUY2MUQwQGV4Y2g+"
    }
}