{
    "numMessagesInTopic": 48, 
    "nextInTime": 2135, 
    "senderId": "5jk2NtTQzcXQKbmxnTTC8CpXxiQ6zYPbZXKes9nT1iMEbCIFN0YOxxQkno8AHJfqXhK2eXeQOP0d2Z0gXemFm176K7YNT4JoVYrv", 
    "systemMessage": false, 
    "subject": "RE: [junit] Reporting more then 1 failed assertion per test", 
    "from": "Jeff Langr &lt;JLangr@...&gt;", 
    "authorName": "Jeff Langr", 
    "msgSnippet": "I have a passing interesting in seeing an assertion count in JUnit, but I could and do live without it just fine.  My reason seems to be different from any of", 
    "msgId": 2134, 
    "topicId": 2072, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-618396066\">I have a passing interesting in seeing an assertion count in JUnit, but I<br/>\ncould and do live without it just fine.  My reason seems to be different<br/>\nfrom any of the others I&#39;ve seen.<br/>\n<br/>\nI don&#39;t give a hoot about the total number of assertions for whatever<br/>\nmetrics purposes.  I do care about doing test-first coding appropriately. <br/>\n<br/>\nThat means: code some context, code an assert. <br/>\nMake sure the assert fails.  Fix the assert. <br/>\nAdd another assert to the same test method. <br/>\nRepeat until done with all things that assert against <br/>\nthe given context for the test method. <br/>\n<br/>\nMy problem is that my memory is poor, and I get <br/>\ndistracted.  I just coded an assert and compiled.  <br/>\nOr did I really compile?<br/>\nDrat, I forgot.  <br/>\nDid I just add a new assert to the body of tests or did I not? <br/>\n<br/>\nThe count of assertions would be something visual that would change so I<br/>\ncould get *feedback* and not have to trust myself.  It&#39;s part of the reason<br/>\nthere is a count of tests, anyway. <br/>\n <br/>\nWhat if instead of being a count, it was a simple visual symbol that showed,<br/>\nfor a given test class, that there is now a new assert that is being run for<br/>\nthe first time? <br/>\n(could be a royal pain to figure out... consider if asserts are changed <br/>\nor deleted) <br/>\n<br/>\nOr am I just slower than the majority of developers?</div>", 
    "prevInTime": 2133, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "996170399", 
    "canDelete": false, 
    "nextInTopic": 2135, 
    "prevInTopic": 2133, 
    "headers": {
        "messageIdInHeader": "PEFGMDc3NzZEQjVEMUQyMTFCQzA3MDBBMEM5RTkyMzdGNUMwMTdDQG9iamVjbWVudG9yLmNvbT4="
    }
}