{
    "numMessagesInTopic": 5, 
    "nextInTime": 21402, 
    "senderId": "2yTXg71GBnXMzfZN_ep86eD6IWMb_ZbvfcKMODJdMGnLhGHjNluZ85DfVA0tXQEJjRDZLmXjFtvmDHmepl2Yog8UKQZFSUCsfzFhh5aKSJw", 
    "systemMessage": false, 
    "subject": "Making a better Suite annotation", 
    "from": "&quot;yme0987654321&quot; &lt;yme0987654321@...&gt;", 
    "authorName": "yme0987654321", 
    "msgSnippet": "I have the following challenge, with a proposed solution. If there is interest, I would be happy to contribute a patch to the JUnit project to address it. On", 
    "msgId": 21401, 
    "profile": "yme0987654321", 
    "topicId": 21401, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 386557907, 
    "messageBody": "<div id=\"ygrps-yiv-488477863\">I have the following challenge, with a proposed solution. If there is<br/>\ninterest, I would be happy to contribute a patch to the JUnit project<br/>\nto address it. On the other hand, if there is a way to solve this<br/>\nproblem differently in JUnit already, please let me know.<br/>\n<br/>\nAnt and IDEA (the IDE from Intellij) don&#39;t agree on how to gather<br/>\nclasses for test. IDEA inspects the actual class for things that<br/>\nextend TestCase or have a JUnit annotation on the class (or have a<br/>\nstatic suite method) and executes the test. Ant gathers tests via<br/>\nclass names. To use the Ant method with JUnit outside of Ant, you can<br/>\nuse JUnitCore, and just pass it an array of classes gathered in the<br/>\nAnt form. However IDEA doesn&#39;t report those results in its typical<br/>\nfashion. It uses its own custom runner to gather and run these tests.<br/>\n<br/>\nThe only option I see in the JUnit current code is to make a custom<br/>\nrunner that knows how to extract a Class[] array and pass it on to the<br/>\nstandard runner, and then use the RunWith tag to annotate an arbitrary<br/>\nclass to get IDEA to think that it is running a test suite. I haven&#39;t<br/>\nactually done this to see if IDEA has any issues, but it seems like it<br/>\nshould work.<br/>\n<br/>\nMy proposal is to add an annotation to the Suite class called<br/>\nSuiteMethod that would annotate a method that returns a Class[] array.<br/>\nThe Suite would then be built from the two annotations,<br/>\nSuite.SuiteClasses plus any methods on the class (we could enforce<br/>\nthat they be public, static, take no parameters and return a Class[]<br/>\narray) that are annotated with Suite.SuiteMethod and build the Suite<br/>\nas a combination of all of the Arrays returned.<br/>\n<br/>\nWhat do you think?</div>", 
    "prevInTime": 21400, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1235572498", 
    "canDelete": false, 
    "nextInTopic": 21486, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGdvM2t1aStyazNsQGVHcm91cHMuY29tPg=="
    }
}