{
    "numMessagesInTopic": 8, 
    "nextInTime": 21442, 
    "senderId": "pvQI2RnAOPEj-xB5eYfjcODCmS9zLBBOisKCx8adwVmMXz37HUrApT1D7xOJNB6n7QNL_Hg-Omv227B6i5crbYGZKmTIClO_RHEyYqE", 
    "systemMessage": true, 
    "subject": "Newbie question about the best practice for organizing and running tests", 
    "from": "&quot;David Parks&quot; &lt;davidparks21@...&gt;", 
    "authorName": "David Parks", 
    "msgSnippet": "Hi there, I m new at JUnit, and just want to start using it with a new project. I m trying to figure out the best way to easily expand on a set of test", 
    "msgId": 21441, 
    "profile": "davidparks21", 
    "topicId": 21441, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 25644315, 
    "messageBody": "<div id=\"ygrps-yiv-858753936\">Hi there, I&#39;m new at JUnit, and just want to start using it with a new project. <br/>\n<br/>\nI&#39;m trying to figure out the best way to easily expand on a set of test classes.<br/>\n<br/>\nIt seems like I should configure a TestSuite of some sort. But I&#39;m not sure if I should use the DirectoryBuilder, or if I should manually maintain a class that launches my tests, or use annotations.<br/>\n<br/>\nIt looks like there is a way to simply annotate the classes I want to run and then to be able to kick off various test suites. But the docs don&#39;t have many examples of this. And it seems like there are many ways to do the same thing.<br/>\n<br/>\nThe cookbook just mentions using JUnitCore.runClasses(TestClass1.class, ...), but that doesn&#39;t seem very extendable.<br/>\n<br/>\nI&#39;m just looking for a simple best practice. I&#39;d like to not have to update a main() method each time I want to add a new test class. I&#39;d like to simply kick off one or another suite of test classes from my IDE in most cases and get a nicely printed result printed to the console.<br/>\n<br/>\nThanks!<br/>\nDavid</div>", 
    "prevInTime": 21440, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1237926997", 
    "canDelete": false, 
    "nextInTopic": 21443, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGdxYmc4bCtvMWxkQGVHcm91cHMuY29tPg=="
    }
}