{
    "numMessagesInTopic": 4, 
    "nextInTime": 21466, 
    "senderId": "lVWAEJH_BwrT5EKNS66ZRnrBNPiEkmfK1eHRqAgc0PUaAlc3ZZvrL7t59zlh95ZyyjMXSxgQg38_-paUFPqhUqcZ5pqNsop1bqE", 
    "systemMessage": true, 
    "subject": "Support of jUnit 4 annotations in jUnit-3-style TestCases", 
    "from": "&quot;jduprez4junit&quot; &lt;jethrie@...&gt;", 
    "authorName": "jduprez4junit", 
    "msgSnippet": "[renamed topic with a more appropriate subject line] OK I understand this is an intentional feature, and that it would be costly to change it. It s not a", 
    "msgId": 21465, 
    "profile": "jduprez4junit", 
    "topicId": 21463, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 393990744, 
    "messageBody": "<div id=\"ygrps-yiv-1581192865\">[renamed topic with a more appropriate subject line]<br/>\n<br/>\nOK I understand this is an intentional feature, and that it would be costly to change it. It&#39;s not a blocking problem for me either (I can give up using annotations in legacy test classes, and migrate each class atomically).<br/>\n<br/>\nBelow are details of why this is hampering me.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, David Saff &lt;david@...&gt; wrote:<br/>\n&gt; If your test class extends TestCase, then the 3.8 rules are applied<br/>\n&gt; exactly.  There are still lots of tools that depend fairly strongly <br/>\n&gt; on that guarantee.<br/>\n<br/>\nOK, so this is intentional. And I understand your point that specifying the execution rules while mixing both 3.8 and 4.x rules may be non-trivial.<br/>\n<br/>\n&gt; 1) In your current case, it would require very little effort to<br/>\n&gt; annotate the remaining desired methods with @Test.<br/>\n<br/>\nI don&#39;t understand: the problem is merely that the @Test annotation is not taken into account as soon as the test class extends TestCase.<br/>\nMaybe what you mean is, it would would require very little effort to<br/>\nnot extend TestCase? yes of course, but this is a contrived SSSCE just to demonstrate the issue.<br/>\n<br/>\n&gt; Is there a real situation in which<br/>\n&gt; it is a significant amount of effort to update a class all at once?<br/>\n<br/>\nAgain, I don&#39;t understand. What I have is a real situation where it is a significant amount of effort to remove TestCase from the test hierarchy:<br/>\n<br/>\nI just happened to stumble on a fairly big heap of tests which are organized in a class hierarchy (OrderDaoTestCase DaoTestCase extends BaseTestCase extends TestCase). jUnit4 annotations are disregarded in OrderDaoTestCase, as it indirectly extends TestCase.<br/>\n<br/>\nIf I want to benefit from jUnit4 annotations in OrderDaoTestCase, I can either:<br/>\n- break this hierarchy before extending BaseTestCase: this would be heavy work (lots of utilities in BaseTestcase, could have been written as static utilities or helper classes, but the legacy situation is that most of these useful utilities are based on instance methods or protected fields).<br/>\n- simply making BaseTestCase not extend TestCase: that would break those test subclasses that do rely on being indirect TestCase subclasses (ex: non-static assert methods).<br/>\n<br/>\n&gt; 2) Where did you look in the documentation?  Where would be a natural place to see this behavior described?<br/>\n<br/>\nOK this is a trick question because I mentioned &quot;the documentation&quot; :o)<br/>\nYour question made me search for the docs I had read, and I realized that most of them are not from the jUnit team (or on the jUnit website).<br/>\nAs far as the standard doc is concerned, well, this issue is probably too far-fetched to deserve an entry in the short cookbook (which no more describes 3.8-style anyway).<br/>\nI expected I would find it in the FAQ (must not be as frequent as I thought).<br/>\n<br/>\nThis is probably merely a subject for a tutorial on migrating from 3.8, which may seem obsolete as of today, but I&#39;m sure there still exists lots of 3.8 test code in the field.<br/>\n<br/>\nBest regards,<br/>\n<br/>\n    Jerome. </span></blockquote></div>", 
    "prevInTime": 21464, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1238517388", 
    "canDelete": false, 
    "nextInTopic": 21472, 
    "prevInTopic": 21464, 
    "headers": {
        "inReplyToHeader": "PDRmN2RhNmI5MDkwMzMxMDY1MGwxY2I4MzgwY3IyNWYyYzI5OTdlZTRmM2NhQG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PGdxdGdxYytvNzdxQGVHcm91cHMuY29tPg=="
    }
}