{
    "numMessagesInTopic": 4, 
    "nextInTime": 21473, 
    "senderId": "dvECCj87kPE_hI8V1a8mWVsPUVrBqKiTM53oN-UwN1aMBRvcomwmR5Lz_kK-coQJQQT_RsCpDY9EWkBjSUwnBEu9", 
    "systemMessage": false, 
    "subject": "Re: [junit] Support of jUnit 4 annotations in jUnit-3-style TestCases", 
    "from": "David Saff &lt;david@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "... If you annotate OrderDaoTestCase with @RunWith(JUnit4.class), does everything work? David Saff ... As you ve gathered, we ve been relying on Google and the", 
    "msgId": 21472, 
    "profile": "dsaff", 
    "topicId": 21463, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 341876227, 
    "messageBody": "<div id=\"ygrps-yiv-782354599\">On Tue, Mar 31, 2009 at 12:36 PM, jduprez4junit &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jethrie@...\">jethrie@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I just happened to stumble on a fairly big heap of tests which are organized in a class hierarchy (OrderDaoTestCase DaoTestCase extends BaseTestCase extends TestCase). jUnit4 annotations are disregarded in OrderDaoTestCase, as it indirectly extends TestCase.<br/>\n&gt;<br/>\n&gt; If I want to benefit from jUnit4 annotations in OrderDaoTestCase, I can either:<br/>\n&gt; - break this hierarchy before extending BaseTestCase: this would be heavy work (lots of utilities in BaseTestcase, could have been written as static utilities or helper classes, but the legacy situation is that most of these useful utilities are based on instance methods or protected fields).<br/>\n&gt; - simply making BaseTestCase not extend TestCase: that would break those test subclasses that do rely on being indirect TestCase subclasses (ex: non-static assert methods).<br/>\n<br/>\n </span></blockquote>If you annotate OrderDaoTestCase with @RunWith(JUnit4.class), does<br/>\neverything work?<br/>\n<br/>\n   David Saff<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; 2) Where did you look in the documentation?  Where would be a natural place to see this behavior described?<br/>\n&gt;<br/>\n&gt; OK this is a trick question because I mentioned &quot;the documentation&quot; :o)<br/>\n&gt; Your question made me search for the docs I had read, and I realized that most of them are not from the jUnit team (or on the jUnit website).<br/>\n&gt; As far as the standard doc is concerned, well, this issue is probably too far-fetched to deserve an entry in the short cookbook (which no more describes 3.8-style anyway).<br/>\n&gt; I expected I would find it in the FAQ (must not be as frequent as I thought).<br/>\n&gt;<br/>\n&gt; This is probably merely a subject for a tutorial on migrating from 3.8, which may seem obsolete as of today, but I&#39;m sure there still exists lots of 3.8 test code in the field.<br/>\n<br/>\n </span></blockquote>As you&#39;ve gathered, we&#39;ve been relying on Google and the far corners<br/>\nof the Internet to do some of our documentation for us, as we<br/>\nconcentrate our limited time on functionality.  This is missing.<br/>\nPerhaps you could log a feature request at SourceForge to update the<br/>\nFAQ?  Thanks,<br/>\n<br/>\n   David Saff</div>", 
    "prevInTime": 21471, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1238681692", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 21465, 
    "headers": {
        "inReplyToHeader": "PGdxdGdxYytvNzdxQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDRmN2RhNmI5MDkwNDAyMDcxNHY2Yjk3YzBmM2xkNjBlNGUyYTAwNTAzMjFmQG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PDRmN2RhNmI5MDkwMzMxMDY1MGwxY2I4MzgwY3IyNWYyYzI5OTdlZTRmM2NhQG1haWwuZ21haWwuY29tPgkgPGdxdGdxYytvNzdxQGVHcm91cHMuY29tPg=="
    }
}