{
    "numMessagesInTopic": 9, 
    "nextInTime": 21521, 
    "senderId": "pVAGRWOKByD28fTMzGDbqQXB9_WR8n7lqjHZlomlxwCBUB5drP5BqVjrUYKv926hkaldPPt0yd0ZeeiSChDz0f_8", 
    "systemMessage": false, 
    "subject": "Re: [junit] TDD Using NetBeans 6.5+ and JUnit.", 
    "from": "David Saff &lt;david@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "Karl, Eclipse also has a UI feature that will automatically create a JUnit test case class from an existing class.  I never use it.  Instead, I manually create", 
    "msgId": 21520, 
    "profile": "dsaff", 
    "topicId": 21518, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 341876227, 
    "messageBody": "<div id=\"ygrps-yiv-137378178\">Karl,<br/>\n<br/>\nEclipse also has a UI feature that will automatically create a JUnit<br/>\ntest case class from an existing class.  I never use it.  Instead, I<br/>\nmanually create test classes.  Does NetBeans make this more difficult?<br/>\n<br/>\n   David Saff<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Apr 19, 2009 at 6:18 PM, Karl Krasnowsky &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:karlkras@...\">karlkras@...</a>&gt; wrote:<br/>\n&gt; This question is really targeted to those who have used Kent Beck&#39;s book, Test-Driven Development within the context of the NetBeans IDE, otherwise please disregard.<br/>\n&gt;<br/>\n&gt; Maybe someone here can provide a pointer to already available information on this.<br/>\n&gt; I&#39;m using Kent Beck&#39;s book, Test-Driven Development as a tutorial and was looking at how i might use NetBeans with its JUnit plugin to mimic his recommended processes, but right out of the gate I&#39;m having a fundamental issue.<br/>\n&gt; A standard practice of KB&#39;s method is to code the test before any code is written, and then backfill the empty bits (class, methods, variables, etc.) to make the test work.<br/>\n&gt; for example, here&#39;s the first JUnit test he shows in chapter 1 to begin building from:<br/>\n&gt; Code:<br/>\n&gt;    public void testMultiplication() {<br/>\n&gt;        Dollar five = new Dollar(5);<br/>\n&gt;        five.times(2);<br/>\n&gt;        assertEquals(10, five.amount);<br/>\n&gt;    }<br/>\n&gt;<br/>\n&gt; Problem I&#39;m having is, if I&#39;m creating tests out of the context of the Java project, tests in NB aren&#39;t created until you have a class with runtime methods to create tests from. So I have a chicken egg sort of situation. NB would do the obvious thing, i.e., have tests generated from code, so the above doesn&#39;t make any sense as it implies that the code is generated from the test, which is a cool idea of the IDE could support it.<br/>\n&gt; I have experience using JUnit, so the framework itself isn&#39;t in question, but how to apply this methodology within the IDE format is.<br/>\n&gt; Do I have to simply short-circuit the default process that NB and the JUnit plugin manufacture?<br/>\n&gt;<br/>\n&gt; thanks in advance for any help on this,<br/>\n&gt; Karl<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 21519, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1240186040", 
    "canDelete": false, 
    "nextInTopic": 21521, 
    "prevInTopic": 21518, 
    "headers": {
        "inReplyToHeader": "PGdzZzd2cis2YjBmQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDRmN2RhNmI5MDkwNDE5MTcwN2ozZDJkOWI1YW8xNTdhZjQ0MDc5Yjg3Y2RiQG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PGdzZzd2cis2YjBmQGVHcm91cHMuY29tPg=="
    }
}