{
    "numMessagesInTopic": 12, 
    "nextInTime": 2161, 
    "senderId": "m0TK63w5g40ZPsGGl1QgfMQdHrfIzWjuj10rSwvq6izSw4mtZfzne-QgsG0gO3xvjk42yyteC40Z3_MitlQg15YB4FtX2YPsIujO1yp8MrQcNVc", 
    "systemMessage": false, 
    "subject": "Counting assertions", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains762@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... Mike makes an excellent point here. It is critical to ensure that your tests do something interesting, otherwise the numbers simply give you false ", 
    "msgId": 2160, 
    "topicId": 2160, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1633974165\"><blockquote><span title=\"ireply\">&gt;&quot;90 tests, 405 assertions&quot; doesn&#39;t tell me much, however seeing something<br/>\n&gt;like &quot;90 tests, 0 assertions&quot; should raise a red flag in anyone&#39;s eyes. <br/>\n&gt;This<br/>\n&gt;sort of thing does happen and needs to be highlighted.<br/>\n<br/>\n </span></blockquote>Mike makes an excellent point here. It is critical to ensure that your tests <br/>\ndo something interesting, otherwise the numbers simply give you false <br/>\nsecurity.<br/>\n<br/>\nCertainly, at some point, as a developer, you have to think. Test-first <br/>\nprogramming merely makes that thinking more effective, by concentrating on <br/>\ncoding the expected behavior of a class, then worrying about the details of <br/>\nhow to make the class beahve that way. If you write tests without thinking, <br/>\nyou&#39;re doomed, whether JUnit counts assertions or not.<br/>\n<br/>\nIf you want to count assertions, then be my guest. TestCase extends Assert, <br/>\nso nothing stops you from creating class MyTestCase that extends TestCase <br/>\nand overrides assertTrue() to do the counting. It does not need to be in the <br/>\nframework or even a standard extension.<br/>\n<br/>\nYou could also use something like JesTer, which changes your code and <br/>\nexpects tests to fail. It can either identify code not tested (so either <br/>\ntest it or remove it) or pointless tests (so either fix it or remove it).<br/>\n<br/>\nDo whatever makes sense for you, but don&#39;t get bogged down in counting <br/>\nassertions for the sake of counting assertions. For the most part, people on <br/>\nthis list have insisted that the number, on its own, is largely meaningless. <br/>\nMike has pointed out a situation in which it has great meaning. I hope we <br/>\nall read that and thought about it.<br/>\n<br/>\nSimply: do what makes sense. Think. Share your ideas. Listen to <br/>\nalternatives. Don&#39;t be so quick to change JUnit, though -- it didn&#39;t develop <br/>\novernight, you know. :)<br/>\n<br/>\nJBR.<br/>\n<br/>\n_________________________________________________________________<br/>\nGet your FREE download of MSN Explorer at <a rel=\"nofollow\" target=\"_blank\" href=\"http://explorer.msn.com/intl.asp\">http://explorer.msn.com/intl.asp</a></div>", 
    "prevInTime": 2159, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "996258715", 
    "canDelete": false, 
    "nextInTopic": 15162, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PEYyOVFkT2dsNHJoWVFZeDNHNWEwMDAwYmI4Y0Bob3RtYWlsLmNvbT4="
    }
}