{
    "numMessagesInTopic": 6, 
    "nextInTime": 21620, 
    "senderId": "craFcvA6D7kc4k4NG-eCJnDxehf2Xqb9s_66TYdYIy70c-DR0wsUoUsFTDAHaMy7a-lN-S8SuBXHfNFW2NXXlGpm4QV8YlQKWjdZqA", 
    "systemMessage": true, 
    "subject": "No runnable methods in Eclipse plugin", 
    "from": "&quot;blekit@...&quot; &lt;blekit@...&gt;", 
    "authorName": "blekit@ymail.com", 
    "msgSnippet": "Hello, i m currently writing a plugin which is supposed to launch JUnit4 Tests after each save. So far i m only loading every class that is changed using", 
    "msgId": 21619, 
    "profile": "blekit@ymail.com", 
    "topicId": 21619, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 400349000, 
    "messageBody": "<div id=\"ygrps-yiv-1876658478\">Hello,<br/>\n<br/>\ni&#39;m currently writing a plugin which is supposed to launch JUnit4 Tests after each save. So far i&#39;m only loading every class that is changed using IResourceChangedListener and URLClassLoader:<br/>\n<br/>\nURLClassLoader classLoader = new URLClassLoader(new URL[] {outputDirectory.toURL(), new URL(&quot;file:/D:/eclipse/plugins/org.junit4_4.3.1/junit.jar&quot;) });<br/>\n<br/>\nClass&lt;?&gt; clazz = classLoader.loadClass(fileName);<br/>\n<br/>\nAt this point everything looks great - when i modify JUnit4 test class it gets loaded with annotations on proper methods (thanks to second URL - without it no annotation was loaded, and to be honest i don&#39;t know why). However, things start to go wrong when i pass the loaded class to JUnitCore.run method - the result i always get says that there was &quot;No runnable method&quot; exception even though there are clearly some method annotaded with @Test...<br/>\n<br/>\nI have little experience in writing plugins for Eclipse, so i&#39;m kind of lost now... I may suspect, that the problem is with not sufficient classpath (cause it seems that it was a reason why i had to add another URL to class loader) of my plugin. So i&#39;m asking if anyone ever tried to dynamically load test classes from Eclipse plugin and run them using JUnitCore - if so, I&#39;d be very grateful for helping me out with this problem. <br/>\n<br/>\nThanks in advance.<br/>\nBest regards,<br/>\nMichal Olejnik</div>", 
    "prevInTime": 21618, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1242489542", 
    "canDelete": false, 
    "nextInTopic": 21620, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGd1bW5zNithNmlpQGVHcm91cHMuY29tPg=="
    }
}