{
    "numMessagesInTopic": 7, 
    "nextInTime": 21724, 
    "senderId": "j6kE7600uLmDNerf0QSMzfxm2nNylRImk5_E0lEyC0HlemelRDOj-b-uJnmPZ5F0yo1JxAUqgSTPduWUFEvBbL1ISx9R19f_", 
    "systemMessage": false, 
    "subject": "Re: Non-static inner classes of test classes using enclosing fixtures?", 
    "from": "&quot;Paul Holser&quot; &lt;pholser@...&gt;", 
    "authorName": "Paul Holser", 
    "msgSnippet": "Hi JUnit, Here s a blog entry that describes in detail what I ended up doing to get non-static inner classes instantiated and run along with their enclosing", 
    "msgId": 21723, 
    "profile": "pholser", 
    "topicId": 21578, 
    "spamInfo": {
        "reason": "3", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 66805313, 
    "messageBody": "<div id=\"ygrps-yiv-898398492\">Hi JUnit,<br/>\n<br/>\nHere&#39;s a blog entry that describes in detail what I ended up doing to get non-static inner classes instantiated and run along with their enclosing class:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://cleveralias.blogs.com/thought_spearmints/2009/06/running-nonstatic-inner-classes-of-junit-tests.html\">http://cleveralias.blogs.com/thought_spearmints/2009/06/running-nonstatic-inner-classes-of-junit-tests.html</a><br/>\n<br/>\nThanks again for the discussion and assistance.<br/>\n<br/>\n--p<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;Paul Holser&quot; &lt;pholser@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, David Saff &lt;david@&gt; wrote:<br/>\n&gt; &gt; &gt; I wonder if this would be useful functionality for JUnit to<br/>\n&gt; &gt; &gt; have in general: when a test class is detected, and that test class has<br/>\n&gt; &gt; &gt; non-static inner classes which may themselves be test classes, when<br/>\n&gt; &gt; &gt; building up tests for the enclosing class, also instantiate the inner<br/>\n&gt; &gt; &gt; test classes and attach to the (an?) enclosing test class instance. I<br/>\n&gt; &gt; &gt; saw some previous discussion about such fixtures in JDave.<br/>\n&gt; &gt; <br/>\n&gt; &gt; I think there were two different directions going on here.  It sounds<br/>\n&gt; &gt; like you want JUnit, when given the outer class, to automatically<br/>\n&gt; &gt; instantiate the inner classes.  It sounded like JDave wanted JUnit,<br/>\n&gt; &gt; when given the inner class, to automatically consult the outer class<br/>\n&gt; &gt; when instantiating.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Am I getting both requests right?  If not, then we&#39;re getting close to<br/>\n&gt; &gt; a Rule of Three threshold for reuse.  If I am, then I see the same<br/>\n&gt; &gt; Java idiom having two different &quot;obvious&quot; interpretations to two<br/>\n&gt; &gt; different classes of user.<br/>\n&gt; <br/>\n&gt; David, I believe you&#39;re getting both requests right.  In my case, the inner classes are to be instantiated along with the enclosing class when the enclosing class is run, but never instantiated and run on their own.  I ended up accomplishing this via the AllTests runner and suite() methods that adapt the enclosing class and inner class instances as JUnit 3.8-style Test adapters.  I also wanted to tie the inner class instances to a specific enclosing class instance, because the inner classes use fixture fields from an enclosing instance.<br/>\n&gt; <br/>\n&gt; It looks as though the requirement for JDave inner class contexts is that they be instantiable and runnable on their own, independent of their sibling contexts -- and that the requestor would have liked for such contexts to adopt whatever Runner a @RunWith on the enclosing class might have specified.<br/>\n&gt; <br/>\n&gt; Off the top of my head, I can&#39;t think of a clean way for JUnit to support both strategies in the core proper.<br/>\n&gt; <br/>\n&gt; I may try satisfying my specific use case in another way, perhaps using an as-yet-developed kind of Runner.  The AllTests way still seems a bit icky, but works for now.<br/>\n&gt; <br/>\n&gt; Thanks,<br/>\n&gt; Paul Holser<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 21722, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1244486935", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 21611, 
    "headers": {
        "inReplyToHeader": "PGd1aHF2bitibXZkQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGgwam1lbitxZjl0QGVHcm91cHMuY29tPg=="
    }
}