{
    "numMessagesInTopic": 10, 
    "nextInTime": 21879, 
    "senderId": "hwvy3R5UVv-iqVP6lGO1MTogwZkQhq2bmsHQIOlCJlHQHsBKLOyaAR-ZcGGOAid5o64ipCdXUacNSrTPODMVAoEfnRvEFI8jU3wCwV2W-bOkI1DzFXTSEQ", 
    "systemMessage": true, 
    "subject": "Re: [junit] Dependency Testing", 
    "from": "Lothar Kimmeringer &lt;maillists_job@...&gt;", 
    "authorName": "Lothar Kimmeringer", 
    "msgSnippet": "... I don t know what type of application you developed, but that sounds not good. ... They are supposed to be independent but in reality most test-runners ", 
    "msgId": 21878, 
    "profile": "kimmerin_job", 
    "topicId": 21874, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 120492285, 
    "messageBody": "<div id=\"ygrps-yiv-1067149695\">Trenton D. Adams schrieb:<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt; But yes, I think setting up a test, that is not dependant on any other<br/>\n&gt; test, is possible, but I would have to hard code a bunch of stuff in the<br/>\n&gt; tests, and I would have to put all of the tests in a single test, in<br/>\n&gt; order for them to succeed. And doing that would prevent a bit of my<br/>\n&gt; actual code from being tested.<br/>\n<br/>\n </span></blockquote>I don&#39;t know what type of application you developed, but that<br/>\nsounds not good.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; One other question is, can I trust the order of execution of the test<br/>\n&gt; methods in a single TestCase implemention? Or are all of them also<br/>\n&gt; supposed to be independent?<br/>\n<br/>\n </span></blockquote>They are supposed to be independent but in reality most test-runners<br/>\n(Junit, Eclipse, Ant as far as I found out) go through the tests in<br/>\nthe order they are defined in the class. This might change with a<br/>\ndifferent version of the JVM/JRE returning the names of the methods<br/>\nin a different order when using Java Reflection but an order today<br/>\nshould stay the same tomorrow if none of these components change.<br/>\n<br/>\nIf you derive a test-class from another, the methods of the deriving<br/>\nclass will be executed first, then the methods of the superclass.<br/>\nSo if you depend on a specific order of executing the methods you<br/>\nshouldn&#39;t override classes or use the suite-methods (if they<br/>\nstill exist in JUnit 4, I&#39;m still stuck with the previous version).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The reason I ask is because this is what is basically happening: There<br/>\n&gt; is an external ASYNCHRONOUS SOAP messaging system that is the core to<br/>\n&gt; all communication between several companies. Requests/responses can be<br/>\n&gt; sent to and from all of the participating parties. For testing purposes,<br/>\n&gt; so that my tests can be a little more controlled, I send requests and<br/>\n&gt; responses to and from my own server. i.e. I do not send to other<br/>\n&gt; companies, because I cannot guarantee they will respond within the time<br/>\n&gt; I need (seconds), even though technically, their test systems are<br/>\n&gt; supposed to be up and running.<br/>\n<br/>\n </span></blockquote>If you abstracted the layer between your applicaiton and the messaging<br/>\nsystem you can simply define a mock that answers the requests for you.<br/>\nThat way you don&#39;t need to setup anything in advance. I&#39;m doing this<br/>\nhere e.g. for testing the parts of our software doing OFTP by ISDN.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 1. submit request to my system, through the external system. This is<br/>\n&gt; effectively to test receiving requests from the external system, to me.<br/>\n&gt; i.e. I can send requests to myself, as if they were coming from someone<br/>\n&gt; else&#39;s system.<br/>\n&gt; 2. receive request from external system<br/>\n&gt; 3. queue job for nightly build of data<br/>\n&gt; 4. check for available data from nightly job, the next day<br/>\n&gt; 5. send available data<br/>\n&gt; 6. receive the data sent in #5, and email it out to a staff member<br/>\n<br/>\n </span></blockquote>For this I see Ant or Maven a better fitting tool than JUnit. There<br/>\nyou have dependencies and all the things you need for data-transfer,<br/>\nemailing, etc.<br/>\n<br/>\nSo write an Ant script that is preparing everything as needed and<br/>\nstart e.g. the JUnit-tests that do the testing. With the optional<br/>\ntasks junit and junitreport you even end up with a nice HTML-page<br/>\nsimilar to a Java-API documentation showing you what tests failed<br/>\nand what succeeded. Combined e.g. with Cobertura you can see what<br/>\nparts of your application aren&#39;t under test.<br/>\n<br/>\n<br/>\nRegards, Lothar</div>", 
    "prevInTime": 21877, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1250494047", 
    "canDelete": false, 
    "nextInTopic": 21879, 
    "prevInTopic": 21877, 
    "headers": {
        "inReplyToHeader": "PDE2NTYwMTI2NDcuMjIzOTY2MzEyNTA0OTIwMzcxNjkuSmF2YU1haWwucm9vdEBhbXVuZHNlbi5jcy5hdGhhYmFzY2F1LmNhPg==", 
        "messageIdInHeader": "PDRBODkwNjVGLjEwNTAxMDdAa2ltbWVyaW5nZXIuZGU+", 
        "referencesHeader": "PDE2NTYwMTI2NDcuMjIzOTY2MzEyNTA0OTIwMzcxNjkuSmF2YU1haWwucm9vdEBhbXVuZHNlbi5jcy5hdGhhYmFzY2F1LmNhPg=="
    }
}