{
    "numMessagesInTopic": 10, 
    "nextInTime": 21878, 
    "senderId": "yjv_UJRzGVTulSxaohsW-qkjSFbpllQYJs_ygjmDPxM8lWer0C8JvhLd-GMS7b4jZKqyNZowe4geJe4uwWcDDLCIuCDhOK07SfMxDs5JL7U", 
    "systemMessage": true, 
    "subject": "Re: [junit] Dependency Testing", 
    "from": "&quot;Trenton D. Adams&quot; &lt;trenta@...&gt;", 
    "authorName": "Trenton D. Adams", 
    "msgSnippet": "Hi Mike, Interesting thoughts. But, in some complex systems, it s just not feasible to have all tests run independently of each other. For example, in my case,", 
    "msgId": 21877, 
    "profile": "trenton_adams2001", 
    "topicId": 21874, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 410445564, 
    "messageBody": "<div id=\"ygrps-yiv-1624471313\">Hi Mike, <br/>\n<br/>\nInteresting thoughts. But, in some complex systems, it&#39;s just not feasible to have all tests run independently of each other. For example, in my case, the nightly job needs to do it&#39;s work, before I can do one of the tests. Furthermore, to verify that the whole process actually works, from start to finish, would be impossible with independent tests. i.e. I would not really be testing the nightly job. <br/>\n<br/>\nBut yes, I think setting up a test, that is not dependant on any other test, is possible, but I would have to hard code a bunch of stuff in the tests, and I would have to put all of the tests in a single test, in order for them to succeed. And doing that would prevent a bit of my actual code from being tested. <br/>\n<br/>\nOne other question is, can I trust the order of execution of the test methods in a single TestCase implemention? Or are all of them also supposed to be independent? <br/>\n<br/>\nThe reason I ask is because this is what is basically happening: There is an external ASYNCHRONOUS SOAP messaging system that is the core to all communication between several companies. Requests/responses can be sent to and from all of the participating parties. For testing purposes, so that my tests can be a little more controlled, I send requests and responses to and from my own server. i.e. I do not send to other companies, because I cannot guarantee they will respond within the time I need (seconds), even though technically, their test systems are supposed to be up and running. <br/>\n<br/>\nAlso note that this is a cronjob, likely run once every night. <br/>\n<br/>\n1. submit request to my system, through the external system. This is effectively to test receiving requests from the external system, to me. i.e. I can send requests to myself, as if they were coming from someone else&#39;s system. <br/>\n2. receive request from external system <br/>\n3. queue job for nightly build of data <br/>\n4. check for available data from nightly job, the next day <br/>\n5. send available data <br/>\n6. receive the data sent in #5, and email it out to a staff member <br/>\n<br/>\nSo, what we have here, is a complex messaging system that is not internally controlled. I agree that the majority of testing, with most projects, does not involve complex scenarios like this, with so many dependencies on other systems. And, generally, you could write independent tests. But, with something like this, where your tests are actually tests to make sure that your communication with the messaging system works, it is extremely difficult to make tests independent of each other. <br/>\n<br/>\nThe way I see it, there is only two ways to make testing this scenario work. <br/>\n1. put all of the tests in a single test, and have delays or polling to wait for the messages to come through, and declare them all successful if it succeeds, or all failed if they fail. <br/>\n2. have tests depend on the completion of each other, and have delays or polling to wait for the messages to come through. <br/>\n<br/>\nAny other insight, that would make this easier to test, would be HIGHLY appreciated. I am pretty new to JUnit, and don&#39;t have a whole lot of experience with automated testing in general. <br/>\n<br/>\nTrenton D. Adams <br/>\nSystems Analyst/Web Software Engineer <br/>\nNavy Penguins at your service! <br/>\nAthabasca University <br/>\n(780) 675-6195 <br/>\n:wq! <br/>\n<br/>\n----- &quot;Mike Forsberg&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bigmike@...\">bigmike@...</a>&gt; wrote: <br/>\n<blockquote><span title=\"ireply\"> &gt; From: &quot;Mike Forsberg&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bigmike@...\">bigmike@...</a>&gt; <br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> <br/>\n&gt; Sent: Sunday, August 16, 2009 9:46:31 PM GMT -07:00 US/Canada Mountain <br/>\n&gt; Subject: Re: [junit] Dependency Testing <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I&#39;ve always felt that each test should exist as standalone thing. <br/>\n<blockquote><span title=\"ireply\"> &gt; They can have a setup and teardown method. Maybe a set of tests in a <br/>\n&gt; suite share some set up and tear down stuff. <br/>\n&gt; <br/>\n&gt; What it looks like here is your tests are dependent on a nightly job <br/>\n&gt; to run and worst their order. It has always been my understanding <br/>\n&gt; that each test is order independent. I remember early on stuff saying <br/>\n&gt; that one was not guaranteed what order the tests would run in. <br/>\n&gt; Granted I think this randomization was never done, but it was made to <br/>\n&gt; show a concept. The concept being, a person should be able to run a <br/>\n&gt; given failed test over and over (with some of source under test having <br/>\n&gt; modifications) until it passes. There should not be a whole series of <br/>\n&gt; steps that have to run in order to get a single test to pass. <br/>\n&gt; <br/>\n&gt; I can speak from experience, requiring a procedure of tests to run <br/>\n&gt; inorder to get the desired results leads to tests that are turned off <br/>\n&gt; or forgotten about. <br/>\n&gt; <br/>\n&gt; I have some questions... <br/>\n&gt; <br/>\n&gt; Are you testing the nightly job? <br/>\n&gt; Could the initialization for Test2.myTest() actually be setup in a <br/>\n&gt; setup method? --Then no need to rely on the nightly job. <br/>\n&gt; <br/>\n&gt; something you should consider... <br/>\n&gt; - &quot;Ideally, each test case is independent from the others&quot; -- <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Unit_Test\">http://en.wikipedia.org/wiki/Unit_Test</a> <br/>\n&gt; -- Along these lines, the results of one test should not dictate the <br/>\n&gt; results of another. <br/>\n&gt; <br/>\n&gt; Hope I added some insight, <br/>\n&gt; <br/>\n&gt; Big Mike <br/>\n&gt; <br/>\n&gt; On Fri, Aug 14, 2009 at 11:21 PM, trenton_adams2001&lt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:trenta@...\">trenta@...</a> &gt; wrote: <br/>\n&gt; &gt; Hi Guys, <br/>\n&gt; &gt; <br/>\n&gt; &gt; I&#39;m just wondering. Have the JUnit developers considered adding dependency annotations to JUnit? You could annotate your code with say <br/>\n&gt; &gt; <br/>\n&gt; &gt; &quot;@TestDependency Test1 public void myTest() {code;}&quot;, which would cause myTest() to depend on Test1 running it&#39;s tests first. <br/>\n&gt; &gt; <br/>\n&gt; &gt; A scenario where this might be needed... <br/>\n&gt; &gt; 1. Test1 inserts DB records <br/>\n&gt; &gt; 2. Nightly job runs (but can be run manually by user) <br/>\n&gt; &gt; 3. Test2.myTest() then runs, as #2 has completed, and myTest() now has data that can be used. <br/>\n&gt; &gt; <br/>\n&gt; &gt; In the case of #2, it would need to give the user enough time to run the nightly job, manually. <br/>\n&gt; &gt; <br/>\n&gt; &gt; I&#39;m wanting to test everything in a totally automated way. But at this point, it is not entirely possible. <br/>\n&gt; &gt; <br/>\n&gt; &gt; I just wanted to ask about this, as you guys probably have a lot more experience in why this is or is not a good idea. <br/>\n&gt; &gt; <br/>\n&gt; &gt; Thanks. <br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; ------------------------------------ <br/>\n&gt; &gt; <br/>\n&gt; &gt; Yahoo! Groups Links <br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n </span></blockquote>__ <br/>\n    This communication is intended for the use of the recipient to whom it<br/>\n    is addressed, and may contain confidential, personal, and or privileged<br/>\n    information. Please contact us immediately if you are not the intended<br/>\n    recipient of this communication, and do not copy, distribute, or take<br/>\n    action relying on it. Any communications received in error, or<br/>\n    subsequent reply, should be deleted or destroyed.<br/>\n---<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 21876, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1250492037", 
    "canDelete": false, 
    "nextInTopic": 21878, 
    "prevInTopic": 21876, 
    "headers": {
        "inReplyToHeader": "PDEwNTI0NzE3MDIuMjIzOTY2MTEyNTA0OTE5NjY3MzEuSmF2YU1haWwucm9vdEBhbXVuZHNlbi5jcy5hdGhhYmFzY2F1LmNhPg==", 
        "messageIdInHeader": "PDE2NTYwMTI2NDcuMjIzOTY2MzEyNTA0OTIwMzcxNjkuSmF2YU1haWwucm9vdEBhbXVuZHNlbi5jcy5hdGhhYmFzY2F1LmNhPg=="
    }
}