{
    "numMessagesInTopic": 10, 
    "nextInTime": 21884, 
    "senderId": "x6moe4mGPKAh70EOvKWfE4uEfGK1-t7kZwhTJXz8kbhuY03NOV03IRDH-TACH7TiEaGzkCxG6pOWZqEdUW3sT3PsN6vS", 
    "systemMessage": true, 
    "subject": "Re: [junit] Dependency Testing", 
    "from": "Mike Forsberg &lt;bigmike@...&gt;", 
    "authorName": "Mike Forsberg", 
    "msgSnippet": "Trenton, I think you ll find that if you populate the data yourself you will test more then just nightly.  This would drastically improve your turn around", 
    "msgId": 21883, 
    "profile": "bigmike_f", 
    "topicId": 21874, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 89428055, 
    "messageBody": "<div id=\"ygrps-yiv-90615700\">Trenton,<br/>\n<br/>\nI think you&#39;ll find that if you populate the data yourself you will<br/>\ntest more then just nightly.  This would drastically improve your turn<br/>\naround time.<br/>\n<br/>\nI think this is something good.<br/>\n<br/>\nAs for using mocks,  I was of the opinion that they double the work<br/>\ntoo.  Then I realized, the mock engine does most of the work for you,<br/>\nif you are using interfaces that is.  Basically you just insert the<br/>\nresponse from the mock object and you can forget how the mock would<br/>\nimplement anything.  Saves me a lot of time once my co-workers and I<br/>\nagree upon the interfaces.  Which is where the work SHOULD be.<br/>\n<br/>\nYes, you are going to fake the rest of the application.  However, If<br/>\nyou are intending to test a separate application from your code, maybe<br/>\nyou should just test that application alone.  For me, I like to test<br/>\nthings as simply as possible.  You could also supply a mock of your<br/>\ncode to allow them to test using your code.<br/>\n<br/>\nI see your point of needing acceptance and/or integration tests.  They<br/>\nshould be there too.  But, maybe as a separate suite that executes<br/>\nless often.  (Like if you make a release (used loosely of course).)<br/>\n<br/>\nJust my 0.02$,<br/>\n<br/>\nBig Mike<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Aug 17, 2009 at 11:36 AM, Trenton D. Adams&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:trenta@...\">trenta@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi Lothar,<br/>\n&gt;<br/>\n&gt; First off, I wanted to mention, a lot of my tests can be automated, albeit with delays or polling. But, I suppose what I could do, is create some code that does a DB insert/update, that simulates what the nightly job does, without actually doing all the work. In other words, take some data that I&#39;m expecting, and put it in the DB, rather than actually &quot;generate&quot; the data. That way, I don&#39;t need the nightly job to be part of the testing cycle.<br/>\n&gt;<br/>\n&gt; Then, all the tests could run independently, and not rely on each other, but I could also run them in order manually, to verify that the system actually works as a whole. Then, I could actually have an &quot;OrderedTest&quot; that instantiates all my TestCase classes, and calls them in order. That in itself would then be it&#39;s own separate test.<br/>\n&gt;<br/>\n&gt; Does that sound like a good idea?<br/>\n&gt;<br/>\n&gt; Anyhow, I respond to your comments below.<br/>\n&gt;<br/>\n&gt; ----- &quot;Lothar Kimmeringer&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:maillists_job@...\">maillists_job@...</a>&gt; wrote:<br/>\n&gt;&gt; From: &quot;Lothar Kimmeringer&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:maillists_job@...\">maillists_job@...</a>&gt;<br/>\n&gt;&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\n&gt;&gt; Sent: Monday, August 17, 2009 1:27:27 AM GMT -07:00 US/Canada Mountain<br/>\n&gt;&gt; Subject: Re: [junit] Dependency Testing<br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; &gt; The reason I ask is because this is what is basically happening: There<br/>\n&gt;&gt; &gt; is an external ASYNCHRONOUS SOAP messaging system that is the core to<br/>\n&gt;&gt; &gt; all communication between several companies. Requests/responses can be<br/>\n&gt;&gt; &gt; sent to and from all of the participating parties. For testing purposes,<br/>\n&gt;&gt; &gt; so that my tests can be a little more controlled, I send requests and<br/>\n&gt;&gt; &gt; responses to and from my own server. i.e. I do not send to other<br/>\n&gt;&gt; &gt; companies, because I cannot guarantee they will respond within the time<br/>\n&gt;&gt; &gt; I need (seconds), even though technically, their test systems are<br/>\n&gt;&gt; &gt; supposed to be up and running.<br/>\n&gt;&gt;<br/>\n&gt;&gt; If you abstracted the layer between your applicaiton and the messaging<br/>\n&gt;&gt; system you can simply define a mock that answers the requests for you.<br/>\n&gt;&gt; That way you don&#39;t need to setup anything in advance. I&#39;m doing this<br/>\n&gt;&gt; here e.g. for testing the parts of our software doing OFTP by ISDN.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yes, that would be possible, but also a whole heck of a lot of extra work. It would probably double the code, perhaps even more. I was trying to keep my part of the application simple. :D<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Also, by doing this, I am still circumventing the testing that actually tests to see if the system actually works. And, I don&#39;t want to do that, as I want to be sure the system actually works, and not just my code. I could do these little abstractions (with a factory, that has test and production configurations), and that would test my code, but it would not test that my code works with the other system, as I would end up having a &quot;fake&quot; layer, pretending to be their system, but never actually verifying.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; &gt; 1. submit request to my system, through the external system. This is<br/>\n&gt;&gt; &gt; effectively to test receiving requests from the external system, to me.<br/>\n&gt;&gt; &gt; i.e. I can send requests to myself, as if they were coming from someone<br/>\n&gt;&gt; &gt; else&#39;s system.<br/>\n&gt;&gt; &gt; 2. receive request from external system<br/>\n&gt;&gt; &gt; 3. queue job for nightly build of data<br/>\n&gt;&gt; &gt; 4. check for available data from nightly job, the next day<br/>\n&gt;&gt; &gt; 5. send available data<br/>\n&gt;&gt; &gt; 6. receive the data sent in #5, and email it out to a staff member<br/>\n&gt;&gt;<br/>\n&gt;&gt; For this I see Ant or Maven a better fitting tool than JUnit. There<br/>\n&gt;&gt; you have dependencies and all the things you need for data-transfer,<br/>\n&gt;&gt; emailing, etc.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I am using Maven, but maven isn&#39;t a testing tool. However, it does support JUnit.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; So write an Ant script that is preparing everything as needed and<br/>\n&gt;&gt; start e.g. the JUnit-tests that do the testing. With the optional<br/>\n&gt;&gt; tasks junit and junitreport you even end up with a nice HTML-page<br/>\n&gt;&gt; similar to a Java-API documentation showing you what tests failed<br/>\n&gt;&gt; and what succeeded. Combined e.g. with Cobertura you can see what<br/>\n&gt;&gt; parts of your application aren&#39;t under test.<br/>\n&gt;&gt;<br/>\n&gt;&gt; Regards, Lothar<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt; __<br/>\n&gt;    This communication is intended for the use of the recipient to whom it<br/>\n&gt;    is addressed, and may contain confidential, personal, and or privileged<br/>\n&gt;    information. Please contact us immediately if you are not the intended<br/>\n&gt;    recipient of this communication, and do not copy, distribute, or take<br/>\n&gt;    action relying on it. Any communications received in error, or<br/>\n&gt;    subsequent reply, should be deleted or destroyed.<br/>\n&gt; ---<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 21882, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1250533913", 
    "canDelete": false, 
    "nextInTopic": 21913, 
    "prevInTopic": 21882, 
    "headers": {
        "inReplyToHeader": "PDg3Nzc0OTM5MS4yMjQ1MzM2MTI1MDUyNjk5NDA1NC5KYXZhTWFpbC5yb290QGFtdW5kc2VuLmNzLmF0aGFiYXNjYXUuY2E+", 
        "messageIdInHeader": "PGE1MjdmZGRmMDkwODE3MTEzMXcyNjQ3MjhiMHBmOTk5OTc4YzFmM2M2NTg2QG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PDIzNzk0MDExNC4yMjQ1MzM0MTI1MDUyNjk5Mjc2MS5KYXZhTWFpbC5yb290QGFtdW5kc2VuLmNzLmF0aGFiYXNjYXUuY2E+CSA8ODc3NzQ5MzkxLjIyNDUzMzYxMjUwNTI2OTk0MDU0LkphdmFNYWlsLnJvb3RAYW11bmRzZW4uY3MuYXRoYWJhc2NhdS5jYT4="
    }
}