{
    "numMessagesInTopic": 10, 
    "nextInTime": 21914, 
    "senderId": "lht9Wi2MYQIwZO_oSurTyPCeuD4PKjD3MIF55IGkpXm5MdErYUPlHJb28Ubx4jUitMzsKp1zwAtEl2ex_52W2DIuKiQ", 
    "systemMessage": false, 
    "subject": "RE: [junit] Dependency Testing", 
    "from": "&quot;kentb&quot; &lt;kentb@...&gt;", 
    "authorName": "kentb", 
    "msgSnippet": "Lothar, My analysis of the situation is that the time invested in expressing dependencies between tests would be more valuable invested in improving the design", 
    "msgId": 21913, 
    "profile": "kentlbeck", 
    "topicId": 21874, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 173198504, 
    "messageBody": "<div id=\"ygrps-yiv-763441174\">Lothar,<br/>\n <br/>\nMy analysis of the situation is that the time invested in expressing<br/>\ndependencies between tests would be more valuable invested in improving the<br/>\ndesign so those dependencies no longer matter. JUnit (at least the core)<br/>\nwon&#39;t include support for dependencies in the foreseeable future.<br/>\n <br/>\nRegards,<br/>\n <br/>\nKent<br/>\n<br/>\n  _____  <br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>] On Behalf Of<br/>\nLothar Kimmeringer<br/>\nSent: Tuesday, August 18, 2009 12:33 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSubject: Re: [junit] Dependency Testing<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\nTrenton D. Adams schrieb:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In other words, take some<br/>\n&gt; data that I&#39;m expecting, and put it in the DB, rather than actually<br/>\n&gt; &quot;generate&quot; the data. That way, I don&#39;t need the nightly job to be part<br/>\n&gt; of the testing cycle.<br/>\n<br/>\n </span></blockquote>When doing tests with parts of my software that need an underlying<br/>\ndatabase, I&#39;m always using HSQLDB that gets connected instead of<br/>\nthe real database being in use. That way you can fill in exactly<br/>\nwhat you want without the problem that e.g. a parallel running test<br/>\nis interfering.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Then, all the tests could run independently, and not rely on each other,<br/>\n&gt; but I could also run them in order manually, to verify that the system<br/>\n&gt; actually works as a whole.<br/>\n<br/>\n </span></blockquote>These are different types of tests and should exist in parallel.<br/>\nThe first gives you immediate feedback if you change something at<br/>\none specific part. The latter gives you feedback if the current<br/>\nchange has broken something somewhere else. Both are necessray.<br/>\nThe difference is that the single test should run very fast, allowing<br/>\nyou the check your changes over and over again to realize as soon<br/>\nas possible in the process that you broke something. The whole<br/>\ntest run can take longer.<br/>\n<br/>\nMy single tests always take only up to a couple of seconds (with<br/>\nfew exceptions) while the complete test including coverage-calculation<br/>\ntakes about one hour (without coverage 20 minutes).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Then, I could actually have an &quot;OrderedTest&quot;<br/>\n&gt; that instantiates all my TestCase classes, and calls them in order. That<br/>\n&gt; in itself would then be it&#39;s own separate test.<br/>\n<br/>\n </span></blockquote>Personally I don&#39;t like these kind of test-classes because I always<br/>\nforget to add a newly created one (but that be different from you,<br/>\nso this might be a practicable way).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Does that sound like a good idea?<br/>\n<br/>\n </span></blockquote>It&#39;s nothing I&#39;d do, but I don&#39;t have a system that is that much<br/>\n&quot;integrated&quot; that I need to do these kind of tests. So don&#39;t ask<br/>\nme about that. If it works for you, it&#39;s fine.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; If you abstracted the layer between your applicaiton and the messaging<br/>\n&gt;&gt; system you can simply define a mock that answers the requests for you.<br/>\n&gt;&gt; That way you don&#39;t need to setup anything in advance. I&#39;m doing this<br/>\n&gt;&gt; here e.g. for testing the parts of our software doing OFTP by ISDN.<br/>\n&gt; <br/>\n&gt; Yes, that would be possible, but also a whole heck of a lot of extra<br/>\n&gt; work. It would probably double the code, perhaps even more. I was trying<br/>\n&gt; to keep my part of the application simple. :D<br/>\n<br/>\n </span></blockquote>Doesn&#39;t sound good, maybe you overestimate things a bit. I can<br/>\nrecommend reading the book &quot;Working effectively with legacy code&quot;<br/>\nby Michael C. Feathers. There are a couple of hints how to get<br/>\nthat kind of code you&#39;re talking about under test.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, by doing this, I am still circumventing the testing that actually<br/>\n&gt; tests to see if the system actually works. And, I don&#39;t want to do that,<br/>\n&gt; as I want to be sure the system actually works, and not just my code.<br/>\n<br/>\n </span></blockquote>If you make sure that your code works (and keeps working after<br/>\ndoing changes) you can track down problems occuring in the whole<br/>\nsystem much easier than without.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I<br/>\n&gt; could do these little abstractions (with a factory, that has test and<br/>\n&gt; production configurations), and that would test my code, but it would<br/>\n&gt; not test that my code works with the other system, as I would end up<br/>\n&gt; having a &quot;fake&quot; layer, pretending to be their system, but never actually<br/>\n&gt; verifying.<br/>\n<br/>\n </span></blockquote>I had good results by using anonymous inner classes:<br/>\n<br/>\npublic void testSomething(){<br/>\nfinal int[] channels = new int[]{2};<br/>\nMyISDNHardware driver = new MyISDNHardware(){<br/>\npublic int getNumberOfBChannels(){<br/>\nreturn channels[0];<br/>\n}<br/>\n}<br/>\n// perform the tests that check if the behavior in dependence<br/>\n// of the number of B-channels is correct<br/>\n}<br/>\n<br/>\nThat&#39;s one of the reasons I don&#39;t like singletons. It effectively<br/>\nprevents you from doing things like these.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; For this I see Ant or Maven a better fitting tool than JUnit. There<br/>\n&gt;&gt; you have dependencies and all the things you need for data-transfer,<br/>\n&gt;&gt; emailing, etc.<br/>\n&gt; <br/>\n&gt; I am using Maven, but maven isn&#39;t a testing tool. However, it does<br/>\n&gt; support JUnit.<br/>\n<br/>\n </span></blockquote>Of course it&#39;s not but you can use it to set up things and call<br/>\nthe Junit-tests in dependence of that.<br/>\n<br/>\nRegards, Lothar<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 21912, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1251303234", 
    "canDelete": false, 
    "nextInTopic": 21918, 
    "prevInTopic": 21883, 
    "headers": {
        "inReplyToHeader": "PDRBOEE1OTNCLjcwMDA0MDhAa2ltbWVyaW5nZXIuZGU+", 
        "messageIdInHeader": "PDM5OTg3OUI0MEI2RjQ0REJBMThBQzU1ODEwMEE5QTQ3QGtlbnRzcGF2aWxpb24+", 
        "referencesHeader": "PDg3Nzc0OTM5MS4yMjQ1MzM2MTI1MDUyNjk5NDA1NC5KYXZhTWFpbC5yb290QGFtdW5kc2VuLmNzLmF0aGFiYXNjYXUuY2E+IDw0QThBNTkzQi43MDAwNDA4QGtpbW1lcmluZ2VyLmRlPg=="
    }
}