{
    "numMessagesInTopic": 4, 
    "nextInTime": 21911, 
    "senderId": "CS4aQz_sz-nPtB2azTbN6eAyNN3hQCdQ7C1BXhvt1Xxv33Shrg3UEyWcpdG2t6yRsM3uARIMHjpUwY4CPwbJ7MIke2BfgeTuvfNudn-ADg", 
    "systemMessage": false, 
    "subject": "RE: [junit] What should I be testing?", 
    "from": "&quot;Pigneri, Rocco&quot; &lt;rpigneri@...&gt;", 
    "authorName": "Pigneri, Rocco", 
    "msgSnippet": "Dear John, Well, you hit the nail pretty much right on the head: you *do* have a really simple algorithm, but it *does* provide a great way for you to learn", 
    "msgId": 21910, 
    "topicId": 21907, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 383279107, 
    "messageBody": "<div id=\"ygrps-yiv-615534793\">Dear John,<br/>\n<br/>\nWell, you hit the nail pretty much right on the head: you *do* have a really simple algorithm, but it *does* provide a great way for you to learn about automated testing.  All of the trade-offs and design issues that you cite are the right ones to be thinking about; however, they look a bit silly given the small size of the project.  You have correctly identified that you cannot just continue to write code as you would in a non-tested development methodology, and you have also identified some reasonable programmatic interfaces necessary to use an automated testing tool (in this case, you feel a bit silly about it, but it is one of the trade-offs if you want to use automated testing).  You have begun to separate large pieces of code (i.e. your original one function) into smaller, more refined pieces (the file finder, the random number generator, the renamer) that are not only useful for testing  but *also* useful for expanding your design later (this is probably one of the best reasons to use automated testing, in my opinion).  And, finally, you have also run into one of the most difficult parts of automated testing: testing static, persistent resources (in this case, the file system) that are the only testable interface to certain methods.<br/>\n<br/>\nSo, all in all, you have a pretty good start, and you have a pretty good program for learning to test in an automated fashion.  Continuing in the direction that you are going will help you learn the ins and outs of automated testing in a reasonably real world situation J.<br/>\n<br/>\nBest of luck,<br/>\n<br/>\nRocco<br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>] On Behalf Of rejohnsoca<br/>\nSent: Tuesday, August 25, 2009 4:32 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSubject: [junit] What should I be testing?<br/>\n<br/>\n<br/>\n<br/>\nI&#39;ve been playing a bit with Test Driven Development, and have read the book, but now I want to try it out, and am really not sure what to do next...<br/>\n<br/>\nMy wife loves to show photo slide shows on our living room windows-XP computer (have patience, it will come together), but she doesn&#39;t like that the pictures show up in order. I want to write a small utility to rename the pictures in a controllable way, but prefixing something like<br/>\n&quot;RND&quot;, a set of random digits, and the original name. For example, if the original was DCIM1001.jpg, I want the class to rename the file to &quot;RND4356332_DCIM1001.jpg&quot;. Windows can then show the photos in a &#39;random&#39; order, but I can still figure out the real photo name, in case someone wants a copy. Sounds simple.<br/>\n<br/>\nI want to build this, using TDD.<br/>\nI figure that I need to build tests, and get green bars in eclipse in the following order:<br/>\n-instantiate my photoRandomizer class<br/>\n-pass it several different paths, and have them be validated (null, empty, non-existing, very long, very short, etc...).<br/>\n<br/>\nthat was easy.<br/>\nbut my next question, is now what?<br/>\nIf I was writing this without TDD, my next step, would have been to iterate through the directory, and rename all of the files according to my scheme. I can&#39;t see an operational advantage to exposing any of this to outside, or make it more than one method, for testing purposes.<br/>\n<br/>\nmaybe what I should do, is have a method that iterates through the appropriate directory, generates a random number, and then passes both pieces of information to another method which renames the target file. This doesn&#39;t seem like a very good way to do it, but then I would at least be able to test the renaming.<br/>\n<br/>\nWhat am I missing?<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 21909, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1251296678", 
    "canDelete": false, 
    "nextInTopic": 21911, 
    "prevInTopic": 21907, 
    "headers": {
        "inReplyToHeader": "PGg3MWhuaytpYzk3QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDgxRkI0OTFFRUY1RUEzNEY5N0ZGNzA2QUMxQUIzNTYzMDVCNjlDRTczRkBib3N0b24tbWFpbC5sYXZhc3Rvcm0ubG9jYWwuY29tPg==", 
        "referencesHeader": "PGg3MWhuaytpYzk3QGVHcm91cHMuY29tPg=="
    }
}