{
    "numMessagesInTopic": 3, 
    "nextInTime": 21965, 
    "senderId": "t2J1Ejbt-0gCuo29sp9Shog9lQ9b3LORZGEpTqqSZS94tAS_GCtQelL7OzGdO4RJjdtiWYbGhKaPOX4EdY-80yiVenycBP-kLg", 
    "systemMessage": true, 
    "subject": "Specifying the order of tests and test classes?", 
    "from": "&quot;kokaku71&quot; &lt;andy.kriger@...&gt;", 
    "authorName": "kokaku71", 
    "msgSnippet": "Hello, I m looking for some advice on the best way to setup this test scenario... * Tests are run from Ant using a fileset with wildcards (so that we don t", 
    "msgId": 21964, 
    "profile": "kokaku71", 
    "topicId": 21964, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 237153158, 
    "messageBody": "<div id=\"ygrps-yiv-47759911\">Hello,<br/>\n<br/>\nI&#39;m looking for some advice on the best way to setup this test scenario...<br/>\n<br/>\n* Tests are run from Ant using a fileset with wildcards (so that we don&#39;t have to manually maintain a list of tests)<br/>\n<br/>\n* These tests are for a web application where there is a login screen<br/>\n<br/>\n* We want to test the login screen with LoginTest.class, but the tests in that class only need to run once. Once the test has logged in successfully, the other application tests will already be logged in.<br/>\n<br/>\nSo, what is the best way to force LoginTest to run before all other tests and to force the order of LoginTest tests (because we want to test all the failure scenarios before finally testing the success scenario)? <br/>\n<br/>\nIs it possible to maintain the low-maintainance flexibility of the Ant fileset while specifying order? Is it possible to create a TestSuite dynamically that would allow us to specify order?</div>", 
    "prevInTime": 21963, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1255443496", 
    "canDelete": false, 
    "nextInTopic": 21971, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGhiMjI3OCtvN2JpQGVHcm91cHMuY29tPg=="
    }
}