{
    "numMessagesInTopic": 2, 
    "nextInTime": 21968, 
    "senderId": "FCd9x5Jvxyf0XqrL3Sec2emetPpQ7abyUvLlsT4-7NzbJLCMOEHZ43457dGSh9750-ArUrVXSVGjCqjHhOvagvMSGSPl", 
    "systemMessage": true, 
    "subject": "ScalaTest 1.0 for JUnit", 
    "from": "Bill Venners &lt;bill@...&gt;", 
    "authorName": "Bill Venners", 
    "msgSnippet": "Hi, I wanted to let JUnit folks know that we released ScalaTest 1.0 this morning, which has deep integration with JUnit. ScalaTest is for all practical", 
    "msgId": 21967, 
    "profile": "billvenners", 
    "topicId": 21967, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 416990097, 
    "messageBody": "<div id=\"ygrps-yiv-656727183\">Hi,<br/>\n<br/>\nI wanted to let JUnit folks know that we released ScalaTest 1.0 this<br/>\nmorning, which has deep integration with JUnit. ScalaTest is for all<br/>\npractical purposes a &quot;JUnit add-on&quot; that facilitates using JUnit and<br/>\nScala together. The promise is that by writing tests in Scala, you can<br/>\nreduce the lines of test code you need to maintain by half or more,<br/>\nand at the same time increase the clarity of that code. That&#39;s the<br/>\nbenefit. The up front cost is you need to learn Scala. But ScalaTest<br/>\ndoes let you mix in tests written in Scala with your existing tests<br/>\nwritten in Java, so it is easy to dip your toe in before jumping in. I<br/>\nalso think writing tests in Scala is a good way to start learning and<br/>\ngetting experience with Scala, because it is important code, but not<br/>\nyour production code. So it reduces the risk of trying a new language.<br/>\nAnd you can certainly write tests in Scala to test production code<br/>\nwritten in Java.<br/>\n<br/>\nYou can get a good overview of ScalaTest&#39;s JUnit integration on this page:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.scalatest.org/getting_started_with_junit\">http://www.scalatest.org/getting_started_with_junit</a><br/>\n<br/>\nYou can see we have good integration with both JUnit 3 and 4 (because<br/>\nI know many people are still using JUnit 3). One other thing to keep<br/>\nin mind is that because of the org.junit.runner.Runner class, which we<br/>\nextend in our org.scalatest.junit.JUnitRunner class, you can pretty<br/>\nmuch write tests in any style you want and run them with JUnit. For<br/>\nexample, you could write in a Behavior-Driven Development (BDD) style<br/>\nand still run the tests with JUnit. So ScalaTest adds BDD to JUnit in<br/>\neffect, and other styles as well. By annotating with JUnitRunner, you<br/>\ncan use JUnit to run tests written with any of the &quot;Suite&quot; or &quot;Spec&quot;<br/>\ntraits you see here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.scalatest.org/quick_start\">http://www.scalatest.org/quick_start</a><br/>\n<br/>\nHere&#39;s a list of the ScalaTest/JUnit integration points:<br/>\n<br/>\n- AssertionsForJUnit, ShouldMatchersForJUnit, and<br/>\nMustMatchersForJUnit, which provide concise, readable assertion and<br/>\nmatcher DSLs, ensure that assertion failures are reported as<br/>\n&quot;failures&quot; not &quot;errors&quot; by JUnit and its ecosystem<br/>\n- JUnit3Suite extends junit.framework.TestCase as well as<br/>\norg.scalatest.Suite, which allows you to write traditional TestCase<br/>\ntests that can be run by either JUnit 3 or ScalaTest<br/>\n- JUnitSuite extends org.scalatest.Suite, and allows you to write<br/>\ntraditional JUnit 4-style tests (with @Test annotation, etc.) that can<br/>\nbe run by either JUnit 4 or ScalaTest<br/>\n- JUnitWrapperSuite allows you to run existing JUnit tests written in<br/>\nJava (or Groovy, etc.) with ScalaTest&#39;s Runner<br/>\n- JUnitRunner allows you to run any ScalaTest Suite written in any<br/>\nstyle (such as BDD) with JUnit<br/>\n- ScalaTest&#39;s Runner has a -j option that allows you to specify JUnit<br/>\ntests written in Java (or Groovy, etc.) and have them run alongside<br/>\nScalaTest tests (i.e., so you get one uniform report)<br/>\n- ScalaTest&#39;s Ant task can generate the XML format produced by the<br/>\nJUnit ant task, which can then be used by JUnitReport ant task,<br/>\nHudson, etc., to produce reports.<br/>\n<br/>\nLet me know if anyone has any questions. I&#39;ll keep an eye on this<br/>\nlist, but you might get a quicker response if you cross-post<br/>\nJUnit-related ScalaTest questions to the scalatest-users mailing list<br/>\nas well.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.google.com/group/scalatest-users\">http://groups.google.com/group/scalatest-users</a><br/>\n<br/>\nThanks.<br/>\n<br/>\nBill<br/>\n----<br/>\nBill Venners<br/>\nArtima, Inc.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.artima.com\">http://www.artima.com</a></div>", 
    "prevInTime": 21966, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1255376489", 
    "canDelete": false, 
    "nextInTopic": 22010, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDNiOGQwZGU2MDkxMDEyMTI0MWliODg3N2ZhcmZiNTMyZTljODc3MmJmYTBAbWFpbC5nbWFpbC5jb20+"
    }
}