{
    "topicId": 2136, 
    "postDate": "996260088", 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "from": "&quot;Mathieu Gervais&quot; &lt;egoine_@...&gt;", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "Tl5-tPg63lqiIf1nJtjrZ4cTCkPO3mIJc2kQ1EOVYR-40yQYnT6u0fdobJF79L9VXmr0V3XeOEI8sjFyLCCi366ZCVDokCXq1kPqJE2c", 
    "nextInTime": 2197, 
    "userId": 0, 
    "prevInTime": 2195, 
    "prevInTopic": 2147, 
    "headers": {
        "messageIdInHeader": "PE9FNDlRaEV4a2l5UG9IWmd6RGcwMDAwMzdkM0Bob3RtYWlsLmNvbT4=", 
        "referencesHeader": "PEM2RDFCRDQzMDRCMDdGNEU5NjQyMjNCQUU1RDQ1RTJCMDZFQzI3QGhlcm1lcy5ianNzLmNvLnVrPg=="
    }, 
    "authorName": "Mathieu Gervais", 
    "numMessagesInTopic": 11, 
    "msgSnippet": "... I think you are right, altought I m not expert in locking models . Another important point is that you can have code that insist on commiting, for example", 
    "contentTrasformed": false, 
    "msgId": 2196, 
    "nextInTopic": 2197, 
    "systemMessage": false, 
    "rawEmail": "Return-Path: &lt;egoine_@...&gt;\r\nX-Sender: egoine_@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-7_2_0); 30 Jul 2001 21:01:56 -0000\r\nReceived: (qmail 47469 invoked from network); 30 Jul 2001 20:33:57 -0000\r\nReceived: from unknown (10.1.10.27) by l8.egroups.com with QMQP; 30 Jul 2001 20:33:57 -0000\r\nReceived: from unknown (HELO hotmail.com) (216.33.236.85) by mta2 with SMTP; 30 Jul 2001 20:33:57 -0000\r\nReceived: from mail pickup service by hotmail.com with Microsoft SMTPSVC; Fri, 27 Jul 2001 11:55:52 -0700\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nReferences: &lt;C6D1BD4304B07F4E964223BAE5D45E2B06EC27@...&gt;\r\nSubject: Re: [junit] testing database operation\r\nDate: Fri, 27 Jul 2001 14:54:48 -0400\r\nMIME-Version: 1.0\r\nContent-Type: text/plain;\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Priority: 3\r\nX-MSMail-Priority: Normal\r\nX-Mailer: Microsoft Outlook Express 5.50.4133.2400\r\nX-MimeOLE: Produced By Microsoft MimeOLE V5.50.4133.2400\r\nMessage-ID: &lt;OE49QhExkiyPoHZgzDg000037d3@...&gt;\r\nX-OriginalArrivalTime: 27 Jul 2001 18:55:52.0822 (UTC) FILETIME=[C25F5960:01C116CD]\r\nFrom: &quot;Mathieu Gervais&quot; &lt;egoine_@...&gt;\r\n\r\n&gt;This technique, however, is dependant on your locking model.\n\nI think you are right, altought I&#39;m not expert in &quot;locking models&quot;.\n\nAnother important point is that you can have code that insist on commiting,\nfor example an entity EJB that you test in the real container environment.\nOr code that do multi-transaction, so need to commit in between.\n\nIn that case, you can not do the real neat trick of autoCommit false.\n\nI once dreamed a system where every affected row would be rolled back.\n\nI investigated many options :\n\nGlossary:\n-&quot;stable data&quot; means data you no is ok and that should be the baseline for\nthe tests, i.e. before the tests are runned, the DB contains that baseline\nstable data. Note that if your tables are all emtpy (i.e. no baseline data)\nbefore runnning the tests, everything is much simpler, you just do a\ntruncate/delete on all tables after every test and you don&#39;t need to read on\n:)\n\nOption 1 - Data refresh:  refresh data after/before every test.\n...from a copy of the baseline data somewhere.\nReally impossible due to performance. If you think not, let me know how.\n\nOption 2 - Data Re-initialize: every test case clean up it&#39;s data in\ntearDown()\nPointed out by David Roussel also.\nThat&#39;s one of the strategy we use. Works well but you got to be carefull\nwriting your cleanup code.\nImpossible to use if you are changing stable data rows: only work if just\njust add rows.\n\nOption 3 - use mock objects to fake the DB.\nDicussed in the mailing list archives.\nWhen you want to test DB code, (SQL, transactions, etc), does not really\napply since you fake the part you want to test.\nOnly applies if the actual DB is outside the &quot;unit&quot; under test, which isnot\nalways the case.\n\nOption 4 - Data Reset: reverse the changes via some generic black-magic\nafter every test.\nThe dream! Fast, efficient, generic! :)\nI&#39;ve spent some time trying to find a neat DB trick do to that one. Never\nreally got the time to find a complete solution and implement it.\n\n4a) Journalling\nUse some sort of journalling provided by the database to replay in backward\ndirection all the changes made. Is this even possible/supported?\n\n4b) DB tricks, triggers and al.\nYou need a DB that is a copy of your baseline stable data. (Might be in the\nsame DB, but with table names prefixed with &#39;STBL&#39;(stable)).\n(You could use &#39;create table like&#39; to ease making baseline table with the\nsame structure.)\n\nEvery table as a flag column name BASELINE to keep track of what happens to\nthe line. For your baseline data, set the flag to &#39;Y&#39;(es).\nDefault on insert for this column in &#39;N&#39; (New, Not part of baseline). A\ntrigger on update changes the flag to &#39;U&#39;(updated).\nA trigger on delete (only effective on a row marked &#39;Y&#39; or &#39;U&#39;)  marks the\ncorresponding row in the baseline copy with &#39;D&#39;(deleted)\n\nAfter a test:\n-drop all lines with &#39;N&#39;,\n-if a line is U, refresh it from the baseline copy. (resetting the flag to\n&#39;Y&#39;).\n-Add all the rows marked &#39;D&#39; in the baseline copy to the working copy.\n\nDaily or weekly, refresh from scratch your working copy from the baseline\ncopy. Do this also if a test case fail and it should really worked and you\nsuspects the code that revert changes to have somehow failed.\n\nBeware of autoincrement columns, they will cause re-adding a deleted row to\nbreak the system because the column(possibly a key) will change.\nAny trigger used in the system needs to be analysed to see if it would work\nwith this system (e.g. a trigger that sets a column to the current time will\nmake re-adding a delete row fail, i.e. the time will have changed. This\nmight be ok or not).\nSpecial treatment should be done for views also. (Don&#39;t run the reversing\ncode on them)\n(You might also have to drop the integrity constraints while doing this if\nyou don&#39;t want to have to do it in the right order respecting integrity\nconstraints).\n\nOption 5 - Data Roll forward:  don&#39;t do anything!\nJust start the next test without cleaning the junk of the previous one.\nMight work in some case (i.e. obvious read-only DB case) but is not really a\n&quot;solution&quot;.\n\nOption 6 - Auto commit = false ...\n...and rollback in tearDown().\nPointed out by Neil Swingler also.\nVery good solution if applicable (see top of this email for reasons why it\nwould not always apply).\nYour code should allow this, and your DB also (&quot;locking model&quot;), see email\nbelow from David Roussel.\n\n\nIf you ever implement 4b, or have any comments or solution, please let me\nknow! :)\n\nmathieu\n\n----- Original Message -----\nFrom: David Roussel\nTo: junit@yahoogroups.com\nSent: Friday, July 27, 2001 4:12 AM\nSubject: RE: [junit] testing database operation\n\n\nThat sounds like a very good idea.  That would get around the concerns I\nhave of running to DB tests too many times on a live DB for fear of\nrunning out of primary (a pretty daft fear I might add).\n\nThis technique, however, is dependant on your locking model.  If you ran\non a database that used optimistic locking (Oracle) you could find that\neverything worked ok.  But if you had committed then problems would have\noccurred.  I guess this would be pretty rare and only occur when\nmultiple updates are occurring at the same time.  That is stress testing\nand not the job of Junit.  It&#39;s worth being aware of the limitations\nthough.\n\nDave\n\n-----Original Message-----\nFrom: Neil Swingler [mailto:nswingler@...]\nSent: 27 July 2001 09:01\nTo: junit@yahoogroups.com\nSubject: RE: [junit] testing database operation\n\n\nThe easiest way to clean up the database is to ensure nothing ever gets\ncommited. I aquire my connection in setUp (no autoCommit) and rollback\nin\ntearDown().\n\n&gt; -----Original Message-----\n&gt; From: Simon Evans [mailto:sevans@...]\n&gt; Sent: 26 July 2001 19:29\n&gt; To: junit@yahoogroups.com\n&gt; Subject: [junit] testing database operation\n&gt;\n&gt;\n&gt; i am trying to test objects that use the database. in order to leave\nthe\n&gt; database in the same state after the test, one test method has to do a\n&gt; store, load and delete. is this normal? or is there a way to test each\n&gt; method (store, load, delete) separately, maybe using the setUp() and\n&gt; tearDown() methods? is there a standard pattern for this?\n&gt;\n&gt; also the assert methods do not throw anything...do they throw a\n&gt; RuntimeException or somethnig when they fail? because if i want to do\nsome\n&gt; clean up in a certain test method using a try-catch-finally\n&gt; block, do i have\n&gt; to catch a specific runtime exception? or should all cleanup for\n&gt; all methods\n&gt; be done in the tearDown() method?\n&gt;\n\n\n\nTo unsubscribe from this group, send an email to:\njunit-unsubscribe@yahoogroups.com\n\n\nYour use of Yahoo! Groups is subject to\nhttp://docs.yahoo.com/info/terms/\n\n\n\nYahoo! Groups Sponsor\nADVERTISEMENT\n\n\n\n\nTo unsubscribe from this group, send an email to:\njunit-unsubscribe@yahoogroups.com\n\n\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service.\n\n", 
    "subject": "Re: [junit] testing database operation"
}