{
    "numMessagesInTopic": 1, 
    "nextInTime": 21974, 
    "senderId": "8uSteB42P2joeuOE_lBBUnqgTpHCBJ4E-YFvzdfLnIXJe4ZR4BZs3KtnqSS5LXIMF3Ba544H9X3aLCfC86B1VhEa", 
    "systemMessage": false, 
    "subject": "Feature prioritization in JUnit", 
    "from": "David Saff &lt;david@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "All, For the last six weeks, I ve been on paternity leave, which brought forward progress on JUnit to an even slower crawl than usual.  In starting back up, we", 
    "msgId": 21973, 
    "profile": "dsaff", 
    "topicId": 21973, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 341876227, 
    "messageBody": "<div id=\"ygrps-yiv-1401026413\">All,<br/>\n<br/>\nFor the last six weeks, I&#39;ve been on paternity leave, which brought forward<br/>\nprogress on JUnit to an even slower crawl than usual.  In starting back up,<br/>\nwe recently received a helpful mail that challenged us to think harder about<br/>\nour community responsiveness.  Even when we&#39;re at full productivity, there&#39;s<br/>\nnever been more active committers on JUnit than you could count on one hand,<br/>\nand usually (including now), that hand could be missing most of its fingers.<br/>\nWe want the feature requests to continue, and even to accelerate, but we are<br/>\nunlikely to implement feature requests at the speed that they are proposed.<br/>\nOur practice with JUnit has always been to grow it slowly, adding features<br/>\nonly when they are obviously widely useful. Therefore, we should make clear<br/>\nhow your favorite feature request or patch can be among the few that get<br/>\nimplemented, integrated, and released.<br/>\n<br/>\nFrom here on, you can assume that we will be pulling work from the github<br/>\nissues list at <a rel=\"nofollow\" target=\"_blank\" href=\"http://github.com/KentBeck/junit/issues.\">http://github.com/KentBeck/junit/issues.</a>  We will generally<br/>\nbe pulling from the top of one of three stacks:<br/>\n<br/>\n1) All bugs, sorted by votes:<br/>\n   - <a rel=\"nofollow\" target=\"_blank\" href=\"http://github.com/KentBeck/junit/issues/labels/bug#sort=votes\">http://github.com/KentBeck/junit/issues/labels/bug#sort=votes</a><br/>\n2) All issues, sorted by votes:<br/>\n  - <a rel=\"nofollow\" target=\"_blank\" href=\"http://github.com/KentBeck/junit/issues#sort=votes\">http://github.com/KentBeck/junit/issues#sort=votes</a><br/>\n3) All issues, sorted by priority (where priority is set by the development<br/>\nteam)<br/>\n   - <a rel=\"nofollow\" target=\"_blank\" href=\"http://github.com/KentBeck/junit/issues#list\">http://github.com/KentBeck/junit/issues#list</a><br/>\n<br/>\nIf your issue is at the top of one of those stacks, and you don&#39;t hear from<br/>\nus for a couple weeks, please bug us to find out what&#39;s going on.<br/>\n<br/>\nIf your issue is _not_ at the top of one of those stacks, and you really<br/>\nthink it should be, it&#39;s time for some politicking.  You can convince the<br/>\ndevelopment team that your issue is more important than our current top<br/>\npriority, or you can convince the community to vote up your issue.<br/>\n<br/>\nWe appreciate issues that are solved by already-written patches, but we will<br/>\nnot necessarily prioritize a low-vote issue with a patch over a highly-voted<br/>\nissue with no patch. Even if you submit a patch (with tests, naturally, and<br/>\nplease follow our coding conventions), we are unlikely to integrate it<br/>\nunchanged. We say this because we never have incorporated a patch unchanged<br/>\nin 12 years of development.<br/>\n<br/>\nThanks for your continued community support.  We love the programming, but<br/>\nyou help make it fun for us,<br/>\n<br/>\n  David</div>", 
    "prevInTime": 21972, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1256060166", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDRmN2RhNmI5MDkxMDIwMTAzNngxODk3YzMyN2g1YTcyNGJiMWM0NDVlZDFAbWFpbC5nbWFpbC5jb20+"
    }
}