{
    "numMessagesInTopic": 3, 
    "nextInTime": 21973, 
    "senderId": "EzcgbgXYeSWe8jk343bhWAeWv_0xFeJvLuxQ4K2BhL8hQ_9vlyMFb5msSNeURwKXg-6gc2SeQAq6fIyREgCra2LWKIbmKemcj1A6LVSV2Y6u2d9BcRQ", 
    "systemMessage": true, 
    "subject": "Re: Specifying the order of tests and test classes?", 
    "from": "&quot;le_garcon_enerve&quot; &lt;le_garcon_enerve@...&gt;", 
    "authorName": "le_garcon_enerve", 
    "msgSnippet": "Hello! I d like to extend on Rocco s suggestion: Test for the login and logout in one class (test case). Then in another class  do rest of your tests - in", 
    "msgId": 21972, 
    "profile": "le_garcon_enerve", 
    "topicId": 21964, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 279496184, 
    "messageBody": "<div id=\"ygrps-yiv-1871181085\">Hello!<br/>\n<br/>\nI&#39;d like to extend on Rocco&#39;s suggestion: <br/>\nTest for the login and logout in one class (test case). Then in another class  do rest of your tests - in particular if you are concerned with the time to execute the tests - place the login-code in a method of a class testing the rest of your application with a @BeforeClass annotation.<br/>\nThat way, there should be no dependency of the test outcomes on the sequence in which the tests are executed (a good idea anyhow!). You may force ant (for convinience only!) to have the login test done early to make the root cause of the failures more evident.<br/>\n<br/>\nGreetings,<br/>\n  Georg<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;Pigneri, Rocco&quot; &lt;rpigneri@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Dear Andy,<br/>\n&gt; <br/>\n&gt; I haven&#39;t used Ant in a number of years, but perhaps you could separate the login tests, main tests, and logout tests into three separate Ant tasks.  You could then use Ant to force the order of execution and test the return value from your test runner to see if any test cases failed and then act accordingly.  Since this is a web app, I&#39;m assuming that it doesn&#39;t really matter which process makes the HTTP request as long as it comes in with the same credentials.<br/>\n&gt; <br/>\n&gt; Hope that helps,<br/>\n&gt; <br/>\n&gt; Rocco<br/>\n&gt; <br/>\n&gt; From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>] On Behalf Of kokaku71<br/>\n&gt; Sent: Tuesday, October 13, 2009 10:18 AM<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\n&gt; Subject: [junit] Specifying the order of tests and test classes?<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Hello,<br/>\n&gt; <br/>\n&gt; I&#39;m looking for some advice on the best way to setup this test scenario...<br/>\n&gt; <br/>\n&gt; * Tests are run from Ant using a fileset with wildcards (so that we don&#39;t have to manually maintain a list of tests)<br/>\n&gt; <br/>\n&gt; * These tests are for a web application where there is a login screen<br/>\n&gt; <br/>\n&gt; * We want to test the login screen with LoginTest.class, but the tests in that class only need to run once. Once the test has logged in successfully, the other application tests will already be logged in.<br/>\n&gt; <br/>\n&gt; So, what is the best way to force LoginTest to run before all other tests and to force the order of LoginTest tests (because we want to test all the failure scenarios before finally testing the success scenario)?<br/>\n&gt; <br/>\n&gt; Is it possible to maintain the low-maintainance flexibility of the Ant fileset while specifying order? Is it possible to create a TestSuite dynamically that would allow us to specify order?<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 21971, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1255759263", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 21971, 
    "headers": {
        "inReplyToHeader": "PDgxRkI0OTFFRUY1RUEzNEY5N0ZGNzA2QUMxQUIzNTYzMEVBOEREQTg4RUBib3N0b24tbWFpbC5sYXZhc3Rvcm0ubG9jYWwuY29tPg==", 
        "messageIdInHeader": "PGhiYm1pditzYzJqQGVHcm91cHMuY29tPg=="
    }
}