{
    "numMessagesInTopic": 38, 
    "nextInTime": 22069, 
    "senderId": "UnAYB72DufBSLsH0OdceI9cGJEwt6BzlfS7k9JWmGcg0Oy2opyZuZHI4boLkufgFbusnf4WS4koEmb_5FmaXcyGvlnY-akSLFZVAO5Xwccc", 
    "systemMessage": false, 
    "subject": "Re: Categories in JUnit 4.8", 
    "from": "&quot;yme0987654321&quot; &lt;yme0987654321@...&gt;", 
    "authorName": "yme0987654321", 
    "msgSnippet": "Well, of course the feature already has my vote ;), but in terms of concrete code, sure. I have an DAOBase for the general persistence classes, and then", 
    "msgId": 22068, 
    "rawEmail": "Return-Path: &lt;yme0987654321@...&gt;\r\nX-Sender: yme0987654321@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nX-Received: (qmail 22750 invoked from network); 19 Nov 2009 18:21:39 -0000\r\nX-Received: from unknown (98.137.34.45)\n  by m11.grp.re1.yahoo.com with QMQP; 19 Nov 2009 18:21:39 -0000\r\nX-Received: from unknown (HELO n38b.bullet.mail.sp1.yahoo.com) (66.163.168.152)\n  by mta2.grp.sp2.yahoo.com with SMTP; 19 Nov 2009 18:21:38 -0000\r\nX-Received: from [69.147.65.151] by n38.bullet.mail.sp1.yahoo.com with NNFMP; 19 Nov 2009 18:21:04 -0000\r\nX-Received: from [98.137.34.36] by t5.bullet.mail.sp1.yahoo.com with NNFMP; 19 Nov 2009 18:21:04 -0000\r\nDate: Thu, 19 Nov 2009 18:21:03 -0000\r\nTo: junit@yahoogroups.com\r\nMessage-ID: &lt;he42af+po0g@...&gt;\r\nIn-Reply-To: &lt;D8594F88-2C3B-4239-9D8C-06F009004E01@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:6:0:0:0\r\nFrom: &quot;yme0987654321&quot; &lt;yme0987654321@...&gt;\r\nSubject: Re: Categories in JUnit 4.8\r\nX-Yahoo-Group-Post: member; u=386557907; y=eAJuEoizFOCin9FsM5PUgvwkO7GZqiAf6LvVfoNFSKIsEifqi7zAmA\r\nX-Yahoo-Profile: yme0987654321\r\n\r\nWell, of course the feature already has my vote ;), but in terms of concret=\r\ne code, sure.\n\nI have an DAOBase for the general persistence classes, and t=\r\nhen specific DAOBase implementations for their respective DataObject.\n\nSo I=\r\n could certainly see categorizing all general persistence tests to be about=\r\n DAOBase and specific tests to be categorized according to the specific sub=\r\nclass that they exercise.\n\nIn addition, in certain hairy parts of the data =\r\nmodel, the DAOBase subclass has itself subclasses, allowing me to categoriz=\r\ne tests according to that area.\n\nThe advantage of such categories is that s=\r\nince all of the relevant tests on these are slow (they actually hit the dat=\r\nabase), I could test a specific area I&#39;m working on before check-in in a re=\r\nasonable time, and then rely on the build server to run everything after ch=\r\neck in just in case, without a long wait (currently the tests take over an =\r\nhour on the Build server).\n\nOf course I could make my own arbitrary categor=\r\nies, whether interfaces or Strings, but it is just a parallel duplicate sys=\r\ntem. Or I could implement the JUnit interface on DAOBase, introducing a JUn=\r\nit dependency I would rather not have on production code, and get the same =\r\neffect.\n\nIn terms of a test case, I&#39;d be happy to put one together, but I&#39;m=\r\n just not fully sure what you are looking for. The real value would seem to=\r\n be shown in having a real class hierarchy that fits well, more than in jus=\r\nt demonstrating it with a hypothetical test hierarchy. So the question is w=\r\nhat characteristics would such a test have that would be compelling for you=\r\n?\n\n--- In junit@yahoogroups.com, Kent Beck &lt;kentb@...&gt; wrote:\n&gt;\n&gt; I&#39;m with =\r\nDavid on being intrigued by the idea of using arbitrary classes. However, I=\r\n&#39;m much more interested in experiences than in votes. If someone said, &quot;I w=\r\nent through my code and I could definitely use classes as categories becaus=\r\ne of X, Y and/or Z,&quot; would be compelling to me. Even more compelling is if =\r\nsomeone would write the test cases for the new scheme.\n&gt; \n&gt; Regards,\n&gt; \n&gt; K=\r\nent\n&gt; \n&gt; On Nov 19, 2009, at 7:33 AM, David Saff wrote:\n&gt; \n&gt; &gt; On Wed, Nov =\r\n18, 2009 at 7:46 PM, yme0987654321 &lt;yme0987654321@...&gt; wrote:\n&gt; &gt; &gt; The dec=\r\nision to use types to define categories is definitely surprising to see, so=\r\n that has to count against it.\n&gt; &gt; &gt;\n&gt; &gt; &gt; However, after the initial shock=\r\n wears off, I definitely see the power in it, using Java inheritance and st=\r\natic checking rather than free form strings and some arbitrary hierarchy de=\r\nlimiter in the string.\n&gt; &gt; &gt;\n&gt; &gt; &gt; However, I think the decision to use a s=\r\npecific new interface as the super type is not a good idea. It would seem y=\r\nou gain the same power by allowing any Class&lt;?&gt;. The advantage of doing thi=\r\ns is it would allow real classes within the project to act as Categories, s=\r\no that if, for example, I am testing a DAO framework, I can categorize indi=\r\nvidual tests with the specific DAO subclass they are targeting, and then ru=\r\nn a category based on the DAO supertype. Much nicer than just calling it al=\r\nl SlowTests. In practice that won&#39;t happen often if a custom interface is r=\r\nequired because it will introduce a dependency on a JUnit type in the produ=\r\nction code.\n&gt; &gt; \n&gt; &gt; Huh. The first time through, I thought &quot;that&#39;s ridicul=\r\nous&quot;. The\n&gt; &gt; second time, I wondered if there&#39;s not something to this...\n&gt;=\r\n &gt; \n&gt; &gt; Totally musing out loud, but you could rename the annotation as\n&gt; &gt;=\r\n TestOf, so that you&#39;d have\n&gt; &gt; \n&gt; &gt; @TestOf(CustomStreamingPlatform.class)=\r\n\n&gt; &gt; \n&gt; &gt; Hmm...\n&gt; &gt; \n&gt; &gt; &gt; I&#39;m also curious if you considered using an ann=\r\notation as the category? That is having the category take a Class&lt;?&gt; that r=\r\nepresents an annotation? You could support meta-annotations to allow a hier=\r\narchy of categories as well as supporting any subclasses or implementations=\r\n of types so annotated. Coding for that would be nasty business, but it wou=\r\nldn&#39;t be complicated from a client point of view, and would allow the same =\r\nflexibility of inheritance without the dependency on a JUnit type.\n&gt; &gt; \n&gt; &gt;=\r\n I wanted to stay away from meta-annotations unless the reasons were\n&gt; &gt; _r=\r\neally_ compelling.\n&gt; &gt; \n&gt; &gt; &gt; I would prefer just an arbitrary Class&lt;?&gt;, th=\r\nough. Inheritance is well understood by any Java programmer (unlike meta-an=\r\nnotations) and opens up a synergy between the category hierarchy and the co=\r\nde hierarchy.\n&gt; &gt; \n&gt; &gt; Can I get another vote on this extension idea?\n&gt; &gt; \n=\r\n&gt; &gt; David\n&gt; &gt; \n&gt; \n&gt; \n&gt; \n&gt; [Non-text portions of this message have been remo=\r\nved]\n&gt;\n\n\n\n", 
    "profile": "yme0987654321", 
    "topicId": 22052, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 386557907, 
    "prevInTime": 22067, 
    "contentTrasformed": false, 
    "postDate": "1258654863", 
    "canDelete": false, 
    "nextInTopic": 22074, 
    "prevInTopic": 22066, 
    "headers": {
        "inReplyToHeader": "PEQ4NTk0Rjg4LTJDM0ItNDIzOS05RDhDLTA2RjAwOTAwNEUwMUBlYXJ0aGxpbmsubmV0Pg==", 
        "messageIdInHeader": "PGhlNDJhZitwbzBnQGVHcm91cHMuY29tPg=="
    }
}