{
    "numMessagesInTopic": 38, 
    "nextInTime": 22069, 
    "senderId": "rga_Ou6_h8xTAWmTLfbUP-yZQ1ZP1voXVKo2FY7GWuySqLbItpD-qzh52wRQ3fQGjG9MJXyruIsT0brsnyFbaL_8XBsx_8uOwVAwROvX6iw", 
    "systemMessage": false, 
    "subject": "Re: Categories in JUnit 4.8", 
    "from": "&quot;yme0987654321&quot; &lt;yme0987654321@...&gt;", 
    "authorName": "yme0987654321", 
    "msgSnippet": "Well, of course the feature already has my vote ;), but in terms of concrete code, sure. I have an DAOBase for the general persistence classes, and then", 
    "msgId": 22068, 
    "profile": "yme0987654321", 
    "topicId": 22052, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 386557907, 
    "messageBody": "<div id=\"ygrps-yiv-1475002905\">Well, of course the feature already has my vote ;), but in terms of concrete code, sure.<br/>\n<br/>\nI have an DAOBase for the general persistence classes, and then specific DAOBase implementations for their respective DataObject.<br/>\n<br/>\nSo I could certainly see categorizing all general persistence tests to be about DAOBase and specific tests to be categorized according to the specific subclass that they exercise.<br/>\n<br/>\nIn addition, in certain hairy parts of the data model, the DAOBase subclass has itself subclasses, allowing me to categorize tests according to that area.<br/>\n<br/>\nThe advantage of such categories is that since all of the relevant tests on these are slow (they actually hit the database), I could test a specific area I&#39;m working on before check-in in a reasonable time, and then rely on the build server to run everything after check in just in case, without a long wait (currently the tests take over an hour on the Build server).<br/>\n<br/>\nOf course I could make my own arbitrary categories, whether interfaces or Strings, but it is just a parallel duplicate system. Or I could implement the JUnit interface on DAOBase, introducing a JUnit dependency I would rather not have on production code, and get the same effect.<br/>\n<br/>\nIn terms of a test case, I&#39;d be happy to put one together, but I&#39;m just not fully sure what you are looking for. The real value would seem to be shown in having a real class hierarchy that fits well, more than in just demonstrating it with a hypothetical test hierarchy. So the question is what characteristics would such a test have that would be compelling for you?<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, Kent Beck &lt;kentb@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I&#39;m with David on being intrigued by the idea of using arbitrary classes. However, I&#39;m much more interested in experiences than in votes. If someone said, &quot;I went through my code and I could definitely use classes as categories because of X, Y and/or Z,&quot; would be compelling to me. Even more compelling is if someone would write the test cases for the new scheme.<br/>\n&gt; <br/>\n&gt; Regards,<br/>\n&gt; <br/>\n&gt; Kent<br/>\n&gt; <br/>\n&gt; On Nov 19, 2009, at 7:33 AM, David Saff wrote:<br/>\n&gt; <br/>\n&gt; &gt; On Wed, Nov 18, 2009 at 7:46 PM, yme0987654321 &lt;yme0987654321@...&gt; wrote:<br/>\n&gt; &gt; &gt; The decision to use types to define categories is definitely surprising to see, so that has to count against it.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; However, after the initial shock wears off, I definitely see the power in it, using Java inheritance and static checking rather than free form strings and some arbitrary hierarchy delimiter in the string.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; However, I think the decision to use a specific new interface as the super type is not a good idea. It would seem you gain the same power by allowing any Class&lt;?&gt;. The advantage of doing this is it would allow real classes within the project to act as Categories, so that if, for example, I am testing a DAO framework, I can categorize individual tests with the specific DAO subclass they are targeting, and then run a category based on the DAO supertype. Much nicer than just calling it all SlowTests. In practice that won&#39;t happen often if a custom interface is required because it will introduce a dependency on a JUnit type in the production code.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Huh. The first time through, I thought &quot;that&#39;s ridiculous&quot;. The<br/>\n&gt; &gt; second time, I wondered if there&#39;s not something to this...<br/>\n&gt; &gt; <br/>\n&gt; &gt; Totally musing out loud, but you could rename the annotation as<br/>\n&gt; &gt; TestOf, so that you&#39;d have<br/>\n&gt; &gt; <br/>\n&gt; &gt; @TestOf(CustomStreamingPlatform.class)<br/>\n&gt; &gt; <br/>\n&gt; &gt; Hmm...<br/>\n&gt; &gt; <br/>\n&gt; &gt; &gt; I&#39;m also curious if you considered using an annotation as the category? That is having the category take a Class&lt;?&gt; that represents an annotation? You could support meta-annotations to allow a hierarchy of categories as well as supporting any subclasses or implementations of types so annotated. Coding for that would be nasty business, but it wouldn&#39;t be complicated from a client point of view, and would allow the same flexibility of inheritance without the dependency on a JUnit type.<br/>\n&gt; &gt; <br/>\n&gt; &gt; I wanted to stay away from meta-annotations unless the reasons were<br/>\n&gt; &gt; _really_ compelling.<br/>\n&gt; &gt; <br/>\n&gt; &gt; &gt; I would prefer just an arbitrary Class&lt;?&gt;, though. Inheritance is well understood by any Java programmer (unlike meta-annotations) and opens up a synergy between the category hierarchy and the code hierarchy.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Can I get another vote on this extension idea?<br/>\n&gt; &gt; <br/>\n&gt; &gt; David<br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 22067, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1258654863", 
    "canDelete": false, 
    "nextInTopic": 22074, 
    "prevInTopic": 22066, 
    "headers": {
        "inReplyToHeader": "PEQ4NTk0Rjg4LTJDM0ItNDIzOS05RDhDLTA2RjAwOTAwNEUwMUBlYXJ0aGxpbmsubmV0Pg==", 
        "messageIdInHeader": "PGhlNDJhZitwbzBnQGVHcm91cHMuY29tPg=="
    }
}