{
    "numMessagesInTopic": 11, 
    "nextInTime": 2208, 
    "senderId": "h5l4LauBLO-oN1KuR9-r37UqLVloBzuIUA1c1PRyyoyLwRlDRqH96_Eqn_M17Unc7zqCdv3hTF2SFAvZALn26N8m-Qfw7Y0pvZspIGuj", 
    "systemMessage": false, 
    "subject": "Re: testing database operation", 
    "from": "Richard Dallaway &lt;richard@...&gt;", 
    "authorName": "Richard Dallaway", 
    "msgSnippet": "Mathieu - thanks for putting together that list of options.  I think there s some good stuff in there to think about. ... If... - you need a lot of data for", 
    "msgId": 2207, 
    "topicId": 2136, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1157673955\">Mathieu - thanks for putting together that list of options.  I think <br/>\nthere&#39;s some good stuff in there to think about.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Option 1 - Data refresh:  refresh data after/before every test.<br/>\n&gt;...from a copy of the baseline data somewhere.<br/>\n&gt;Really impossible due to performance. If you think not, let me know how.<br/>\n<br/>\n </span></blockquote>If...<br/>\n  - you need a lot of data for unit tests (and some codes does); or<br/>\n  - your DB machine is on the wrong side of the planet; or<br/>\n  - your DB machine/DB product is under-powered; or<br/>\n  - you have so many DB tests that you&#39;ve reached a limit...<br/>\n...then yes, performance is an issue with this approach.  For an <br/>\never-growing project it&#39;s something you&#39;re going to run into sooner or <br/>\nlater, I guess.<br/>\n<br/>\nOn the other hand, there are some things you can do to make it <br/>\nworkable.  For example:<br/>\n<br/>\n- if a subsection of tests only touch a couple of tables, then you don&#39;t <br/>\nneed to wipe and recreate the whole database for those tests.  I tend to <br/>\nwrite helper methods to set up database scenarios and call them as required <br/>\n(rather than touch every table every time in setUp and tearDown).<br/>\n<br/>\n- how much data do you need for unit tests?  If you craft your tests <br/>\ncarefully, you may be able to get away with just a hand full of records.<br/>\n<br/>\n- as you point out, truncate is very fast for getting rid of data.  And for <br/>\nsome tests, that&#39;s all you need to do.<br/>\n<br/>\n- if your tests are all in one test class, then it&#39;s going to be a pain to <br/>\nrun that class.  You may get better mileage from option 1 if you can break <br/>\nyour testing into a number of smaller classes.  During a coding frenzy you <br/>\ncan run the test class covering just the area you&#39;re working on... and run <br/>\nall tests a little less frequently.<br/>\n<br/>\nI guess the viability of option 1 depends on your aims and circumstances.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Option 4 - Data Reset: reverse the changes via some generic black-magic<br/>\n&gt;after every test.<br/>\n&gt;The dream! Fast, efficient, generic! :)<br/>\n<br/>\n </span></blockquote>Oh yes, this is what we want.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;4b) DB tricks, triggers and al.<br/>\n&gt;You need a DB that is a copy of your baseline stable data. (Might be in the<br/>\n&gt;same DB, but with table names prefixed with &#39;STBL&#39;(stable)).<br/>\n<br/>\n </span></blockquote>The only downside I see to this is the complexity it brings, and I&#39;m not <br/>\nsure I want to add much more complexity to my testing environment.   I <br/>\nguess it&#39;s a trade off: extra complexity for time gained from something <br/>\nlike option 1.<br/>\n<br/>\nRegards<br/>\nRichard</div>", 
    "prevInTime": 2206, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "996568523", 
    "canDelete": false, 
    "nextInTopic": 2208, 
    "prevInTopic": 2197, 
    "headers": {
        "inReplyToHeader": "PDk5NjUzNzU1OC4yNjc2LjU5OTQxLmw5QHlhaG9vZ3JvdXBzLmNvbT4=", 
        "messageIdInHeader": "PDUuMC4yLjEuMC4yMDAxMDczMTA5MDYyOS4wNDBjZjBiMEBwb3AzLm5vcnRvbi5hbnRpdmlydXM+"
    }
}