{
    "numMessagesInTopic": 9, 
    "nextInTime": 22081, 
    "senderId": "pb_Vw7rsD2M1-gIn0CcQyB2Jdvv0fXuz2uiSxItN--lGjfzOV8U53xjLqIzS7ehKKBwOWamJoPkm7HEHoVtSdWY18rjZeBq0CaqnDlED8kwr0iDRfuwbQci42A", 
    "systemMessage": false, 
    "subject": "RE: [junit] Gathering and displaying supplemental information about test \tfailures.", 
    "from": "&quot;Forsberg, Mike&quot; &lt;mike.forsberg@...&gt;", 
    "authorName": "Forsberg, Mike", 
    "msgSnippet": "Have you looked at how eclipse handles AssertEquals of two Strings. Not sure if this is a JUnit core functionality or not.  But eclipse highlights how the two", 
    "msgId": 22080, 
    "profile": "mike.forsberg_gf", 
    "topicId": 22079, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 392980748, 
    "messageBody": "<div id=\"ygrps-yiv-299746186\">Have you looked at how eclipse handles AssertEquals of two Strings.<br/>\n<br/>\nNot sure if this is a JUnit core functionality or not.  But eclipse highlights how the two strings differ.<br/>\n<br/>\nJust wondering if you&#39;ve ever seen this functionality... I&#39;ll send screen shots if not.<br/>\n<br/>\nBig Mike<br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>] On Behalf Of Sunburned Surveyor<br/>\nSent: Friday, November 20, 2009 12:06 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nCc: Martin Davis; Martin Davis<br/>\nSubject: [junit] Gathering and displaying supplemental information about test failures.<br/>\n<br/>\n<br/>\n<br/>\nI have a question about the options for gathering and displaying<br/>\nsupplemental information about test failures. Please allow me to<br/>\nillustrate my question with a simple example.<br/>\n<br/>\nI&#39;ve got a class called Coordinate that represents a point in a 3D<br/>\ncoordinate system. I&#39;ve overloaded the toString method of this class<br/>\nto write out the X, Y, and Z values of the coordinate in a simple<br/>\nString. Now I want to test my toString method using JUnit.<br/>\n<br/>\nIf the Coordinate.toString test method fails (because the string was<br/>\nnot constructed in the correct format) I would like to provide the<br/>\nprogrammer running the test with a copy of the incorrect string, since<br/>\nit provides valuable clues about what is broken with the method under<br/>\ntest. I typically do this by placing System.err.println statements in<br/>\nmy test method. However, I realize that using System.err.println isn&#39;t<br/>\nthe most portable or elegant way to provide this information to the<br/>\nprogrammer executing the test.<br/>\n<br/>\nWhat I really want is a GUI that allows the programmer to select a<br/>\nfailed test from a list of failed tests, and then to view supplemental<br/>\ntest data I provide him/her.<br/>\n<br/>\nI was thinking I could do this by completing the following tasks:<br/>\n<br/>\n- Implementing the RunListener interface in JUnit.<br/>\n- Create an extension of Exception that could contain a HashMap of<br/>\nsimple parameters and that would be passed to the constructor of a<br/>\nFailure object from within a test.<br/>\n- Creating Failure objects in my tests that contain the supplemental<br/>\nfailrure data.<br/>\n- Passing these failure objects to my RunListener implementaiton.<br/>\n- Creating a FailureProcessor class that displays a GUI with the<br/>\ninformation in my RunListener implemenation to show the programmer<br/>\nexecuting my tests the supplemental failure data as described above.<br/>\n(FailureProcessor would be an interface so that you could do different<br/>\nthings with the supplemental failure data, not just show it in a GUI.)<br/>\n<br/>\nBefore I begin this work, I wanted to ask if there was a better way to<br/>\ndo this. I know I could use a logging framework from within my test<br/>\nmethod, but I really want to work within the JUnut framework, not<br/>\noutside of it. I also want a nice little GUI, not a log file.<br/>\n<br/>\nHow are other programmers handling instances when they want to display<br/>\nsupplemental data on failed tests? Does my approach sound reasonable?<br/>\n<br/>\nThe Sunburned Surveyor<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 22079, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1258744815", 
    "canDelete": false, 
    "nextInTopic": 22081, 
    "prevInTopic": 22079, 
    "headers": {
        "inReplyToHeader": "PDcxMDk3YWUyMDkxMTIwMTAwNmk1M2M3ZjlkcDJlNzlhMDhlYjUzZTg5ODVAbWFpbC5nbWFpbC5jb20+", 
        "messageIdInHeader": "PDRBN0M3MTFGMDAyRTkyNDM5NjcxRkYwQzI1Q0Q5RDM1MUIzRUYwMTBAVkFVU0VYTUJYUDEuZ2ZvdW5kcmllcy5jb20+", 
        "referencesHeader": "PDcxMDk3YWUyMDkxMTIwMTAwNmk1M2M3ZjlkcDJlNzlhMDhlYjUzZTg5ODVAbWFpbC5nbWFpbC5jb20+"
    }
}