{
    "numMessagesInTopic": 16, 
    "nextInTime": 22107, 
    "senderId": "xy5XmvSm2PtloaY2KUAnCbcfA9hjHu7aJKnLKbTkGDwxvtgSfBZ00MMgRh-_UGBbrAVSWV0kXjwrtUIK3Wb8sUJ8J3Idfoa8Z8ISYZpAqiMVv4Dadw", 
    "systemMessage": false, 
    "subject": "Re: [junit] An &quot;after all tests&quot; event", 
    "from": "Malte Finsterwalder &lt;malte@...&gt;", 
    "authorName": "Malte Finsterwalder", 
    "msgSnippet": "Hello! you can also use Runtime.getRuntime().registerShutdownHook(...) to register a shutdown-hook that is run after junit is done. But I don t hink you can", 
    "msgId": 22106, 
    "profile": "maltefinsterwalder", 
    "topicId": 22067, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 199072473, 
    "messageBody": "<div id=\"ygrps-yiv-576206898\">Hello!<br/>\n<br/>\nyou can also use Runtime.getRuntime().registerShutdownHook(...) to<br/>\nregister a shutdown-hook that is run after junit is done. But I don&#39;t<br/>\nhink you can throw assertion errors in the shutdown hook.<br/>\n<br/>\nAnother idea would be to capture System.out or the logging-stream and<br/>\nverify in your tests, that no exception is in the log/out-stream, as<br/>\nthis is (from what I understood) closer to what you really want to<br/>\ntest for.<br/>\n<br/>\nI do the runBefore the same way as you said. The only difference: I<br/>\nput the init-code as @BeforeClass in a superclass and my tests simply<br/>\ninherit from it.<br/>\n<br/>\nWhen you use eclipse, you probably don&#39;t build explicit suites, so you<br/>\ncan&#39;t use @BeforeClass and @AfterClass on a suite easily.<br/>\nThis would work with<br/>\n@RunWith(Suite.class)<br/>\n@SuiteClasses({Class1.class, Class2.class, ....})<br/>\npublic void AllTests {<br/>\n@BeforeClass<br/>\npublic static void runBeforeAllTests() {<br/>\n}<br/>\n<br/>\n@AfterClass<br/>\npublic static void runAfterAllTests() {<br/>\n}<br/>\n}<br/>\n<br/>\nYou could look into cpSuite, which allows this, I think, and still<br/>\nruns all tests automatically.<br/>\n<br/>\nGreetings,<br/>\n   Malte<br/>\n<br/>\n2009/11/19 stolsvik &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:online@...\">online@...</a>&gt;:<br/>\n<blockquote><span title=\"qreply\"> &gt; I need some way to run a certain test after all other tests.<br/>\n&gt;<br/>\n&gt; I run my tests in Eclipse, and do not yet have a build system outside of it. I understand that had I done this programmatically, I could have attached a RunListener, implementing the testRunFinished(Result) method.<br/>\n&gt;<br/>\n&gt; Is there any way to achieve a similar effect within the JUnit runner in Eclipse?<br/>\n&gt;<br/>\n&gt; Rationale: I have actual unit tests, then bigger tests, then full-fledged &quot;integration tests&quot; or whatever one call them, where I take up my entire application-local server thingy and process a bunch of items, letting JUnit check after the dust settles whether the items was processed correctly. However, the internals are multi threaded, and also, this being a Swing app, lots of Runnables are sent over to the EDT. This is all good.<br/>\n&gt;<br/>\n&gt; However, I&#39;ve sometimes seen that a thread crashes (uncaught exception), without this being noticed by any of the tests running (I&#39;ve e.g. seen a ConcurrentModificationException take down the EDT, without having a clue as to why I got that - and the next event posted just brings up a new EDT, so I get a green bar, but with an uncaught error). What I&#39;d want to achieve, is to install an uncaught exception handler, and then, as a final step to ALL permutations of tests (e.g. both for a single unit test, and also for the project-wide test run), run a test that checks whether any thread-killing exception was caught by the handler, and if so, fails the run. (I&#39;d throw the exception that was caught, and in any case also log-dump any and all such exceptions).<br/>\n&gt;<br/>\n&gt; (As a very similar question, I&#39;d also like to have a &quot;before any tests&quot; thing, like the RunListener.testRunStarted(Description) method, where I could set up logging. Now I do that by letting ALL tests have a static block that calls a specific static method which has a static boolean that tells whether the log system already is set up. This also works just nicely, but is a hassle nevertheless. However, it is not possible, as I see it, to solve the above question in the same manner.)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 22105, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1259053457", 
    "canDelete": false, 
    "nextInTopic": 22785, 
    "prevInTopic": 22077, 
    "headers": {
        "inReplyToHeader": "PGhlM2NpMSs3MTNwQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDUzODc0ZWMwMDkxMTI0MDEwNG42N2ViYWUwZHc5NzAyYjgwYjZhZmEyNmI2QG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PGhlM2NpMSs3MTNwQGVHcm91cHMuY29tPg=="
    }
}