{
    "numMessagesInTopic": 23, 
    "nextInTime": 22137, 
    "senderId": "9UAs2yWbLTQqnEoEpnoXcv7OdDDQtOL_O2Qgpn4Bo3dlhN-wUZDSPOUWtxwoUxTRXbgv2Q6EJkPa8VYKxAx7saE1WllA4jk3-yN--Im0T6keYY0Fdd_42oHHprg", 
    "systemMessage": true, 
    "subject": "Re: [junit] Global Rule, active for all tests", 
    "from": "=?UTF-8?Q?Endre_St=C3=B8lsvik?= &lt;online@...&gt;", 
    "authorName": "Endre Stølsvik", 
    "msgSnippet": "I just posted a *somewhat* similar question in regard to the JUnit runner in Eclipse. I would like to have an after test that is run after all other tests", 
    "msgId": 22136, 
    "profile": "stolsvik", 
    "topicId": 22133, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 420600143, 
    "messageBody": "<div id=\"ygrps-yiv-1603787300\">I just posted a *somewhat* similar question in regard to the JUnit runner in<br/>\nEclipse. I would like to have an &quot;after&quot; test that is run after all other<br/>\ntests (no matter what tests you are running, single class, package or<br/>\nproject). This is because I have set up an<br/>\nThread.setDefaultUncaughtExceptionHandler that will pick up if threads die<br/>\nunexpectedly (and I do that by a &quot;before&quot; logic that relies on a static<br/>\nblock in ALL tests, which obviously also would be nice if I could place in a<br/>\n&quot;before&quot; test, harness). I want this &quot;after&quot; test to check that this number<br/>\nis 0, and if not, fail the test.<br/>\n<br/>\nIt sounds slightly like this magic-all-tests-add Rule thing could fix my<br/>\nproblem - if the Eclipse runner honors this, of course. Just wanted to<br/>\nmention it, if some tools in the future could take it into account!<br/>\n<br/>\nThanks,<br/>\nEndre.<br/>\n<br/>\nOn Fri, Dec 4, 2009 at 16:34, Bogdan<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bogdan.mocanu.notifications@...\">bogdan.mocanu.notifications@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Hi everyone,<br/>\n&gt;<br/>\n&gt; as we have it currently, we can place a Rule in a test, and that rule will<br/>\n&gt; be activated for that test. To have the rule working in several tests, you<br/>\n&gt; have to place the Rule in each test.<br/>\n&gt;<br/>\n&gt; However, I am searching for a way to activate a Rule for all the tests that<br/>\n&gt; are executed, without needing to add the rule to each test. Perhaps by<br/>\n&gt; specifying a Java property parameter when running the tests (I could also<br/>\n&gt; set this as a global Java option, therefore being used upon each execution<br/>\n&gt; of the JVM).<br/>\n&gt;<br/>\n&gt; Do you know if this is possible?<br/>\n&gt;<br/>\n&gt; The reason why I need this, is: I am making the plans and gathering the<br/>\n&gt; ideas for creating a simple Swing application that will display the results<br/>\n&gt; of the executed tests (just like the JUnit view in Eclipse/Idea/Netbeans,<br/>\n&gt; but perhaps with more details, and also available for anyone, not just IDE<br/>\n&gt; users). Currently I developed a small agent rule, that you can place in your<br/>\n&gt; test, and it will report to the console the status of your tests (the Swing<br/>\n&gt; console runs remotely).<br/>\n&gt;<br/>\n&gt; This is ok, but it means that you will have to add this rule to each and<br/>\n&gt; every test that you have. It also means that will not be an easy task to<br/>\n&gt; disable this rule, if you don&#39;t want it anymore.<br/>\n&gt;<br/>\n&gt; Therefore a possibility to enable Rules globally for all tests I think is<br/>\n&gt; the best solution for my case, and also a good tool to have for various<br/>\n&gt; other tasks.<br/>\n&gt;<br/>\n&gt; What do you think? Also, what do you think about the Swing console idea?<br/>\n&gt;<br/>\n&gt; Cheers,<br/>\n&gt; Bogdan<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 22135, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1260017107", 
    "canDelete": false, 
    "nextInTopic": 22137, 
    "prevInTopic": 22135, 
    "headers": {
        "inReplyToHeader": "PGhmYmE1YSs0bTB1QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDE1MDFmZGY0MDkxMjA1MDQ0NXExMTdhOWRlNGoyNDE0N2I1MDhiNDY0ODMxQG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PGhmYmE1YSs0bTB1QGVHcm91cHMuY29tPg=="
    }
}