{
    "numMessagesInTopic": 23, 
    "nextInTime": 22138, 
    "senderId": "xs5mKk4c0n5rVso5wx0i9kDyEdP1JvbRxW-AcOBOxjP9MbqEwFwcbczyODEFRHcXv7UJdItNzoW7hvhYXfYBPxKoHa3IqBWUcbN0HA-ECKqxP3k8Ix5t", 
    "systemMessage": true, 
    "subject": "Re: Global Rule, active for all tests", 
    "from": "&quot;Bogdan&quot; &lt;bogdan.mocanu.notifications@...&gt;", 
    "authorName": "Bogdan", 
    "msgSnippet": "Hi guys, thank you very much for your responses. I didn t know about the RunListener, so I will definitely take a look at it, and come back with an answer", 
    "msgId": 22137, 
    "profile": "bogdanmocanu2011", 
    "topicId": 22133, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 414734247, 
    "messageBody": "<div id=\"ygrps-yiv-1118161899\">Hi guys,<br/>\n<br/>\nthank you very much for your responses.<br/>\n<br/>\nI didn&#39;t know about the RunListener, so I will definitely take a look at it, and come back with an answer regarding it.<br/>\n<br/>\nWhat I was thinking about the global rules is to be able to configure something like global rules, that are specified as a startup parameter (read Java option) when starting the test (in the project at my office, we have like 750 tests, and therefore would work just nice to configure this option just for my env; probably the RunListener will work just like that, so as I said, I will read about this).<br/>\n<br/>\nI was thinking about something like this:<br/>\n<br/>\njava -Djunit.globalRules=com.test.myrules.SomeNiceRule,com.test.myrules.SomeNiceRule2 ..........<br/>\n<br/>\nCheers,<br/>\nBogdan<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;Bogdan&quot; &lt;bogdan.mocanu.notifications@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi everyone,<br/>\n&gt; <br/>\n&gt; as we have it currently, we can place a Rule in a test, and that rule will be activated for that test. To have the rule working in several tests, you have to place the Rule in each test.<br/>\n&gt; <br/>\n&gt; However, I am searching for a way to activate a Rule for all the tests that are executed, without needing to add the rule to each test. Perhaps by specifying a Java property parameter when running the tests (I could also set this as a global Java option, therefore being used upon each execution of the JVM). <br/>\n&gt; <br/>\n&gt; Do you know if this is possible?<br/>\n&gt; <br/>\n&gt; The reason why I need this, is: I am making the plans and gathering the ideas for creating a simple Swing application that will display the results of the executed tests (just like the JUnit view in Eclipse/Idea/Netbeans, but perhaps with more details, and also available for anyone, not just IDE users). Currently I developed a small agent rule, that you can place in your test, and it will report to the console the status of your tests (the Swing console runs remotely).<br/>\n&gt; <br/>\n&gt; This is ok, but it means that you will have to add this rule to each and every test that you have. It also means that will not be an easy task to disable this rule, if you don&#39;t want it anymore.<br/>\n&gt; <br/>\n&gt; Therefore a possibility to enable Rules globally for all tests I think is the best solution for my case, and also a good tool to have for various other tasks.<br/>\n&gt; <br/>\n&gt; What do you think? Also, what do you think about the Swing console idea?<br/>\n&gt; <br/>\n&gt; Cheers,<br/>\n&gt; Bogdan<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 22136, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1260042416", 
    "canDelete": false, 
    "nextInTopic": 22138, 
    "prevInTopic": 22136, 
    "headers": {
        "inReplyToHeader": "PGhmYmE1YSs0bTB1QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGhmZWRiZytibmEyQGVHcm91cHMuY29tPg=="
    }
}