{
    "numMessagesInTopic": 38, 
    "nextInTime": 22234, 
    "senderId": "ttB1dp6c2Ywzdp-e5r8f8qzoAPwkALoPd9G1MjcmOkJDryNn8jwYc6QpkBLNCltUkLXAgj8XNhqko-k976qg23gdpW14nFiLr3bn1-xvkGeKr1BN", 
    "systemMessage": false, 
    "subject": "RE: [junit] Order of execution for tests", 
    "from": "&quot;Charlie Poole&quot; &lt;charlie@...&gt;", 
    "authorName": "Charlie Poole", 
    "msgSnippet": "Hi Cédric, ... This is an implementation-based view of the tests: i.e. they will either be run or not run. The distinction I was trying to make - and I think", 
    "msgId": 22233, 
    "profile": "cpoole98370", 
    "topicId": 22219, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 212099090, 
    "messageBody": "<div id=\"ygrps-yiv-1763121362\">Hi Cédric, <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; On another list, I identified the same variations of dependency but <br/>\n&gt; &gt; with the variation that for case 1. We might run B anyway but could <br/>\n&gt; &gt; highlight the error in A in some way. That approach doesn&#39;t require <br/>\n&gt; &gt; ordering the tests in any particular way, which has some advantages.<br/>\n&gt; &gt; It still promotes developer efficiency while not worrying about <br/>\n&gt; &gt; execution efficiency.<br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; Yes, we call these &quot;soft dependencies&quot;.<br/>\n&gt; <br/>\n&gt; If &quot;b&quot; has a hard dependency on &quot;a&quot; and &quot;a&quot; fails, &quot;a&quot; will <br/>\n&gt; be marked &quot;FAILED&quot; and b &quot;SKIPPED&quot;.<br/>\n&gt; <br/>\n&gt; If &quot;b&quot; has a soft dependency on &quot;a&quot;, &quot;b&quot; will still run even <br/>\n&gt; if &quot;a&quot; fails but a warning could be displayed in the log.<br/>\n<br/>\n </span></blockquote>This is an implementation-based view of the tests: i.e. they<br/>\nwill either be run or not run.<br/>\n<br/>\nThe distinction I was trying to make - and I think David as<br/>\nwell - is based on the cause and nature of the dependency.<br/>\nFor the sake of argument, I&#39;ll try to redefine what you&#39;re<br/>\ncalling Hard and Soft along those lines.<br/>\n<br/>\nHard: Test A does something (sets state) upon which B depends. <br/>\nFor example, A may write to a data store and B might try to <br/>\nread the information back. Or A might create a complex object<br/>\nand B might try to call a method on that object. If we allow <br/>\nthis sort of thing, then there is no choice but to run A first<br/>\nand it makes sense to not run B at all if A fails. However,<br/>\nI would not want a unit test framework to allow it.<br/>\n<br/>\nSoft: Test A tests some functionality upon which some other<br/>\nfunctionality, tested by B, depends. Therefore, if test A <br/>\nfails, Test B will either fail as well or be inconclusive, <br/>\nso nothing further can be learned from test B. In this case,<br/>\na testing framework could respond in a number of ways to<br/>\nthe dependency:<br/>\n1) Run the tests in order, skipping B if A fails.<br/>\n2) Run the tests in an arbitrary order, but skip B if A <br/>\nalready ran and failed.<br/>\n3) Run the tests in an arbitrary order, not skipping any<br/>\nof them but organize reporting in such a way that a failure<br/>\nof A takes precedence over a failure of B.<br/>\n<br/>\nAs a framework author, I can see that allowing the user to<br/>\nspecify ordering is a simpler implementation. But I think<br/>\nit&#39;s more interesting to imagine the user specifying the<br/>\nnature of the dependencies and allowing the framework to<br/>\nfigure out a strategy.<br/>\n<br/>\nCharlie<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Every time we have discussed this potential feature for <br/>\n&gt; TestNG, the discussion ended up being non conclusive on the <br/>\n&gt; real interest and the existing ability to mark certain <br/>\n&gt; methods as &quot;alwaysRun&quot; already fills a big part of this <br/>\n&gt; scenario, so I always ended up punting on it, but I&#39;d be <br/>\n&gt; happy to hear if someone can come up with a good use case for <br/>\n&gt; soft dependencies...<br/>\n&gt; <br/>\n&gt; --<br/>\n&gt; ***Cédric<br/>\n&gt; *<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ------------------------------------<br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 22232, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1261631342", 
    "canDelete": false, 
    "nextInTopic": 22239, 
    "prevInTopic": 22232, 
    "headers": {
        "inReplyToHeader": "PGI4NmI2YTljMDkxMjIzMjAzNXUzMzQ0NDZhYm8xZWQ3ZWJlZDZhZWVkNzBjQG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PDAyN2UwMWNhODQ1NyQzNmE4NDhlMCQ3MTAxYThjMEBmZXJyYXJpPg=="
    }
}