{
    "numMessagesInTopic": 38, 
    "nextInTime": 22240, 
    "senderId": "ucmhKE9-j1sGX7abhNIEZu7jWHeDEFaDmWPJjz0DXM50oWGJahzJHYb2ft_XmmOdMFBNliVwI7BSRv89c09hyHS21j0v-IP8zNq4h1KF2g", 
    "systemMessage": false, 
    "subject": "RE: [junit] Order of execution for tests", 
    "from": "&quot;Pigneri, Rocco&quot; &lt;rpigneri@...&gt;", 
    "authorName": "Pigneri, Rocco", 
    "msgSnippet": "Charlie, ... I am very much with you on this one.  In my experience, there have been a lot of times when functions under test within the same class depend upon", 
    "msgId": 22239, 
    "topicId": 22219, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 383279107, 
    "messageBody": "<div id=\"ygrps-yiv-1779317671\">Charlie,<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;As a framework author, I can see that allowing the user to<br/>\n&gt;specify ordering is a simpler implementation. But I think<br/>\n&gt;it&#39;s more interesting to imagine the user specifying the<br/>\n&gt;nature of the dependencies and allowing the framework to<br/>\n&gt;figure out a strategy.<br/>\n<br/>\n </span></blockquote>I am very much with you on this one.  In my experience, there have been a lot of times when functions under test within the same class depend upon each other, and it would have been great to have the test harness know that information.  When I was refactoring code for a new framework package, I would have loved to have the UI to display non-dependent tests first as it would have shown me very clearly the source of the problem.<br/>\n<br/>\nSpecifying only the relationships in code and leaving the display strategy to the test harness would allow more flexible display and execution of these tests based upon the user&#39;s goals rather than upon the dependencies themselves.  I could imagine myself asking the UI only to display the least dependent functions&#39; errors and to hide all other errors for quick debugging on sweeping optimizations.  I could also want to see the dependent tests in a tree in case I am changing a single class and want to understand the effects of what I am touching.  I could also want to see all tests in a single list with the least dependent at the top and the most dependent on the bottom when running regression tests.  As you can see, the chosen view depends more upon what I am doing than upon the test dependencies themselves.<br/>\n<br/>\nFinally, being able to list dependencies between test classes in addition to test cases would also JUnit to report which components of the system depend upon each other.  This simple extension would greatly increase the power of the dependency models for larger systems (particularly regression tests).<br/>\n<br/>\nThank you,<br/>\n<br/>\nRocco<br/>\n<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>] On Behalf Of Charlie Poole<br/>\nSent: Thursday, December 24, 2009 12:09 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSubject: RE: [junit] Order of execution for tests<br/>\n<br/>\n<br/>\n<br/>\nHi Cédric,<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; On another list, I identified the same variations of dependency but<br/>\n&gt; &gt; with the variation that for case 1. We might run B anyway but could<br/>\n&gt; &gt; highlight the error in A in some way. That approach doesn&#39;t require<br/>\n&gt; &gt; ordering the tests in any particular way, which has some advantages.<br/>\n&gt; &gt; It still promotes developer efficiency while not worrying about<br/>\n&gt; &gt; execution efficiency.<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; Yes, we call these &quot;soft dependencies&quot;.<br/>\n&gt;<br/>\n&gt; If &quot;b&quot; has a hard dependency on &quot;a&quot; and &quot;a&quot; fails, &quot;a&quot; will<br/>\n&gt; be marked &quot;FAILED&quot; and b &quot;SKIPPED&quot;.<br/>\n&gt;<br/>\n&gt; If &quot;b&quot; has a soft dependency on &quot;a&quot;, &quot;b&quot; will still run even<br/>\n&gt; if &quot;a&quot; fails but a warning could be displayed in the log.<br/>\n<br/>\n </span></blockquote>This is an implementation-based view of the tests: i.e. they<br/>\nwill either be run or not run.<br/>\n<br/>\nThe distinction I was trying to make - and I think David as<br/>\nwell - is based on the cause and nature of the dependency.<br/>\nFor the sake of argument, I&#39;ll try to redefine what you&#39;re<br/>\ncalling Hard and Soft along those lines.<br/>\n<br/>\nHard: Test A does something (sets state) upon which B depends.<br/>\nFor example, A may write to a data store and B might try to<br/>\nread the information back. Or A might create a complex object<br/>\nand B might try to call a method on that object. If we allow<br/>\nthis sort of thing, then there is no choice but to run A first<br/>\nand it makes sense to not run B at all if A fails. However,<br/>\nI would not want a unit test framework to allow it.<br/>\n<br/>\nSoft: Test A tests some functionality upon which some other<br/>\nfunctionality, tested by B, depends. Therefore, if test A<br/>\nfails, Test B will either fail as well or be inconclusive,<br/>\nso nothing further can be learned from test B. In this case,<br/>\na testing framework could respond in a number of ways to<br/>\nthe dependency:<br/>\n1) Run the tests in order, skipping B if A fails.<br/>\n2) Run the tests in an arbitrary order, but skip B if A<br/>\nalready ran and failed.<br/>\n3) Run the tests in an arbitrary order, not skipping any<br/>\nof them but organize reporting in such a way that a failure<br/>\nof A takes precedence over a failure of B.<br/>\n<br/>\nAs a framework author, I can see that allowing the user to<br/>\nspecify ordering is a simpler implementation. But I think<br/>\nit&#39;s more interesting to imagine the user specifying the<br/>\nnature of the dependencies and allowing the framework to<br/>\nfigure out a strategy.<br/>\n<br/>\nCharlie<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Every time we have discussed this potential feature for<br/>\n&gt; TestNG, the discussion ended up being non conclusive on the<br/>\n&gt; real interest and the existing ability to mark certain<br/>\n&gt; methods as &quot;alwaysRun&quot; already fills a big part of this<br/>\n&gt; scenario, so I always ended up punting on it, but I&#39;d be<br/>\n&gt; happy to hear if someone can come up with a good use case for<br/>\n&gt; soft dependencies...<br/>\n&gt;<br/>\n&gt; --<br/>\n&gt; ***Cédric<br/>\n&gt; *<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 22238, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1262125719", 
    "canDelete": false, 
    "nextInTopic": 22240, 
    "prevInTopic": 22233, 
    "headers": {
        "inReplyToHeader": "PDAyN2UwMWNhODQ1NyQzNmE4NDhlMCQ3MTAxYThjMEBmZXJyYXJpPg==", 
        "messageIdInHeader": "PDgxRkI0OTFFRUY1RUEzNEY5N0ZGNzA2QUMxQUIzNTYzMTRFNkQxMkM2RkBib3N0b24tbWFpbC5sYXZhc3Rvcm0ubG9jYWwuY29tPg==", 
        "referencesHeader": "PGI4NmI2YTljMDkxMjIzMjAzNXUzMzQ0NDZhYm8xZWQ3ZWJlZDZhZWVkNzBjQG1haWwuZ21haWwuY29tPiA8MDI3ZTAxY2E4NDU3JDM2YTg0OGUwJDcxMDFhOGMwQGZlcnJhcmk+"
    }
}