{
    "numMessagesInTopic": 38, 
    "nextInTime": 22257, 
    "senderId": "yuXT1FHQqOminCs3o8w1-9QizzH1bdxJxe16SCHCte04kOHMfOuNM2zfnKZeC6rdDn1izYZx0OF-VNm7Q-S6c-MRJNZFjIRPwA", 
    "systemMessage": false, 
    "subject": "Re: Order of execution for tests", 
    "from": "&quot;adrian.kuhn&quot; &lt;akuhn@...&gt;", 
    "authorName": "adrian.kuhn", 
    "msgSnippet": "... Based on personal feedback from promoting JExample the issue of overwhelming mass-failure of tests seems to be well known. People that confirm it to me ", 
    "msgId": 22256, 
    "profile": "adrian.kuhn", 
    "topicId": 22219, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 370478133, 
    "messageBody": "<div id=\"ygrps-yiv-226719002\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, Kent Beck &lt;kentb@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; How rare/cheap does this situation need to be before it isn&#39;t worth investing<br/>\n&gt; in the better answer? Put the other way, how frequent/expensive does this<br/>\n&gt; situation need to be before it is worth investing in the better answer?<br/>\n<br/>\n </span></blockquote>Based on personal feedback from promoting JExample the issue of &quot;overwhelming<br/>\n mass-failure of tests&quot; seems to be well known. People that confirm it to me<br/>\n are typically working in large teams and/or maintaining code written by<br/>\n others. Alas, I can offer anecdotical evidence only.<br/>\n<br/>\nFurthermore, I often hear that developers can (alas) not use JExample since it<br/>\n is an *invasive* solution. On the one hand this might just be a polite <br/>\n rebuffal to not hurt my feelings :) but on the other hand is seems reasonable <br/>\n that in large corporate projects adding a new external dependency is likely<br/>\n to need approval from project management, which again is typically denied for<br/>\n below-the-radar projects such as JExample. So exactly the kind of projects<br/>\n that are likely to suffer from overwhelming mass-failure are unable to move<br/>\n towards a solution---unless of course it were non-invasive. That is, either<br/>\n based on tool support only (using e.g. code coverage to detect dependencies)<br/>\n or being shipped as part of the regular JUnit distribution. (But even then,<br/>\n many corporate projects don&#39;t upgrade to newer versions of JUnit either.)<br/>\n<br/>\nSo my personal conclusion is that if you want adoption by the conservative<br/>\n Java community you&#39;d better write a non-invasive tool than a framework. All<br/>\n in all, as someone that knows both the Smalltalk and the Java community I<br/>\n cannot avoid noting that Jave is starting to get stuck in the same state of<br/>\n innovation inertia as Smalltalk. As a contrast consider the PHP community<br/>\n that picked up and integrated the ideas of JExample as soon as they learned of<br/>\n our XP paper! Or also, the Ruby community that releases and integrated novel<br/>\n and *awesome* testing frameworks every half year or so. Just think of RSpec,<br/>\n Cucumber, et cetera. But then, given that TextMate is your upper boundary for<br/>\n tools you&#39;ll naturally look for frameworks rather than tool support :) <br/>\n<br/>\n--AA</div>", 
    "prevInTime": 22255, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1262705655", 
    "canDelete": false, 
    "nextInTopic": 22257, 
    "prevInTopic": 22254, 
    "headers": {
        "inReplyToHeader": "PDVGRUU2MTRELTA2RDQtNEE0Ri1CMjUyLUY0QTdCMDY1QUZFQUBlYXJ0aGxpbmsubmV0Pg==", 
        "messageIdInHeader": "PGhodm01bitzc3EzQGVHcm91cHMuY29tPg=="
    }
}