{
    "numMessagesInTopic": 38, 
    "nextInTime": 22270, 
    "senderId": "QOfNawVyRjKFUjoWYhqjVJjr7xrAJtuVYoBt-grhH7Ac1NmVCwS3PHvOj9VVhUkMWPvk78TQSYVoW68EsBfeyTJL", 
    "systemMessage": false, 
    "subject": "Re: [junit] Order of execution for tests", 
    "from": "David Saff &lt;david@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "... Rocco, To add a datapoint, working now in a rather large software engineering organization, I ve found that knowing which tests fail, even with ", 
    "msgId": 22269, 
    "profile": "dsaff", 
    "topicId": 22219, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 341876227, 
    "messageBody": "<div id=\"ygrps-yiv-1962126811\">On Fri, Jan 8, 2010 at 1:41 PM, Pigneri, Rocco &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rpigneri@...\">rpigneri@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Dear Kent,<br/>\n&gt;<br/>\n&gt; I don’t think that I am actually the one to provide the answers.  I was simply providing a concrete example to James Lee’s regression situation (I was sorta drafted for it since I provided the 80-20 suggestion).  However, here’s a quick summary of where I see the real value-add for this feature: large enterprise customers who have large regression suites.  These are people who could use the dependencies to identify the cause of a regression failure and therefore pin-point the responsible party much more easily.  Also, since large companies usually have difficulty adopting new tools (i.e. politics, cost of training, etc.), they would benefit most from having this feature in JUnit itself rather than adopting a new tool.<br/>\n&gt;<br/>\n&gt; As a disclaimer, most of my corporate experience in is companies with fewer than 20 engineers: in these situations, you usually already know who to talk to ;-).  In fact, the example I gave isn’t even real; I just made it up!  However, I can speak from my limited experience to answer a few of these questions.  James, please provide your input as well since you have a more pressing “real-world” need.<br/>\n&gt;<br/>\n&gt; * What is the magnitude of the value? (That is, how long does it take to find the most-fundamental error when you have one test failing vs. when you have many?)<br/>\n&gt; * How many people would use dependencies?<br/>\n&gt;<br/>\n&gt; I would also add “What kind of people would use dependencies?”<br/>\n&gt;<br/>\n&gt; I think our target audience here are regression suite maintenance engineers in large corporations.  With lots of moving parts, lots of engineers, and a large regression suite, the value of dependencies is incredible as the tests allow for automated identification of the group/person most responsible for breaking the build/test run.  You could easily imagine that for a project with 500 engineers letting the computer send an e-mail to the most responsible party based on the tests that fail could greatly reduce maintenance overhead for the regression engineers for transient errors.  This feature would then free the maintenance engineers to focus on code that seems constantly out of whack.  Add in the fact that a company of that size may have trouble adopting a new tool to automat this process, and you see that this provides a lot of value to large, corporate customers.<br/>\n<br/>\n </span></blockquote>Rocco,<br/>\n<br/>\nTo add a datapoint, working now in a rather large software engineering<br/>\norganization, I&#39;ve found that knowing which tests fail, even with<br/>\nsophisticated analysis, is rarely sufficient to find the people who<br/>\nbroke the tests.  Around here, team A doesn&#39;t often submit code that<br/>\nbreaks team A&#39;s tests.  Team A fixes all of team A&#39;s tests _before_<br/>\nsubmitting, and then the submitted code breaks team B&#39;s tests.<br/>\n<br/>\n   David Saff<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; * What is the cost of creating the dependencies?<br/>\n&gt; * What is the cost of maintaining the dependencies?<br/>\n&gt; * What is the cost of teaching about dependencies?<br/>\n&gt;<br/>\n&gt; I feel that these are rather minimal.  Discovering a missing dependency would simply involve gaining extraneous information about a failure rather than a succinct report, possibly leading to a few false leads for fixers.  The only time this would be expensive would be for classes shared over a large portion of a software project.  I’m not certain how often this situation would occur.<br/>\n&gt;<br/>\n&gt; * What is the cost to people who don&#39;t use dependencies?<br/>\n&gt;<br/>\n&gt; I would say none since they can just ignore this functionality, but I feel like there’s a nuance to this question that I am missing.<br/>\n&gt;<br/>\n&gt; * Do the dependencies ever provide misleading results? How frequently? At what cost?<br/>\n&gt;<br/>\n&gt; I have punted this idea around a lot as well.  Assuming that the dependencies are, in fact, correctly set, the only problem that I foresee is that a single failure in a common class could mask a lot of other, unrelated errors under the 80-20 solution because *any* dependent test fixture would be skipped for a single failure in a dependency test fixture.  However, this is one of the trade-offs of marking dependencies on the fixture level rather than the method level.<br/>\n&gt;<br/>\n&gt; * What is the cost and opportunity cost of both the initial implementation of dependencies and the maintenance of the code? (This is primarily a concern for David and I as our implementation budget for JUnit is so tight, but the opportunity cost is a factor for everyone.)<br/>\n&gt;<br/>\n&gt; Well, I can’t really speak to this since I haven’t developed for JUnit before and since I can’t see myself needing this feature in the near future, but I do have the following suggestion.  Since this feature really benefits our large enterprise customers and since this feature is being suggested in order to allow our corporate customers to avoid adding a new tool, I suggest the following approach: let’s hash out a spec—I think we are reasonably close to one already, but I will defer, again, to those with more experience in larger enterprises—and then state that we will support/maintain this feature if someone else is willing to write it, write it and maintain it for a year, or meet some other criteria whereby this feature is an even trade for our community.  Since we are considering this feature more out of concerns for corporate needs rather than out of a technical philosophy, I think that it is only fair for “corporate” to drive this feature’s implementation and help out a bit in its maintenance.<br/>\n&gt;<br/>\n&gt; Just my two cents,<br/>\n&gt;<br/>\n&gt; Rocco<br/>\n&gt;<br/>\n&gt; From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>] On Behalf Of Kent Beck<br/>\n&gt; Sent: Wednesday, January 06, 2010 3:03 PM<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\n&gt; Subject: Re: [junit] Order of execution for tests<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Rocco,<br/>\n&gt;<br/>\n&gt; Thank you for the complete and carefully considered example. I think from it I can understand the value you would like to gain from expressing dependencies. My questions are:<br/>\n&gt; * How frequently does this value accrue?<br/>\n&gt; * What is the magnitude of the value? (That is, how long does it take to find the most-fundamental error when you have one test failing vs. when you have many?)<br/>\n&gt; * What is the cost of creating the dependencies?<br/>\n&gt; * What is the cost of maintaining the dependencies?<br/>\n&gt; * What is the cost of teaching about dependencies?<br/>\n&gt; * What is the cost to people who don&#39;t use dependencies?<br/>\n&gt; * How many people would use dependencies?<br/>\n&gt; * Do the dependencies ever provide misleading results? How frequently? At what cost?<br/>\n&gt; * What is the cost and opportunity cost of both the initial implementation of dependencies and the maintenance of the code? (This is primarily a concern for David and I as our implementation budget for JUnit is so tight, but the opportunity cost is a factor for everyone.)<br/>\n&gt;<br/>\n&gt; I don&#39;t necessarily expect &quot;the answers&quot; to these questions from you, but these are the things we&#39;re thinking about when we consider whether to implement any feature.<br/>\n&gt;<br/>\n&gt; Regards,<br/>\n&gt;<br/>\n&gt; Kent<br/>\n&gt;<br/>\n&gt; On Jan 6, 2010, at 9:47 AM, Pigneri, Rocco wrote:<br/>\n&gt;<br/>\n&gt;&gt; Dear Kent,<br/>\n&gt;&gt;<br/>\n&gt;&gt; Let’s say that you are building a reporting tool for a financial firm and that you have three major indices to manage: consumer spending, average national income, and average consumer debt load. The calculation and presentation of each of these indices is rather involved, especially given the amount of background material required for regulatory compliance, so you have a separate three-tier class structure for each index. Each index has a few “helper classes” that are shared among the three indices and also between the logic and data layers: consumer, consumer region (a group of consumers within a particular region), and some analysis classes. On top of the presentation layer for each tier, there is a single “reporter” class that collates the three index reports, provides some summary data, and personalizes the package for the individual recipients.<br/>\n&gt;&gt;<br/>\n&gt;&gt; So, if you imagine that each of these parts is implemented in a single class—I’ve found this organization to be pretty reasonable in the past—you would have a few classes: Consumer, ConsumerRegion, ConsumerAnalysis at the bottom, then a single class for each tier of each index (SpendingDataLayer, SpendingLogicLayer, SpendingPresentationLayer, IncomeDataLayer, etc.), and then a final Reporter class at the top. The logic layers may also call upon the analysis classes for certain common statistical functions. The data layers would, in addition to poking directly into the database, utilize the “helper classes” for some basic DB access. You could also imagine having a single test class for each of the above classes (also reasonable in my experience).<br/>\n&gt;&gt;<br/>\n&gt;&gt; In JUnit, then, you would say that the ReporterTestFixture depends upon the SpendingPresentationLayerTestFixture, the IncomePresentationLayerTestFixture, and the DebtLoadPresentationLayerTestFixture, let’s say via an Annotation on ReporterTestFixture. Each presentation layer would be marked to depend upon its logic layer. The logics would depend upon the datas, any additional helper classes, and finally the Analysis class. Finally, the data layers would be marked to depend upon any “helper classes” that they use.<br/>\n&gt;&gt;<br/>\n&gt;&gt; Under this schema, if any of the DebtLoadLogicLayer’s tests were to fail, the DebtLoadPresentationLayerTestFixture and the ReporterTestFixture would be skipped, and the DebtLoadLogicLayerTestFixture’s tests would be highlighted as since they failed. The ConsumerSpendingLogic and PresentaionLayerTestFixtures would be run along with their analogues in Income as they do not depend upon the DebtLoadLogicLayer and report any errors found as described above. As another example, if any of Consumer’s tests fail, then nearly the entire tree would be skipped (all of the n-tier code plus the Reporter), thus showing only a failure in Consumer and maybe a failure in some other helper classes. In other words, you very quickly find the lowest level class where a failure occurred before it can percolate up through your test suite. This would greatly simplify life when running regression suites as the class that caused the error (along with its developer, hopefully) is easy identifiable.<br/>\n&gt;&gt;<br/>\n&gt;&gt; The major value-add of this approach is that you get most of the benefits of dependency trees without the hassle of maintaining thousands of dependency links. The class relationships above are rarely going to change—in other words, if the logic layer stops depending upon the data layer, you’ve probably rearchitected the system and are already being careful about what you are doing—and the annotations are very easy to write. Also, due to the hierarchical nature of the dependencies, you do have a bit of a safety net: if a Logic Layer forgets to claim a helper class dependency, but that Logic Layer’s Data Layer does claim that dependency, then the Logic Layer’s tests are still skipped when the helper class fails.<br/>\n&gt;&gt;<br/>\n&gt;&gt; The biggest shortcoming of this approach involves situations where you have lots of classes that all depend upon one helper class: for example, if we had thirty indices, we would have to maintain thirty annotations for each helper class on each data layer, thus requiring more maintenance to track the dependency. Another negative is that a single failing test in your test fixture could skip over 95% of your tests since this information is stored on a class rather than method level. However, the maintenance costs are much lower, and the method dependencies could be added later if we are smart about our framework.<br/>\n&gt;&gt;<br/>\n&gt;&gt; How does that sound?<br/>\n&gt;&gt;<br/>\n&gt;&gt; Thank you,<br/>\n&gt;&gt;<br/>\n&gt;&gt; Rocco<br/>\n&gt;&gt;<br/>\n&gt;&gt; From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>&lt;mailto:junit%40yahoogroups.com&gt; [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>&lt;mailto:junit%40yahoogroups.com&gt;] On Behalf Of Kent Beck<br/>\n&gt;&gt; Sent: Tuesday, January 05, 2010 1:07 PM<br/>\n&gt;&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>&lt;mailto:junit%40yahoogroups.com&gt;<br/>\n&gt;&gt; Subject: Re: [junit] Order of execution for tests<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; Could you provide a concrete example so I&#39;m sure I understand what you&#39;re saying?<br/>\n&gt;&gt;<br/>\n&gt;&gt; Thanks,<br/>\n&gt;&gt;<br/>\n&gt;&gt; Kent<br/>\n&gt;&gt;<br/>\n&gt;&gt; On Jan 5, 2010, at 8:21 AM, Pigneri, Rocco wrote:<br/>\n&gt;&gt;<br/>\n&gt;&gt; &gt; Dear all,<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; An interesting 80-20 solution for this scenario could be something as simple as an attribute indicating that a test fixture depends upon the passing of all tests in another fixture. This would allow for failure scenarios to be on the scale of Cédric’s “10 tests failed” for James’s large regression suite without requiring a lot of effort from the user-developers. What makes this particularly nice in my mind is that you only have to change these dependencies when you rearchitect the system, thus making them rather light on the maintenance side.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; What do you all think?<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; Rocco<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>&lt;mailto:junit%40yahoogroups.com&gt;&lt;mailto:junit%40yahoogroups.com&gt; [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>&lt;mailto:junit%40yahoogroups.com&gt;&lt;mailto:junit%40yahoogroups.com&gt;] On Behalf Of James Lee<br/>\n&gt;&gt; &gt; Sent: Monday, January 04, 2010 3:43 PM<br/>\n&gt;&gt; &gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>&lt;mailto:junit%40yahoogroups.com&gt;&lt;mailto:junit%40yahoogroups.com&gt;<br/>\n&gt;&gt; &gt; Subject: Re: [junit] Order of execution for tests<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; Or in my case, something like this:<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; 1 test failed, 585 tests skipped (how it would have looked in a recent test<br/>\n&gt;&gt; &gt; run).<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; Our suite has well over 5000 tests and couple dozen developers all<br/>\n&gt;&gt; &gt; adding/changing in parallel.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; Luckily we use a continuous integration environment, so get a small set of<br/>\n&gt;&gt; &gt; changes for every run (run the tests every 2hrs). So it can usually be<br/>\n&gt;&gt; &gt; tracked down in 20-30m of work. But it would be almost instant if there was<br/>\n&gt;&gt; &gt; a &quot;core&quot; test that failed first. Or even if it wasn&#39;t perfect, like: 25<br/>\n&gt;&gt; &gt; tests failed, 585 tests skipped.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; Gets much worse when the folks watching the builds are busy, as it can fail<br/>\n&gt;&gt; &gt; for long enough to cloud the build history, as failure states start to<br/>\n&gt;&gt; &gt; overlap.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; Just throwing in the, &quot;Crazy large test suite&quot; perspective.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; Regards,<br/>\n&gt;&gt; &gt; James Lee<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; 2010/1/4 Cédric Beust ♔ &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cbeust@...\">cbeust@...</a>&lt;mailto:cbeust%40google.com&gt;&lt;mailto:cbeust%40google.com&gt;&lt;mailto:cbeust%40google.com&gt;&gt;<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; &gt;<br/>\n&gt;&gt; &gt; &gt;<br/>\n&gt;&gt; &gt; &gt; On Mon, Jan 4, 2010 at 11:25 AM, Charlie Poole<br/>\n&gt;&gt; &gt; &gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:charlie@...\">charlie@...</a>&lt;mailto:charlie%40pooleconsulting.com&gt;&lt;mailto:charlie%40pooleconsulting.com&gt;&lt;mailto:charlie%40pooleconsulting.com&gt; &lt;charlie%40pooleconsulting.com&gt;&gt;wrote:<br/>\n&gt;&gt; &gt; &gt;<br/>\n&gt;&gt; &gt; &gt; &gt; And yet, I get reports of other folks having this interpretation<br/>\n&gt;&gt; &gt; &gt; &gt; problem all the time. It may be that the problem lies in how they<br/>\n&gt;&gt; &gt; &gt; &gt; are doing their development.<br/>\n&gt;&gt; &gt; &gt; &gt;<br/>\n&gt;&gt; &gt; &gt;<br/>\n&gt;&gt; &gt; &gt; I don&#39;t think so, it&#39;s just that<br/>\n&gt;&gt; &gt; &gt;<br/>\n&gt;&gt; &gt; &gt; &quot;1 test failed, 9 tests skipped&quot;<br/>\n&gt;&gt; &gt; &gt;<br/>\n&gt;&gt; &gt; &gt; is much easier to read and diagnose than<br/>\n&gt;&gt; &gt; &gt;<br/>\n&gt;&gt; &gt; &gt; &quot;10 tests failed&quot;.<br/>\n&gt;&gt; &gt; &gt;<br/>\n&gt;&gt; &gt; &gt; --<br/>\n&gt;&gt; &gt; &gt; ***Cédric<br/>\n&gt;&gt; &gt; &gt; *<br/>\n&gt;&gt; &gt; &gt;<br/>\n&gt;&gt; &gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt;&gt; &gt; &gt;<br/>\n&gt;&gt; &gt; &gt;<br/>\n&gt;&gt; &gt; &gt;<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; [Non-text portions of this message have been removed]<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; [Non-text portions of this message have been removed]<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 22268, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1263050873", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 22268, 
    "headers": {
        "inReplyToHeader": "PDgxRkI0OTFFRUY1RUEzNEY5N0ZGNzA2QUMxQUIzNTYzMTRFNkUzMjg5NUBib3N0b24tbWFpbC5sYXZhc3Rvcm0ubG9jYWwuY29tPg==", 
        "messageIdInHeader": "PDRmN2RhNmI5MTAwMTA5MDcyN2w1ZWY3ZGU4MGpmZGU1ODY2Yjg2NThiYWNiQG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PEMwQThEMTBELTJDQjktNDBBNC1BQ0M2LTQyN0RCNkE1RDY2MEBlYXJ0aGxpbmsubmV0PgkgPDAwMzMwMWNhOGQ3MyRiZDI0MmFlMCQ2NDAxYThjMEBmZXJyYXJpPgkgPGI4NmI2YTljMTAwMTA0MTEyOHAzNTU4ZmUzN3ljYjdmNGZlYmM5YjUwOWEwQG1haWwuZ21haWwuY29tPgkgPDRkZDVhNDZjMTAwMTA0MTI0MnQ0ODMwZmM0Zmk0ZDk3ZDg3MWU2NWNiOWE2QG1haWwuZ21haWwuY29tPgkgPDgxRkI0OTFFRUY1RUEzNEY5N0ZGNzA2QUMxQUIzNTYzMTRFNkQxMzA0RUBib3N0b24tbWFpbC5sYXZhc3Rvcm0ubG9jYWwuY29tPgkgPDEwM0MxQzVFLTc5QjYtNEI0Ri05MEU3LTcyMThDOTYwMDY5MUBlYXJ0aGxpbmsubmV0PgkgPDgxRkI0OTFFRUY1RUEzNEY5N0ZGNzA2QUMxQUIzNTYzMTRFNkUzMjQ1NkBib3N0b24tbWFpbC5sYXZhc3Rvcm0ubG9jYWwuY29tPgkgPEIxMEVBODQxLUEzQzItNDcwNC1BQTIzLUIxOTMxNjE3MjA1Q0BlYXJ0aGxpbmsubmV0PgkgPDgxRkI0OTFFRUY1RUEzNEY5N0ZGNzA2QUMxQUIzNTYzMTRFNkUzMjg5NUBib3N0b24tbWFpbC5sYXZhc3Rvcm0ubG9jYWwuY29tPg=="
    }
}