{
    "numMessagesInTopic": 38, 
    "nextInTime": 22270, 
    "senderId": "5XKdbzo8iE-feroU7FpozlvOwTfNJ5_b9TsXLVzq8WNsPbt2ISPqe1HIqOb2Lvi83wYMhdmCpXUiHNAJaf2HeBDw", 
    "systemMessage": false, 
    "subject": "Re: [junit] Order of execution for tests", 
    "from": "David Saff &lt;david@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "... Rocco, To add a datapoint, working now in a rather large software engineering organization, I ve found that knowing which tests fail, even with ", 
    "msgId": 22269, 
    "rawEmail": "Return-Path: &lt;david.saff@...&gt;\r\nX-Sender: david.saff@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nX-Received: (qmail 77367 invoked from network); 9 Jan 2010 15:28:53 -0000\r\nX-Received: from unknown (98.137.34.46)\n  by m1.grp.sp2.yahoo.com with QMQP; 9 Jan 2010 15:28:53 -0000\r\nX-Received: from unknown (HELO mail-px0-f177.google.com) (209.85.216.177)\n  by mta3.grp.sp2.yahoo.com with SMTP; 9 Jan 2010 15:28:53 -0000\r\nX-Received: by pxi7 with SMTP id 7so15326868pxi.31\n        for &lt;junit@yahoogroups.com&gt;; Sat, 09 Jan 2010 07:27:53 -0800 (PST)\r\nMIME-Version: 1.0\r\nX-Received: by 10.141.107.14 with SMTP id j14mr6651186rvm.271.1263050873494; \n\tSat, 09 Jan 2010 07:27:53 -0800 (PST)\r\nIn-Reply-To: &lt;81FB491EEF5EA34F97FF706AC1AB356314E6E32895@...&gt;\r\nReferences: &lt;C0A8D10D-2CB9-40A4-ACC6-427DB6A5D660@...&gt;\n\t &lt;003301ca8d73$bd242ae0$6401a8c0@ferrari&gt;\n\t &lt;b86b6a9c1001041128p3558fe37ycb7f4febc9b509a0@...&gt;\n\t &lt;4dd5a46c1001041242t4830fc4fi4d97d871e65cb9a6@...&gt;\n\t &lt;81FB491EEF5EA34F97FF706AC1AB356314E6D1304E@...&gt;\n\t &lt;103C1C5E-79B6-4B4F-90E7-7218C9600691@...&gt;\n\t &lt;81FB491EEF5EA34F97FF706AC1AB356314E6E32456@...&gt;\n\t &lt;B10EA841-A3C2-4704-AA23-B1931617205C@...&gt;\n\t &lt;81FB491EEF5EA34F97FF706AC1AB356314E6E32895@...&gt;\r\nDate: Sat, 9 Jan 2010 10:27:53 -0500\r\nX-Google-Sender-Auth: 6afec370f2f2d67f\r\nMessage-ID: &lt;4f7da6b91001090727l5ef7de80jfde5866b8658bacb@...&gt;\r\nTo: junit@yahoogroups.com\r\nContent-Type: text/plain; charset=UTF-8\r\nContent-Transfer-Encoding: quoted-printable\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: David Saff &lt;david@...&gt;\r\nSubject: Re: [junit] Order of execution for tests\r\nX-Yahoo-Group-Post: member; u=341876227; y=d4b14pW4pcd5f6tsxzuwikSx3yAxKU2eIWSTr9TwCeI\r\nX-Yahoo-Profile: dsaff\r\n\r\nOn Fri, Jan 8, 2010 at 1:41 PM, Pigneri, Rocco &lt;rpigneri@...&gt; wrot=\r\ne:\n&gt; Dear Kent,\n&gt;\n&gt; I don=E2=80=99t think that I am actually the one to pro=\r\nvide the answers. =C2=A0I was simply providing a concrete example to James =\r\nLee=E2=80=99s regression situation (I was sorta drafted for it since I prov=\r\nided the 80-20 suggestion). =C2=A0However, here=E2=80=99s a quick summary o=\r\nf where I see the real value-add for this feature: large enterprise custome=\r\nrs who have large regression suites. =C2=A0These are people who could use t=\r\nhe dependencies to identify the cause of a regression failure and therefore=\r\n pin-point the responsible party much more easily. =C2=A0Also, since large =\r\ncompanies usually have difficulty adopting new tools (i.e. politics, cost o=\r\nf training, etc.), they would benefit most from having this feature in JUni=\r\nt itself rather than adopting a new tool.\n&gt;\n&gt; As a disclaimer, most of my c=\r\norporate experience in is companies with fewer than 20 engineers: in these =\r\nsituations, you usually already know who to talk to ;-). =C2=A0In fact, the=\r\n example I gave isn=E2=80=99t even real; I just made it up! =C2=A0However, =\r\nI can speak from my limited experience to answer a few of these questions. =\r\n=C2=A0James, please provide your input as well since you have a more pressi=\r\nng =E2=80=9Creal-world=E2=80=9D need.\n&gt;\n&gt; * What is the magnitude of the va=\r\nlue? (That is, how long does it take to find the most-fundamental error whe=\r\nn you have one test failing vs. when you have many?)\n&gt; * How many people wo=\r\nuld use dependencies?\n&gt;\n&gt; I would also add =E2=80=9CWhat kind of people wou=\r\nld use dependencies?=E2=80=9D\n&gt;\n&gt; I think our target audience here are regr=\r\nession suite maintenance engineers in large corporations. =C2=A0With lots o=\r\nf moving parts, lots of engineers, and a large regression suite, the value =\r\nof dependencies is incredible as the tests allow for automated identificati=\r\non of the group/person most responsible for breaking the build/test run. =\r\n=C2=A0You could easily imagine that for a project with 500 engineers lettin=\r\ng the computer send an e-mail to the most responsible party based on the te=\r\nsts that fail could greatly reduce maintenance overhead for the regression =\r\nengineers for transient errors. =C2=A0This feature would then free the main=\r\ntenance engineers to focus on code that seems constantly out of whack. =C2=\r\n=A0Add in the fact that a company of that size may have trouble adopting a =\r\nnew tool to automat this process, and you see that this provides a lot of v=\r\nalue to large, corporate customers.\n\nRocco,\n\nTo add a datapoint, working no=\r\nw in a rather large software engineering\norganization, I&#39;ve found that know=\r\ning which tests fail, even with\nsophisticated analysis, is rarely sufficien=\r\nt to find the people who\nbroke the tests.  Around here, team A doesn&#39;t ofte=\r\nn submit code that\nbreaks team A&#39;s tests.  Team A fixes all of team A&#39;s tes=\r\nts _before_\nsubmitting, and then the submitted code breaks team B&#39;s tests.\n=\r\n\n   David Saff\n\n&gt;\n&gt; * What is the cost of creating the dependencies?\n&gt; * Wh=\r\nat is the cost of maintaining the dependencies?\n&gt; * What is the cost of tea=\r\nching about dependencies?\n&gt;\n&gt; I feel that these are rather minimal. =C2=A0D=\r\niscovering a missing dependency would simply involve gaining extraneous inf=\r\normation about a failure rather than a succinct report, possibly leading to=\r\n a few false leads for fixers. =C2=A0The only time this would be expensive =\r\nwould be for classes shared over a large portion of a software project. =C2=\r\n=A0I=E2=80=99m not certain how often this situation would occur.\n&gt;\n&gt; * What=\r\n is the cost to people who don&#39;t use dependencies?\n&gt;\n&gt; I would say none sin=\r\nce they can just ignore this functionality, but I feel like there=E2=80=99s=\r\n a nuance to this question that I am missing.\n&gt;\n&gt; * Do the dependencies eve=\r\nr provide misleading results? How frequently? At what cost?\n&gt;\n&gt; I have punt=\r\ned this idea around a lot as well. =C2=A0Assuming that the dependencies are=\r\n, in fact, correctly set, the only problem that I foresee is that a single =\r\nfailure in a common class could mask a lot of other, unrelated errors under=\r\n the 80-20 solution because *any* dependent test fixture would be skipped f=\r\nor a single failure in a dependency test fixture. =C2=A0However, this is on=\r\ne of the trade-offs of marking dependencies on the fixture level rather tha=\r\nn the method level.\n&gt;\n&gt; * What is the cost and opportunity cost of both the=\r\n initial implementation of dependencies and the maintenance of the code? (T=\r\nhis is primarily a concern for David and I as our implementation budget for=\r\n JUnit is so tight, but the opportunity cost is a factor for everyone.)\n&gt;\n&gt;=\r\n Well, I can=E2=80=99t really speak to this since I haven=E2=80=99t develop=\r\ned for JUnit before and since I can=E2=80=99t see myself needing this featu=\r\nre in the near future, but I do have the following suggestion. =C2=A0Since =\r\nthis feature really benefits our large enterprise customers and since this =\r\nfeature is being suggested in order to allow our corporate customers to avo=\r\nid adding a new tool, I suggest the following approach: let=E2=80=99s hash =\r\nout a spec=E2=80=94I think we are reasonably close to one already, but I wi=\r\nll defer, again, to those with more experience in larger enterprises=E2=80=\r\n=94and then state that we will support/maintain this feature if someone els=\r\ne is willing to write it, write it and maintain it for a year, or meet some=\r\n other criteria whereby this feature is an even trade for our community. =\r\n=C2=A0Since we are considering this feature more out of concerns for corpor=\r\nate needs rather than out of a technical philosophy, I think that it is onl=\r\ny fair for =E2=80=9Ccorporate=E2=80=9D to drive this feature=E2=80=99s impl=\r\nementation and help out a bit in its maintenance.\n&gt;\n&gt; Just my two cents,\n&gt;\n=\r\n&gt; Rocco\n&gt;\n&gt; From: junit@yahoogroups.com [mailto:junit@yahoogroups.com] On B=\r\nehalf Of Kent Beck\n&gt; Sent: Wednesday, January 06, 2010 3:03 PM\n&gt; To: junit@=\r\nyahoogroups.com\n&gt; Subject: Re: [junit] Order of execution for tests\n&gt;\n&gt;\n&gt;\n&gt;=\r\n Rocco,\n&gt;\n&gt; Thank you for the complete and carefully considered example. I =\r\nthink from it I can understand the value you would like to gain from expres=\r\nsing dependencies. My questions are:\n&gt; * How frequently does this value acc=\r\nrue?\n&gt; * What is the magnitude of the value? (That is, how long does it tak=\r\ne to find the most-fundamental error when you have one test failing vs. whe=\r\nn you have many?)\n&gt; * What is the cost of creating the dependencies?\n&gt; * Wh=\r\nat is the cost of maintaining the dependencies?\n&gt; * What is the cost of tea=\r\nching about dependencies?\n&gt; * What is the cost to people who don&#39;t use depe=\r\nndencies?\n&gt; * How many people would use dependencies?\n&gt; * Do the dependenci=\r\nes ever provide misleading results? How frequently? At what cost?\n&gt; * What =\r\nis the cost and opportunity cost of both the initial implementation of depe=\r\nndencies and the maintenance of the code? (This is primarily a concern for =\r\nDavid and I as our implementation budget for JUnit is so tight, but the opp=\r\nortunity cost is a factor for everyone.)\n&gt;\n&gt; I don&#39;t necessarily expect &quot;th=\r\ne answers&quot; to these questions from you, but these are the things we&#39;re thin=\r\nking about when we consider whether to implement any feature.\n&gt;\n&gt; Regards,\n=\r\n&gt;\n&gt; Kent\n&gt;\n&gt; On Jan 6, 2010, at 9:47 AM, Pigneri, Rocco wrote:\n&gt;\n&gt;&gt; Dear Ke=\r\nnt,\n&gt;&gt;\n&gt;&gt; Let=E2=80=99s say that you are building a reporting tool for a fi=\r\nnancial firm and that you have three major indices to manage: consumer spen=\r\nding, average national income, and average consumer debt load. The calculat=\r\nion and presentation of each of these indices is rather involved, especiall=\r\ny given the amount of background material required for regulatory complianc=\r\ne, so you have a separate three-tier class structure for each index. Each i=\r\nndex has a few =E2=80=9Chelper classes=E2=80=9D that are shared among the t=\r\nhree indices and also between the logic and data layers: consumer, consumer=\r\n region (a group of consumers within a particular region), and some analysi=\r\ns classes. On top of the presentation layer for each tier, there is a singl=\r\ne =E2=80=9Creporter=E2=80=9D class that collates the three index reports, p=\r\nrovides some summary data, and personalizes the package for the individual =\r\nrecipients.\n&gt;&gt;\n&gt;&gt; So, if you imagine that each of these parts is implemente=\r\nd in a single class=E2=80=94I=E2=80=99ve found this organization to be pret=\r\nty reasonable in the past=E2=80=94you would have a few classes: Consumer, C=\r\nonsumerRegion, ConsumerAnalysis at the bottom, then a single class for each=\r\n tier of each index (SpendingDataLayer, SpendingLogicLayer, SpendingPresent=\r\nationLayer, IncomeDataLayer, etc.), and then a final Reporter class at the =\r\ntop. The logic layers may also call upon the analysis classes for certain c=\r\nommon statistical functions. The data layers would, in addition to poking d=\r\nirectly into the database, utilize the =E2=80=9Chelper classes=E2=80=9D for=\r\n some basic DB access. You could also imagine having a single test class fo=\r\nr each of the above classes (also reasonable in my experience).\n&gt;&gt;\n&gt;&gt; In JU=\r\nnit, then, you would say that the ReporterTestFixture depends upon the Spen=\r\ndingPresentationLayerTestFixture, the IncomePresentationLayerTestFixture, a=\r\nnd the DebtLoadPresentationLayerTestFixture, let=E2=80=99s say via an Annot=\r\nation on ReporterTestFixture. Each presentation layer would be marked to de=\r\npend upon its logic layer. The logics would depend upon the datas, any addi=\r\ntional helper classes, and finally the Analysis class. Finally, the data la=\r\nyers would be marked to depend upon any =E2=80=9Chelper classes=E2=80=9D th=\r\nat they use.\n&gt;&gt;\n&gt;&gt; Under this schema, if any of the DebtLoadLogicLayer=E2=\r\n=80=99s tests were to fail, the DebtLoadPresentationLayerTestFixture and th=\r\ne ReporterTestFixture would be skipped, and the DebtLoadLogicLayerTestFixtu=\r\nre=E2=80=99s tests would be highlighted as since they failed. The ConsumerS=\r\npendingLogic and PresentaionLayerTestFixtures would be run along with their=\r\n analogues in Income as they do not depend upon the DebtLoadLogicLayer and =\r\nreport any errors found as described above. As another example, if any of C=\r\nonsumer=E2=80=99s tests fail, then nearly the entire tree would be skipped =\r\n(all of the n-tier code plus the Reporter), thus showing only a failure in =\r\nConsumer and maybe a failure in some other helper classes. In other words, =\r\nyou very quickly find the lowest level class where a failure occurred befor=\r\ne it can percolate up through your test suite. This would greatly simplify =\r\nlife when running regression suites as the class that caused the error (alo=\r\nng with its developer, hopefully) is easy identifiable.\n&gt;&gt;\n&gt;&gt; The major val=\r\nue-add of this approach is that you get most of the benefits of dependency =\r\ntrees without the hassle of maintaining thousands of dependency links. The =\r\nclass relationships above are rarely going to change=E2=80=94in other words=\r\n, if the logic layer stops depending upon the data layer, you=E2=80=99ve pr=\r\nobably rearchitected the system and are already being careful about what yo=\r\nu are doing=E2=80=94and the annotations are very easy to write. Also, due t=\r\no the hierarchical nature of the dependencies, you do have a bit of a safet=\r\ny net: if a Logic Layer forgets to claim a helper class dependency, but tha=\r\nt Logic Layer=E2=80=99s Data Layer does claim that dependency, then the Log=\r\nic Layer=E2=80=99s tests are still skipped when the helper class fails.\n&gt;&gt;\n=\r\n&gt;&gt; The biggest shortcoming of this approach involves situations where you h=\r\nave lots of classes that all depend upon one helper class: for example, if =\r\nwe had thirty indices, we would have to maintain thirty annotations for eac=\r\nh helper class on each data layer, thus requiring more maintenance to track=\r\n the dependency. Another negative is that a single failing test in your tes=\r\nt fixture could skip over 95% of your tests since this information is store=\r\nd on a class rather than method level. However, the maintenance costs are m=\r\nuch lower, and the method dependencies could be added later if we are smart=\r\n about our framework.\n&gt;&gt;\n&gt;&gt; How does that sound?\n&gt;&gt;\n&gt;&gt; Thank you,\n&gt;&gt;\n&gt;&gt; Roc=\r\nco\n&gt;&gt;\n&gt;&gt; From: junit@yahoogroups.com&lt;mailto:junit%40yahoogroups.com&gt; [mailt=\r\no:junit@yahoogroups.com&lt;mailto:junit%40yahoogroups.com&gt;] On Behalf Of Kent =\r\nBeck\n&gt;&gt; Sent: Tuesday, January 05, 2010 1:07 PM\n&gt;&gt; To: junit@...=\r\nm&lt;mailto:junit%40yahoogroups.com&gt;\n&gt;&gt; Subject: Re: [junit] Order of executio=\r\nn for tests\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; Could you provide a concrete example so I&#39;m sure I =\r\nunderstand what you&#39;re saying?\n&gt;&gt;\n&gt;&gt; Thanks,\n&gt;&gt;\n&gt;&gt; Kent\n&gt;&gt;\n&gt;&gt; On Jan 5, 201=\r\n0, at 8:21 AM, Pigneri, Rocco wrote:\n&gt;&gt;\n&gt;&gt; &gt; Dear all,\n&gt;&gt; &gt;\n&gt;&gt; &gt; An interes=\r\nting 80-20 solution for this scenario could be something as simple as an at=\r\ntribute indicating that a test fixture depends upon the passing of all test=\r\ns in another fixture. This would allow for failure scenarios to be on the s=\r\ncale of C=C3=A9dric=E2=80=99s =E2=80=9C10 tests failed=E2=80=9D for James=\r\n=E2=80=99s large regression suite without requiring a lot of effort from th=\r\ne user-developers. What makes this particularly nice in my mind is that you=\r\n only have to change these dependencies when you rearchitect the system, th=\r\nus making them rather light on the maintenance side.\n&gt;&gt; &gt;\n&gt;&gt; &gt; What do you =\r\nall think?\n&gt;&gt; &gt;\n&gt;&gt; &gt; Rocco\n&gt;&gt; &gt;\n&gt;&gt; &gt; From: junit@yahoogroups.com&lt;mailto:jun=\r\nit%40yahoogroups.com&gt;&lt;mailto:junit%40yahoogroups.com&gt; [mailto:junit@yahoogr=\r\noups.com&lt;mailto:junit%40yahoogroups.com&gt;&lt;mailto:junit%40yahoogroups.com&gt;] O=\r\nn Behalf Of James Lee\n&gt;&gt; &gt; Sent: Monday, January 04, 2010 3:43 PM\n&gt;&gt; &gt; To: =\r\njunit@yahoogroups.com&lt;mailto:junit%40yahoogroups.com&gt;&lt;mailto:junit%40yahoog=\r\nroups.com&gt;\n&gt;&gt; &gt; Subject: Re: [junit] Order of execution for tests\n&gt;&gt; &gt;\n&gt;&gt; &gt;=\r\n\n&gt;&gt; &gt;\n&gt;&gt; &gt; Or in my case, something like this:\n&gt;&gt; &gt;\n&gt;&gt; &gt; 1 test failed, 585=\r\n tests skipped (how it would have looked in a recent test\n&gt;&gt; &gt; run).\n&gt;&gt; &gt;\n&gt;=\r\n&gt; &gt; Our suite has well over 5000 tests and couple dozen developers all\n&gt;&gt; &gt;=\r\n adding/changing in parallel.\n&gt;&gt; &gt;\n&gt;&gt; &gt; Luckily we use a continuous integra=\r\ntion environment, so get a small set of\n&gt;&gt; &gt; changes for every run (run the=\r\n tests every 2hrs). So it can usually be\n&gt;&gt; &gt; tracked down in 20-30m of wor=\r\nk. But it would be almost instant if there was\n&gt;&gt; &gt; a &quot;core&quot; test that fail=\r\ned first. Or even if it wasn&#39;t perfect, like: 25\n&gt;&gt; &gt; tests failed, 585 tes=\r\nts skipped.\n&gt;&gt; &gt;\n&gt;&gt; &gt; Gets much worse when the folks watching the builds ar=\r\ne busy, as it can fail\n&gt;&gt; &gt; for long enough to cloud the build history, as =\r\nfailure states start to\n&gt;&gt; &gt; overlap.\n&gt;&gt; &gt;\n&gt;&gt; &gt; Just throwing in the, &quot;Craz=\r\ny large test suite&quot; perspective.\n&gt;&gt; &gt;\n&gt;&gt; &gt; Regards,\n&gt;&gt; &gt; James Lee\n&gt;&gt; &gt;\n&gt;&gt; =\r\n&gt; 2010/1/4 C=C3=A9dric Beust =E2=99=94 &lt;cbeust@...&lt;mailto:cbeust%40g=\r\noogle.com&gt;&lt;mailto:cbeust%40google.com&gt;&lt;mailto:cbeust%40google.com&gt;&gt;\n&gt;&gt; &gt;\n&gt;&gt;=\r\n &gt; &gt;\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt; On Mon, Jan 4, 2010 at 11:25 AM, Charlie Poole\n&gt;&gt; &gt; &gt; &lt;c=\r\nharlie@...&lt;mailto:charlie%40pooleconsulting.com&gt;&lt;mailto:cha=\r\nrlie%40pooleconsulting.com&gt;&lt;mailto:charlie%40pooleconsulting.com&gt; &lt;charlie%=\r\n40pooleconsulting.com&gt;&gt;wrote:\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &gt; And yet, I get reports of oth=\r\ner folks having this interpretation\n&gt;&gt; &gt; &gt; &gt; problem all the time. It may b=\r\ne that the problem lies in how they\n&gt;&gt; &gt; &gt; &gt; are doing their development.\n&gt;=\r\n&gt; &gt; &gt; &gt;\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt; I don&#39;t think so, it&#39;s just that\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &quot;1 tes=\r\nt failed, 9 tests skipped&quot;\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt; is much easier to read and diagnos=\r\ne than\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt; &quot;10 tests failed&quot;.\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt; --\n&gt;&gt; &gt; &gt; ***C=C3=A9d=\r\nric\n&gt;&gt; &gt; &gt; *\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt; [Non-text portions of this message have been rem=\r\noved]\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt; [Non-text portions of this message hav=\r\ne been removed]\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt; &gt; [Non-text portions of this message have been=\r\n removed]\n&gt;&gt; &gt;\n&gt;&gt; &gt;\n&gt;&gt;\n&gt;&gt; [Non-text portions of this message have been remo=\r\nved]\n&gt;&gt;\n&gt;&gt;\n&gt;&gt; [Non-text portions of this message have been removed]\n&gt;&gt;\n&gt;&gt;\n&gt;=\r\n\n&gt; [Non-text portions of this message have been removed]\n&gt;\n&gt;\n&gt;\n&gt; [Non-text =\r\nportions of this message have been removed]\n&gt;\n&gt;\n&gt;\n&gt; -----------------------=\r\n-------------\n&gt;\n&gt; Yahoo! Groups Links\n&gt;\n&gt;\n&gt;\n&gt;\n\n", 
    "profile": "dsaff", 
    "topicId": 22219, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 341876227, 
    "prevInTime": 22268, 
    "contentTrasformed": false, 
    "postDate": "1263050873", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 22268, 
    "headers": {
        "inReplyToHeader": "PDgxRkI0OTFFRUY1RUEzNEY5N0ZGNzA2QUMxQUIzNTYzMTRFNkUzMjg5NUBib3N0b24tbWFpbC5sYXZhc3Rvcm0ubG9jYWwuY29tPg==", 
        "messageIdInHeader": "PDRmN2RhNmI5MTAwMTA5MDcyN2w1ZWY3ZGU4MGpmZGU1ODY2Yjg2NThiYWNiQG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PEMwQThEMTBELTJDQjktNDBBNC1BQ0M2LTQyN0RCNkE1RDY2MEBlYXJ0aGxpbmsubmV0PgkgPDAwMzMwMWNhOGQ3MyRiZDI0MmFlMCQ2NDAxYThjMEBmZXJyYXJpPgkgPGI4NmI2YTljMTAwMTA0MTEyOHAzNTU4ZmUzN3ljYjdmNGZlYmM5YjUwOWEwQG1haWwuZ21haWwuY29tPgkgPDRkZDVhNDZjMTAwMTA0MTI0MnQ0ODMwZmM0Zmk0ZDk3ZDg3MWU2NWNiOWE2QG1haWwuZ21haWwuY29tPgkgPDgxRkI0OTFFRUY1RUEzNEY5N0ZGNzA2QUMxQUIzNTYzMTRFNkQxMzA0RUBib3N0b24tbWFpbC5sYXZhc3Rvcm0ubG9jYWwuY29tPgkgPDEwM0MxQzVFLTc5QjYtNEI0Ri05MEU3LTcyMThDOTYwMDY5MUBlYXJ0aGxpbmsubmV0PgkgPDgxRkI0OTFFRUY1RUEzNEY5N0ZGNzA2QUMxQUIzNTYzMTRFNkUzMjQ1NkBib3N0b24tbWFpbC5sYXZhc3Rvcm0ubG9jYWwuY29tPgkgPEIxMEVBODQxLUEzQzItNDcwNC1BQTIzLUIxOTMxNjE3MjA1Q0BlYXJ0aGxpbmsubmV0PgkgPDgxRkI0OTFFRUY1RUEzNEY5N0ZGNzA2QUMxQUIzNTYzMTRFNkUzMjg5NUBib3N0b24tbWFpbC5sYXZhc3Rvcm0ubG9jYWwuY29tPg=="
    }
}