{
    "numMessagesInTopic": 38, 
    "nextInTime": 22267, 
    "senderId": "L_LLuCvvVwTujVLCAP1pV9arhjzlKTw_QRNlsLExkn1Anvtq2Cs2TEpuAd21HdLgbbG8hQG-8vJTaFTTb5bEvY0cfX3FOA", 
    "systemMessage": false, 
    "subject": "Re: [junit] Order of execution for tests", 
    "from": "Kent Beck &lt;kentb@...&gt;", 
    "authorName": "Kent Beck", 
    "msgSnippet": "Rocco, Thank you for the complete and carefully considered example. I think from it I can understand the value you would like to gain from expressing", 
    "msgId": 22266, 
    "profile": "kentlbeck", 
    "topicId": 22219, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 173198504, 
    "messageBody": "<div id=\"ygrps-yiv-1514547332\">Rocco,<br/>\n<br/>\nThank you for the complete and carefully considered example. I think from it I can understand the value you would like to gain from expressing dependencies. My questions are:<br/>\n  * How frequently does this value accrue?<br/>\n  * What is the magnitude of the value? (That is, how long does it take to find the most-fundamental error when you have one test failing vs. when you have many?)<br/>\n  * What is the cost of creating the dependencies?<br/>\n  * What is the cost of maintaining the dependencies?<br/>\n  * What is the cost of teaching about dependencies?<br/>\n  * What is the cost to people who don&#39;t use dependencies?<br/>\n  * How many people would use dependencies?<br/>\n  * Do the dependencies ever provide misleading results? How frequently? At what cost?<br/>\n  * What is the cost and opportunity cost of both the initial implementation of dependencies and the maintenance of the code? (This is primarily a concern for David and I as our implementation budget for JUnit is so tight, but the opportunity cost is a factor for everyone.)<br/>\n<br/>\nI don&#39;t necessarily expect &quot;the answers&quot; to these questions from you, but these are the things we&#39;re thinking about when we consider whether to implement any feature.<br/>\n<br/>\nRegards,<br/>\n<br/>\nKent<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jan 6, 2010, at 9:47 AM, Pigneri, Rocco wrote:<br/>\n<br/>\n&gt; Dear Kent, <br/>\n&gt; <br/>\n&gt; Let’s say that you are building a reporting tool for a financial firm and that you have three major indices to manage: consumer spending, average national income, and average consumer debt load. The calculation and presentation of each of these indices is rather involved, especially given the amount of background material required for regulatory compliance, so you have a separate three-tier class structure for each index. Each index has a few “helper classes” that are shared among the three indices and also between the logic and data layers: consumer, consumer region (a group of consumers within a particular region), and some analysis classes. On top of the presentation layer for each tier, there is a single “reporter” class that collates the three index reports, provides some summary data, and personalizes the package for the individual recipients. <br/>\n&gt; <br/>\n&gt; So, if you imagine that each of these parts is implemented in a single class—I’ve found this organization to be pretty reasonable in the past—you would have a few classes: Consumer, ConsumerRegion, ConsumerAnalysis at the bottom, then a single class for each tier of each index (SpendingDataLayer, SpendingLogicLayer, SpendingPresentationLayer, IncomeDataLayer, etc.), and then a final Reporter class at the top. The logic layers may also call upon the analysis classes for certain common statistical functions. The data layers would, in addition to poking directly into the database, utilize the “helper classes” for some basic DB access. You could also imagine having a single test class for each of the above classes (also reasonable in my experience). <br/>\n&gt; <br/>\n&gt; In JUnit, then, you would say that the ReporterTestFixture depends upon the SpendingPresentationLayerTestFixture, the IncomePresentationLayerTestFixture, and the DebtLoadPresentationLayerTestFixture, let’s say via an Annotation on ReporterTestFixture. Each presentation layer would be marked to depend upon its logic layer. The logics would depend upon the datas, any additional helper classes, and finally the Analysis class. Finally, the data layers would be marked to depend upon any “helper classes” that they use. <br/>\n&gt; <br/>\n&gt; Under this schema, if any of the DebtLoadLogicLayer’s tests were to fail, the DebtLoadPresentationLayerTestFixture and the ReporterTestFixture would be skipped, and the DebtLoadLogicLayerTestFixture’s tests would be highlighted as since they failed. The ConsumerSpendingLogic and PresentaionLayerTestFixtures would be run along with their analogues in Income as they do not depend upon the DebtLoadLogicLayer and report any errors found as described above. As another example, if any of Consumer’s tests fail, then nearly the entire tree would be skipped (all of the n-tier code plus the Reporter), thus showing only a failure in Consumer and maybe a failure in some other helper classes. In other words, you very quickly find the lowest level class where a failure occurred before it can percolate up through your test suite. This would greatly simplify life when running regression suites as the class that caused the error (along with its developer, hopefully) is easy identifiable. <br/>\n&gt; <br/>\n&gt; The major value-add of this approach is that you get most of the benefits of dependency trees without the hassle of maintaining thousands of dependency links. The class relationships above are rarely going to change—in other words, if the logic layer stops depending upon the data layer, you’ve probably rearchitected the system and are already being careful about what you are doing—and the annotations are very easy to write. Also, due to the hierarchical nature of the dependencies, you do have a bit of a safety net: if a Logic Layer forgets to claim a helper class dependency, but that Logic Layer’s Data Layer does claim that dependency, then the Logic Layer’s tests are still skipped when the helper class fails. <br/>\n&gt; <br/>\n&gt; The biggest shortcoming of this approach involves situations where you have lots of classes that all depend upon one helper class: for example, if we had thirty indices, we would have to maintain thirty annotations for each helper class on each data layer, thus requiring more maintenance to track the dependency. Another negative is that a single failing test in your test fixture could skip over 95% of your tests since this information is stored on a class rather than method level. However, the maintenance costs are much lower, and the method dependencies could be added later if we are smart about our framework. <br/>\n&gt; <br/>\n&gt; How does that sound? <br/>\n&gt; <br/>\n&gt; Thank you, <br/>\n&gt; <br/>\n&gt; Rocco <br/>\n&gt; <br/>\n&gt; From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>] On Behalf Of Kent Beck <br/>\n&gt; Sent: Tuesday, January 05, 2010 1:07 PM <br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> <br/>\n&gt; Subject: Re: [junit] Order of execution for tests <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Could you provide a concrete example so I&#39;m sure I understand what you&#39;re saying? <br/>\n&gt; <br/>\n&gt; Thanks, <br/>\n&gt; <br/>\n&gt; Kent <br/>\n&gt; <br/>\n&gt; On Jan 5, 2010, at 8:21 AM, Pigneri, Rocco wrote: <br/>\n&gt; <br/>\n&gt; &gt; Dear all, <br/>\n&gt; &gt; <br/>\n&gt; &gt; An interesting 80-20 solution for this scenario could be something as simple as an attribute indicating that a test fixture depends upon the passing of all tests in another fixture. This would allow for failure scenarios to be on the scale of Cédric’s “10 tests failed” for James’s large regression suite without requiring a lot of effort from the user-developers. What makes this particularly nice in my mind is that you only have to change these dependencies when you rearchitect the system, thus making them rather light on the maintenance side. <br/>\n&gt; &gt; <br/>\n&gt; &gt; What do you all think? <br/>\n&gt; &gt; <br/>\n&gt; &gt; Rocco <br/>\n&gt; &gt; <br/>\n&gt; &gt; From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>&lt;mailto:junit%40yahoogroups.com&gt; [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>&lt;mailto:junit%40yahoogroups.com&gt;] On Behalf Of James Lee <br/>\n&gt; &gt; Sent: Monday, January 04, 2010 3:43 PM <br/>\n&gt; &gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>&lt;mailto:junit%40yahoogroups.com&gt; <br/>\n&gt; &gt; Subject: Re: [junit] Order of execution for tests <br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; Or in my case, something like this: <br/>\n&gt; &gt; <br/>\n&gt; &gt; 1 test failed, 585 tests skipped (how it would have looked in a recent test <br/>\n&gt; &gt; run). <br/>\n&gt; &gt; <br/>\n&gt; &gt; Our suite has well over 5000 tests and couple dozen developers all <br/>\n&gt; &gt; adding/changing in parallel. <br/>\n&gt; &gt; <br/>\n&gt; &gt; Luckily we use a continuous integration environment, so get a small set of <br/>\n&gt; &gt; changes for every run (run the tests every 2hrs). So it can usually be <br/>\n&gt; &gt; tracked down in 20-30m of work. But it would be almost instant if there was <br/>\n&gt; &gt; a &quot;core&quot; test that failed first. Or even if it wasn&#39;t perfect, like: 25 <br/>\n&gt; &gt; tests failed, 585 tests skipped. <br/>\n&gt; &gt; <br/>\n&gt; &gt; Gets much worse when the folks watching the builds are busy, as it can fail <br/>\n&gt; &gt; for long enough to cloud the build history, as failure states start to <br/>\n&gt; &gt; overlap. <br/>\n&gt; &gt; <br/>\n&gt; &gt; Just throwing in the, &quot;Crazy large test suite&quot; perspective. <br/>\n&gt; &gt; <br/>\n&gt; &gt; Regards, <br/>\n&gt; &gt; James Lee <br/>\n&gt; &gt; <br/>\n&gt; &gt; 2010/1/4 Cédric Beust ♔ &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cbeust@...\">cbeust@...</a>&lt;mailto:cbeust%40google.com&gt;&lt;mailto:cbeust%40google.com&gt;&gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; &gt; <br/>\n&gt; &gt; &gt; <br/>\n&gt; &gt; &gt; On Mon, Jan 4, 2010 at 11:25 AM, Charlie Poole <br/>\n&gt; &gt; &gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:charlie@...\">charlie@...</a>&lt;mailto:charlie%40pooleconsulting.com&gt;&lt;mailto:charlie%40pooleconsulting.com&gt; &lt;charlie%40pooleconsulting.com&gt;&gt;wrote: <br/>\n&gt; &gt; &gt; <br/>\n&gt; &gt; &gt; &gt; And yet, I get reports of other folks having this interpretation <br/>\n&gt; &gt; &gt; &gt; problem all the time. It may be that the problem lies in how they <br/>\n&gt; &gt; &gt; &gt; are doing their development. <br/>\n&gt; &gt; &gt; &gt; <br/>\n&gt; &gt; &gt; <br/>\n&gt; &gt; &gt; I don&#39;t think so, it&#39;s just that <br/>\n&gt; &gt; &gt; <br/>\n&gt; &gt; &gt; &quot;1 test failed, 9 tests skipped&quot; <br/>\n&gt; &gt; &gt; <br/>\n&gt; &gt; &gt; is much easier to read and diagnose than <br/>\n&gt; &gt; &gt; <br/>\n&gt; &gt; &gt; &quot;10 tests failed&quot;. <br/>\n&gt; &gt; &gt; <br/>\n&gt; &gt; &gt; -- <br/>\n&gt; &gt; &gt; ***Cédric <br/>\n&gt; &gt; &gt; * <br/>\n&gt; &gt; &gt; <br/>\n&gt; &gt; &gt; [Non-text portions of this message have been removed] <br/>\n&gt; &gt; &gt; <br/>\n&gt; &gt; &gt; <br/>\n&gt; &gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; [Non-text portions of this message have been removed] <br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; [Non-text portions of this message have been removed] <br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 22265, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1262808172", 
    "canDelete": false, 
    "nextInTopic": 22267, 
    "prevInTopic": 22265, 
    "headers": {
        "inReplyToHeader": "PDgxRkI0OTFFRUY1RUEzNEY5N0ZGNzA2QUMxQUIzNTYzMTRFNkUzMjQ1NkBib3N0b24tbWFpbC5sYXZhc3Rvcm0ubG9jYWwuY29tPg==", 
        "messageIdInHeader": "PEIxMEVBODQxLUEzQzItNDcwNC1BQTIzLUIxOTMxNjE3MjA1Q0BlYXJ0aGxpbmsubmV0Pg==", 
        "referencesHeader": "PEMwQThEMTBELTJDQjktNDBBNC1BQ0M2LTQyN0RCNkE1RDY2MEBlYXJ0aGxpbmsubmV0PiA8MDAzMzAxY2E4ZDczJGJkMjQyYWUwJDY0MDFhOGMwQGZlcnJhcmk+IDxiODZiNmE5YzEwMDEwNDExMjhwMzU1OGZlMzd5Y2I3ZjRmZWJjOWI1MDlhMEBtYWlsLmdtYWlsLmNvbT4gPDRkZDVhNDZjMTAwMTA0MTI0MnQ0ODMwZmM0Zmk0ZDk3ZDg3MWU2NWNiOWE2QG1haWwuZ21haWwuY29tPiA8ODFGQjQ5MUVFRjVFQTM0Rjk3RkY3MDZBQzFBQjM1NjMxNEU2RDEzMDRFQGJvc3Rvbi1tYWlsLmxhdmFzdG9ybS5sb2NhbC5jb20+IDwxMDNDMUM1RS03OUI2LTRCNEYtOTBFNy03MjE4Qzk2MDA2OTFAZWFydGhsaW5rLm5ldD4gPDgxRkI0OTFFRUY1RUEzNEY5N0ZGNzA2QUMxQUIzNTYzMTRFNkUzMjQ1NkBib3N0b24tbWFpbC5sYXZhc3Rvcm0ubG9jYWwuY29tPg=="
    }
}