{
    "numMessagesInTopic": 38, 
    "nextInTime": 22269, 
    "senderId": "vSF0K06ZDrLa2AsE0e8VrDox5CO4io2vw1xRS9mrr1OzhPHKDP0hEfhIWHkQX5wSK5DBaCf6VkM7dU-rYJrsUohDXYwtWQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Order of execution for tests", 
    "from": "Kent Beck &lt;kentb@...&gt;", 
    "authorName": "Kent Beck", 
    "msgSnippet": "Rocco, I appreciate your persistence in following this thread. It gives me a chance to articulate our philosophy with JUnit in a way that we haven t before. (I", 
    "msgId": 22268, 
    "rawEmail": "Return-Path: &lt;kentb@...&gt;\r\nX-Sender: kentb@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nX-Received: (qmail 88738 invoked from network); 8 Jan 2010 22:37:44 -0000\r\nX-Received: from unknown (66.196.94.105)\n  by m3.grp.sp2.yahoo.com with QMQP; 8 Jan 2010 22:37:44 -0000\r\nX-Received: from unknown (HELO elasmtp-galgo.atl.sa.earthlink.net) (209.86.89.61)\n  by mta1.grp.re1.yahoo.com with SMTP; 8 Jan 2010 22:37:44 -0000\r\nX-Received: from [67.42.49.27] (helo=[192.168.0.79])\n\tby elasmtp-galgo.atl.sa.earthlink.net with esmtpa (Exim 4.67)\n\t(envelope-from &lt;kentb@...&gt;)\n\tid 1NTNSh-0002bV-4R\n\tfor junit@yahoogroups.com; Fri, 08 Jan 2010 17:37:44 -0500\r\nMime-Version: 1.0 (Apple Message framework v1077)\r\nDate: Fri, 8 Jan 2010 14:37:41 -0800\r\nIn-Reply-To: &lt;81FB491EEF5EA34F97FF706AC1AB356314E6E32895@...&gt;\r\nTo: junit@yahoogroups.com\r\nReferences: &lt;C0A8D10D-2CB9-40A4-ACC6-427DB6A5D660@...&gt; &lt;003301ca8d73$bd242ae0$6401a8c0@ferrari&gt; &lt;b86b6a9c1001041128p3558fe37ycb7f4febc9b509a0@...&gt; &lt;4dd5a46c1001041242t4830fc4fi4d97d871e65cb9a6@...&gt; &lt;81FB491EEF5EA34F97FF706AC1AB356314E6D1304E@...&gt; &lt;103C1C5E-79B6-4B4F-90E7-7218C9600691@...&gt; &lt;81FB491EEF5EA34F97FF706AC1AB356314E6E32456@...&gt; &lt;B10EA841-A3C2-4704-AA23-B1931617205C@...&gt; &lt;81FB491EEF5EA34F97FF706AC1AB356314E6E32895@...&gt;\r\nMessage-Id: &lt;97E025D4-C1A6-4320-BB0E-470B006B4001@...&gt;\r\nX-Mailer: Apple Mail (2.1077)\r\nX-ELNK-Trace: 6d780abf06d998e474bf435c0eb9d4785b720774340403657c9f360e64e77ebde646e1f67744f1f2350badd9bab72f9c350badd9bab72f9c350badd9bab72f9c\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Kent Beck &lt;kentb@...&gt;\r\nSubject: Re: [junit] Order of execution for tests\r\nX-Yahoo-Group-Post: member; u=173198504; y=LDdWDZmhFCNHoCafvZ51gcRbTcpXuwtl_lgfQL-iuuzuH3Da\r\nX-Yahoo-Profile: kentlbeck\r\nContent-Type: text/plain; charset=UTF-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nRocco,\n\nI appreciate your persistence in following this thread. It gives me=\r\n a chance to articulate our philosophy with JUnit in a way that we haven&#39;t =\r\nbefore. (I should say &quot;I haven&#39;t&quot;, as I haven&#39;t run this past Saff).\n\nIf th=\r\ne story below is the reason to add dependencies, we won&#39;t do it. Our missio=\r\nn is to lower the barriers for developers wanting to take responsibility fo=\r\nr the quality of their work by writing tests. We focus on that to the exclu=\r\nsion of all else.\n\nThat&#39;s not to say that dependencies are a bad idea or th=\r\nat the needs of &quot;regression engineers&quot; (new concept for me) are unimportant=\r\n, it&#39;s just that JUnit.org is not focused in that direction.\n\nIf you asked =\r\nme to put my Three Rivers Consulting, Inc. hat on, this sounds like an inte=\r\nresting product idea. But that&#39;s a whole different set of negotiations.\n\nRe=\r\ngards,\n\nKent\n\nOn Jan 8, 2010, at 10:41 AM, Pigneri, Rocco wrote:\n\n&gt; Dear Ke=\r\nnt, \n&gt; \n&gt; I don=E2=80=99t think that I am actually the one to provide the a=\r\nnswers. I was simply providing a concrete example to James Lee=E2=80=99s re=\r\ngression situation (I was sorta drafted for it since I provided the 80-20 s=\r\nuggestion). However, here=E2=80=99s a quick summary of where I see the real=\r\n value-add for this feature: large enterprise customers who have large regr=\r\nession suites. These are people who could use the dependencies to identify =\r\nthe cause of a regression failure and therefore pin-point the responsible p=\r\narty much more easily. Also, since large companies usually have difficulty =\r\nadopting new tools (i.e. politics, cost of training, etc.), they would bene=\r\nfit most from having this feature in JUnit itself rather than adopting a ne=\r\nw tool. \n&gt; \n&gt; As a disclaimer, most of my corporate experience in is compan=\r\nies with fewer than 20 engineers: in these situations, you usually already =\r\nknow who to talk to ;-). In fact, the example I gave isn=E2=80=99t even rea=\r\nl; I just made it up! However, I can speak from my limited experience to an=\r\nswer a few of these questions. James, please provide your input as well sin=\r\nce you have a more pressing =E2=80=9Creal-world=E2=80=9D need. \n&gt; \n&gt; * What=\r\n is the magnitude of the value? (That is, how long does it take to find the=\r\n most-fundamental error when you have one test failing vs. when you have ma=\r\nny?) \n&gt; * How many people would use dependencies? \n&gt; \n&gt; I would also add =\r\n=E2=80=9CWhat kind of people would use dependencies?=E2=80=9D \n&gt; \n&gt; I think=\r\n our target audience here are regression suite maintenance engineers in lar=\r\nge corporations. With lots of moving parts, lots of engineers, and a large =\r\nregression suite, the value of dependencies is incredible as the tests allo=\r\nw for automated identification of the group/person most responsible for bre=\r\naking the build/test run. You could easily imagine that for a project with =\r\n500 engineers letting the computer send an e-mail to the most responsible p=\r\narty based on the tests that fail could greatly reduce maintenance overhead=\r\n for the regression engineers for transient errors. This feature would then=\r\n free the maintenance engineers to focus on code that seems constantly out =\r\nof whack. Add in the fact that a company of that size may have trouble adop=\r\nting a new tool to automat this process, and you see that this provides a l=\r\not of value to large, corporate customers. \n&gt; \n&gt; * What is the cost of crea=\r\nting the dependencies? \n&gt; * What is the cost of maintaining the dependencie=\r\ns? \n&gt; * What is the cost of teaching about dependencies? \n&gt; \n&gt; I feel that =\r\nthese are rather minimal. Discovering a missing dependency would simply inv=\r\nolve gaining extraneous information about a failure rather than a succinct =\r\nreport, possibly leading to a few false leads for fixers. The only time thi=\r\ns would be expensive would be for classes shared over a large portion of a =\r\nsoftware project. I=E2=80=99m not certain how often this situation would oc=\r\ncur. \n&gt; \n&gt; * What is the cost to people who don&#39;t use dependencies? \n&gt; \n&gt; I=\r\n would say none since they can just ignore this functionality, but I feel l=\r\nike there=E2=80=99s a nuance to this question that I am missing. \n&gt; \n&gt; * Do=\r\n the dependencies ever provide misleading results? How frequently? At what =\r\ncost? \n&gt; \n&gt; I have punted this idea around a lot as well. Assuming that the=\r\n dependencies are, in fact, correctly set, the only problem that I foresee =\r\nis that a single failure in a common class could mask a lot of other, unrel=\r\nated errors under the 80-20 solution because *any* dependent test fixture w=\r\nould be skipped for a single failure in a dependency test fixture. However,=\r\n this is one of the trade-offs of marking dependencies on the fixture level=\r\n rather than the method level. \n&gt; \n&gt; * What is the cost and opportunity cos=\r\nt of both the initial implementation of dependencies and the maintenance of=\r\n the code? (This is primarily a concern for David and I as our implementati=\r\non budget for JUnit is so tight, but the opportunity cost is a factor for e=\r\nveryone.) \n&gt; \n&gt; Well, I can=E2=80=99t really speak to this since I haven=E2=\r\n=80=99t developed for JUnit before and since I can=E2=80=99t see myself nee=\r\nding this feature in the near future, but I do have the following suggestio=\r\nn. Since this feature really benefits our large enterprise customers and si=\r\nnce this feature is being suggested in order to allow our corporate custome=\r\nrs to avoid adding a new tool, I suggest the following approach: let=E2=80=\r\n=99s hash out a spec=E2=80=94I think we are reasonably close to one already=\r\n, but I will defer, again, to those with more experience in larger enterpri=\r\nses=E2=80=94and then state that we will support/maintain this feature if so=\r\nmeone else is willing to write it, write it and maintain it for a year, or =\r\nmeet some other criteria whereby this feature is an even trade for our comm=\r\nunity. Since we are considering this feature more out of concerns for corpo=\r\nrate needs rather than out of a technical philosophy, I think that it is on=\r\nly fair for =E2=80=9Ccorporate=E2=80=9D to drive this feature=E2=80=99s imp=\r\nlementation and help out a bit in its maintenance. \n&gt; \n&gt; Just my two cents,=\r\n \n&gt; \n&gt; Rocco \n&gt; \n&gt; From: junit@yahoogroups.com [mailto:junit@...=\r\nm] On Behalf Of Kent Beck \n&gt; Sent: Wednesday, January 06, 2010 3:03 PM \n&gt; T=\r\no: junit@yahoogroups.com \n&gt; Subject: Re: [junit] Order of execution for tes=\r\nts \n&gt; \n&gt; \n&gt; \n&gt; Rocco, \n&gt; \n&gt; Thank you for the complete and carefully consid=\r\nered example. I think from it I can understand the value you would like to =\r\ngain from expressing dependencies. My questions are: \n&gt; * How frequently do=\r\nes this value accrue? \n&gt; * What is the magnitude of the value? (That is, ho=\r\nw long does it take to find the most-fundamental error when you have one te=\r\nst failing vs. when you have many?) \n&gt; * What is the cost of creating the d=\r\nependencies? \n&gt; * What is the cost of maintaining the dependencies? \n&gt; * Wh=\r\nat is the cost of teaching about dependencies? \n&gt; * What is the cost to peo=\r\nple who don&#39;t use dependencies? \n&gt; * How many people would use dependencies=\r\n? \n&gt; * Do the dependencies ever provide misleading results? How frequently?=\r\n At what cost? \n&gt; * What is the cost and opportunity cost of both the initi=\r\nal implementation of dependencies and the maintenance of the code? (This is=\r\n primarily a concern for David and I as our implementation budget for JUnit=\r\n is so tight, but the opportunity cost is a factor for everyone.) \n&gt; \n&gt; I d=\r\non&#39;t necessarily expect &quot;the answers&quot; to these questions from you, but thes=\r\ne are the things we&#39;re thinking about when we consider whether to implement=\r\n any feature. \n&gt; \n&gt; Regards, \n&gt; \n&gt; Kent \n&gt; \n&gt; On Jan 6, 2010, at 9:47 AM, P=\r\nigneri, Rocco wrote: \n&gt; \n&gt; &gt; Dear Kent, \n&gt; &gt; \n&gt; &gt; Let=E2=80=99s say that yo=\r\nu are building a reporting tool for a financial firm and that you have thre=\r\ne major indices to manage: consumer spending, average national income, and =\r\naverage consumer debt load. The calculation and presentation of each of the=\r\nse indices is rather involved, especially given the amount of background ma=\r\nterial required for regulatory compliance, so you have a separate three-tie=\r\nr class structure for each index. Each index has a few =E2=80=9Chelper clas=\r\nses=E2=80=9D that are shared among the three indices and also between the l=\r\nogic and data layers: consumer, consumer region (a group of consumers withi=\r\nn a particular region), and some analysis classes. On top of the presentati=\r\non layer for each tier, there is a single =E2=80=9Creporter=E2=80=9D class =\r\nthat collates the three index reports, provides some summary data, and pers=\r\nonalizes the package for the individual recipients. \n&gt; &gt; \n&gt; &gt; So, if you im=\r\nagine that each of these parts is implemented in a single class=E2=80=94I=\r\n=E2=80=99ve found this organization to be pretty reasonable in the past=E2=\r\n=80=94you would have a few classes: Consumer, ConsumerRegion, ConsumerAnaly=\r\nsis at the bottom, then a single class for each tier of each index (Spendin=\r\ngDataLayer, SpendingLogicLayer, SpendingPresentationLayer, IncomeDataLayer,=\r\n etc.), and then a final Reporter class at the top. The logic layers may al=\r\nso call upon the analysis classes for certain common statistical functions.=\r\n The data layers would, in addition to poking directly into the database, u=\r\ntilize the =E2=80=9Chelper classes=E2=80=9D for some basic DB access. You c=\r\nould also imagine having a single test class for each of the above classes =\r\n(also reasonable in my experience). \n&gt; &gt; \n&gt; &gt; In JUnit, then, you would say=\r\n that the ReporterTestFixture depends upon the SpendingPresentationLayerTes=\r\ntFixture, the IncomePresentationLayerTestFixture, and the DebtLoadPresentat=\r\nionLayerTestFixture, let=E2=80=99s say via an Annotation on ReporterTestFix=\r\nture. Each presentation layer would be marked to depend upon its logic laye=\r\nr. The logics would depend upon the datas, any additional helper classes, a=\r\nnd finally the Analysis class. Finally, the data layers would be marked to =\r\ndepend upon any =E2=80=9Chelper classes=E2=80=9D that they use. \n&gt; &gt; \n&gt; &gt; U=\r\nnder this schema, if any of the DebtLoadLogicLayer=E2=80=99s tests were to =\r\nfail, the DebtLoadPresentationLayerTestFixture and the ReporterTestFixture =\r\nwould be skipped, and the DebtLoadLogicLayerTestFixture=E2=80=99s tests wou=\r\nld be highlighted as since they failed. The ConsumerSpendingLogic and Prese=\r\nntaionLayerTestFixtures would be run along with their analogues in Income a=\r\ns they do not depend upon the DebtLoadLogicLayer and report any errors foun=\r\nd as described above. As another example, if any of Consumer=E2=80=99s test=\r\ns fail, then nearly the entire tree would be skipped (all of the n-tier cod=\r\ne plus the Reporter), thus showing only a failure in Consumer and maybe a f=\r\nailure in some other helper classes. In other words, you very quickly find =\r\nthe lowest level class where a failure occurred before it can percolate up =\r\nthrough your test suite. This would greatly simplify life when running regr=\r\nession suites as the class that caused the error (along with its developer,=\r\n hopefully) is easy identifiable. \n&gt; &gt; \n&gt; &gt; The major value-add of this app=\r\nroach is that you get most of the benefits of dependency trees without the =\r\nhassle of maintaining thousands of dependency links. The class relationship=\r\ns above are rarely going to change=E2=80=94in other words, if the logic lay=\r\ner stops depending upon the data layer, you=E2=80=99ve probably rearchitect=\r\ned the system and are already being careful about what you are doing=E2=80=\r\n=94and the annotations are very easy to write. Also, due to the hierarchica=\r\nl nature of the dependencies, you do have a bit of a safety net: if a Logic=\r\n Layer forgets to claim a helper class dependency, but that Logic Layer=E2=\r\n=80=99s Data Layer does claim that dependency, then the Logic Layer=E2=80=\r\n=99s tests are still skipped when the helper class fails. \n&gt; &gt; \n&gt; &gt; The big=\r\ngest shortcoming of this approach involves situations where you have lots o=\r\nf classes that all depend upon one helper class: for example, if we had thi=\r\nrty indices, we would have to maintain thirty annotations for each helper c=\r\nlass on each data layer, thus requiring more maintenance to track the depen=\r\ndency. Another negative is that a single failing test in your test fixture =\r\ncould skip over 95% of your tests since this information is stored on a cla=\r\nss rather than method level. However, the maintenance costs are much lower,=\r\n and the method dependencies could be added later if we are smart about our=\r\n framework. \n&gt; &gt; \n&gt; &gt; How does that sound? \n&gt; &gt; \n&gt; &gt; Thank you, \n&gt; &gt; \n&gt; &gt; R=\r\nocco \n&gt; &gt; \n&gt; &gt; From: junit@yahoogroups.com&lt;mailto:junit%40yahoogroups.com&gt; =\r\n[mailto:junit@yahoogroups.com&lt;mailto:junit%40yahoogroups.com&gt;] On Behalf Of=\r\n Kent Beck \n&gt; &gt; Sent: Tuesday, January 05, 2010 1:07 PM \n&gt; &gt; To: junit@yaho=\r\nogroups.com&lt;mailto:junit%40yahoogroups.com&gt; \n&gt; &gt; Subject: Re: [junit] Order=\r\n of execution for tests \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Could you provide a concrete ex=\r\nample so I&#39;m sure I understand what you&#39;re saying? \n&gt; &gt; \n&gt; &gt; Thanks, \n&gt; &gt; \n=\r\n&gt; &gt; Kent \n&gt; &gt; \n&gt; &gt; On Jan 5, 2010, at 8:21 AM, Pigneri, Rocco wrote: \n&gt; &gt; \n=\r\n&gt; &gt; &gt; Dear all, \n&gt; &gt; &gt; \n&gt; &gt; &gt; An interesting 80-20 solution for this scenar=\r\nio could be something as simple as an attribute indicating that a test fixt=\r\nure depends upon the passing of all tests in another fixture. This would al=\r\nlow for failure scenarios to be on the scale of C=C3=A9dric=E2=80=99s =E2=\r\n=80=9C10 tests failed=E2=80=9D for James=E2=80=99s large regression suite w=\r\nithout requiring a lot of effort from the user-developers. What makes this =\r\nparticularly nice in my mind is that you only have to change these dependen=\r\ncies when you rearchitect the system, thus making them rather light on the =\r\nmaintenance side. \n&gt; &gt; &gt; \n&gt; &gt; &gt; What do you all think? \n&gt; &gt; &gt; \n&gt; &gt; &gt; Rocco =\r\n\n&gt; &gt; &gt; \n&gt; &gt; &gt; From: junit@yahoogroups.com&lt;mailto:junit%40yahoogroups.com&gt;&lt;m=\r\nailto:junit%40yahoogroups.com&gt; [mailto:junit@yahoogroups.com&lt;mailto:junit%4=\r\n0yahoogroups.com&gt;&lt;mailto:junit%40yahoogroups.com&gt;] On Behalf Of James Lee \n=\r\n&gt; &gt; &gt; Sent: Monday, January 04, 2010 3:43 PM \n&gt; &gt; &gt; To: junit@yahoogroups.c=\r\nom&lt;mailto:junit%40yahoogroups.com&gt;&lt;mailto:junit%40yahoogroups.com&gt; \n&gt; &gt; &gt; S=\r\nubject: Re: [junit] Order of execution for tests \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; =\r\n&gt; Or in my case, something like this: \n&gt; &gt; &gt; \n&gt; &gt; &gt; 1 test failed, 585 test=\r\ns skipped (how it would have looked in a recent test \n&gt; &gt; &gt; run). \n&gt; &gt; &gt; \n&gt;=\r\n &gt; &gt; Our suite has well over 5000 tests and couple dozen developers all \n&gt; =\r\n&gt; &gt; adding/changing in parallel. \n&gt; &gt; &gt; \n&gt; &gt; &gt; Luckily we use a continuous =\r\nintegration environment, so get a small set of \n&gt; &gt; &gt; changes for every run=\r\n (run the tests every 2hrs). So it can usually be \n&gt; &gt; &gt; tracked down in 20=\r\n-30m of work. But it would be almost instant if there was \n&gt; &gt; &gt; a &quot;core&quot; t=\r\nest that failed first. Or even if it wasn&#39;t perfect, like: 25 \n&gt; &gt; &gt; tests =\r\nfailed, 585 tests skipped. \n&gt; &gt; &gt; \n&gt; &gt; &gt; Gets much worse when the folks wat=\r\nching the builds are busy, as it can fail \n&gt; &gt; &gt; for long enough to cloud t=\r\nhe build history, as failure states start to \n&gt; &gt; &gt; overlap. \n&gt; &gt; &gt; \n&gt; &gt; &gt; =\r\nJust throwing in the, &quot;Crazy large test suite&quot; perspective. \n&gt; &gt; &gt; \n&gt; &gt; &gt; R=\r\negards, \n&gt; &gt; &gt; James Lee \n&gt; &gt; &gt; \n&gt; &gt; &gt; 2010/1/4 C=C3=A9dric Beust =E2=99=94=\r\n &lt;cbeust@...&lt;mailto:cbeust%40google.com&gt;&lt;mailto:cbeust%40google.com&gt;=\r\n&lt;mailto:cbeust%40google.com&gt;&gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; On Mon, Jan=\r\n 4, 2010 at 11:25 AM, Charlie Poole \n&gt; &gt; &gt; &gt; &lt;charlie@...&lt;m=\r\nailto:charlie%40pooleconsulting.com&gt;&lt;mailto:charlie%40pooleconsulting.com&gt;&lt;=\r\nmailto:charlie%40pooleconsulting.com&gt; &lt;charlie%40pooleconsulting.com&gt;&gt;wrote=\r\n: \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &gt; And yet, I get reports of other folks having this int=\r\nerpretation \n&gt; &gt; &gt; &gt; &gt; problem all the time. It may be that the problem lie=\r\ns in how they \n&gt; &gt; &gt; &gt; &gt; are doing their development. \n&gt; &gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n=\r\n&gt; &gt; &gt; &gt; I don&#39;t think so, it&#39;s just that \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &quot;1 test failed, =\r\n9 tests skipped&quot; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; is much easier to read and diagnose than=\r\n \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; &quot;10 tests failed&quot;. \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; -- \n&gt; &gt; &gt; &gt; ***C=C3=\r\n=A9dric \n&gt; &gt; &gt; &gt; * \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; [Non-text portions of this message hav=\r\ne been removed] \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; [Non-text portions=\r\n of this message have been removed] \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt; [Non-text portions=\r\n of this message have been removed] \n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; \n&gt; &gt; [Non-text porti=\r\nons of this message have been removed] \n&gt; &gt; \n&gt; &gt; \n&gt; &gt; [Non-text portions of=\r\n this message have been removed] \n&gt; &gt; \n&gt; &gt; \n&gt; \n&gt; [Non-text portions of this=\r\n message have been removed] \n&gt; \n&gt; \n&gt; [Non-text portions of this message hav=\r\ne been removed]\n&gt; \n&gt; \n\n\n\n[Non-text portions of this message have been remov=\r\ned]\n\n\n", 
    "profile": "kentlbeck", 
    "topicId": 22219, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 173198504, 
    "prevInTime": 22267, 
    "contentTrasformed": false, 
    "postDate": "1262990261", 
    "canDelete": false, 
    "nextInTopic": 22269, 
    "prevInTopic": 22267, 
    "headers": {
        "inReplyToHeader": "PDgxRkI0OTFFRUY1RUEzNEY5N0ZGNzA2QUMxQUIzNTYzMTRFNkUzMjg5NUBib3N0b24tbWFpbC5sYXZhc3Rvcm0ubG9jYWwuY29tPg==", 
        "messageIdInHeader": "PDk3RTAyNUQ0LUMxQTYtNDMyMC1CQjBFLTQ3MEIwMDZCNDAwMUBlYXJ0aGxpbmsubmV0Pg==", 
        "referencesHeader": "PEMwQThEMTBELTJDQjktNDBBNC1BQ0M2LTQyN0RCNkE1RDY2MEBlYXJ0aGxpbmsubmV0PiA8MDAzMzAxY2E4ZDczJGJkMjQyYWUwJDY0MDFhOGMwQGZlcnJhcmk+IDxiODZiNmE5YzEwMDEwNDExMjhwMzU1OGZlMzd5Y2I3ZjRmZWJjOWI1MDlhMEBtYWlsLmdtYWlsLmNvbT4gPDRkZDVhNDZjMTAwMTA0MTI0MnQ0ODMwZmM0Zmk0ZDk3ZDg3MWU2NWNiOWE2QG1haWwuZ21haWwuY29tPiA8ODFGQjQ5MUVFRjVFQTM0Rjk3RkY3MDZBQzFBQjM1NjMxNEU2RDEzMDRFQGJvc3Rvbi1tYWlsLmxhdmFzdG9ybS5sb2NhbC5jb20+IDwxMDNDMUM1RS03OUI2LTRCNEYtOTBFNy03MjE4Qzk2MDA2OTFAZWFydGhsaW5rLm5ldD4gPDgxRkI0OTFFRUY1RUEzNEY5N0ZGNzA2QUMxQUIzNTYzMTRFNkUzMjQ1NkBib3N0b24tbWFpbC5sYXZhc3Rvcm0ubG9jYWwuY29tPiA8QjEwRUE4NDEtQTNDMi00NzA0LUFBMjMtQjE5MzE2MTcyMDVDQGVhcnRobGluay5uZXQ+IDw4MUZCNDkxRUVGNUVBMzRGOTdGRjcwNkFDMUFCMzU2MzE0RTZFMzI4OTVAYm9zdG9uLW1haWwubGF2YXN0b3JtLmxvY2FsLmNvbT4="
    }
}