{
    "numMessagesInTopic": 3, 
    "nextInTime": 22283, 
    "senderId": "aBMgR1zredpLXQiI2BkkXiqoOSDDxLgArM9QRcNVDMyNOlBXGOjgB0To3_w_GeXFKwz9hx8ifwcHk8LBjADuHoQDrC91RyyWNq2QDgxRl0I", 
    "systemMessage": false, 
    "subject": "Re: detect if junit is running", 
    "from": "&quot;yme0987654321&quot; &lt;yme0987654321@...&gt;", 
    "authorName": "yme0987654321", 
    "msgSnippet": "There are many ways to handle this. The most standard is to use a different helper under test than in production (that share a common interface or base", 
    "msgId": 22282, 
    "profile": "yme0987654321", 
    "topicId": 22278, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 386557907, 
    "messageBody": "<div id=\"ygrps-yiv-1397983982\">There are many ways to handle this. The most &quot;standard&quot; is to use a different helper under test than in production (that share a common interface or base class) that behave differently as required.<br/>\n<br/>\nAnother is to use a Dependency Injection framework (such as Guice or Spring) to insert the right one in production vs. testing.<br/>\n<br/>\nA more offbeat way, which is generally more around configuration than the way you describe (starting background threads) is a system property. For example we use it to make sure no actual customers get e-mails during QA tests against copies of production data.<br/>\n<br/>\nIf you want to be (in my view) really ugly, you could just analyze the call stack and look for any junit classes via Thread.currentThread().getStackTrace().<br/>\n<br/>\nThose last two should really be a last resort because basically, from a TDD perspective, this requirement to run sometimes with the background thread and sometimes without is driving the design to abstract your database helper. Don&#39;t fight that, listen to what the test is telling you (unless of course you have a specific reason to know better).<br/>\n<br/>\nYishai<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;iltrex76&quot; &lt;albmarchi@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; In my code, I would need to do something like <br/>\n&gt; <br/>\n&gt; if (CodeISNotRunningInJUnit()) { <br/>\n&gt;     //do some operations that must not be executed if tests are running <br/>\n&gt; } <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; reason is that the database helper class used by application and junit tests does some background operations that must NOT be executed while running junit tests. <br/>\n&gt; <br/>\n&gt; is there a way to implement the method CodeISNotRunningInJUnit() ? <br/>\n&gt; <br/>\n&gt; thank you <br/>\n&gt;  « Return to Thread: detect if junit is runnin<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 22281, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1263506794", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 22279, 
    "headers": {
        "inReplyToHeader": "PGhpazVzbCtvY2o1QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGhpbzRoYSttYms4QGVHcm91cHMuY29tPg=="
    }
}