{
    "numMessagesInTopic": 2, 
    "nextInTime": 22304, 
    "senderId": "LlJUn5nG0g2exSDTWXLuSysI_X2K2VHUINnrwVWEtDSL3Y_l0mnlyg14p-pqL-d0onFHq36Eg62vWFvFTioIPHlk9r3bZOK4ZaY", 
    "systemMessage": false, 
    "subject": "how to get test class from Runner?", 
    "from": "Bill Shannon &lt;Bill.Shannon@...&gt;", 
    "authorName": "Bill Shannon", 
    "msgSnippet": "I ve discovered that my ClassLoaderSuite that loads each test class in its own ClassLoader also needs to set the thread s context class loader before running", 
    "msgId": 22303, 
    "profile": "bs00011", 
    "topicId": 22303, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 65283932, 
    "messageBody": "<div id=\"ygrps-yiv-931547818\">I&#39;ve discovered that my ClassLoaderSuite that loads each test class in its<br/>\nown ClassLoader also needs to set the thread&#39;s context class loader before<br/>\nrunning the test, and restore it after running the test.  If I override the<br/>\nrunChild method, how do I find the test class (so I can find its ClassLoader)?<br/>\nThe javadocs say that runChild runs &quot;the test corresponding to child&quot;, but<br/>\n&quot;child&quot; isn&#39;t a parameter.  I assume it means the test corresponding to<br/>\n&quot;runner&quot;, but I don&#39;t see how to get from &quot;runner&quot; to the test class.<br/>\n<br/>\nDo I need to implement my own Runner, and thus my own RunnerBuilder?<br/>\nI&#39;m not sure how to connect all these pieces together.<br/>\n<br/>\nI suppose I could create a delegating RunnerBuilder to wrap the one<br/>\nI&#39;m given, and have it replace the Runners with delegating Runners<br/>\nthat can also remember the class that the Runner was created for,<br/>\nbut is there a better way?<br/>\n<br/>\nIf I assume the runner is always going to be a ParentRunner, I can use<br/>\nparent.getTestClass().getJavaClass() to get what I want.  But how safe<br/>\nis it to assume that the runner will always be a ParentRunner?</div>", 
    "prevInTime": 22302, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1264020243", 
    "canDelete": false, 
    "nextInTopic": 22308, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDRCNTc2QjEzLjEwNDAzMDhAc3VuLmNvbT4="
    }
}