{
    "numMessagesInTopic": 8, 
    "nextInTime": 22316, 
    "senderId": "J-a1q9N8-mya8_AVLoFBM-00xrhEwb7PPOAc75a1046oK23sl4j4pF5oidRjsvVAVfDX14QwWX1IS-Mig5Cn9arHQMrxGA", 
    "systemMessage": false, 
    "subject": "Re: [junit] Why must test methods return void?", 
    "from": "Kent Beck &lt;kentb@...&gt;", 
    "authorName": "Kent Beck", 
    "msgSnippet": "The initial design was a historical artifact. The little code snippets I used as tests didn t have a return value, so the tests didn t have a return value. I", 
    "msgId": 22315, 
    "profile": "kentlbeck", 
    "topicId": 22312, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 173198504, 
    "messageBody": "<div id=\"ygrps-yiv-1055866468\">The initial design was a historical artifact. The little code snippets I used as tests didn&#39;t have a return value, so the tests didn&#39;t have a return value. I never found a compelling reason to add a return value, although I&#39;ve seen frameworks that relied heavily on return values from tests.<br/>\n<br/>\nWhat I wonder is if we should relax the constraint that tests cannot return a value. In the olden days it made sense because you didn&#39;t want someone to just happen to name a method &quot;test...&quot; and have it accidentally run as a test. With @Test, this risk disappears.<br/>\n<br/>\nI think this would be a trivial change internally to JUnit. I&#39;m not sure how many external tools have the &quot;void only&quot; assumption baked in and how many rely on JUnit for validation.<br/>\n<br/>\nRegards,<br/>\n<br/>\nKent<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jan 22, 2010, at 10:17 AM, dmcg123 wrote:<br/>\n<br/>\n&gt; After over 10 years of using JUnit, it has only just struck me that test methods must return void, but why?<br/>\n&gt; <br/>\n&gt; I&#39;ve just come across an example where a particular test did a lot of work, and I wanted to piggy-back on its final state by calling the method from another test. Is there any fundamental reason for not allowing me to return values? It might even be an opportunity to write an annotation expressing constraints about the value returned.<br/>\n&gt; <br/>\n&gt; Cheers<br/>\n&gt; <br/>\n&gt; Duncan McGregor<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 22314, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1264190690", 
    "canDelete": false, 
    "nextInTopic": 22316, 
    "prevInTopic": 22314, 
    "headers": {
        "inReplyToHeader": "PGhqY3E0NitvZHB2QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDAxQjQyMEEzLTZENzctNEQ1NC05Q0VFLTA5Mzc3QTdEQjBBN0BlYXJ0aGxpbmsubmV0Pg==", 
        "referencesHeader": "PGhqY3E0NitvZHB2QGVHcm91cHMuY29tPg=="
    }
}