{
    "numMessagesInTopic": 5, 
    "nextInTime": 22339, 
    "senderId": "zWeMfJVEtmRSb5F-b1JUKWifq4bksE8XvvBfl7gP2vYixRmNiWwOCrYMj8Y9I6s6xdwFGZR8TBHmHbySS7CAhYBb-cSdO8MQMYHcw_czibKRK4GkEY-u", 
    "systemMessage": false, 
    "subject": "Understanding the JUnit Annotations", 
    "from": "&quot;Loritsch, Berin C.&quot; &lt;berin.loritsch@...&gt;", 
    "authorName": "Loritsch, Berin C.", 
    "msgSnippet": "Some of the annotations are pretty well understood and map directly to JUnit 3 concepts, so I ll just keep them here for completeness: *\t@Test - run this", 
    "msgId": 22338, 
    "profile": "bloritsch", 
    "topicId": 22338, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 428096731, 
    "messageBody": "<div id=\"ygrps-yiv-1832465137\">Some of the annotations are pretty well understood and map directly to<br/>\nJUnit 3 concepts, so I&#39;ll just keep them here for completeness:<br/>\n<br/>\n*\t@Test - run this method as a test<br/>\n*\t@Ignore - do not run this test for now<br/>\n*\t@Before - set up data for the next test<br/>\n*\t@After - tear down data for the next test<br/>\n*\t@BeforeClass - set up supporting classes for this suite of tests<br/>\n*\t@AfterClass - tear down supporting classes for this suite of<br/>\ntests<br/>\n<br/>\nAfter that is a whole bunch of annotations that are quite new to me and<br/>\nI&#39;m trying to understand when, where, and how to use them:<br/>\n<br/>\n*\t@Rule - Mark a test attribute that extends MethodRule to affect<br/>\nthe test outcome (more advanced verifications)<br/>\n*\t@Category - Mark tests or test classes as belonging to a<br/>\ncategory, which is used with specific test suites.  Not sure how this<br/>\nworks when you are invoking the tests through a build system.  For<br/>\nexample, turn off slow tests until we do integration etc.  At least it<br/>\nis marked.<br/>\n*\t@RunWith(Runner.class) - Run a test suite with a particular<br/>\nrunner.  Enables other things like theories to work<br/>\n<br/>\nTheories: thanks for the blog entry, it helps.  Are these meant to<br/>\nverify an algorithm with several datapoints?  If not, what other uses<br/>\nwere they designed for?<br/>\n*\t@DataPoint - used with theories, marks a test attribute as data<br/>\nto pass in to parameterized tests<br/>\n*\t@DataPoints - used with theories, marks a test attribute that is<br/>\na collection as data to pass in to parameterized tests?  Pure guess<br/>\nhere.<br/>\n*\t@ParametersSuppliedBy(ParameterSupplier.class) - used with<br/>\ntheories, maps datapoints to the theory tests?  Pure guess here.<br/>\n*\t@Theory - marks a parameterized test that is executed several<br/>\ntimes to include all applicable combinations of datapoints<br/>\n*\t@TestedOn - not sure about its applicability.<br/>\n<br/>\nParameterized: run tests with a list of parameters.  The List of<br/>\nparameters is specified by the @Parameters method.<br/>\n<br/>\nSuites: run a suite of tests.  The set of classes is marked by<br/>\n@SuiteClasses.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 22337, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1265047634", 
    "canDelete": false, 
    "nextInTopic": 22342, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDc1RjVFRDhBNUE1NTM2NDZBNDZFMDBFNkVDODU0RkEzMDQzNzlFOTBAdmFmZjAxLW1haWwwMS5hZC5nZC1haXMuY29tPg=="
    }
}