{
    "numMessagesInTopic": 10, 
    "nextInTime": 22389, 
    "senderId": "9KlfspboJcfthgGEs50-xF_3S6aMx8cTC0VJg78wB_LA-2_duGcieuCqCZTyoqew2Y7qm2BYDwJVqWjox8PaF4wctcRA6c4caM8", 
    "systemMessage": false, 
    "subject": "Something is bothering me about assumptions", 
    "from": "&quot;Berin&quot; &lt;berin.loritsch@...&gt;", 
    "authorName": "Berin", 
    "msgSnippet": "I ve seen in a few places that if an assumption fails, the test automatically passes.  I then ran into the test case that confirms that action.  Coming from", 
    "msgId": 22388, 
    "profile": "bloritsch", 
    "topicId": 22388, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 428096731, 
    "messageBody": "<div id=\"ygrps-yiv-79939171\">I&#39;ve seen in a few places that if an assumption fails, the test automatically passes.  I then ran into the test case that confirms that action.  Coming from the aspect that I want to have confidence that my code and tests are functioning properly, I honestly think that is the wrong action.<br/>\n<br/>\nIf an assumption is violated then it should be either a failure or at best ignored.  To say the test passes because something failed is like saying you don&#39;t have a cavity because the dentist doesn&#39;t have the right tool.  You don&#39;t know one way or the other, and the test won&#39;t be able to run properly when the assumption is violated.<br/>\n<br/>\nIt&#39;s partly that reason that I don&#39;t use assumptions to begin with.  If there needs to be a certain precondition to the test passing, I will add those assertions before I perform the action that needs to be tested.  To me, it is a failure if the test could not be set up properly.<br/>\n<br/>\nIf you want something a little softer, then I recommend that a failed assumption is equivalent to the @Ignore annotation.  You&#39;ll see in the summary that X number of tests were run, Y number of tests ignored, and Z number of tests failed.  Although, for ignored tests I&#39;d like to see what the reason was (failed assumption or manually ignored through the attribute).<br/>\n<br/>\nMaking a test pass because of a failed assumption gives you a false sense of security about your code.  What is happening is that the test just wasn&#39;t run, and there may be a legitimate problem hiding.  To me that is the most dangerous part of that solution.  I&#39;d rather get the bad news straight than trust faulty information.<br/>\n<br/>\nAm I making sense?</div>", 
    "prevInTime": 22387, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1265754559", 
    "canDelete": false, 
    "nextInTopic": 22389, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGhrc25qditpc2dsQGVHcm91cHMuY29tPg=="
    }
}