{
    "numMessagesInTopic": 5, 
    "nextInTime": 22399, 
    "senderId": "v9Kvkiuj1Xuxt3drmeukxzKx56Nt2JqMBVW1LLjXGVhEk60NEBmz6_z7ZsuHAsXn-ldH0mQqsWoMq-6mc-GxqUS3tNA4BHZvxBoDkA", 
    "systemMessage": true, 
    "subject": "Putting all your JUnit tests in separate Eclipse project?", 
    "from": "&quot;willmcqueen&quot; &lt;willmcqueen@...&gt;", 
    "authorName": "willmcqueen", 
    "msgSnippet": "Hi, Has anyone out there tried moving all of your JUnit test cases into a separate Eclipse project, rather than keeping them within your main project? I", 
    "msgId": 22398, 
    "profile": "willmcqueen", 
    "topicId": 22398, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 125879749, 
    "messageBody": "<div id=\"ygrps-yiv-40587562\">Hi,<br/>\n<br/>\nHas anyone out there tried moving all of your JUnit test cases into a separate Eclipse project, rather than keeping them within your main project?<br/>\n<br/>\nI couldn&#39;t find any info on this option when I searched on google for &quot;junit separate eclipse project&quot; and &quot;junit different eclipse project&quot;. I looked through the JUnit FAQ, and found this:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://junit.sourceforge.net/doc/faq/faq.htm#organize_1\">http://junit.sourceforge.net/doc/faq/faq.htm#organize_1</a><br/>\n...which describes having parallel source folders within the same project -- one for main code, and one for test code. But nothing found about having separate projects.<br/>\n<br/>\nI see the following advantages in having a separate Eclipse project for the JUnit tests:<br/>\n<br/>\n1) The ability to set your project-specific settings for your test project to something other than what is set for the main project. Not all project settings are available in the runtime configs (such as builder configurations), and so moving the test code to a separate project would allow for setting whatever test-specific project settings are desired. The main project can be added as a project dependency of the test project, and so the parallel source dirs design can still exist and the test project can continue to access all of the main project&#39;s code.<br/>\n<br/>\n2) Reduced risk in having your main code accidentally depend on a test (not likely to happen, but possible with single project).<br/>\n<br/>\n3) Reduced risk in accidentally shipping test-specific jars with your production code.<br/>\n<br/>\n4) The freedom to add any version of a lib that you need for your tests. For example, let&#39;s say that your main code depends on google-collections-0.9.jar. And your tests can benefit from some new method introduced in a new version -- google-collection-1.0.jar. So, you&#39;d like to use v1.0 with your test code but don&#39;t want to touch the main code&#39;s libs. If you have a separate test project, then that&#39;s not a problem -- you just add v1.0 to the test project&#39;s lib dir. But if you have a single main project that includes your test code, then your either stuck with v0.9 -- or you&#39;ll have to use a custom classloader to load your entire test code (and the test-specific libs) so that you can load v1.0 and not v0.9.<br/>\n<br/>\n<br/>\nI&#39;d say that the separate-project-option would do well when needing test-specific project settings and with dealing with transitive dependencies.<br/>\n<br/>\nFor the disadvantages of having a separate project, I can&#39;t think of any besides:<br/>\n1) Having one more project to maintain. Is that really a disadvantage, though? Maybe.<br/>\n<br/>\nCan you list any other disadvantages?<br/>\n<br/>\nMaybe a more fundamental question is: Should an eclipse project that contains your production code (and jars used by your production code at runtime) also contain non-production code (eg, test code and test-specific jars) or should non-production code+artifacts be placed in a separate Eclipse project while still maintaining a parallel dir structure for tests?<br/>\n<br/>\nI welcome all your thoughts! Thank you.<br/>\n<br/>\nCheers,<br/>\nWill</div>", 
    "prevInTime": 22397, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1265923714", 
    "canDelete": false, 
    "nextInTopic": 22399, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGhsMXNxMitiOWNtQGVHcm91cHMuY29tPg=="
    }
}