{
    "numMessagesInTopic": 8, 
    "nextInTime": 22401, 
    "senderId": "RlErVfPMQqrJGkLJZ76EnJHPV2ASpEWgVbXJheND9RS-9sNwwZNmlfZdM17K8wf_VxDx1f4tNN5liN07P0ccEZ7DEFE0nSg-GxnaShSO7r-Ck7kNTfy2", 
    "systemMessage": false, 
    "subject": "When to use parameterized tests vs. theories?", 
    "from": "&quot;Loritsch, Berin C.&quot; &lt;berin.loritsch@...&gt;", 
    "authorName": "Loritsch, Berin C.", 
    "msgSnippet": "I know I m a little slow on the uptake, but I m asking these questions so that I can formulate how I m going to mentor my team to make the most of their", 
    "msgId": 22400, 
    "profile": "bloritsch", 
    "topicId": 22400, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 428096731, 
    "messageBody": "<div id=\"ygrps-yiv-1946135230\">I know I&#39;m a little slow on the uptake, but I&#39;m asking these questions<br/>\nso that I can formulate how I&#39;m going to mentor my team to make the most<br/>\nof their testing investment.<br/>\n<br/>\nThere is a certain amount of overlap between parameterized tests and<br/>\ntheories.  The parameterized tests are a bit more of a pain to set up;<br/>\nbut they provide a little more control over how things get matched up.<br/>\nOf course, theories allow for much more robust data sets by combining<br/>\nall the data points in every way.  This can provide an order of<br/>\nmagnitude more tests automatically, but care has to be taken.  For<br/>\nexample, the number of actual tests run is D^P where D is the number of<br/>\ndata points and P is the number of parameters on any given theory.  This<br/>\ncan generate a lot of tests quickly, and the &quot;runDiscretely&quot; option I<br/>\nhacked together for theories would definitely not be a preferable.<br/>\n<br/>\nI now know that assumptions are filtering devices for theories, so it<br/>\ndoes not mark the test as failed.  Essentially, the reason that an<br/>\nassumption is marked as passing for the theory is that the assumption<br/>\nsuccessfully filtered out that data combination.  I get that now, but I<br/>\nprobably will use that feature very sparingly.<br/>\n<br/>\nThe question I have is what problem was the reason parameterized tests<br/>\nsupposed to solve, and how is that different than the problem that<br/>\ntheories are supposed to solve?<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 22399, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1266001922", 
    "canDelete": false, 
    "nextInTopic": 22401, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDc1RjVFRDhBNUE1NTM2NDZBNDZFMDBFNkVDODU0RkEzMDQzRjk5MTJAdmFmZjAxLW1haWwwMS5hZC5nZC1haXMuY29tPg=="
    }
}