{
    "numMessagesInTopic": 3, 
    "nextInTime": 22409, 
    "senderId": "jFf2LrAcRPFs9I6j8Iwnvrvir0X3apBb0BSs2zH5_DfkxXjfoA25IjZ7CzmaSX5tr9fHZPGBgPZjv2g_2j6fr4pedCBhIP0bCOhPDg", 
    "systemMessage": false, 
    "subject": "Re: Maven SureFire - parallel attribute", 
    "from": "&quot;krosenvold&quot; &lt;kristian@...&gt;", 
    "authorName": "krosenvold", 
    "msgSnippet": "The surefire docs are probably a bit thin in the sense that they expect the user to access the docs of the actual testing framework for the meaning of the", 
    "msgId": 22408, 
    "profile": "krosenvold", 
    "topicId": 22405, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 403861045, 
    "messageBody": "<div id=\"ygrps-yiv-1654022929\">The surefire docs are probably a bit &quot;thin&quot; in the sense that they expect the user to access the docs of the actual testing framework for the meaning of the actual values. Now I&#39;m not entirely sure<br/>\nwhere the semantics of classes/methods/both are documented, but you are right;<br/>\n<br/>\nclasses starts each class in a thread of its own, methods runs all the methods of each class in its own thread. &quot;both&quot; is actually the <br/>\nvaguest of the two, but it does both ;)<br/>\n<br/>\nJunit 4.7+ itself comes with what I like to think of as a reference implemention of a parallel computer. As can be seen by this issue <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://github.com/KentBeck/junit/issues#issue/18)\">http://github.com/KentBeck/junit/issues#issue/18)</a>, there are some<br/>\nknown gotchas to this implementation.<br/>\n<br/>\n<br/>\nSurefire knows how to use both ParallelComputer (junit) and ConfigurableParallelComputer (mine). Check blog post at <a rel=\"nofollow\" target=\"_blank\" href=\"http://incodewetrustinc.blogspot.com/2010/01/run-your-junit-tests-concurrently-with.html\">http://incodewetrustinc.blogspot.com/2010/01/run-your-junit-tests-concurrently-with.html</a><br/>\n<br/>\n<br/>\nI have actually created several revisions of ConfigurableParallelComputer since last time dsaff looked at it, and in its current incarnation it&#39;s much more similar to ParallelComputer but without the gotchas. <br/>\nI am hererby --&gt; . &lt;--- requesting ConfigurableParallelComputer and its test-cases to be accepted as  a submission to junit<br/>\nas a patch for issue 18. Being the original author of all, I&#39;ll grant the CPL lisence.<br/>\n<br/>\nI will try to update the surefire docs somewhat, it&#39;s on my todo<br/>\nlist. But it seems like most of your question actually should be <br/>\nanswered somewhere in junit.<br/>\n<br/>\nKristian<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;Douglas Ferguson&quot; &lt;douglas@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Can anybody shed light on this comment from the docs?<br/>\n&gt; <br/>\n&gt; ......<br/>\n&gt; <br/>\n&gt; parallel \t<br/>\n&gt; <br/>\n&gt; String \t2.2 \t(TestNG only) When you use the parallel attribute, TestNG will try to run all your test methods in separate threads, except for methods      that depend on each other, which will be run in the same thread in order to respect their order of execution.<br/>\n&gt; <br/>\n&gt;  In JUnit 4.7 the values are classes/methods/both to run in separate threads, as controlled by threadCount.<br/>\n&gt; <br/>\n&gt; .....<br/>\n&gt; <br/>\n&gt; I have junit test tests and when I set parallel = methods it runs everything synchronously, however when I set parallel = classes, it runs the classes in parallel. I haven&#39;t been able to find good documentation for this anywhere.. Does anybody know of any good resources? <br/>\n&gt; <br/>\n&gt; Also, assuming I can get methods to work, does it run all methods in parallel or does it run the methods in parallel by class? i.e. 1 class at a time but all the methods in that class are parallel?<br/>\n&gt; <br/>\n&gt; Are there other gotchas or configuration settings I should be considering? I.E. I&#39;ve read a little bit on ConfigurableParallelComputer but I&#39;m not sure what it&#39;s all about..<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 22407, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1266046637", 
    "canDelete": false, 
    "nextInTopic": 22409, 
    "prevInTopic": 22405, 
    "headers": {
        "inReplyToHeader": "PGhsNDI3cCttbXJzQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGhsNWtyZCs3YXJxQGVHcm91cHMuY29tPg=="
    }
}