{
    "numMessagesInTopic": 5, 
    "nextInTime": 22405, 
    "senderId": "Hl_PAD8G4wQVmu1rP46WkKQT4l_Z0HDyl-zvF01IbdupyhvqWh8cvBpwWSvtWAvPcpZKiWKppElUBoebr0Vz6Q05VTh9vA3cPjM", 
    "systemMessage": true, 
    "subject": "Re: [junit] Putting all your JUnit tests in separate Eclipse project?", 
    "from": "Mike Forsberg &lt;bigmike.f@...&gt;", 
    "authorName": "Mike Forsberg", 
    "msgSnippet": "My cheap two cents... I really like the parallel source-test code convention. Could you explain project-specific settings for your test project a little ", 
    "msgId": 22404, 
    "profile": "bigmike_f", 
    "topicId": 22398, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 421392598, 
    "messageBody": "<div id=\"ygrps-yiv-985017127\">My cheap two cents...<br/>\n<br/>\nI really like the parallel source-test code convention.<br/>\n<br/>\nCould you explain &quot;project-specific settings for your test project&quot; a little<br/>\nmore.  When I test, I want to be able to configure the environment of my<br/>\ncode as much as possible.  My test code creates many different situations<br/>\nfor my code under test.  This way I know that my code under test can perform<br/>\nin different scenarios.  To enable this ability, I like to limit my<br/>\nconfiguration, so my code under test is as nimble as possible.  It should<br/>\nwork under many configurations and not depend &quot;too much&quot; on resource files,<br/>\nproject configurations, the weather, a specific server...<br/>\n<br/>\nI think number 2 & 3 are the same.  Where I work, we are leaning towards<br/>\nshipping the test code in our distributable.  It is an option to install,<br/>\nwhich shows the confidence we have in our code base.  All the tests pass,<br/>\nand you know what&#39;s under test will work.  I&#39;ve seen some companies required<br/>\nto show coverage analysis along with the tests to prove the code is<br/>\nexercised before it is installed. We are lucky that our customer is<br/>\ninternal.<br/>\n<br/>\nFor reason number 4...  If I had to maintain two sets of libraries, I&#39;d have<br/>\nproblems figuring out which version of a jar I&#39;m using.  Especially when my<br/>\ntest code calls into my code under test with one of the shared jars.  (Is<br/>\nthis the &quot;jar hell&quot; many speak of?)  If one follows the apache version<br/>\nnumber conventions... there are problems with changing the x and y numbers<br/>\nin a x.y.z version scheme between projects.<br/>\n<br/>\nWhy should the test code have additional functionality that the code under<br/>\ntest can&#39;t.  Is the test code performing the same work as the production<br/>\ncode.  I like to limit my test code to set up, tear down, and assertions<br/>\nlogic.  If I&#39;m doing something that the code under test should do, I wonder<br/>\nwhy it is so hard to test.  (In those cases maybe I wrote a bad API for<br/>\nmyself.)<br/>\n<br/>\nBasically, when it comes down to it... I&#39;m lazy and hate having to set up<br/>\ntwo environments.  I already pull my hair out when ant and eclipse function<br/>\ndifferently because someone, &lt;cough &quot;myself&quot;/&gt; forgets to make the<br/>\nclasspaths match.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Feb 11, 2010 at 3:28 PM, willmcqueen &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:willmcqueen@...\">willmcqueen@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Hi,<br/>\n&gt;<br/>\n&gt; Has anyone out there tried moving all of your JUnit test cases into a<br/>\n&gt; separate Eclipse project, rather than keeping them within your main project?<br/>\n&gt;<br/>\n&gt; I couldn&#39;t find any info on this option when I searched on google for<br/>\n&gt; &quot;junit separate eclipse project&quot; and &quot;junit different eclipse project&quot;. I<br/>\n&gt; looked through the JUnit FAQ, and found this:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://junit.sourceforge.net/doc/faq/faq.htm#organize_1\">http://junit.sourceforge.net/doc/faq/faq.htm#organize_1</a><br/>\n&gt; ...which describes having parallel source folders within the same project<br/>\n&gt; -- one for main code, and one for test code. But nothing found about having<br/>\n&gt; separate projects.<br/>\n&gt;<br/>\n&gt; I see the following advantages in having a separate Eclipse project for the<br/>\n&gt; JUnit tests:<br/>\n&gt;<br/>\n&gt; 1) The ability to set your project-specific settings for your test project<br/>\n&gt; to something other than what is set for the main project. Not all project<br/>\n&gt; settings are available in the runtime configs (such as builder<br/>\n&gt; configurations), and so moving the test code to a separate project would<br/>\n&gt; allow for setting whatever test-specific project settings are desired. The<br/>\n&gt; main project can be added as a project dependency of the test project, and<br/>\n&gt; so the parallel source dirs design can still exist and the test project can<br/>\n&gt; continue to access all of the main project&#39;s code.<br/>\n&gt;<br/>\n&gt; 2) Reduced risk in having your main code accidentally depend on a test (not<br/>\n&gt; likely to happen, but possible with single project).<br/>\n&gt;<br/>\n&gt; 3) Reduced risk in accidentally shipping test-specific jars with your<br/>\n&gt; production code.<br/>\n&gt;<br/>\n&gt; 4) The freedom to add any version of a lib that you need for your tests.<br/>\n&gt; For example, let&#39;s say that your main code depends on<br/>\n&gt; google-collections-0.9.jar. And your tests can benefit from some new method<br/>\n&gt; introduced in a new version -- google-collection-1.0.jar. So, you&#39;d like to<br/>\n&gt; use v1.0 with your test code but don&#39;t want to touch the main code&#39;s libs.<br/>\n&gt; If you have a separate test project, then that&#39;s not a problem -- you just<br/>\n&gt; add v1.0 to the test project&#39;s lib dir. But if you have a single main<br/>\n&gt; project that includes your test code, then your either stuck with v0.9 -- or<br/>\n&gt; you&#39;ll have to use a custom classloader to load your entire test code (and<br/>\n&gt; the test-specific libs) so that you can load v1.0 and not v0.9.<br/>\n&gt;<br/>\n&gt; I&#39;d say that the separate-project-option would do well when needing<br/>\n&gt; test-specific project settings and with dealing with transitive<br/>\n&gt; dependencies.<br/>\n&gt;<br/>\n&gt; For the disadvantages of having a separate project, I can&#39;t think of any<br/>\n&gt; besides:<br/>\n&gt; 1) Having one more project to maintain. Is that really a disadvantage,<br/>\n&gt; though? Maybe.<br/>\n&gt;<br/>\n&gt; Can you list any other disadvantages?<br/>\n&gt;<br/>\n&gt; Maybe a more fundamental question is: Should an eclipse project that<br/>\n&gt; contains your production code (and jars used by your production code at<br/>\n&gt; runtime) also contain non-production code (eg, test code and test-specific<br/>\n&gt; jars) or should non-production code+artifacts be placed in a separate<br/>\n&gt; Eclipse project while still maintaining a parallel dir structure for tests?<br/>\n&gt;<br/>\n&gt; I welcome all your thoughts! Thank you.<br/>\n&gt;<br/>\n&gt; Cheers,<br/>\n&gt; Will<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 22403, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1265954842", 
    "canDelete": false, 
    "nextInTopic": 22407, 
    "prevInTopic": 22399, 
    "headers": {
        "inReplyToHeader": "PGhsMXNxMitiOWNtQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGE1MjdmZGRmMTAwMjExMjIwN3Q0MDljNmNhMG43NTM3NTdmZjc3YTJiZjNAbWFpbC5nbWFpbC5jb20+", 
        "referencesHeader": "PGhsMXNxMitiOWNtQGVHcm91cHMuY29tPg=="
    }
}