{
    "numMessagesInTopic": 31, 
    "nextInTime": 22417, 
    "senderId": "enHC2PQFGgXIPye2c7AGLqYGvVNOilLCM24vgXFlbqhGytCAY-CWmun2spBpgKEIbyk_tL6nYxL4PARxP3z7cqcd9y197cqb-zpiIAD2Nf19tMjC", 
    "systemMessage": true, 
    "subject": "Re: [junit] Re: SureFire Plugin: &quot;parallel&quot; attribute", 
    "from": "Douglas Ferguson &lt;douglas@...&gt;", 
    "authorName": "Douglas Ferguson", 
    "msgSnippet": "1 more thing, do any of the selenium projects you speak of use the selenium grid with windows? We are having a hell of a time getting that working too. We have", 
    "msgId": 22416, 
    "profile": "the_d_u_g", 
    "topicId": 22403, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 360562056, 
    "messageBody": "<div id=\"ygrps-yiv-793907672\">1 more thing, do any of the selenium projects you speak of use the selenium grid with windows? We are having a hell of a time getting that working too. We have the hub on Ubuntu and windows slaves don&#39;t play nice but Ubuntu slaves work fine. I haven&#39;t found much info on the issues we are seeing nor have a I gotten any responses on the Selenium mailing list.  We may just have to skip IE testing for now and running everything on firefox Ubuntu.<br/>\n<br/>\nD/<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Feb 13, 2010, at 4:28 PM, krosenvold wrote:<br/>\n<br/>\n<br/>\n<br/>\nI think the thing you&#39;re missing is that maven surefire 2.5 works with JUST junit 4.7+ or a *combination* of junit 4.7+ /and/ ConfigurableParallelComputer.<br/>\n<br/>\nWhen using surefire with junit /alone/ it does not support threadCount. You will need to use the /combination/ to restrict threadCount. Since you&#39;re a selenium user you WILL need to limit threads, which means you *cannot* get by with just junit 4.7+, but you *will* need ConfigurableParallelComputer.<br/>\n<br/>\nI will update the surefire docs to be a bit clearer on this restriction.<br/>\n<br/>\nI know at least three selenium projects that are doing exactly what you want. Most run with parallel=classes and a thread restriction, since this allows a smooth number of concurrent tests, something that is good for your grid. My current firefox runs went from 45 minutes single thread to 8 minutes concurrent, so there&#39;s definitely a huge upside.<br/>\n<br/>\nThis does not mean it&#39;s a simple task, since most selenium test suites are not written with concurrency support in mind. Quite frankly, if you think getting surefire/junit to work is hard you can rest assured that the worst part is still ahead of you.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 22415, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1266106331", 
    "canDelete": false, 
    "nextInTopic": 22417, 
    "prevInTopic": 22415, 
    "headers": {
        "inReplyToHeader": "PGhsNzkxcytzYXNsQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDM4Q0IwMkQ2LThENjgtNDAyRi1CMzA1LUU2NUFDODE2QjBCMEBkb3VnbGFzZmVyZ3Vzb24udXM+", 
        "referencesHeader": "PGhsNzkxcytzYXNsQGVHcm91cHMuY29tPg=="
    }
}