{
    "numMessagesInTopic": 31, 
    "nextInTime": 22422, 
    "senderId": "J0uRzknM0vtMjJJGMvT9k6VgmU-ypzYsywA_Oh6_n6Vd3ftSB2YawyXdccp5bMSDaWd-L1_mNeES9hZlqkVlrbAQ5Pzn-u2mXkXdWPnz_g3GdRJU", 
    "systemMessage": true, 
    "subject": "Re: [junit] Re: SureFire Plugin: &quot;parallel&quot; attribute", 
    "from": "Douglas Ferguson &lt;douglas@...&gt;", 
    "authorName": "Douglas Ferguson", 
    "msgSnippet": "Adding more formating.. from my reader this was easy to read but not after going through the mailing list.. Now mine start with [DF] See below.. ... Yes, in", 
    "msgId": 22421, 
    "profile": "the_d_u_g", 
    "topicId": 22403, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 360562056, 
    "messageBody": "<div id=\"ygrps-yiv-1939696438\">Adding more formating.. from my reader this was easy to read but not after going through the mailing list..<br/>\nNow mine start with [DF]<br/>\n<br/>\nSee below..<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Feb 14, 2010, at 4:25 PM, krosenvold wrote:<br/>\n<br/>\n&gt; Also, Just out of curiosity, what happens thread count wise when you aren&#39;t using ConfigurableParallelComputer, does it literally fire up a thread per test?<br/>\nYes, in &quot;methods&quot; mode it&#39;s one thread per test method. Classes mode is one per class. Both is, well, both. In my 10+ years as test-infected, I have really never ever had a use-case where this kind of solution would be appropriate (maybe some kind of really slow database with unlimited cheap connections). With thousands of test classes you come to a grinding halt with any of these options.<br/>\n<br/>\n[DF] That&#39;s insane...<br/>\n<br/>\n&gt;1 more thing, do any of the selenium projects you speak of use the &gt;selenium grid with windows? We are having a hell of a time getting &gt;that working too. We have the hub on Ubuntu and windows slaves don&#39;t &gt;play nice but Ubuntu slaves work fine. I haven&#39;t found much info on &gt;the issues we are seeing nor have a I gotten any responses on the &gt;Selenium mailing list. We may just have to skip IE testing for now &gt;and running everything on firefox Ubuntu.<br/>\n<br/>\nWe run all our browser-bots on windows, and the CI is bamboo on linux. We do not use grid. Instead we let a single build run with 4 threads towards a single instance of selenium RC (with firefox). This has proved to be a nice, stable setup that gives us a lot of punch.<br/>\nNow we also partition the entire build into 2, so we have two separate (Windows) pizza boxes running RC+ firefox, for a grand total<br/>\nof 8 available browsers. This allows us to use firefox as the backbone in our selenium-TDD-based development that has allowed us<br/>\nvirtually regression free frequent deployments<br/>\n<br/>\n[DF] So are you saying that you have 2 windows machines running selenium RC and you have your test runner that round robins between the two rather than using the grid?<br/>\nJust out of curiosity, what are you using to kick off the tests?<br/>\n<br/>\nWe run Internet Explorer and Opera on separate boxes. Opera Selenium tests are hard to make stable, but they also work concurrently.<br/>\nInternet Exploder is a strict one-instance per box for any kind of<br/>\nstability. I know some people use virtualization. We just add boxes.<br/>\n<br/>\n[DF] When you add boxes, each one runs a separate selenium rc server? How do you distribute the tests to them?<br/>\n<br/>\nThe other projects do much the same, but they all pre-date grid somewhat.<br/>\n<br/>\nWe&#39;re also planning to try out Chrome once we upgrade to Selenium 2.0, we really need something webkit based.<br/>\n<br/>\nKristian<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 22420, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1266193485", 
    "canDelete": false, 
    "nextInTopic": 22422, 
    "prevInTopic": 22420, 
    "headers": {
        "inReplyToHeader": "PDQ2MUIwRDUxLUM4OUUtNDkxNy1CRTMzLUM0MkVCRDJFQTY4REBkb3VnbGFzZmVyZ3Vzb24udXM+", 
        "messageIdInHeader": "PDVGQkIzMzRDLTBCMTMtNDNDMi1BOTE4LTcyRDMyNUY5NUQyMEBkb3VnbGFzZmVyZ3Vzb24udXM+", 
        "referencesHeader": "PGhsOXQ4cyttcHA4QGVHcm91cHMuY29tPiA8NDYxQjBENTEtQzg5RS00OTE3LUJFMzMtQzQyRUJEMkVBNjhEQGRvdWdsYXNmZXJndXNvbi51cz4="
    }
}