{
    "numMessagesInTopic": 4, 
    "nextInTime": 22467, 
    "senderId": "zSxW7lR2djoa2joTG-ONdSZO2vQ92zVdCUscJd99EENAGqckN97Efj3chpiEF2AFwFEW8o7WSYegPXuMlo47Eool9Ne5z5HjFloG12SwEXEfeI14UFgP", 
    "systemMessage": false, 
    "subject": "Thoughts on Suites in modern testing", 
    "from": "&quot;Loritsch, Berin C.&quot; &lt;berin.loritsch@...&gt;", 
    "authorName": "Loritsch, Berin C.", 
    "msgSnippet": "When JUnit first started out, there really wasn t any way to collect all the tests without writing a Suite.  Now Ant, Maven, and other build tools collect all", 
    "msgId": 22466, 
    "profile": "bloritsch", 
    "topicId": 22466, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 428096731, 
    "messageBody": "<div id=\"ygrps-yiv-1585442662\">When JUnit first started out, there really wasn&#39;t any way to collect all<br/>\nthe tests without writing a Suite.  Now Ant, Maven, and other build<br/>\ntools collect all the test classes and execute them.  Essentially, the<br/>\nusefulness of test Suites has been greatly diminished.  The problem that<br/>\nthe build tools answered quite nicely was the fact that manually<br/>\nmaintaining the test suites can be a problem.  People routinely forget<br/>\nto add test classes to the test suites, and it&#39;s not a question of<br/>\nlaziness.  It&#39;s just a question of it being that &quot;one more thing&quot; to<br/>\nremember that is so easily overlooked.<br/>\n<br/>\nThe Categories test runner provides a nice extension to Suites that give<br/>\nthem some value again.  However, I&#39;d like to make use of them without<br/>\nexplicitly listing all the classes included in the suite.  Essentially,<br/>\nI&#39;d either like the Categories test runner to collect all the test<br/>\nclasses itself and apply the category filters, or have that built into<br/>\nthe main JUnit runner.  Adding support for a class collector is<br/>\npossible, and may even be preferable in today&#39;s testing.<br/>\n<br/>\nCurrently some projects keep unit tests, slow tests, and installation<br/>\ntests in separate directory structures so that Ant or whatever build<br/>\ntool they choose can run them separately.  Categories will allow these<br/>\nprojects to clearly mark the tests, possibly even assigning multiple<br/>\ncategories to the tests.  This provides great flexibility in how things<br/>\nare run.<br/>\n<br/>\nOf course, this includes corresponding support in ANT to execute the<br/>\nproper categories, or at the very least call the Categories test suites<br/>\nwe&#39;ve set up.  Since JUnit takes care of collecting the classes for us,<br/>\nit makes leveraging that support as simple as calling a single test case<br/>\nwhich all the build tools already support.<br/>\n<br/>\nWhat thoughts do you have on this?<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 22465, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1266939010", 
    "canDelete": false, 
    "nextInTopic": 22469, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDc1RjVFRDhBNUE1NTM2NDZBNDZFMDBFNkVDODU0RkEzMDQ0Njk4QjZAdmFmZjAxLW1haWwwMS5hZC5nZC1haXMuY29tPg=="
    }
}