{
    "numMessagesInTopic": 9, 
    "nextInTime": 22488, 
    "senderId": "Npw1SttepDlC897WxzFZPWj-4y84GZbUKlmgONDEqfGOhvP527SpIMp8UA8mGUXUCrUAKkR534wKxL0anwYeJHjaSPvd0brR581PYqpUCeNCqptS8i5a", 
    "systemMessage": false, 
    "subject": "[RT] JUnit Core, Parallelism, Documentation", 
    "from": "&quot;Loritsch, Berin C.&quot; &lt;berin.loritsch@...&gt;", 
    "authorName": "Loritsch, Berin C.", 
    "msgSnippet": "RT = Random Thought.  It s a habit I picked up from Stefano Mazzocchi when I used to work with him on the Cocoon project.  Essentially, it s a structured brain", 
    "msgId": 22487, 
    "rawEmail": "Return-Path: &lt;prvs=1670cc190e=berin.loritsch@...&gt;\r\nX-Sender: prvs=1670cc190e=berin.loritsch@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nX-Received: (qmail 2835 invoked from network); 1 Mar 2010 22:18:34 -0000\r\nX-Received: from unknown (66.196.94.106)\n  by m1.grp.sp2.yahoo.com with QMQP; 1 Mar 2010 22:18:34 -0000\r\nX-Received: from unknown (HELO camv02-relay2.casc.gd-ais.com) (192.5.164.99)\n  by mta2.grp.re1.yahoo.com with SMTP; 1 Mar 2010 22:18:33 -0000\r\nX-Received: from ([10.73.100.22])\n\tby camv02-relay2.casc.gd-ais.com with SMTP  id 5203374.16536873;\n\tMon, 01 Mar 2010 14:17:11 -0800\r\nX-Received: from vaff01-mail01.ad.gd-ais.com ([10.13.13.20]) by camv02-fes01.ad.gd-ais.com with Microsoft SMTPSVC(6.0.3790.3959);\n\t Mon, 1 Mar 2010 14:17:10 -0800\r\nX-MimeOLE: Produced By Microsoft Exchange V6.5\r\nContent-class: urn:content-classes:message\r\nMIME-Version: 1.0\r\nDate: Mon, 1 Mar 2010 17:17:07 -0500\r\nMessage-ID: &lt;75F5ED8A5A553646A46E00E6EC854FA3044B97F2@...-ais.com&gt;\r\nX-MS-Has-Attach: \r\nX-MS-TNEF-Correlator: \r\nThread-Topic: [RT] JUnit Core, Parallelism, Documentation\r\nThread-Index: Acq5jO4sJiFpkYiFShuKKb7SSiokQw==\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nReturn-Path: Berin.Loritsch@...\r\nX-OriginalArrivalTime: 01 Mar 2010 22:17:10.0499 (UTC) FILETIME=[EFE7DB30:01CAB98C]\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Loritsch, Berin C.&quot; &lt;berin.loritsch@...&gt;\r\nSubject: [RT] JUnit Core, Parallelism, Documentation\r\nX-Yahoo-Group-Post: member; u=428096731; y=GKn6Xo3ohYdlfWofcEDuOZulMcnKAahx-Xfl2ffECtrxxv3g\r\nX-Yahoo-Profile: bloritsch\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\n\r\nRT = Random Thought.  It&#39;s a habit I picked up from Stefano Mazzocchi\nwhen I used to work with him on the Cocoon project.  Essentially, it&#39;s a\nstructured brain dump based on observations of the internals of a\nproject (as such it is longer than most posts).  My apologies if this is\nnot the forum for this.\n\n== Code Maintenance Thoughts ==\n\nI&#39;ve been going through some of the JUnit Core to add some JavaDocs\n(it&#39;s in my forked copy if you want me to do a Push request), and made a\nfew observations.  I can definitely see how JUnit has begun to evolve\nover the years, and as is natural with a couple missteps along the way.\nIt&#39;s hard to get rid of those missteps because some people may have\nextended them.  Some of the classes have been deprecated with the\npromise that they would be removed in the next revision (as of 4.4) and\nthey are still there.  I&#39;m not saying that the current solution is a\nmisstep, just that it is hard to separate the past ones from the current\npreferred solution.\n\nPart of managing a codebase like this includes separating the public and\nprivate API.  Some of that has been done with the &quot;internal&quot; package.\nThere is no reason to worry about deprecating classes and methods in the\ninternal package because they are not part of the public API.  But I did\nnotice that when some classes got moved, the old class in full was kept\nin the original location.  A low maintenance way of performing a move\nlike that makes use of inheritance.  Essentially the newer class is\nmoved so there is one maintenance location, and the deprecated class\nextends the newer class.  Kind of like how the JUnit4 runner provides a\npreferred alias to the BlockJUnit4Runner class.\n\nPart of the core includes a nice little callback interface (the\nRunListener).  I imagine that a number of integrations make good use of\nthis little class.  However, with the implementation as it is currently\nwritten, the RunListener can affect the run performance and parallelism\navailable.  Essentially, the act of calling a method is a synchronous\nfunction.  That means a poorly written runner can detrimentally affect\nthe performance of JUnit.  The one that is included with JUnit is pretty\ntame, doing the absolute minimum it has to do to track the test\nprogress.  However, if your tests execute slower in an IDE than with\nJUnit alone, it&#39;s probably the RunListener slowing things down.\n\n== Parallelism Thoughts ==\n\nSome of the architectural decisions in JUnit&#39;s core definitely reflect\nthe synchronous nature that the tests were designed to be written.  I\ndon&#39;t think there is going to be an easy solution to that problem,\nunless you stick to a test class per thread model.  More on that a bit\nlatter.\n\nWhen designing for parallel execution of tests (the ParallelComputer\nhints at this), you usually don&#39;t want an unbounded number of threads to\nbe executed in the system.  A fairly common approach to taming the\nthread/work apportioning beast is to use queues and worker threads.\nEssentially, each test (including the set up and tear down parts) gets\npushed on to the queue, while the executor pops it off on the other side\nin another process.  Essentially the relationship to executors to work\nqueues depends on whatever rules you&#39;ve set up.  For JUnit a simple\nmapping of executors to the number of processors (cores) or some\nmultiple of that would be sufficient.  This model is closer to how JMS\nworks without all the quality of service overhead.  As the executor runs\nthe test, it sends notification objects to the notification queue.\nUsing one line of ASCII art, the process looks like this:\n\nClasses/Suite ==&gt; Executor ==&gt; Notifier\n\nEach &quot;==&gt;&quot; represents a queue.  The notification mechanism then becomes\nmore like Swing events.  We could even cheat and use an Java 5 enum for\nthe types of events.  This provides the same interface for all the\nevents, and the convenience of an enum for determining the type of\nevent.  If we take this approach a step further, if we substitute a\nPriorityQueue for the first queue, we get a way to prefer some tests\nover others (e.g. using categories as a priority mechanism).  Collecting\nthe results in a separate thread than they are being executed protects\nthe execution of tests from poorly written listeners.\n\nWe could go to a very fine level of detail (i.e. each individual test)\nif it weren&#39;t for the class setup/tear down methods.  Those kind of\ntests would force some sort of ordering.  It&#39;s not entirely impossible,\nbut does require more care.\n\nSuch an approach may be over-engineering things a bit, and for short\nruns of a couple hundred tests that takes less than a second to run\ndefinitely overkill.  However for larger projects with much larger\nexecution times, it may be a way to short circuit the execution a bit.\nEssentially the win here would be the ability to execute tests while\nthey are still being parsed and prepared.  That can help with things\nlike Theories where collecting a large number of DataPoints can have a\nprofound impact on the time it takes to run.\n\nIt would be pretty easy to ensure that no more than n+2 threads are used\nin a system, where n = Runtime.availableProcessors().\n\n\n[Non-text portions of this message have been removed]\n\n\n", 
    "profile": "bloritsch", 
    "topicId": 22487, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 428096731, 
    "prevInTime": 22486, 
    "contentTrasformed": false, 
    "postDate": "1267481827", 
    "canDelete": false, 
    "nextInTopic": 22488, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDc1RjVFRDhBNUE1NTM2NDZBNDZFMDBFNkVDODU0RkEzMDQ0Qjk3RjJAdmFmZjAxLW1haWwwMS5hZC5nZC1haXMuY29tPg=="
    }
}