{
    "numMessagesInTopic": 8, 
    "nextInTime": 22515, 
    "senderId": "iP-0yGk_nr9DdNtk4x7Iz1cJzyOXGX4Y7jquHO8Q7gXIhFGbhnTMsf9eZJond8YoQX4nKckA-i0RG1_T4TtQqPiknEX7ILfPs4yvQ-ut_zLDog", 
    "systemMessage": true, 
    "subject": "Re: [junit] JUnitBenchmarks (application of @Rule)", 
    "from": "Dawid Weiss &lt;Dawid.Weiss@...&gt;", 
    "authorName": "Dawid Weiss", 
    "msgSnippet": "... Oh, interesting. ... Micro-benchmarking is tricky itself, no library is going to guarantee common sense here. What you re talking about is really a bad", 
    "msgId": 22514, 
    "profile": "dawid_weiss", 
    "topicId": 22503, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 309931857, 
    "messageBody": "<div id=\"ygrps-yiv-755519047\"><blockquote><span title=\"ireply\">&gt; I started a new project to flesh out my ideas from the RT I posted last week that might fit this solution well.  In essence, the project I<br/>\n<br/>\n </span></blockquote>Oh, interesting.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; gotten it to the place where it can run its own tests and the result events are processed in a separate thread.<br/>\n<br/>\n&gt; On a minor side note, when the bulk of your tests are short and do not involve a lot of objects, you can see as much as 100% speed gains.  Essentially, by short I mean less than a millisecond in duration.  The speed gains are achieved by not penalizing the tests while you write to the console.  In more substantive tests you will not see as much of a speed gain.<br/>\n<br/>\n </span></blockquote>Micro-benchmarking is tricky itself, no library is going to guarantee<br/>\ncommon sense here. What you&#39;re talking about is really a bad benchmark<br/>\n-- if you include an operation with such a large time variance<br/>\n(writing to console), the results will have a high variance too, of<br/>\ncourse.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Essentially the QoS testing framework will have some hooks to specify numbers of runs, parameters, etc.  My hope is that at the very<br/>\n<br/>\n </span></blockquote>This library I posted does have some sort of this -- there are<br/>\nannotations that drive the benchmarking process (number of warmup<br/>\nruns, benchmarks runs, reset for the GC on every round, etc.).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; testing for benchmarks and quality of service is a little different from regular unit testing.<br/>\n<br/>\n </span></blockquote>I believe it may be, don&#39;t know much about QoS.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also note: for more accurate test timing, use the System.nanoTime().  Most JVM implementations only increment the system clock every 10ms.  That’s fine enough for telling the time, but when your individual tests are typically faster than 10ms that lack of granularity can hurt.<br/>\n<br/>\n </span></blockquote>In fact they are both equally unreliable, so changing to theoretically<br/>\nsmaller granularity is not really going to help. From our experience,<br/>\nyou need to design a benchmark that takes a more significant amount of<br/>\ntime (in the order of milliseconds at least) and make sure HotSpot has<br/>\ndone its job (and no deoptimizations occur). In any other scenario<br/>\nbenchmark results will be too close to noise and prone to large<br/>\nvariance distortions due to background processes and other activity.<br/>\n<br/>\nDawid</div>", 
    "prevInTime": 22513, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1268076992", 
    "canDelete": false, 
    "nextInTopic": 22515, 
    "prevInTopic": 22513, 
    "headers": {
        "inReplyToHeader": "PDc1RjVFRDhBNUE1NTM2NDZBNDZFMDBFNkVDODU0RkEzMDQ1MTMyOTBAdmFmZjAxLW1haWwwMS5hZC5nZC1haXMuY29tPg==", 
        "messageIdInHeader": "PGJhYThjNTczMTAwMzA4MTEzNnU0YjUzYWZmMm04ZjU5NjBhZGU4MWQ0MWE1QG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PGhuMm45cytyN2xxQGVHcm91cHMuY29tPiA8NGY3ZGE2YjkxMDAzMDgwNjMwdDFiNWE2Y2RjeGE3ZmRmZjc5ZWIzMWM3ZjlAbWFpbC5nbWFpbC5jb20+IAk8YmFhOGM1NzMxMDAzMDgwNjQ3bDJhMDE0Mzk3aGJmYWJmNDIwM2ExMDkwMTRAbWFpbC5nbWFpbC5jb20+IAk8NGY3ZGE2YjkxMDAzMDgwNzAyazdlYjdmZDAybjFmZmRhMzE3YTEyYWMyNzRAbWFpbC5nbWFpbC5jb20+IAk8YmFhOGM1NzMxMDAzMDgwODI3cjM1NDlkYWZleDJiOGMyNzk1NzE0MDA3MDJAbWFpbC5nbWFpbC5jb20+IAk8NzVGNUVEOEE1QTU1MzY0NkE0NkUwMEU2RUM4NTRGQTMwNDUxMzI5MEB2YWZmMDEtbWFpbDAxLmFkLmdkLWFpcy5jb20+"
    }
}