{
    "numMessagesInTopic": 14, 
    "nextInTime": 2253, 
    "senderId": "jjNY-TjTh7qeONPduWGMn0tlZsq8vEJ5RwjwpHlRrLJmqdwH1JtTLve4k8MtLOQLozzxLd0skPpdOFIP3WMz3pBtoWvjhzJXjn4", 
    "systemMessage": false, 
    "subject": "Re: [junit] Need Advice on Unit Testing Pain", 
    "from": "Mike Duffy &lt;mduffy_lists@...&gt;", 
    "authorName": "Mike Duffy", 
    "msgSnippet": "In my opinion, developers should not write the web page navigation and contents tests.  This is not unit testing.  This is functional testing that should be", 
    "msgId": 2252, 
    "topicId": 2251, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1990141283\">In my opinion, developers should not write the web page navigation<br/>\nand contents tests.  This is not unit testing.  This is functional<br/>\ntesting that should be done by the QA team.  Although I admit the<br/>\nline between unit and functional testing is sometimes blurry.<br/>\n<br/>\nAn effective approach would be to use a design pattern called Front<br/>\nController:  &quot;Centralize view management (navigation, templating,<br/>\nsecurity, etc.) for a Web application in a single object that handles<br/>\nincoming client requests .&quot;<br/>\n<br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://java.sun.com/j2ee/blueprints/design_patterns/front_controller/index.html)\">http://java.sun.com/j2ee/blueprints/design_patterns/front_controller/index.html)</a>.<br/>\n<br/>\nWith Front Controller you can gut all of your business logic out of<br/>\nyour servlets and JSPs.  Your business logic would be contained in<br/>\nseparate classes which can be unit tested.<br/>\n<br/>\nMike<br/>\n<br/>\n--- Paul Hodgetts &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:prh@...\">prh@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; We are developing a J2EE-based web application, and we&#39;ve been<br/>\n&gt; getting better and better at our testing.  Recently we reached<br/>\n&gt; a pain threshold that&#39;s causing us to make a compromise trade<br/>\n&gt; off.  Perhaps you folks can offer some suggestions.<br/>\n&gt; <br/>\n&gt; The developers write unit test for all layers of the system,<br/>\n&gt; from the web pages to the smallest methods.  For most tests,<br/>\n&gt; we use JUnit and for the web tests we use HTTPUnit.<br/>\n&gt; <br/>\n&gt; The highest level of the web tests check for the page flow<br/>\n&gt; (link navigation) and for page contents.  These tests, written<br/>\n&gt; with HTTPUnit, are getting painful.  There is often a lot of<br/>\n&gt; set up needed (e.g., putting objects in the right state) to<br/>\n&gt; get to the point where the test can execute, as well as a lot<br/>\n&gt; of code to log in and navigate to the page where the test can<br/>\n&gt; run.  In some cases, the effort to write these tests is a<br/>\n&gt; significant percentage of the overall task efforts.<br/>\n&gt; <br/>\n&gt; Recently, developers have stopped writing these web tests,<br/>\n&gt; resorting to running the tests manually by hand.  Their<br/>\n&gt; reasoning is that the cost of writing the web tests is not<br/>\n&gt; justified by their benefits.  Others point out the issues<br/>\n&gt; with manual tests (inconsistent tests, the extra time to run<br/>\n&gt; them repeatedly, lack of documentation, etc.), and assert<br/>\n&gt; that the tests are worth the admittedly high costs.  We&#39;re<br/>\n&gt; having trouble reaching consensus.<br/>\n&gt; <br/>\n&gt; A related issue is that our QA folks have not been able to<br/>\n&gt; provide a suite of automated acceptance tests, which we<br/>\n&gt; presume should also test page navigation and contents as page<br/>\n&gt; of the user functionality tests.  They use a &quot;big&quot; testing<br/>\n&gt; tool (Seque), and we&#39;re not sure if we could use their tests<br/>\n&gt; in a day-to-day development environment, if they existed.<br/>\n&gt; <br/>\n&gt; So, in your opinion, should the developers be writing the web<br/>\n&gt; page navigation and contents tests?  IMHO, we should because<br/>\n&gt; this stuff can break, unless we can get QA to write them as<br/>\n&gt; part of the acceptance tests and we can share the tool to run<br/>\n&gt; them in the development environment.<br/>\n&gt; <br/>\n&gt; If so, should the tests be automated?  IMHO, they should for<br/>\n&gt; all the same reasons we automate any tests.<br/>\n&gt; <br/>\n&gt; Now, what about the cost?  Are there ways to reduce the costs<br/>\n&gt; of writing these type of tests?  Are there other tools we<br/>\n&gt; could be using?  At XPU, Lisa Crispin recommended WebART as<br/>\n&gt; a tool at this level.  I also heard discussion of patterns<br/>\n&gt; such as Object Mother for creating objects in a particular<br/>\n&gt; state for testing.  Comments here?<br/>\n&gt; <br/>\n&gt; Thanks much in advance for any suggestions.<br/>\n&gt; <br/>\n&gt; -Paul Hodgetts<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>__________________________________________________<br/>\nDo You Yahoo!?<br/>\nMake international calls for as low as $.04/minute with Yahoo! Messenger<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://phonecard.yahoo.com/\">http://phonecard.yahoo.com/</a></div>", 
    "prevInTime": 2251, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "997038816", 
    "canDelete": false, 
    "nextInTopic": 2253, 
    "prevInTopic": 2251, 
    "headers": {
        "inReplyToHeader": "PDQuMi4yLjIwMDEwODA1MTA0NTI5LjAwYzY0ZWIwQG1haWwuenp5enh0ZWsuY29tPg==", 
        "messageIdInHeader": "PDIwMDEwODA1MTkxMzM2LjUyOTM4LnFtYWlsQHdlYjE0OTA2Lm1haWwueWFob28uY29tPg=="
    }
}