{
    "topicId": 2251, 
    "postDate": "997046907", 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "from": "Paul Hodgetts &lt;prh@...&gt;", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "I_65Bq_IzvbUc8oJE-ceua-Y5pfao4kLRHWC9cLAy72KIxXJLjOmhuFzDLhQ8SNpeE8LCYVOvuTuIb-KrJJrf4JQ3sku3_Y", 
    "nextInTime": 2254, 
    "userId": 0, 
    "prevInTime": 2252, 
    "prevInTopic": 2252, 
    "headers": {
        "messageIdInHeader": "PDQuMi4yLjIwMDEwODA1MTI1MzMyLjAwYzY1MjcwQG1haWwuenp5enh0ZWsuY29tPg=="
    }, 
    "authorName": "Paul Hodgetts", 
    "numMessagesInTopic": 14, 
    "msgSnippet": "... Yes, it is a blurry line.  IMHO, the QA team should write tests that prove the functionality is available to the user.  Since the user accesses the", 
    "contentTrasformed": false, 
    "msgId": 2253, 
    "nextInTopic": 2254, 
    "systemMessage": false, 
    "rawEmail": "Return-Path: &lt;prh@...&gt;\r\nX-Sender: prh@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-7_2_0); 5 Aug 2001 21:28:35 -0000\r\nReceived: (qmail 12115 invoked from network); 5 Aug 2001 21:28:34 -0000\r\nReceived: from unknown (10.1.10.26) by m8.onelist.org with QMQP; 5 Aug 2001 21:28:34 -0000\r\nReceived: from unknown (HELO relay1.pair.com) (209.68.1.20) by mta1 with SMTP; 5 Aug 2001 21:28:34 -0000\r\nReceived: (qmail 9320 invoked from network); 5 Aug 2001 21:28:29 -0000\r\nReceived: from 2cust32.vr1.lax4.broadband.uu.net (HELO zxyzx) (63.13.232.32) by relay1.pair.com with SMTP; 5 Aug 2001 21:28:29 -0000\r\nX-pair-Authenticated: 63.13.232.32\r\nMessage-Id: &lt;4.2.2.20010805125332.00c65270@...&gt;\r\nX-Sender: zzyzx@... (Unverified)\r\nX-Mailer: QUALCOMM Windows Eudora Pro Version 4.2.2 \r\nDate: Sun, 05 Aug 2001 14:28:27 -0700\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] Need Advice on Unit Testing Pain\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;; format=flowed\r\nFrom: Paul Hodgetts &lt;prh@...&gt;\r\n\r\nMike Duffy wrote:\n\n &gt; In my opinion, developers should not write the web page navigation\n &gt; and contents tests.  This is not unit testing.  This is functional\n &gt; testing that should be done by the QA team.  Although I admit the\n &gt; line between unit and functional testing is sometimes blurry.\n\nYes, it is a blurry line.  IMHO, the QA team should write tests\nthat prove the functionality is available to the user.  Since the\nuser accesses the application via the web pages, this would imply\nthat they would need to write tests that simulate the user&#39;s use\nof the web pages.  But I&#39;m not sure that these functional tests\nwould always test the implementation of the web pages, which is\nwhere the developers may need to supplement them with tests that\nunderstand the underlying implementation and poke at it.\n\nThe main reason we would have the developers write these tests\nis because QA does not yet have the capabilities to write and\nperform these tests, which we can solve by increasing their\ncapabilities.  For now we have to cover this somehow.\n\nIn addition to QA not being able to perform these tests,\nthere&#39;s also an issue with trying to catch these errors as\nearly in the release cycle as possible.  The developers really\nshould be regularly running all the web tests.  If the tests\nare too time consuming to run as part of the pre-check in\nsuite, maybe we just run them a few times a day as part of a\nbackground build verify process.  If these errors make it to\na QA build, it takes more effort to fix them and then build\nand deploy new releases than it does to catch them sooner.  We\ncan work on making the release to QA easier and more a part of\nthe daily process, rather than a discrete step.\n\nHow does your process work in these areas?\n\n &gt; An effective approach would be to use a design pattern called Front\n &gt; Controller:  &quot;Centralize view management (navigation, templating,\n &gt; security, etc.) for a Web application in a single object that handles\n &gt; incoming client requests .&quot;\n &gt;\n &gt; \n(http://java.sun.com/j2ee/blueprints/design_patterns/front_controller/index. \nhtml&#92;).\n &gt;\n &gt;\n &gt; With Front Controller you can gut all of your business logic out of\n &gt; your servlets and JSPs.  Your business logic would be contained in\n &gt; separate classes which can be unit tested.\n\nYes, we use this pattern, along with other J2EE presentation\npatterns.  Even with Front Controllers, and View Helpers, and\nother things that drive code off of the pages, there is still\na layer, however thin, that rests on the surface area of the\napplication.  IMHO, we still need to verify that this layer\ncontains the correct contents and links, and perhaps even has\nthem displayed at the correct position in the correct font,\ncolor, etc.  Also, the underlying controllers and helpers\nhave a degree of dependency on things like the HTTP request\nand session, so it&#39;s not always simple to test them in\nisolation from the web context.  How do you deal with these\nissues?\n\nThanks for your comments,\n-Paul Hodgetts\n\n\n", 
    "subject": "Re: [junit] Need Advice on Unit Testing Pain"
}