{
    "topicId": 2251, 
    "postDate": "997049787", 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "from": "Robert Leftwich &lt;digital@...&gt;", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "qnXFHfDWCE-lpe-CWwmZPYSt37tJGFx5m27YxUmMaqQuAScfl5-r-bNPnnEo1cfGIY5m1R3xs17Ni4uOxMhORhSj-EBFfMYsUxg", 
    "nextInTime": 2255, 
    "userId": 0, 
    "prevInTime": 2253, 
    "prevInTopic": 2253, 
    "headers": {
        "inReplyToHeader": "PDQuMi4yLjIwMDEwODA1MTA0NTI5LjAwYzY0ZWIwQG1haWwuenp5enh0ZWsuY29tPg==", 
        "messageIdInHeader": "PDUuMS4wLjE0LjAuMjAwMTA4MDYwNzM4MjAuMDNkNGY2ZTBAZHVhbD4=", 
        "referencesHeader": "PDk5NzAwODI5Ny41NjIuNjQ0NjgubDEwQHlhaG9vZ3JvdXBzLmNvbT4="
    }, 
    "authorName": "Robert Leftwich", 
    "numMessagesInTopic": 14, 
    "msgSnippet": "I have been using mock objects (in particular EasyMock - http://tammofreese.de/easymock/index.html, it s great!) to ease the sort of pain you are talking", 
    "contentTrasformed": false, 
    "msgId": 2254, 
    "nextInTopic": 2256, 
    "systemMessage": false, 
    "rawEmail": "Return-Path: &lt;digital@...&gt;\r\nX-Sender: digital@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-7_2_0); 5 Aug 2001 22:17:54 -0000\r\nReceived: (qmail 17594 invoked from network); 5 Aug 2001 22:17:53 -0000\r\nReceived: from unknown (10.1.10.26) by l10.egroups.com with QMQP; 5 Aug 2001 22:17:53 -0000\r\nReceived: from unknown (HELO mail.ix.net.au) (203.33.239.11) by mta1 with SMTP; 5 Aug 2001 22:17:53 -0000\r\nReceived: from localhost (U067.P01.tnt1.bhs.au.psi.net [203.76.45.67]) by mail.ix.net.au (8.9.3/8.8.7) with SMTP id IAA18700 for &lt;junit@yahoogroups.com&gt;; Mon, 6 Aug 2001 08:16:28 +1000\r\nReceived: from fastdual.ix.net.au ([192.168.0.1]) by localmail with ESMTP id 486 for &lt;junit@yahoogroups.com&gt;; Mon, 6 Aug 2001 08:18:17 +1000\r\nX-Mail-Server: Eserv/2.95/Digital Innovations Pty Ltd\r\nMessage-Id: &lt;5.1.0.14.0.20010806073820.03d4f6e0@dual&gt;\r\nX-Sender: robert@dual\r\nX-Mailer: QUALCOMM Windows Eudora Version 5.1\r\nDate: Mon, 06 Aug 2001 08:16:27 +1000\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] Need Advice on Unit Testing Pain\r\nIn-Reply-To: &lt;4.2.2.20010805104529.00c64eb0@...&gt;\r\nReferences: &lt;997008297.562.64468.l10@yahoogroups.com&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;; format=flowed\r\nFrom: Robert Leftwich &lt;digital@...&gt;\r\n\r\nI have been using mock objects (in particular EasyMock - \nhttp://tammofreese.de/easymock/index.html, it&#39;s great!) to ease the sort of \npain you are talking about.\n\nI have found that using mock objects for the servlet specific classes \nenables me to easily test the page content (using XPath expressions on the \nDOM produced by the Java presentation classes) and the navigation, firstly \nby checking the links, etc in the page content and secondly by checking any \nredirection performed in the Java code. I am not doing J2EE (I use \nEnhydra/Barracuda servlets) so I don&#39;t know how easy it would be to setup \nthe mock objects for that environment but it is extremely simple, using \nEasyMock at least, to setup HttpRequest/Response/Session objects to enable \nthis sort of testing using JUnit.\n\nThe bonus of this approach is that you don&#39;t need to wait for any web \nenvironment to start-up before you can run the tests, so it is faster. In \naddition all the tests are purely JUnit-based, so there is no additional \ntesting frameworks to learn or keep up to date. Also, you can use \ntest-first design on all the layers in your application, even the app \nserver specific areas.\nThe drawbacks are firstly that it doesn&#39;t do functional testing, in the \nsense of complete end to end tests in the environment that will be used in \nproduction (but that isn&#39;t your problem). Secondly, EasyMock requires java \n1.3 which may be an issue for some people. Thirdly, it does take a little \ntime to setup the mock objects behavior, but nothing like the time it used \nto take me to setup HttpUnit tests.\n\nBy way of illustration, I found 5 bugs (admittedly somewhat obscure) on the \nfirst page I used this technique on, a login page that had been in \nproduction for some months, purely because it was easy to setup a number of \ndifferent scenarios in the mock objects that the login code used.\n\nHTH\n\nRobert\n\nPS The code I am testing is very much as thin as possible, I make heavy use \nof facades to make the ui/web server specific code as simple as I can, \noriginally in the hope that it couldn&#39;t possible break, so it wouldn&#39;t need \nunit testing. However, the recent releases I have made have had problems \nfound by QA in that thin layer (and only in that layer) that wasn&#39;t being \nunit tested, hence the use of mock objects.\n\n\nAt 04:37 AM 6/08/2001, Paul Hodgetts wrote:\n&gt;We are developing a J2EE-based web application, and we&#39;ve been\n&gt;getting better and better at our testing.  Recently we reached\n&gt;a pain threshold that&#39;s causing us to make a compromise trade\n&gt;off.  Perhaps you folks can offer some suggestions.\n&gt;\n&gt;The developers write unit test for all layers of the system,\n&gt;from the web pages to the smallest methods.  For most tests,\n&gt;we use JUnit and for the web tests we use HTTPUnit.\n&gt;\n&gt;The highest level of the web tests check for the page flow\n&gt;(link navigation) and for page contents.  These tests, written\n&gt;with HTTPUnit, are getting painful.  There is often a lot of\n&gt;set up needed (e.g., putting objects in the right state) to\n&gt;get to the point where the test can execute, as well as a lot\n&gt;of code to log in and navigate to the page where the test can\n&gt;run.  In some cases, the effort to write these tests is a\n&gt;significant percentage of the overall task efforts.\n&gt;\n&gt;Recently, developers have stopped writing these web tests,\n&gt;resorting to running the tests manually by hand.  Their\n&gt;reasoning is that the cost of writing the web tests is not\n&gt;justified by their benefits.  Others point out the issues\n&gt;with manual tests (inconsistent tests, the extra time to run\n&gt;them repeatedly, lack of documentation, etc.), and assert\n&gt;that the tests are worth the admittedly high costs.  We&#39;re\n&gt;having trouble reaching consensus.\n&gt;\n&gt;A related issue is that our QA folks have not been able to\n&gt;provide a suite of automated acceptance tests, which we\n&gt;presume should also test page navigation and contents as page\n&gt;of the user functionality tests.  They use a &quot;big&quot; testing\n&gt;tool (Seque), and we&#39;re not sure if we could use their tests\n&gt;in a day-to-day development environment, if they existed.\n&gt;\n&gt;So, in your opinion, should the developers be writing the web\n&gt;page navigation and contents tests?  IMHO, we should because\n&gt;this stuff can break, unless we can get QA to write them as\n&gt;part of the acceptance tests and we can share the tool to run\n&gt;them in the development environment.\n&gt;\n&gt;If so, should the tests be automated?  IMHO, they should for\n&gt;all the same reasons we automate any tests.\n&gt;\n&gt;Now, what about the cost?  Are there ways to reduce the costs\n&gt;of writing these type of tests?  Are there other tools we\n&gt;could be using?  At XPU, Lisa Crispin recommended WebART as\n&gt;a tool at this level.  I also heard discussion of patterns\n&gt;such as Object Mother for creating objects in a particular\n&gt;state for testing.  Comments here?\n&gt;\n&gt;Thanks much in advance for any suggestions.\n&gt;\n&gt;-Paul Hodgetts\n&gt;\n&gt;\n&gt;\n&gt;To unsubscribe from this group, send an email to:\n&gt;junit-unsubscribe@yahoogroups.com\n&gt;\n&gt;\n&gt;Your use of Yahoo! Groups is subject to http://docs.yahoo.com/info/terms/\n\n\n", 
    "subject": "Re: [junit] Need Advice on Unit Testing Pain"
}