{
    "numMessagesInTopic": 14, 
    "nextInTime": 2258, 
    "senderId": "6F30S7hc2zRXvVPEadGnjsitqE6blzufJU0dQrH91wA56dGpha0H6T5Fo0AH37iWA3eeG_E_mGhcL1RSX_i6nbqCjqUkFFqfEkvyWSGTFg", 
    "systemMessage": false, 
    "subject": "Re: [junit] Need Advice on Unit Testing Pain", 
    "from": "&quot;Johannes O. Akinlaja&quot; &lt;joa@...&gt;", 
    "authorName": "Johannes O. Akinlaja", 
    "msgSnippet": "Hi Mike, ... But in the situation described by Paul, there is no QA Staff available to do so. Do I get it right that in your opinion in such a situations there", 
    "msgId": 2257, 
    "topicId": 2251, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-99274396\">Hi Mike,<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In my opinion, developers should not write the web page navigation<br/>\n&gt; and contents tests.  This is not unit testing.  This is functional<br/>\n&gt; testing that should be done by the QA team.  Although I admit the<br/>\n&gt; line between unit and functional testing is sometimes blurry.<br/>\n<br/>\n </span></blockquote>    But in the situation described by Paul, there is no QA Staff available<br/>\nto do so. Do I get it right that in your opinion in such a situations there<br/>\nis no need for functional testing?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; With Front Controller you can gut all of your business logic out of<br/>\n&gt; your servlets and JSPs.  Your business logic would be contained in<br/>\n&gt; separate classes which can be unit tested.<br/>\n&gt; Mike<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>    IMHO, even if I am going the model 2 way and my business logic layer is<br/>\ndoing fine, the presentation layer can break and bugs in the integration are<br/>\nrather likely to be coded.<br/>\n<br/>\n    IMHO, you should do functional testing. Yes, I had the same problem with<br/>\nHttpUnit when using it for unit tests. But for functional testing I believe<br/>\nit to be a great help and a wonderful tool (Thank you Russel Gold et al.).<br/>\nKeeping the functional tests up with other tools (even with graphical tools<br/>\nfor none programmers) will also be a pain, if design changes very rapidly.<br/>\n<br/>\n    IMHO, if  QA staff cannot write the functional tests, it will at least<br/>\nbe in the position to describe the functional tests. Thus if I am up to<br/>\nintegrating my stuff - I tend to think of writing the controler of model 2<br/>\nas integration - I write down the stories related to my integration. If<br/>\nthese functional tests go fine, I am done with integrating. If the design is<br/>\nabout to change in a way, that it will affect my test code, I tell<br/>\nmanagement about this. No one ever stated, that changes in requirements or<br/>\ndesign come for free. Thus I do testing with HttpUnit, but on functional<br/>\nlevel and not unit level. And using it this way, the pain my collegues and I<br/>\nhad with keeping the tests up is quite okay. And if you are straight with<br/>\nmanagement about the costs of change, unnecessary changes in design (the<br/>\ntypical: &quot;Oh, let&#39;s do that, because at the time I, the manager or marketing<br/>\nperson, believe it to be cool.&quot;) are not very likely.<br/>\n<br/>\nToyin</div>", 
    "prevInTime": 2256, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "997088320", 
    "canDelete": false, 
    "nextInTopic": 2258, 
    "prevInTopic": 2256, 
    "headers": {
        "messageIdInHeader": "PDAwNTkwMWMxMWU1NSRmZDQ2MjI5MCRjZTAxYThjMEBhbnRpc3RoZW5lcz4=", 
        "referencesHeader": "PDIwMDEwODA1MTkxMzM2LjUyOTM4LnFtYWlsQHdlYjE0OTA2Lm1haWwueWFob28uY29tPg=="
    }
}