{
    "numMessagesInTopic": 6, 
    "nextInTime": 22640, 
    "senderId": "6aih1-Mt0Yk95b0baql16aBtqRzHmvFVjBfSsnI_cQ5oWiALSGKHUJvnkwpOM2T_3_vh8T6Bb2E7PqdkQ1mc8y0RwlVdmPjBB2OYJxgpNLwEQj7YiUJr", 
    "systemMessage": true, 
    "subject": "Re: String concatenation is costly -  WAS: Disabling test code generation globally?", 
    "from": "&quot;Bogdan&quot; &lt;bogdan.mocanu.notifications@...&gt;", 
    "authorName": "Bogdan", 
    "msgSnippet": "Hi tomte, indeed, if you have a multitude of such operations, the difference in the generated compiled code can be of some importance. However, since we are", 
    "msgId": 22639, 
    "profile": "bogdanmocanu2011", 
    "topicId": 22632, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 414734247, 
    "messageBody": "<div id=\"ygrps-yiv-555966145\">Hi tomte,<br/>\n<br/>\nindeed, if you have a multitude of such operations, the difference in the generated compiled code can be of some importance.<br/>\n<br/>\nHowever, since we are talking here about unit tests, these are parts of your project that are not packaged and deployed with your binaries. Unit tests are executed, and if passed ok they are then ignored, when the final package is created. <br/>\n<br/>\nTherefore, I think the concern for this difference in the compiled code is not justified. <br/>\n<br/>\nMoreover, I don&#39;t think it is possible to make the compiler ommit parts of the code based on annotations. At most you can benefit of the smart features of the compiler that, as you said, eliminates the parts of the code that cannot be reached because of some final condition. So you could technically define a multitude of final constants, like some switches, that can enable/disable parts of the unit tests.<br/>\n<br/>\nBut I repeat: I think the effort is not justified. We are talking here about unit tests, which are not deployed on client&#39;s system.<br/>\n<br/>\nCheers,<br/>\nBogdan<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;tomte_da&quot; &lt;taeger@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi,<br/>\n&gt; yes, String concatenation is known to be a serious performance lack. <br/>\n&gt; <br/>\n&gt; And it also blows up the size of the compiled code without use. At least for code to be transmitted over the Internet (e.g. by Java Web Start or in Applets) this should be avoided too. <br/>\n&gt; <br/>\n&gt; Java does conditional compilation if the condition is final.<br/>\n&gt; <br/>\n&gt; Without conditional compilation there is no other way than commenting out the hundreds of assertions manually - not really realistic. This keeps me from using standard test frameworks in my own projects. <br/>\n&gt; <br/>\n&gt; In my own logger I have such a global boolean flag to disable test code generation. But this also can not stop those message String concatenations because these are done before passing the resulting String to the internally disabled assertTrue(message, ok) method.<br/>\n&gt; <br/>\n&gt; Would it be technically impossible to solve this through an annotation like e.g. @EnableTestCodeGeneration? Annotations are recognized at compile time.<br/>\n&gt; <br/>\n&gt; tomte<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 22638, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1272044486", 
    "canDelete": false, 
    "nextInTopic": 22642, 
    "prevInTopic": 22636, 
    "headers": {
        "inReplyToHeader": "PGhxczg3NCsybjZ2QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGhxc200NisyYWVsQGVHcm91cHMuY29tPg=="
    }
}