{
    "numMessagesInTopic": 7, 
    "nextInTime": 22659, 
    "senderId": "c0Q7eczNljX3HJGL_KKgf4hSJV8S_aHOOenqnHT9-A4HpH0EQYcKlfin8e2PFrFKa7-gMdA1mMPyYVP0cK8lB9_X", 
    "systemMessage": true, 
    "subject": "Re: [junit] Test runtime scenario using junit", 
    "from": "Ananth &lt;cbananth@...&gt;", 
    "authorName": "Ananth", 
    "msgSnippet": "Hi David, Thanks for the reply. To answer your question, I need to somehow pass the objects into the Junit test to call the method. Let me explain the scenario", 
    "msgId": 22658, 
    "profile": "cbananth", 
    "topicId": 22654, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 195014801, 
    "messageBody": "<div id=\"ygrps-yiv-1933433892\">Hi David,<br/>\nThanks for the reply. To answer your question, I need to somehow pass the<br/>\nobjects into the Junit test to call the method.<br/>\n<br/>\nLet me explain the scenario better. My problem is not that i am unable to<br/>\ntest the small code change. I would be able to write testmethods only to<br/>\nexercise that part of the code. But in order to simulate a run time<br/>\nscenario, i need hav a lot of objects populated already.<br/>\n<br/>\nThe kind of environment i need to simulate before calling the test method,<br/>\nis something like this.<br/>\nI need to have a VmwareESX host to be registered in my application database,<br/>\nand identify what are the VMs installed on that machine and and trigger an<br/>\noperation on those VMs to move from one host to another.<br/>\n<br/>\nThis kind of scenario is very difficult to populate on objects. I was<br/>\nlooking at a way to do those operations manually on my running application,<br/>\nand attach the Junit test class to the already running process where i will<br/>\nalready have the environment. I can use my application to do those set up<br/>\noperations before i trigger the junit test case.<br/>\n<br/>\nThis is very similar to how we can attach an eclipse debugger to a running<br/>\nwindows service and point to a source code to debug. The parameters eclipse<br/>\nwould take for that (remote debugging) are ip address and port number.<br/>\n<br/>\nIs there anything similar available with Junit framework?<br/>\n<br/>\nHope i have not confused you even more :)<br/>\n<br/>\nRegards<br/>\nAnanth<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, Apr 30, 2010 at 6:18 AM, David Saff &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:david@...\">david@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Ananth,<br/>\n&gt;<br/>\n&gt; Needing to change a small area in a large, tangled codebase is an<br/>\n&gt; all-too-familiar problem. If you haven&#39;t already read Michael<br/>\n&gt; Feather&#39;s Working Effectively With Legacy Code, you&#39;ll likely get a<br/>\n&gt; lot out of it. The short version is: for every hour that you spend<br/>\n&gt; writing tests that have to work around these large dependencies, if<br/>\n&gt; you can find at least another hour to improve the design of the tested<br/>\n&gt; code to reduce those dependencies, the second hour will very often pay<br/>\n&gt; itself off fairly quickly.<br/>\n&gt;<br/>\n&gt; That said, can you help me understand the scenario you have in mind?<br/>\n&gt; Especially, are the objects that need to be populated somehow globally<br/>\n&gt; accessible, or do you need to somehow pass them into the JUnit test?<br/>\n&gt; Thanks,<br/>\n&gt;<br/>\n&gt; David<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Fri, Apr 30, 2010 at 5:17 AM, cbananth &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cbananth@...\">cbananth@...</a>&lt;cbananth%40gmail.com&gt;&gt;<br/>\n&gt; wrote:<br/>\n&gt; &gt; Hi,<br/>\n&gt; &gt; Is it possible to test a runtime scenario using junit? For instance,<br/>\n&gt; similar to attaching an eclipse debugger to a running process, attach a<br/>\n&gt; junit test suite to an already running JVM?<br/>\n&gt; &gt;<br/>\n&gt; &gt; The reason why I have this doubt is because, I am making changes to a<br/>\n&gt; small part of a huge code base, but in order to test the small code change a<br/>\n&gt; lot of other objects have to be populated before invoking the test method.<br/>\n&gt; Also, attaching to a running process similar to eclipse debugger, would help<br/>\n&gt; me simulate run time scenarios and check if expected exceptions are thrown<br/>\n&gt; by the method being tested by Junit.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Please get back to me if my question is not clear.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Thank you<br/>\n&gt; &gt;<br/>\n&gt; &gt; Regards<br/>\n&gt; &gt; Ananth<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; ------------------------------------<br/>\n&gt; &gt;<br/>\n&gt; &gt; Yahoo! Groups Links<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nRegards<br/>\nAnanth<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 22657, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1272652358", 
    "canDelete": false, 
    "nextInTopic": 22659, 
    "prevInTopic": 22655, 
    "headers": {
        "inReplyToHeader": "PHYyaTRmN2RhNmI5MTAwNDMwMDYxOG41MzdmNDRkY3liMjAxYWFlNGJkZGNjZWYzQG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PGgybWJkZjI5M2RlMTAwNDMwMTEzMng0ODNiMjcxOWg4MDc3NDExYWFjODM0ZjI4QG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PGhyZTc3Nyt2MmV2QGVHcm91cHMuY29tPgkgPHYyaTRmN2RhNmI5MTAwNDMwMDYxOG41MzdmNDRkY3liMjAxYWFlNGJkZGNjZWYzQG1haWwuZ21haWwuY29tPg=="
    }
}