{
    "numMessagesInTopic": 23, 
    "nextInTime": 22664, 
    "senderId": "MS5FSDHa6hrvs99_bTrE3YwTrt7cfBAXvvnktr6U10s6MNarjtJPCsLauZjv-iuuBR3YJriXoOLg4RlQ3mRfZq9iqrGj4htq4Px4F2vOiqc", 
    "systemMessage": true, 
    "subject": "Re: [junit] When it matters most, don&#39;t forget your tests.", 
    "from": "Dennis Lloyd Jr &lt;dennislloydjr@...&gt;", 
    "authorName": "Dennis Lloyd Jr", 
    "msgSnippet": "Hi Mike, I think it s interesting that under the heat of an interview, TDD practices get dumped. The same seems to happen to many developers under the heat", 
    "msgId": 22663, 
    "profile": "dennis_lloyd_jr", 
    "topicId": 22661, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 328428134, 
    "messageBody": "<div id=\"ygrps-yiv-875094821\">Hi Mike,<br/>\nI think it&#39;s interesting that under the &quot;heat&quot; of an interview, TDD<br/>\npractices get dumped. The same seems to happen to many developers under the<br/>\nheat of a challenging deadline. When I interviewed candidates in the past, I<br/>\npay close attention to if they mention TDD or automated unit testing. If<br/>\nthey don&#39;t mention it themselves, I ask. That is because I believe it is one<br/>\nof most important (perhaps THE most important) development skills. I also<br/>\nask a lot of questions regarding test case identification.<br/>\n<br/>\nIt has been a long time since I was on an interview which asked me to write<br/>\ncode. However, the last interview I was on, I was presented with a code<br/>\nsample and asked what was wrong with it. It was a single function, spanning<br/>\nthree printed pages, with a &quot;bug&quot; somewhere in it. I told the interviewer<br/>\nthat the problem was there were no unit tests, and the code was not clearly<br/>\nwritten - after fixing those two things, the bug should be obvious.<br/>\n<br/>\nIt&#39;s easy to forget these things during an interview. Developer interviews<br/>\nthat I have seen tend to focus on specific developer experiences, such as<br/>\nfamiliarity with specific languages or technologies, or knowledge of a<br/>\ncertain domain. It is easy for the interviewer and candidate to get lost in<br/>\nthese details and forget good practices. I think this focus is generally a<br/>\nmistake. I think the focus should be on demonstrating experience with good<br/>\ndevelopment practices, good design, testing, well-written code, along with a<br/>\ndesire to learn and grow as a developer on a team.<br/>\n<br/>\nCheers,<br/>\nDennis<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, May 1, 2010 at 9:17 AM, Mike Forsberg &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bigmike.f@...\">bigmike.f@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; This may be better in a blog post, which I will hopefully get to...<br/>\n&gt; but I&#39;d like to pose two questions to the group first. Let&#39;s call it<br/>\n&gt; research.<br/>\n&gt;<br/>\n&gt; I&#39;ve just completed a set of interviews and looking back on the coding<br/>\n&gt; questions. I realized that I never followed my test first mantra that<br/>\n&gt; I perform at home.<br/>\n&gt;<br/>\n&gt; First question, to those giving the interview... Would you ever<br/>\n&gt; suggest/remind a candidate of TDD style in his/her code?<br/>\n&gt;<br/>\n&gt; Second question, why on earth does a candidate, like myself, forget to<br/>\n&gt; write tests and incrementally improve their code? Do this show a lack<br/>\n&gt; of software development maturity?<br/>\n&gt;<br/>\n&gt; As a community reminder, and to myself.... don&#39;t forget TDD style on<br/>\n&gt; interviews.<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 22662, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1272743663", 
    "canDelete": false, 
    "nextInTopic": 22664, 
    "prevInTopic": 22661, 
    "headers": {
        "inReplyToHeader": "PHEycGE1MjdmZGRmMTAwNTAxMDUxN2kxZGY4ZTgxMm4yNzNjZDQzMzQ4ZjQwNmRhQG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PHUydmYyYzZiMGU4MTAwNTAxMTI1NHE5OTYxNWIzNm9jYzU5ZDljNTg4M2FlOTI4QG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PHEycGE1MjdmZGRmMTAwNTAxMDUxN2kxZGY4ZTgxMm4yNzNjZDQzMzQ4ZjQwNmRhQG1haWwuZ21haWwuY29tPg=="
    }
}