{
    "numMessagesInTopic": 23, 
    "nextInTime": 22676, 
    "senderId": "JXyYc8JHn2c3NcVt4O557Uq1oYV2P0is46ErqalOIig5x7WLJZO1d9EehEcsy4vr5jTVnvmwmZNAupShi828Y5U5cr2k9w", 
    "systemMessage": false, 
    "subject": "Re: [junit] When it matters most, don&#39;t forget your tests.", 
    "from": "Kent Beck &lt;kentb@...&gt;", 
    "authorName": "Kent Beck", 
    "msgSnippet": "To the OP, I think you forgot TDD because you re human. Hard to cure, but perfectly understandable :-) To all, if you expect developers to use TDD in their", 
    "msgId": 22675, 
    "profile": "kentlbeck", 
    "topicId": 22661, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 173198504, 
    "messageBody": "<div id=\"ygrps-yiv-896287448\">To the OP, I think you forgot TDD because you&#39;re human. Hard to cure, but perfectly understandable :-)<br/>\n<br/>\nTo all, if you expect developers to use TDD in their work, it makes perfect sense to ask them to demonstrate it in an interview. There are a wide range of TDD skills (working on TDD screencasts at the moment continually reminds both how much I know and how very much I don&#39;t). If you are pressed for time, you might be able to get some good information by asking them to list the tests they would write for a given problem instead of actually coding.<br/>\n<br/>\nRegards,<br/>\n<br/>\nKent<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 1, 2010, at 12:54 PM, Dennis Lloyd Jr wrote:<br/>\n<br/>\n&gt; Hi Mike,<br/>\n&gt; I think it&#39;s interesting that under the &quot;heat&quot; of an interview, TDD<br/>\n&gt; practices get dumped. The same seems to happen to many developers under the<br/>\n&gt; heat of a challenging deadline. When I interviewed candidates in the past, I<br/>\n&gt; pay close attention to if they mention TDD or automated unit testing. If<br/>\n&gt; they don&#39;t mention it themselves, I ask. That is because I believe it is one<br/>\n&gt; of most important (perhaps THE most important) development skills. I also<br/>\n&gt; ask a lot of questions regarding test case identification.<br/>\n&gt; <br/>\n&gt; It has been a long time since I was on an interview which asked me to write<br/>\n&gt; code. However, the last interview I was on, I was presented with a code<br/>\n&gt; sample and asked what was wrong with it. It was a single function, spanning<br/>\n&gt; three printed pages, with a &quot;bug&quot; somewhere in it. I told the interviewer<br/>\n&gt; that the problem was there were no unit tests, and the code was not clearly<br/>\n&gt; written - after fixing those two things, the bug should be obvious.<br/>\n&gt; <br/>\n&gt; It&#39;s easy to forget these things during an interview. Developer interviews<br/>\n&gt; that I have seen tend to focus on specific developer experiences, such as<br/>\n&gt; familiarity with specific languages or technologies, or knowledge of a<br/>\n&gt; certain domain. It is easy for the interviewer and candidate to get lost in<br/>\n&gt; these details and forget good practices. I think this focus is generally a<br/>\n&gt; mistake. I think the focus should be on demonstrating experience with good<br/>\n&gt; development practices, good design, testing, well-written code, along with a<br/>\n&gt; desire to learn and grow as a developer on a team.<br/>\n&gt; <br/>\n&gt; Cheers,<br/>\n&gt; Dennis<br/>\n&gt; <br/>\n&gt; On Sat, May 1, 2010 at 9:17 AM, Mike Forsberg &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bigmike.f@...\">bigmike.f@...</a>&gt; wrote:<br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; This may be better in a blog post, which I will hopefully get to...<br/>\n&gt; &gt; but I&#39;d like to pose two questions to the group first. Let&#39;s call it<br/>\n&gt; &gt; research.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I&#39;ve just completed a set of interviews and looking back on the coding<br/>\n&gt; &gt; questions. I realized that I never followed my test first mantra that<br/>\n&gt; &gt; I perform at home.<br/>\n&gt; &gt;<br/>\n&gt; &gt; First question, to those giving the interview... Would you ever<br/>\n&gt; &gt; suggest/remind a candidate of TDD style in his/her code?<br/>\n&gt; &gt;<br/>\n&gt; &gt; Second question, why on earth does a candidate, like myself, forget to<br/>\n&gt; &gt; write tests and incrementally improve their code? Do this show a lack<br/>\n&gt; &gt; of software development maturity?<br/>\n&gt; &gt;<br/>\n&gt; &gt; As a community reminder, and to myself.... don&#39;t forget TDD style on<br/>\n&gt; &gt; interviews.<br/>\n&gt; &gt; <br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 22674, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1272931167", 
    "canDelete": false, 
    "nextInTopic": 22676, 
    "prevInTopic": 22673, 
    "headers": {
        "inReplyToHeader": "PHUydmYyYzZiMGU4MTAwNTAxMTI1NHE5OTYxNWIzNm9jYzU5ZDljNTg4M2FlOTI4QG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PDRFREE2REE0LTE3MEEtNEM5Mi04MDA4LTg5RDA5MzkyMTQzMEBlYXJ0aGxpbmsubmV0Pg==", 
        "referencesHeader": "PHEycGE1MjdmZGRmMTAwNTAxMDUxN2kxZGY4ZTgxMm4yNzNjZDQzMzQ4ZjQwNmRhQG1haWwuZ21haWwuY29tPiA8dTJ2ZjJjNmIwZTgxMDA1MDExMjU0cTk5NjE1YjM2b2NjNTlkOWM1ODgzYWU5MjhAbWFpbC5nbWFpbC5jb20+"
    }
}