{
    "numMessagesInTopic": 23, 
    "nextInTime": 22677, 
    "senderId": "e2cwKZbLraauWfECHUwi8bZBfP8Hn5HyOXpURkZu8PWVvMSM60YZGbOE0L0K0T5zNzyYY77UgKnGATaPMUwIgINGsJC4HqTb-_9dFi97rOgj3Mwblr_F", 
    "systemMessage": false, 
    "subject": "RE: [junit] When it matters most, don&#39;t forget your tests.", 
    "from": "&quot;Loritsch, Berin C.&quot; &lt;berin.loritsch@...&gt;", 
    "authorName": "Loritsch, Berin C.", 
    "msgSnippet": "I ve been silent on this for a while, but I did want to chime in.  If you require TDD in your project, you should resign yourself to the fact that you will", 
    "msgId": 22676, 
    "profile": "bloritsch", 
    "topicId": 22661, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 428096731, 
    "messageBody": "<div id=\"ygrps-yiv-1738982101\">I&#39;ve been silent on this for a while, but I did want to chime in.  If<br/>\nyou require TDD in your project, you should resign yourself to the fact<br/>\nthat you will have to train the prospects on what you mean by that and<br/>\nwhat level of testing you require even under deadline.  The sad truth is<br/>\nthat many projects claim to be &quot;agile&quot; only so they can throw away the<br/>\nmost fundamental engineering practices (like CM, much less testing).<br/>\nThe later a project is, the more they will look to throw away what they<br/>\nreally feel are unnecessary practices, or barriers to progress.<br/>\nFundamental CM and project management will work with the client to<br/>\nadjust scope or deadline, but we won&#39;t go there for the moment.<br/>\n<br/>\nWhat I&#39;ve found as a result of this phenomenon is that the vast majority<br/>\nof people I interview have no concept of unit testing, much less TDD.<br/>\nThat doesn&#39;t mean that the people are bad resources.  It just means that<br/>\nunit testing hasn&#39;t saved their bacon yet, and they haven&#39;t been<br/>\nrequired to stick to it long enough for that to happen.  What that means<br/>\nis that I have to build time into my schedule to teach how unit testing<br/>\nworks, and how TDD works.  I&#39;ll relax the requirement for the tests to<br/>\nbe written first for these folks, as long as the tests get written.<br/>\nPart of the training progress is showing them where they are either<br/>\nwriting too much code, or not enough tests.<br/>\n<br/>\nI tend to focus on the more critical aspects of troubleshooting skills,<br/>\nand determining if their claimed skills are just paper thin.  After that<br/>\nI check their willingness to do TDD.  My assumption is that I&#39;m going to<br/>\nhave to teach them.  Running these engineering tests are only necessary<br/>\nwhen you are dealing with junior positions.<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>] On Behalf Of<br/>\nKent Beck<br/>\nSent: Monday, May 03, 2010 7:59 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSubject: Re: [junit] When it matters most, don&#39;t forget your tests.<br/>\n<br/>\nTo the OP, I think you forgot TDD because you&#39;re human. Hard to cure,<br/>\nbut perfectly understandable :-)<br/>\n<br/>\nTo all, if you expect developers to use TDD in their work, it makes<br/>\nperfect sense to ask them to demonstrate it in an interview. There are a<br/>\nwide range of TDD skills (working on TDD screencasts at the moment<br/>\ncontinually reminds both how much I know and how very much I don&#39;t). If<br/>\nyou are pressed for time, you might be able to get some good information<br/>\nby asking them to list the tests they would write for a given problem<br/>\ninstead of actually coding.<br/>\n<br/>\nRegards,<br/>\n<br/>\nKent<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 1, 2010, at 12:54 PM, Dennis Lloyd Jr wrote:<br/>\n<br/>\n&gt; Hi Mike,<br/>\n&gt; I think it&#39;s interesting that under the &quot;heat&quot; of an interview, TDD<br/>\n&gt; practices get dumped. The same seems to happen to many developers<br/>\nunder the<br/>\n&gt; heat of a challenging deadline. When I interviewed candidates in the<br/>\npast, I<br/>\n&gt; pay close attention to if they mention TDD or automated unit testing.<br/>\nIf<br/>\n&gt; they don&#39;t mention it themselves, I ask. That is because I believe it<br/>\nis one<br/>\n&gt; of most important (perhaps THE most important) development skills. I<br/>\nalso<br/>\n&gt; ask a lot of questions regarding test case identification.<br/>\n&gt; <br/>\n&gt; It has been a long time since I was on an interview which asked me to<br/>\nwrite<br/>\n&gt; code. However, the last interview I was on, I was presented with a<br/>\ncode<br/>\n&gt; sample and asked what was wrong with it. It was a single function,<br/>\nspanning<br/>\n&gt; three printed pages, with a &quot;bug&quot; somewhere in it. I told the<br/>\ninterviewer<br/>\n&gt; that the problem was there were no unit tests, and the code was not<br/>\nclearly<br/>\n&gt; written - after fixing those two things, the bug should be obvious.<br/>\n&gt; <br/>\n&gt; It&#39;s easy to forget these things during an interview. Developer<br/>\ninterviews<br/>\n&gt; that I have seen tend to focus on specific developer experiences, such<br/>\nas<br/>\n&gt; familiarity with specific languages or technologies, or knowledge of a<br/>\n&gt; certain domain. It is easy for the interviewer and candidate to get<br/>\nlost in<br/>\n&gt; these details and forget good practices. I think this focus is<br/>\ngenerally a<br/>\n&gt; mistake. I think the focus should be on demonstrating experience with<br/>\ngood<br/>\n&gt; development practices, good design, testing, well-written code, along<br/>\nwith a<br/>\n&gt; desire to learn and grow as a developer on a team.<br/>\n&gt; <br/>\n&gt; Cheers,<br/>\n&gt; Dennis<br/>\n&gt; <br/>\n&gt; On Sat, May 1, 2010 at 9:17 AM, Mike Forsberg &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bigmike.f@...\">bigmike.f@...</a>&gt;<br/>\nwrote:<br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; This may be better in a blog post, which I will hopefully get to...<br/>\n&gt; &gt; but I&#39;d like to pose two questions to the group first. Let&#39;s call it<br/>\n&gt; &gt; research.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I&#39;ve just completed a set of interviews and looking back on the<br/>\ncoding<br/>\n&gt; &gt; questions. I realized that I never followed my test first mantra<br/>\nthat<br/>\n&gt; &gt; I perform at home.<br/>\n&gt; &gt;<br/>\n&gt; &gt; First question, to those giving the interview... Would you ever<br/>\n&gt; &gt; suggest/remind a candidate of TDD style in his/her code?<br/>\n&gt; &gt;<br/>\n&gt; &gt; Second question, why on earth does a candidate, like myself, forget<br/>\nto<br/>\n&gt; &gt; write tests and incrementally improve their code? Do this show a<br/>\nlack<br/>\n&gt; &gt; of software development maturity?<br/>\n&gt; &gt;<br/>\n&gt; &gt; As a community reminder, and to myself.... don&#39;t forget TDD style on<br/>\n&gt; &gt; interviews.<br/>\n&gt; &gt; <br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links </span></blockquote></div>", 
    "prevInTime": 22675, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1272976931", 
    "canDelete": false, 
    "nextInTopic": 22678, 
    "prevInTopic": 22675, 
    "headers": {
        "inReplyToHeader": "PDRFREE2REE0LTE3MEEtNEM5Mi04MDA4LTg5RDA5MzkyMTQzMEBlYXJ0aGxpbmsubmV0Pg==", 
        "messageIdInHeader": "PDc1RjVFRDhBNUE1NTM2NDZBNDZFMDBFNkVDODU0RkEzMDQ3NDI4NERAdmFmZjAxLW1haWwwMS5hZC5nZC1haXMuY29tPg==", 
        "referencesHeader": "PHEycGE1MjdmZGRmMTAwNTAxMDUxN2kxZGY4ZTgxMm4yNzNjZDQzMzQ4ZjQwNmRhQG1haWwuZ21haWwuY29tPiA8dTJ2ZjJjNmIwZTgxMDA1MDExMjU0cTk5NjE1YjM2b2NjNTlkOWM1ODgzYWU5MjhAbWFpbC5nbWFpbC5jb20+IDw0RURBNkRBNC0xNzBBLTRDOTItODAwOC04OUQwOTM5MjE0MzBAZWFydGhsaW5rLm5ldD4="
    }
}