{
    "numMessagesInTopic": 14, 
    "nextInTime": 2269, 
    "senderId": "8nCm0UUPnNZTwXAApgGmOTnXepcHjzSy2SYmHh5kotPQnt8v7oBFuJ6j2UrZimxAYzFwNi0hOPWxs4TmrU3Axhd0Az02_Es", 
    "systemMessage": false, 
    "subject": "Re: Need Advice on Unit Testing Pain", 
    "from": "Paul Hodgetts &lt;prh@...&gt;", 
    "authorName": "Paul Hodgetts", 
    "msgSnippet": "... I was looking at, IIRC, J2EEUnit which seems to have mocks for the HTTP request and session as part of its framework.  But I didn t get very far with it at", 
    "msgId": 2268, 
    "topicId": 2251, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1595079072\">Robert Leftwich wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt; I have been using mock objects (in particular EasyMock -<br/>\n &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://tammofreese.de/easymock/index.html,\">http://tammofreese.de/easymock/index.html,</a> it&#39;s great!) to ease the sort of<br/>\n &gt; pain you are talking about.<br/>\n &gt;<br/>\n &gt; I have found that using mock objects for the servlet specific classes<br/>\n &gt; enables me to easily test the page content (using XPath expressions on the<br/>\n &gt; DOM produced by the Java presentation classes) and the navigation, firstly<br/>\n &gt; by checking the links, etc in the page content and secondly by checking any<br/>\n &gt; redirection performed in the Java code. I am not doing J2EE (I use<br/>\n &gt; Enhydra/Barracuda servlets) so I don&#39;t know how easy it would be to setup<br/>\n &gt; the mock objects for that environment but it is extremely simple, using<br/>\n &gt; EasyMock at least, to setup HttpRequest/Response/Session objects to enable<br/>\n &gt; this sort of testing using JUnit.<br/>\n<br/>\n </span></blockquote>I was looking at, IIRC, J2EEUnit which seems to have mocks for the HTTP<br/>\nrequest and session as part of its framework.  But I didn&#39;t get very far<br/>\nwith it at the time.  Easy Mock sounds cool, I&#39;ll have to take a look.<br/>\n<br/>\nAnyone have any experiences with J2EEUnit, or with otherwise simulating<br/>\nHTTP sessions and responses?<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt; By way of illustration, I found 5 bugs (admittedly somewhat obscure) on the<br/>\n &gt; first page I used this technique on, a login page that had been in<br/>\n &gt; production for some months, purely because it was easy to setup a number of<br/>\n &gt; different scenarios in the mock objects that the login code used.<br/>\n &gt;<br/>\n &gt; [...]<br/>\n &gt;<br/>\n &gt; PS The code I am testing is very much as thin as possible, I make heavy use<br/>\n &gt; of facades to make the ui/web server specific code as simple as I can,<br/>\n &gt; originally in the hope that it couldn&#39;t possible break, so it wouldn&#39;t need<br/>\n &gt; unit testing. However, the recent releases I have made have had problems<br/>\n &gt; found by QA in that thin layer (and only in that layer) that wasn&#39;t being<br/>\n &gt; unit tested, hence the use of mock objects.<br/>\n<br/>\n </span></blockquote>These are the kinds of things that some of our developers worry about.<br/>\nWe&#39;d hate to have QA or even the end users find these, mostly because<br/>\nany bugs found after a release cause us to back up and fix things,<br/>\nrather than move forward onto new features.<br/>\n<br/>\nThanks for the comments,<br/>\n-Paul Hodgetts</div>", 
    "prevInTime": 2267, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "997164035", 
    "canDelete": false, 
    "nextInTopic": 2269, 
    "prevInTopic": 2262, 
    "headers": {
        "inReplyToHeader": "PDk5NzA4NjQ0OC4zNjMuMzg3MzIubDEwQHlhaG9vZ3JvdXBzLmNvbT4=", 
        "messageIdInHeader": "PDQuMi4yLjIwMDEwODA2MjI1MjE1LjAwYzZhNjgwQG1haWwuenp5enh0ZWsuY29tPg=="
    }
}