{
    "numMessagesInTopic": 1, 
    "nextInTime": 22699, 
    "senderId": "hq_V_AW7JjxduVpjqlstDQD2vbGWK-3LK29cS-b4QXW7Fzulv5Jl4jG_f4OpdHOqEaSCtXyJcPeayBtk_K595CDZ00aiN3T3RwPl0g", 
    "systemMessage": false, 
    "subject": "Maven Surefire  and newer junit features", 
    "from": "&quot;krosenvold&quot; &lt;kristian@...&gt;", 
    "authorName": "krosenvold", 
    "msgSnippet": "Most of you are probably not aware of this, so I thought I d just let you know: maven-surefire plugin has 2 different junit-4 providers, and the most modern", 
    "msgId": 22698, 
    "profile": "krosenvold", 
    "topicId": 22698, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 403861045, 
    "messageBody": "<div id=\"ygrps-yiv-1346894712\">Most of you are probably not aware of this, so I thought I&#39;d just let you know:<br/>\n<br/>\nmaven-surefire plugin has 2 different junit-4 providers, and the most modern one is normally only used to run parallel tests. This provider uses JUnitCore to run the tests and should (probably) support most of the &quot;modern&quot; junit features.<br/>\n<br/>\nThe &quot;thing&quot; is that the JunitCore provider can be activated even for non-parallel tests by adding the following to your configuration:<br/>\n<br/>\n&lt;parallel&gt;none&lt;/parallel&gt;<br/>\n<br/>\nThis will force the use of the new provider in serial mode, which is fine if you just want to get access to more modern junit features.<br/>\n<br/>\nPlease note that right now you need to use 2.6-SNAPSHOT of surefire to get the latest version of the JunitCore provider.  Which is really the reason I&#39;m writing this: I&#39;m about to release a bug-fix release of surefire (which will probably be called 2.5.1). I do not personally have time to test all the &quot;new&quot; junit features with the new provider, but if anyone here has time/interest in this I can get it included in the official surefire documentation.</div>", 
    "prevInTime": 22697, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1273690344", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGhzZXRkOCtvNjRiQGVHcm91cHMuY29tPg=="
    }
}