{
    "numMessagesInTopic": 5, 
    "nextInTime": 22708, 
    "senderId": "R8HwTtmIDyyPCmdIf6POS8qpMQ0dgtnxlFkniZT32RnKPIBkhsWlImwhNQKscokX4mQmcbSoSIdeqCzFHrXepXHDLTWlCA", 
    "systemMessage": false, 
    "subject": "Re: [junit] Real World JUnit (first time poster)", 
    "from": "Kent Beck &lt;kentb@...&gt;", 
    "authorName": "Kent Beck", 
    "msgSnippet": "I am recording a series of screencasts on TDD for the Pragmatic Programmers. My example program is an interface to Tokyo Tyrant (a simple key/value store), so", 
    "msgId": 22707, 
    "profile": "kentlbeck", 
    "topicId": 22706, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 173198504, 
    "messageBody": "<div id=\"ygrps-yiv-2015338948\">I am recording a series of screencasts on TDD for the Pragmatic Programmers. My example program is an interface to Tokyo Tyrant (a simple key/value store), so it isn&#39;t as &quot;business-y&quot; as the example you requested, but it does go through the whole TDD process, at least the way I do it.<br/>\n<br/>\nThe series will be four half-hour episodes. You can see the first ten minutes of the raw footage of the first two episodes at <a rel=\"nofollow\" target=\"_blank\" href=\"http://vimeo.com/user3553347/videos.\">http://vimeo.com/user3553347/videos.</a> I&#39;ll be sure to post here when the series is released.<br/>\n<br/>\nThat said, I think there is scope for many more specialized demonstrations of TDD. I hope lots of folks jump in with their favorite IDE, application, language, and/or technique.<br/>\n<br/>\nRegards,<br/>\n<br/>\nKent<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 17, 2010, at 11:33 AM, amalcamel wrote:<br/>\n<br/>\n&gt; Hi, I am new to this forum and new to JUnit. I started searching for best practices and found that people were asking that question all the way back in 2001! Kind of intimidating!<br/>\n&gt; <br/>\n&gt; Anyway, what I am looking for is not &quot;best practices&quot;, per se, but a real world example. And from that I mean an example that starts from an idea in someone&#39;s head and evolves all the way through application completion and testing coverage. For example, I am thinking of an auto insurance type of application that has certain requirements, say 10, and how the tests are derived from the requirements and the code gets derived from the tests. <br/>\n&gt; <br/>\n&gt; We have many developers that are new to Test Driven Development, and to simply come out with best practices and ask them to get on board will never work. However, if we can take a real world example, from start to finish, and show how the tests did drive the code and how refactoring became so much simpler as a result, that would be a great start into changing the mentality of some of our developers (myself included ;-)<br/>\n&gt; <br/>\n&gt; Any suggestions?<br/>\n&gt; Thank you,<br/>\n&gt; Regards,<br/>\n&gt; Elaine<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 22706, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1274125034", 
    "canDelete": false, 
    "nextInTopic": 22708, 
    "prevInTopic": 22706, 
    "headers": {
        "inReplyToHeader": "PGhzczI2MCt1MWZ0QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDAyMzcwMkY1LUUwRjgtNDE5NS1BMDlELUVCMUY4MDEzMUJDRkBlYXJ0aGxpbmsubmV0Pg==", 
        "referencesHeader": "PGhzczI2MCt1MWZ0QGVHcm91cHMuY29tPg=="
    }
}