{
    "numMessagesInTopic": 5, 
    "nextInTime": 22709, 
    "senderId": "9MKTaVqvM6fNLcVDBP5USzXsZsOp_5ptXVn51Eb4ePkUAoozTxcM-fgk_IkjFTypuqpxqOiwkCuJI_i139gzJ-nGmluXxj-EwYiKVTPIvPP9DftJhAuZ", 
    "systemMessage": false, 
    "subject": "RE: [junit] Real World JUnit (first time poster)", 
    "from": "&quot;Loritsch, Berin C.&quot; &lt;berin.loritsch@...&gt;", 
    "authorName": "Loritsch, Berin C.", 
    "msgSnippet": "The best place to start is that you and your team need to make the following commitments: *         You will stick with it for at least 30 days (you should", 
    "msgId": 22708, 
    "rawEmail": "Return-Path: &lt;prvs=174684e0d3=berin.loritsch@...&gt;\r\nX-Sender: prvs=174684e0d3=berin.loritsch@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nX-Received: (qmail 85612 invoked from network); 17 May 2010 20:02:57 -0000\r\nX-Received: from unknown (98.137.34.46)\n  by m4.grp.sp2.yahoo.com with QMQP; 17 May 2010 20:02:57 -0000\r\nX-Received: from unknown (HELO camv02-relay2.casc.gd-ais.com) (192.5.164.99)\n  by mta3.grp.sp2.yahoo.com with SMTP; 17 May 2010 20:02:57 -0000\r\nX-Received: from ([10.73.100.22])\n\tby camv02-relay2.casc.gd-ais.com with SMTP  id 5203374.30821967;\n\tMon, 17 May 2010 13:02:53 -0700\r\nX-Received: from vaff01-mail01.ad.gd-ais.com ([10.13.13.20]) by camv02-fes01.ad.gd-ais.com with Microsoft SMTPSVC(6.0.3790.4675);\n\t Mon, 17 May 2010 13:02:53 -0700\r\nX-MimeOLE: Produced By Microsoft Exchange V6.5\r\nContent-class: urn:content-classes:message\r\nMIME-Version: 1.0\r\nDate: Mon, 17 May 2010 16:01:57 -0400\r\nMessage-ID: &lt;75F5ED8A5A553646A46E00E6EC854FA304789C94@...-ais.com&gt;\r\nIn-Reply-To: &lt;hss260+u1ft@...&gt;\r\nX-MS-Has-Attach: \r\nX-MS-TNEF-Correlator: \r\nThread-Topic: [junit] Real World JUnit (first time poster)\r\nThread-Index: Acr18P9FjmGcXwTtQO27BrHS52+TNQAAPT8w\r\nReferences: &lt;hss260+u1ft@...&gt;\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nReturn-Path: Berin.Loritsch@...\r\nX-OriginalArrivalTime: 17 May 2010 20:02:53.0632 (UTC) FILETIME=[EF724400:01CAF5FB]\r\nFrom: &quot;Loritsch, Berin C.&quot; &lt;berin.loritsch@...&gt;\r\nSubject: RE: [junit] Real World JUnit (first time poster)\r\nX-Yahoo-Group-Post: member; u=428096731; y=Sjs33X42sgyBvmW77ATMFJSvdXes8et4VdtKc8snLoypbk-L\r\nX-Yahoo-Profile: bloritsch\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\n\r\nThe best place to start is that you and your team need to make the\nfollowing commitments:\n\n*         You will stick with it for at least 30 days (you should start\nseeing benefits by then)\n\n*         Make room with your estimates and schedule to write the unit\ntests\n\n*         Everyone has the responsibility to keep the tests passing-your\nbuild needs to fail if the tests fail\n\n*         Try to make quick running tests\n\n \n\nWithout the above commitments, TDD gets tossed out.  In the very\nbeginning it may seem like a lot of extra work for very little benefit,\nbut stick with it anyway.  It takes time to see how TDD is affecting how\nyou approach writing code and the time saved by not having to step\nthrough the code with a debugger as often.  If you don&#39;t make room in\nyour schedule to write the unit tests, your schedule will be off,\neveryone will feel behind the 8-ball, and what they are not familiar\nwith won&#39;t get done.  Sometimes everything passes until you check in\nyour code.  When everyone makes their (at least daily) check-ins, it\nhelps to do a check-out and rerun the tests-just in case.  Lastly, if\nthe tests take a long time to run, it becomes painful to run them.  If\nit&#39;s painful to run them, they don&#39;t get run and you lose all your\nbenefits.\n\n \n\nAs to a real world example, I&#39;ve got a few.  When I first started doing\nTDD, it was with an open source framework I was building.  I started out\ndutifully writing the test, watching it fail, and doing the simplest\nthing that could possibly work.  Essentially I used &quot;triangulation&quot; to\nget to a set of tests that forced the code to work the way I wanted it.\nIt seemed counterintuitive at first, even a bit awkward.  But I was\nwilling to keep at it.  I noticed that the code I was writing was a bit\ndifferent from what I used to write.  Essentially, by thinking about how\nI was going to test the code before I wrote the code I was intentionally\nmaking the tests easy to write.  By extension, the code I was writing\nwas simpler and easier to comprehend.  As I progressed with writing the\nframework, there were a few tests that I wrote thinking I had to write\nsomething to satisfy the case, but the code already handled that case.\nI left the tests there to make sure the functionality didn&#39;t regress\nafter refactoring the code.  I noticed that I was much more confident in\nrefactoring my code regularly, and made it a point to incorporate that\ninto the way I work.  What was the simplest thing one day isn&#39;t so\nsimple after you&#39;ve made a series of changes.  I also noticed that I was\nspending a lot less time in the debugger.  In fact, the only time I\nneeded to open it up was when someone reported a difficult to reproduce\nbug.  Once I discovered what was happening, I added a new test case to\nreproduce the problem as closely as I could to the cause.  Once I got\nthe expected failure, I was able to make the change with more\nconfidence.\n\n \n\nMy first experience introducing TDD to a team taught me a few things.\nFirst, not everyone knows how to write good tests.  The book Pragmatic\nUnit Testing: in Java with JUnit is a good resource with how to approach\nwriting unit tests.  All it&#39;s examples are JUnit 3 examples, but the\nprinciples still apply no matter what your unit testing framework is.\nBasically, the unit tests need to be as simple as possible.  The setup,\nexecution, and assertions need to be clear.  Adding too much to the\nsetup will cause the tests to be harder to understand, and make them\ntake longer to run.  Your team really needs someone to coach in writing\ngood unit tests.  On my team, that was me.  There will likely be someone\non the team that needs to know that unit tests require an assertion-they\ncannot rely on manual inspection.  Unit tests are not just a way to run\ncode, they are a way to verify the code is correct.  That doesn&#39;t mean\nthe person is stupid, they just aren&#39;t experienced with unit tests.\nIt&#39;s a brand new idea for them.  There will likely be someone else who\ntries to lump multiple separate tests into one test case.  They need to\nbe taught how to test only one thing at a time.  Lastly, with people\nwriting unit tests with differing levels of experience, we can run into\nperformance problems in the unit test suite.  A common area where this\nproblem occurs is when you test anything that requires a network\nconnection such as database access and web services.  It requires a\nlittle more creativity to solve these problems, but it can be done.  I\nsolved the remote service problem by stubbing it out and creating a mock\nimplementation to generate all the test conditions without requiring\nnetwork services.  The database can be more of a problem, particularly\nbecause writing cross database queries can be very hard.  Sometimes it\nhelps to separate out the database tests into a separate suite.  As long\nas the remainder of the unit tests run quickly, you can reserve running\nthe database tests for the official build and the other unit tests as\npart of your daily work.\n\n \n\nThat&#39;s a summary of the highlights with instituting TDD on a project.\nAs people learn how to write better tests, they also end up writing\nbetter code.  The expectations, results, and error conditions are\nthought out much better.  It can also bring to light when different\napproaches are used by different people.  By changing the unit tests,\nyou can get everyone on the same page.  You&#39;ll find some corners that\njust can&#39;t be tested without resorting to extraordinary lengths.\nTypically, these are exceptions that the Java API forces you to catch\neven though there is no way in your code to make those exceptions be\nthrown.  Examples include catching unsupported algorithm exceptions when\nyou are using encryption algorithms installed on everyone&#39;s machine, or\nusing a character set that exists on every instance of Java for your\nstreams.  For those, don&#39;t worry about testing it.  It&#39;s just not worth\nhacking the JVM installation to force these errors.  As long as you\nremain consistent with your error handling techniques and you (at the\nvery least) log the exceptions you can be pretty confident in that code.\n\n \n\nFrom: junit@yahoogroups.com [mailto:junit@yahoogroups.com] On Behalf Of\namalcamel\nSent: Monday, May 17, 2010 2:34 PM\nTo: junit@yahoogroups.com\nSubject: [junit] Real World JUnit (first time poster)\n\n \n\n  \n\nHi, I am new to this forum and new to JUnit. I started searching for\nbest practices and found that people were asking that question all the\nway back in 2001! Kind of intimidating!\n\nAnyway, what I am looking for is not &quot;best practices&quot;, per se, but a\nreal world example. And from that I mean an example that starts from an\nidea in someone&#39;s head and evolves all the way through application\ncompletion and testing coverage. For example, I am thinking of an auto\ninsurance type of application that has certain requirements, say 10, and\nhow the tests are derived from the requirements and the code gets\nderived from the tests. \n\nWe have many developers that are new to Test Driven Development, and to\nsimply come out with best practices and ask them to get on board will\nnever work. However, if we can take a real world example, from start to\nfinish, and show how the tests did drive the code and how refactoring\nbecame so much simpler as a result, that would be a great start into\nchanging the mentality of some of our developers (myself included ;-)\n\nAny suggestions?\nThank you,\nRegards,\nElaine\n\n\n\n\n\n[Non-text portions of this message have been removed]\n\n\n", 
    "profile": "bloritsch", 
    "topicId": 22706, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 428096731, 
    "prevInTime": 22707, 
    "contentTrasformed": false, 
    "postDate": "1274126517", 
    "canDelete": false, 
    "nextInTopic": 22709, 
    "prevInTopic": 22707, 
    "headers": {
        "inReplyToHeader": "PGhzczI2MCt1MWZ0QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDc1RjVFRDhBNUE1NTM2NDZBNDZFMDBFNkVDODU0RkEzMDQ3ODlDOTRAdmFmZjAxLW1haWwwMS5hZC5nZC1haXMuY29tPg==", 
        "referencesHeader": "PGhzczI2MCt1MWZ0QGVHcm91cHMuY29tPg=="
    }
}