{
    "numMessagesInTopic": 4, 
    "nextInTime": 22754, 
    "senderId": "MX8Yv7vxJEVFoIFQGtzEGDEpOEkgpbzHdW9hSDALW7smSQ69jOOgWKLi5ob6WNYSxe-xlyhRcepVTjDb7OpgKI_SV6ZoMJ6o-z1U4rRG0h2EuQ", 
    "systemMessage": true, 
    "subject": "Suggestion for new matchers", 
    "from": "&quot;mickus.mykolas&quot; &lt;mickus.mykolas@...&gt;", 
    "authorName": "mickus.mykolas", 
    "msgSnippet": "Hello, My name is  Mykolas Mickus (in english its Michael). I ve just graduated from Kaunas University of Technology (in Lithuania) where I have been studying", 
    "msgId": 22753, 
    "profile": "mickus.mykolas", 
    "topicId": 22753, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 449887343, 
    "messageBody": "<div id=\"ygrps-yiv-1873770138\">Hello,<br/>\n<br/>\nMy name is  Mykolas Mickus (in english its Michael). I&#39;ve just graduated from Kaunas University of Technology (in Lithuania) where I have been studying IT for four years. I&#39;ve been using Java for 3 years now.<br/>\n<br/>\nFirst of all I&#39;d like to thank You and all JUnit team for the great testing framework which I&#39;ve been using since version 4. What I especially like about the version 4 is hamcrest and matchers. They make my tests more readable (and fun) to write.<br/>\n<br/>\nHowever I&#39;ve found that JUnit does not have property matchers which would be very usefull in my opinion. While using FlexUnit 4 (Adobe Flex and ActionScript 3 testing framework) I&#39;ve got used to these property (or object) matchers and now think that similar matchers could be implemented and used in JUnit.<br/>\n<br/>\nHere is an example reasoning the necessity of this feature. Lets say we call &#39;sellItem()&#39; method on instance of class &#39;Store&#39;. Then we need to check if properties (migh be set/get pairs or public instance variables) like &#39;itemsInStock&#39;, &#39;currentStoreValue&#39; or &#39;itemsSold&#39; have been updated. Currently we could accomplish this in several ways with JUnit:<br/>\n<br/>\n1) Use assertion methods:<br/>\n    store.sellItem(item);<br/>\n    assertEquals( store.getItemsInStock(), 10 );<br/>\n    assertEquals( store.getCurrentStoreValue(), 720.5 );<br/>\n    ...<br/>\n<br/>\n2) With currently available matchers:<br/>\n    store.sellItem(item);<br/>\n    assertThat( store.getItemsInStock(), equalTo (10) );<br/>\n    assertThat( store.getCurrentStoreValue(), equalTo (720.5) );<br/>\n    ...<br/>\n<br/>\n3) Creating another instance and comparing the two:<br/>\n    Store storeExpected = new Store();<br/>\n    // Set values of properties or even add all items to the stock<br/>\n    assertThat( store, equalTo (storeExpected) );<br/>\n    // or<br/>\n    assertEquals( store, storeExpected );<br/>\n<br/>\nThe last example is limited because we must have &#39;equals()&#39; implemented  in correct way and this assertion will *always* check same properties which, probably, means all of them. But what if wee need only a subset? Of course this issue can be addressed by the first two examples.<br/>\n<br/>\nHowever, things get complicated when we come to collections. The same class &#39;Store&#39; probably holds a list of all items. Its difficult to check if there is an item with some specific properties values:<br/>\n<br/>\n    StoreItem item = new StoreItem();<br/>\n    // Initialize all properties (which might be a lot)<br/>\n    assertThat( store.items, hasItem (item) );<br/>\n<br/>\nAgain, we need &#39;equals()&#39; to be implemented correctly and we can&#39;t easily match agains a subset of all properties. Needless to say, many lines of code are required when we want to use &#39;hasItems()&#39; to check even a few items in a collection.<br/>\n<br/>\nNow here is how one would make similar assertions with FlexUnit 4:<br/>\n<br/>\n    store.sellItem(item);<br/>\n    assertThat( store, hasProperties (<br/>\n        &quot;itemsInStock&quot;: 10,<br/>\n        &quot;currentStoreValue&quot;: 720.5,<br/>\n        ...<br/>\n        &quot;items&quot;: hasItems (<br/>\n            hasProperties( &quot;name&quot;: &quot;Bread&quot;, &quot;price&quot;: 10 ),<br/>\n            hasProperties( &quot;name&quot;: &quot;Apple&quot;, &quot;price&quot;: 2 )<br/>\n        )<br/>\n    ));<br/>\n<br/>\n(You can find more information regarding FlexUnit and property (object) matchers here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.flexunit.org/index.php?title=Main_Page\">http://docs.flexunit.org/index.php?title=Main_Page</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://wiki.github.com/drewbourne/hamcrest-as3/matchers-objects)\">http://wiki.github.com/drewbourne/hamcrest-as3/matchers-objects)</a><br/>\n<br/>\nI think this approach is better in many ways compared with those described above. Of course due to limitations of Java same example would be more verbose. Still I think that implementing these matchers for JUnit is worth a shot. And if Java 7 is released we could be able to use new features (like language level support for collections) to simplify the syntax (not sure if this is a correct term).<br/>\n<br/>\nFinally, I think implementing these matchers in Java is not very complicated. Having said that, I would be glad to do it myself. I think I have got enough knowledge and experience to be able to accoplish the task.<br/>\n<br/>\nTo sum up with, I believe property matchers would be great addition to JUnit testing framework. I&#39;m looking forward to hearing Your opinion about this proposal.<br/>\n<br/>\nMykolas Mickus (Kaunas University of Technology graduate)</div>", 
    "prevInTime": 22752, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1276294564", 
    "canDelete": false, 
    "nextInTopic": 22755, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGh1dWNqNCtxMGs4QGVHcm91cHMuY29tPg=="
    }
}