{
    "numMessagesInTopic": 4, 
    "nextInTime": 22788, 
    "senderId": "z-CM8HxF28lvS-Ypf90Ectd-5A9sranahV-dPaUCAj9z3kGVDMa7GwYkN8FNGbVB-NsTUSZyCVbCU_EiNwizSsBIf8B3QQ", 
    "systemMessage": true, 
    "subject": "Organizing Tests - Documentation is Conflicting", 
    "from": "&quot;debio264&quot; &lt;debio264@...&gt;", 
    "authorName": "debio264", 
    "msgSnippet": "Okay, I ve been browsing documentation for a while now, and there seems to be a large conflict where approaches have changed between versions. My understanding", 
    "msgId": 22787, 
    "profile": "debio264", 
    "topicId": 22787, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 453736192, 
    "messageBody": "<div id=\"ygrps-yiv-603918653\">Okay, I&#39;ve been browsing documentation for a while now, and there seems to be a large conflict where approaches have changed between versions. My understanding is that to create a test, I should be doing something along these lines:<br/>\n<br/>\nclass Something {<br/>\n@Test<br/>\npublic void Test() {<br/>\nAssert.assertTrue(true);<br/>\n}<br/>\n}<br/>\n<br/>\nTo add setup and take down, I just make methods that are annotated with @Before and @After. Simple enough.<br/>\nNow, my understanding is that this setup was developed to replace the old practice of making classes that extend TestCase and overriding methods in there to get the same functionality.<br/>\n<br/>\nThe one thing that I can&#39;t seem to find is how I should be grouping tests like these. Eclipse can run this class&#39;s tests for me, and that&#39;s all good, but how should I be grouping tests if I want to run all the tests in a project at the same time? I&#39;ve looked at TestSuite and tried to get it working with classes that use annotations like this, but I can&#39;t seem to figure out how it should be done.</div>", 
    "prevInTime": 22786, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1278123824", 
    "canDelete": false, 
    "nextInTopic": 22788, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGkwbTZ2ZytoY2hzQGVHcm91cHMuY29tPg=="
    }
}