{
    "numMessagesInTopic": 3, 
    "nextInTime": 22825, 
    "senderId": "vswXSGwFMrk6y8ZdZr5pdkfjnSio7OLCLzjdGjAMPJab0GQKFJFtzUMYtfhOpMA0DmyhX2xI4zUumfUDjtkUNbzeMw3e10pYrVUo", 
    "systemMessage": true, 
    "subject": "Re: JUnitCore not waiting for @BeforeClass", 
    "from": "&quot;offlineman78&quot; &lt;donksr1@...&gt;", 
    "authorName": "offlineman78", 
    "msgSnippet": "I have solved the issue of it not waiting for @BeforeClass to finish, it turns out that it was, but my BeforeClass method was finishing before I wanted it to", 
    "msgId": 22824, 
    "profile": "offlineman78", 
    "topicId": 22816, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 151851273, 
    "messageBody": "<div id=\"ygrps-yiv-873608076\">I have solved the issue of it not waiting for @BeforeClass to finish, it turns out that it was, but my BeforeClass method was finishing before I wanted it to on the second time I ran the tests because I wasn&#39;t resetting a flag where it was waiting for another thread to finish.  So the only issue that I have now is running all the tests in the same context, but I have not verified this problem for myself,but was only told it&#39;s an issue by someone else on our team.  Thanks for your help Kent. Adding more logging calls helped me solve the problem that using the debugger didn&#39;t expose because the debugger slowed the main thread enough that the flag pass through was irrelevant.<br/>\n<br/>\nMatt<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, Kent Beck &lt;kentb@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Matt,<br/>\n&gt; <br/>\n&gt; Thank you for exploring this before reporting. I was waiting to see if someone else jumped in on this because I don&#39;t have any experience with EJBs.<br/>\n&gt; <br/>\n&gt; The behavior you report is certainly not how JUnit is supposed to work. @BeforeClass methods are (I thought) guaranteed to be called before any tests in that class are called. Is it possible for you to put logging calls in the test itself as well to verify that this invariant is not holding?<br/>\n&gt; <br/>\n&gt; As far running all the tests in the same context, I&#39;m afraid I can&#39;t help with that.<br/>\n&gt; <br/>\n&gt; Regards,<br/>\n&gt; <br/>\n&gt; Kent<br/>\n&gt; <br/>\n&gt; On Jul 22, 2010, at 4:20 PM, offlineman78 wrote:<br/>\n&gt; <br/>\n&gt; &gt; I am having a problem where the JUnit 4 runner isn&#39;t waiting for the @BeforeClass method to finish before running some of the tests contained within the class. I am running the tests via a webservice which calls an EJB which calls JUnitCore.run(Class[])(I have also tried JUnitCore.run(Runner)). I put a log statement at the end of the BeforeClass method and added a listener to the core to log when a test starts to figure this out. Also, is there a way to guarentee that all the tests in a class run in the same context because we are having problems with the current approach that we are getting EJB cross-pollution between the tests.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Any help is greatly appreciated.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Matt<br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 22823, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1280174478", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 22817, 
    "headers": {
        "inReplyToHeader": "PDU4RUQ1Mjc2LTBCRDItNDU0Ny05QTMyLTA2MzIxRTZGQjdDN0BlYXJ0aGxpbmsubmV0Pg==", 
        "messageIdInHeader": "PGkya3BpZStvMWZ1QGVHcm91cHMuY29tPg=="
    }
}