{
    "numMessagesInTopic": 3, 
    "nextInTime": 22827, 
    "senderId": "8CuSK0xj-x-Wx-HA6LZztzsVLI_AJ6vXiEtDMQ1fWkKkl_h0ec5nIvvxsk2rfhXnlQIACJSvjVVfjt1vS4gI0590XK0wte1URIGde2P8", 
    "systemMessage": false, 
    "subject": "JUnit tests stop working in Eclipse", 
    "from": "&quot;glennindevelopment&quot; &lt;HOLLIDAY@...&gt;", 
    "authorName": "glennindevelopment", 
    "msgSnippet": "Symptoms:  a project in Eclipse 3.5, with which I have been successfully using a JUnit 4 test suite all along.  This morning suddenly when I run a test class", 
    "msgId": 22826, 
    "profile": "glennindevelopment", 
    "topicId": 22826, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 4408173, 
    "messageBody": "<div id=\"ygrps-yiv-1596866117\">Symptoms:  a project in Eclipse 3.5, with which I have been successfully using a JUnit 4 test suite all along.  This morning suddenly when I run a test class with &quot;Run as JUnit Test&quot;, Eclipse reports &quot;No JUnit tests found&quot;.<br/>\n<br/>\nI can still run individual test methods normally.  The problem happens when I run the test class, and it happens with all test classes in the project, except one.  When I run the entire test directory tree, JUnit executes one of the classes in the middle of the directory tree normally, then stops with no other messages.  I can run that one test class normally.  I can&#39;t find any difference between the one that runs and the dozens that don&#39;t.  Other projects continue to run JUnit normally.  Eclipse clean, refresh, and validate does not help.  Closing and opening the project does not help.  Deleting the project from disk and checking it out again from my Subversion repository does not help.  When I drop back to a revision from a few days back, all works correctly.  But I want to save and test my work since then.<br/>\n<br/>\nThis sounds like Eclipse metadata got corrupted, and it sounds like the corrupted metadata gets saved to Subversion.  I haven&#39;t been able to identify an event or a change in my project that led to this problem.<br/>\n<br/>\nWhat metadata might be involved?  If I try deleting Eclipse metadata directories, what is safe to throw away?<br/>\n<br/>\nThanks for any suggestions.</div>", 
    "prevInTime": 22825, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1280412913", 
    "canDelete": false, 
    "nextInTopic": 22827, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGkyczJkaCtmaW40QGVHcm91cHMuY29tPg=="
    }
}