{
    "numMessagesInTopic": 2, 
    "nextInTime": 22831, 
    "senderId": "fcSZCll6K6hOuccl4QB_hsyyqldh5Ym95jY7BMu1WombKlk_-XJHSOHws2mg4jXa_HDS4iQbXlU_lXj2sAwLVkXpOz3u2kLOjvkqyW6ifVrPSQNY", 
    "systemMessage": false, 
    "subject": "JUnit mailing list etiquette", 
    "from": "Simon Chappell &lt;simonpeterchappell@...&gt;", 
    "authorName": "Simon Chappell", 
    "msgSnippet": "Once again, it s time for a little reminder of some of the finer points of JUnit mailing list etiquette. This will be posted now and then; not often enough to", 
    "msgId": 22830, 
    "rawEmail": "Return-Path: &lt;simonpeterchappell@...&gt;\r\nX-Sender: simonpeterchappell@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nX-Received: (qmail 52099 invoked from network); 31 Jul 2010 11:39:38 -0000\r\nX-Received: from unknown (98.137.34.44)\n  by m14.grp.re1.yahoo.com with QMQP; 31 Jul 2010 11:39:38 -0000\r\nX-Received: from unknown (HELO mail-pv0-f179.google.com) (74.125.83.179)\n  by mta1.grp.sp2.yahoo.com with SMTP; 31 Jul 2010 11:39:37 -0000\r\nX-Received: by pvh11 with SMTP id 11so1141786pvh.24\n        for &lt;junit@yahoogroups.com&gt;; Sat, 31 Jul 2010 04:38:28 -0700 (PDT)\r\nMIME-Version: 1.0\r\nX-Received: by 10.114.27.2 with SMTP id a2mr3958690waa.25.1280576306554; Sat, 31 \n\tJul 2010 04:38:26 -0700 (PDT)\r\nX-Received: by 10.114.170.15 with HTTP; Sat, 31 Jul 2010 04:38:26 -0700 (PDT)\r\nDate: Sat, 31 Jul 2010 06:38:26 -0500\r\nMessage-ID: &lt;AANLkTi=qKrbmkSutBD1uRt0BCXpeSCd=2u2ipm+YjAMn@...&gt;\r\nTo: junit@yahoogroups.com\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Simon Chappell &lt;simonpeterchappell@...&gt;\r\nSubject: JUnit mailing list etiquette\r\nX-Yahoo-Group-Post: member; u=211142374; y=WPpa2s4y-YDAHM_z5B7I6E4L8cmPuKiBjmGgiNFJGojPNdi0tw\r\nX-Yahoo-Profile: spchappell\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\n\r\nOnce again, it&#39;s time for a little reminder of some of the finer points of\nJUnit mailing list etiquette. This will be posted now and then; not often\nenough to be spam, but often enough to keep our newer members aware of how\nwe conduct business around here.\n\nDear members and readers of the JUnit mailing list,\n\nAround here, we love testing. Not only do we love testing, we love to\ndiscuss any and all aspects of testing, often with enthusiasm and passion.\nThis is good. This is the reason that this mailing list exists. On top of\nall this, we are very keen to help others understand this strange affliction\nwe have; medical name &quot;testus infectus&quot;, better known as being test\ninfected. We love to answer questions and help those new to the joy move\nfurther down the road towards test enlightenment. In the classic spirit of\nhospitality, our list is your list, our test cases are your test cases.\nPlease make yourself at home and enjoy the journey. :-)\n\nThat said, there are some things that we don&#39;t love, so sit tight and listen\nup.\n\nWe don&#39;t love people who haven&#39;t, or won&#39;t, read the JUnit Frequently Asked\nQuestions (FAQ) document, lovingly maintained by Mike Clark or the &quot;Smart\nQuestions&quot; document written and maintained by Eric S. Raymond. Here are the\nlinks, go forth and read ...\n\nhttp://junit.sourceforge.net/doc/faq/faq.htm\n\nhttp://www.catb.org/~esr/faqs/smart-questions.html\n\nWe don&#39;t love people who think that we&#39;ll do their homework assignments for\nthem. Back when I was a lad, we didn&#39;t have the Internet and we had to do\nour own homework assignments without the aid of all the knowledge and\ninformation that you have available to you today. (And yes, now that you\nask, I did walk uphill both ways to school through the snow.)\n\nWe don&#39;t love people who are incapable of using a search engine, but are yet\nsomehow capable of signing up onto this mailing list so that they can ask\nquestions that ten seconds of searching would reveal the answer to. Learn\nhow to use a search engine. Around here, Google seems quite popular. Here&#39;s\na link; learn to love it and use it.\n\nhttp://www.google.com/\n\nWe don&#39;t love job postings. We do love having jobs (or at least, we like the\npay) and we do like to look at job postings, but we like to look at them in\nmore logical places like job websites. So, please don&#39;t be upset when a\nmoderator deletes your carefully worded prose describing yet another testing\njob.\n\nWe don&#39;t love thread hijacking. That&#39;s when you start a different subject by\nreplying to a previous conversation and not even changing the subject line.\nWe like to discuss a variety of subjects, so please feel free to be inspired\nto ask side-questions during ongoing conversations. Just do so by starting a\nfresh thread with a unique subject line.\n\nLastly, we don&#39;t love people who whine, moan and generally sound like\npetulant children after they&#39;ve been told that they have violated one of the\n&quot;laws of the land&quot; around here. It&#39;s a big old Internet; feel free to take\nyour questions and/or tantrums somewhere else if you don&#39;t like the way we\ndo things around here.\n\nSimon\n(One of the JUnit mailing list moderators)\n\n-- \nsimonpeter.org | simonpeter.com | newlife-upc.org\n\n\n[Non-text portions of this message have been removed]\n\n\n", 
    "profile": "spchappell", 
    "topicId": 22375, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 211142374, 
    "prevInTime": 22829, 
    "contentTrasformed": false, 
    "postDate": "1280576306", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 22375, 
    "headers": {
        "messageIdInHeader": "PEFBTkxrVGk9cUtyYm1rU3V0QkQxdVJ0MEJDWHBlU0NkPTJ1MmlwbStZakFNbkBtYWlsLmdtYWlsLmNvbT4="
    }
}