{
    "numMessagesInTopic": 8, 
    "nextInTime": 22941, 
    "senderId": "fLCGBdWTB5Gd9zxT41kI5fRk35aXgPUeCJjsulRANMiIby4rTo4pojmPqcbJZPOaD0aBxVitQSaHFolvbcKy6OXC27ktqxGtGLswfWu8", 
    "systemMessage": false, 
    "subject": "Re: [junit] Common Test Runner for JVM", 
    "from": "Esko Luontola &lt;esko.luontola@...&gt;", 
    "authorName": "Esko Luontola", 
    "msgSnippet": "... My examples just relate to IntelliJ because that s my IDE of choise. CTR4J isn t meant to be IDE specific. It s meant to be something that every", 
    "msgId": 22940, 
    "profile": "egeluontola", 
    "topicId": 22933, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 395435659, 
    "messageBody": "<div id=\"ygrps-yiv-1743448383\">Mike Forsberg wrote on 13.9.2010 22:39:<br/>\n<blockquote><span title=\"ireply\"> &gt; I may be wrong, but it sounds like this project will be a JUnit<br/>\n&gt; &quot;engine&quot; geared specifically for IntelliJ.<br/>\n<br/>\n </span></blockquote>My examples just relate to IntelliJ because that&#39;s my IDE of choise. <br/>\nCTR4J isn&#39;t meant to be IDE specific. It&#39;s meant to be something that <br/>\nevery development tool can use.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is there any chance that the core functionality could be written in a<br/>\n&gt; way that other tools could leverage it&#39;s design. It would be great if<br/>\n&gt; the project would be broken into a core with modules per IDE. I think<br/>\n&gt; this paradigm would benifit the project in the following ways:<br/>\n&gt; -- Adoption may slow if every developer were forced into a specific<br/>\n&gt; IDE to gain access to this tool.<br/>\n&gt; -- Integration with common tools like Ant, Maven, and other CI tools<br/>\n&gt; might be harder if too much design is IntelliJ specific.<br/>\n&gt; -- I want to use it, but prefer eclipse for no other reason then, &quot;I&#39;m<br/>\n&gt; lazy&quot;.<br/>\n<br/>\n </span></blockquote>CTR4J will probably be organized into three modules: one with the API <br/>\nfor testing frameworks (with a strong backwards compatibility policy), <br/>\nanother with code for launching the test runs (for use in build tools <br/>\nand IDEs), and a reference UI for showing the test results (for use in <br/>\nIDEs or as a stand-alone application).<br/>\n<br/>\nRegarding the reference UI, there are a couple of options that I&#39;ve <br/>\nthought about:<br/>\n<br/>\nOne option is to provide a UI which could be embedded into the IDEs. <br/>\nIntelliJ and NetBeans use Swing, so they could use the same <br/>\nimplementation, but Eclipse&#39;s SWT would require some rework. The IDE <br/>\narchitectures are quite different, so it might be problematic to provide <br/>\ngood integration for every IDE with just one UI implementation. Some <br/>\nIDEs might choose to use the reference UI implementation as just a <br/>\nreference and make their own UI (hopefully with improvements and without <br/>\nbugs).<br/>\n<br/>\nAnother option is for CTR4J to have an external UI. The test runner will <br/>\nanyways run as a separate process (similar to Scala&#39;s compile server, <br/>\nfsc) which does things like classloader caching to speed up test runs <br/>\n(at least the classes of all libraries can be cached - maybe also module <br/>\nor package level caching of unmodified classes in large projects <br/>\npossible). It would be possible to have a UI which connects to the test <br/>\nrunner server(s) running on the local machine and shows the results of <br/>\ncurrent and recent test runs. This option would work also for test runs <br/>\nstarted by Ant, Maven etc. It would to some degree work also for IDEs, <br/>\nwith the (quite serious) limitations that it would be in a different <br/>\nwindow as the IDE and code navigation from test results to source code <br/>\nwould not work.<br/>\n<br/>\nMaybe implementing both options is the best option.<br/>\n<br/>\nOne more thing: To speed up tool support, I&#39;m planning on creating a <br/>\nJUnit adapter so that CTR4J can be launched using the tools&#39; existing <br/>\nJUnit integration. This should be possible with a custom JUnit runner <br/>\nwhich starts CTR4J which in turn finds the tests and runs them (although <br/>\nit might be necessary for the user to manually tell CTR4J that which <br/>\ndirectory contains the compiled test classes).<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sound like a great project, a refactoring of the @RunWith would be a<br/>\n&gt; nice-ity. If you head the eclipse route, I&#39;d be willing to give it a<br/>\n&gt; try and supply feed back.<br/>\n<br/>\n </span></blockquote>Thanks. I&#39;ll keep this mailing list informed when I have something working.<br/>\n<br/>\n-- <br/>\nEsko Luontola<br/>\nwww.orfjackal.net</div>", 
    "prevInTime": 22939, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1284418267", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 22939, 
    "headers": {
        "inReplyToHeader": "PEFBTkxrVGlrX2haQW5XRmplZE4zTj1qS1cxa3dqZTF0clliQT1DYVAzMW5LVkBtYWlsLmdtYWlsLmNvbT4=", 
        "messageIdInHeader": "PDRDOEVBQURCLjMwNDA2MDNAZ21haWwuY29tPg==", 
        "referencesHeader": "PDRDOEJGREU3LjMwMTA2MDNAZ21haWwuY29tPgk8QUFOTGtUaW40QVhrOEJHY2JYR2ZtNjhLUUZ6THFiVnprK20yMkNyY1VnUnQxQG1haWwuZ21haWwuY29tPgk8QUFOTGtUaW0xMU9STzY4aXJGaEhyVkNCdnFIOHZLOUJRRzI2d2lVeFdkOVpkQG1haWwuZ21haWwuY29tPgk8NEM4RTc5MUQuNTA0MDcwNEBnbWFpbC5jb20+IDxBQU5Ma1Rpa19oWkFuV0ZqZWROM049aktXMWt3amUxdHJZYkE9Q2FQMzFuS1ZAbWFpbC5nbWFpbC5jb20+"
    }
}