{
    "numMessagesInTopic": 19, 
    "nextInTime": 22956, 
    "senderId": "kXTdkNbTsRbEfRlsLSwe-kDufkd_V4siwdlN8Xm41lHEIsZob_dWR_5glUL7U6prFPr5nkhAV6RzWopAV-hKcoXq4ztiKbqwJ3lVuK1QhA", 
    "systemMessage": false, 
    "subject": "Re: JUnit Test Result Format&quot; (XML): No evolution for years?", 
    "from": "Daniela Waranie &lt;typo3-community@...&gt;", 
    "authorName": "Daniela Waranie", 
    "msgSnippet": "Hi Exko, process is clear, fine. Next good question is about, where should the discussion takes place, i agree. I am in contact which inventor of TestNG,", 
    "msgId": 22955, 
    "topicId": 22943, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 466140462, 
    "messageBody": "<div id=\"ygrps-yiv-292784262\">Hi Exko,<br/>\n<br/>\nprocess is clear, fine.<br/>\n<br/>\nNext good question is about, where should the discussion takes place, i<br/>\nagree.<br/>\n<br/>\nI am in contact which inventor of TestNG, Cédric Beust. Céderic is<br/>\ninterested in this topic and he contacted me to tell me what he thinks<br/>\nabout a new format/version. He agrees that the format should be<br/>\nmaintained and it should be guarnateed that the format is maintained on<br/>\nits full life cycle. He stated that the JUnit team can be a good choice.<br/>\n<br/>\nI think that we will never get a guarantee. As you can see in the past,<br/>\neven a big player like the apache software foundation can not guarantee<br/>\nthat each projects is maintained forever. I think the guarantee is not<br/>\nthe point.<br/>\n<br/>\nWhen ever someone is interessed in bringing the project to the next step<br/>\nit can be done (event-driven evolution) ;-)<br/>\n<br/>\nStefan Bodewig, one of the initial authors of the<br/>\nXMLJUnitResultFormater, contacts me to tell me his ideas, too. He stated<br/>\nthat it should be developed on &#39;neutral ground&#39; and should stay<br/>\nlanguage-agnostic.<br/>\n<br/>\nAt the moment it feels like a specification team come up around me. The<br/>\nteam members comes / should come from the ant team and the JUnit team,<br/>\nand from many other projects and programming languages that uses the<br/>\n&#39;old format&#39;. The more i think about it, it comes to my mind, that a<br/>\n&#39;neutral ground&#39; looks like to be the best biological nutrient media to<br/>\nensure that the next format version is language-agnostic.<br/>\n<br/>\nMy thanks goes to:<br/>\n- the ant team for inventing the format<br/>\n- the JUnit team for not at least borrowing the inoffical name for the<br/>\nformat (that does not realy have a name jet) - commonly called &quot;JUnit<br/>\nformat&quot;.<br/>\n<br/>\nIt is aaske strategic decision to d the big player (apache ant / JUnit)<br/>\nto give its name to the xml project or to forc with a new name. To call<br/>\nthe next version e.g. &#39;JUnit test result format 2.0&#39; can be a good<br/>\nchoice to be recognized. To become more language-agnostic a renaming to<br/>\na different name can be better - but i am not sure. It depends on the<br/>\ncommunity. Is the community conservative (name keeping) or progressive<br/>\n(renaming). I am not sure.<br/>\n<br/>\nI am a practitioner, so the format should at first fits your needs and<br/>\nthe other things can be done by-the-way (maybe someone with experience<br/>\nin strategic desicions can point me here).<br/>\n<br/>\nAt the moment it sounds good to rename it. I would call it TRUE format,<br/>\nwhere TRUE stands for &quot;Test Results Universal Exchange&quot; format - not at<br/>\nleast because a lot assertions should become true to make the developer<br/>\nhappy. Just my to cents.<br/>\n<br/>\nWhat does the community think:<br/>\n1) Where to place the project?<br/>\na) At a big player?<br/>\nb) Independent?<br/>\n<br/>\n2) Keep the name or rename it?<br/>\na) keep it (make the inofficial name an official name)<br/>\nb) rename it<br/>\n<br/>\nBest regards<br/>\nDaniela Waranie</div>", 
    "prevInTime": 22954, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1284973204", 
    "canDelete": false, 
    "nextInTopic": 22956, 
    "prevInTopic": 22954, 
    "headers": {
        "inReplyToHeader": "PDRDOTY5MTY0LjkwODA1MDJAZ21haWwuY29tPg==", 
        "messageIdInHeader": "PGk3NzdxbCRvajgkMUBkb3VnaC5nbWFuZS5vcmc+", 
        "referencesHeader": "PGk2dTF1biRuNGEkMUBkb3VnaC5nbWFuZS5vcmc+IDw0QzkzMkVDNy44MDgwOTA2QGdtYWlsLmNvbT4gPGk3MG1kcSRja20kMUBkb3VnaC5nbWFuZS5vcmc+IDw0Qzk1MjIzQS40MDEwMDA3QGdtYWlsLmNvbT4gPGk3NTB1ZCQ2cDIkMUBkb3VnaC5nbWFuZS5vcmc+IDw0Qzk2OTE2NC45MDgwNTAyQGdtYWlsLmNvbT4="
    }
}