{
    "numMessagesInTopic": 3, 
    "nextInTime": 22960, 
    "senderId": "8hy6LvdGi44F7FIQgjI5MxBS-0L5u-4AFAyoA8l-NRsMH-lwYtxntoZY5tDyoyIec5oqrs--9_ZaKsJ5-oHuB-MzJCJSahUyfQ", 
    "systemMessage": false, 
    "subject": "Fwd: Writing a test fixture for a set of many classes", 
    "from": "Konrad Reiche &lt;home@...&gt;", 
    "authorName": "Konrad Reiche", 
    "msgSnippet": "Hey everyone! I am currently developing a course scheduler for universites in Java. My team and me chose test driven development, espcially for the scheduler ", 
    "msgId": 22959, 
    "topicId": 22959, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 466388931, 
    "messageBody": "<div id=\"ygrps-yiv-18606423\">Hey everyone!<br/>\n<br/>\nI am currently developing a course scheduler for universites in Java. My <br/>\nteam and me chose test driven development, espcially for the scheduler <br/>\nitself. I am using JUnit. For nearly every class there has to be JUnit <br/>\ntest class. The database schema has become quiet big. Not everything is <br/>\nneeded for the OR-mapped classes in the scheduler. In the end there are <br/>\nstill 14 classes.<br/>\n<br/>\nAs the scheduler has to be highly configurable, we need classes like: <br/>\ncourses, lecturers, students, features, rooms, roomRequiredFeatures, <br/>\ntimeSlot, lecturerPrefferredTimeSlots, and so on. I wanted to use the <br/>\n@Before annotations to create fixtures (instantiated test objects to <br/>\ntest). These test objects reflect one example of a data set from the <br/>\ndatabase.<br/>\n<br/>\nAs a matter of fact, the 14 classess are not very detailed: maybe 3-4 <br/>\nfields. The problem arises as they are bound really tight to each other. <br/>\nTHis results in 220 lines code of instanation in the @Before method <br/>\nwhich is way to much. A common way to deal with this is to write <br/>\nmockups, which simulate the test objects behaviour. But as the classes <br/>\nare very simple there is no way to simulate them.<br/>\n<br/>\nI am a little bit desperate because I have the feeling our design is <br/>\nflawed. Are there any suggesstions or course of actions for this case?<br/>\n<br/>\nI hope I made myself clear,<br/>\n<br/>\nBest regards!</div>", 
    "prevInTime": 22958, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1285015623", 
    "canDelete": false, 
    "nextInTopic": 22961, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDRDOTdDODQ3LjEwNTAwMDBAcGF0aGV0aGljLmNvbT4="
    }
}