{
    "numMessagesInTopic": 4, 
    "nextInTime": 22994, 
    "senderId": "EAvNJoXXiiMqfvcPHn2UiWcpBA-JRdhZ_00FWxqKYiOVoDO7SJhV4QvIuO9S4QHi8gocktp2Aaexe6NLxWZLh-A8Hxo9rFmIhXPud0hhXw", 
    "systemMessage": false, 
    "subject": "what should I do first?  upgrade to Java 6, or write unit tests?", 
    "from": "&quot;rejohnsoca&quot; &lt;regan.v.johnson@...&gt;", 
    "authorName": "rejohnsoca", 
    "msgSnippet": "I ve recently become responsible for a piece of software, that runs under java 1.4.2.  it has NO unit tests. I want to move it to Java 6, but the CTO of my", 
    "msgId": 22993, 
    "profile": "rejohnsoca", 
    "topicId": 22993, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 201754012, 
    "messageBody": "<div id=\"ygrps-yiv-173228401\">I&#39;ve recently become responsible for a piece of software, that runs under java 1.4.2.  it has NO unit tests. <br/>\nI want to move it to Java 6, but the CTO of my company is thinking that we should write a unit test suite first, so that we can make sure the upgrade doesn&#39;t break anything.  <br/>\n<br/>\nThat&#39;s a nice idea, and I&#39;m fully behind writing some unit tests.  I&#39;m not sure that the plan is very practical, as I&#39;d really like to start with a recent version of JUnit -like 4.8, and I can&#39;t use it with java 1.4.2<br/>\n<br/>\nWe do have a reasonable suite of integration tests (which are NOT unit tests), to ensure that the upgrade goes well.<br/>\n<br/>\nI was considering, rather than writing unit tests for java 1.4.2, and JUnit 3.8 and then potentially rewriting all of them to run under JUnit 4.8 after the upgrade, it would be better to upgrade the JVM first, rely on integration tests, and then write unit tests from scratch for JUnit 4.8.<br/>\n<br/>\nWhat do other people do if they are in a similar situation?</div>", 
    "prevInTime": 22992, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1286420027", 
    "canDelete": false, 
    "nextInTopic": 22995, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGk4amNucitiOXRpQGVHcm91cHMuY29tPg=="
    }
}