{
    "numMessagesInTopic": 1, 
    "nextInTime": 23050, 
    "senderId": "i1zDaTDFA_2GGiFPjDY-yPEoRTzH5my6rGSZK5CfiEZj8RaM0kLzY2rwZGpvJD9bgqb4rW30pVe5mzKWFBAe4aeMElsH", 
    "systemMessage": true, 
    "subject": "Question about @Category and @SuiteClasses", 
    "from": "&quot;davexor&quot; &lt;xdavem@...&gt;", 
    "authorName": "davexor", 
    "msgSnippet": "Hi there, Yesterday I was trying out the new features in junit 4.8.x and noticed that while Categories and SuiteClasses seem to be what I needed to group my", 
    "msgId": 23049, 
    "profile": "davexor", 
    "topicId": 23049, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 200126209, 
    "messageBody": "<div id=\"ygrps-yiv-2100817307\">Hi there,<br/>\n<br/>\nYesterday I was trying out the new features in junit 4.8.x and noticed that while Categories and SuiteClasses seem to be what I needed to group my tests into different &quot;testing frameworks&quot; I realized that the xml reports generated are not what I expected.<br/>\n<br/>\nThe total number of tests I run is around 60k. They&#39;re currently grouped into &quot;testing frameworks&quot; like frontend tests, backend tests, rdbms, api, webservices, etc. The tests are run through ant and these frameworks are just filesets that include or exclude different file directories. This seems to work fine for us, as the reports generated are per-class, so we can quickly know which class a specific test case belongs to.<br/>\n<br/>\nThe reason I wanted to define my &quot;testing frameworks&quot; using Categories or SuiteClasses is so that the group definition are closer to the java code and developers are more in control as opposed to having to manipulate the ant filesets.<br/>\n<br/>\nHowever, when creating a &quot;Frontend&quot; Suite all the test methods in the frontend test classes are shown in a single report, so I don&#39;t know if testMethodA belongs to com.frontend.ClassATest or com.frontend.ClassBTest.<br/>\n<br/>\nIs there a way to use Categories or SuiteClasses for my use case?<br/>\n<br/>\nThanks!</div>", 
    "prevInTime": 23048, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1288663774", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGlhbnJzdStpc2wxQGVHcm91cHMuY29tPg=="
    }
}