{
    "numMessagesInTopic": 5, 
    "nextInTime": 2305, 
    "senderId": "GZSXZObeAeeE-HpUVX2heBQbB6uUepTCYoKdB1rFiL7Z_YY0v_he8w68NTrzTFb7T15zcvG8pxW6RYFNC0CT7oVx_I_e", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: re - novice QA", 
    "from": "Shane Duan &lt;sduan@...&gt;", 
    "authorName": "Shane Duan", 
    "msgSnippet": "If I understand it correctly, you are trying to improve your test code to be more junit friendly . If that is the case, I think you should do the following", 
    "msgId": 2304, 
    "topicId": 2278, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-696722895\">If I understand it correctly, you are trying to improve your test code to<br/>\nbe more &#39;junit friendly&#39;.<br/>\n<br/>\nIf that is the case, I think you should do the following incremental<br/>\nrefactoring :<br/>\n1. change your testing class to extend junit.framework.TestCase<br/>\n<br/>\n2. Put all your testing code into a method start with &#39;test&#39;, e.g.<br/>\npublic void testCompatibility() so that test runner can pick it up.<br/>\n<br/>\n3. change the code so that instead of adding an error to a vector,<br/>\ncall fail(&quot;your message here&quot;) instead.  I suggest you change the<br/>\nfirst one or three only so that you don&#39;t spend too much time and<br/>\nkeep focused.<br/>\n<br/>\n4. Now you might notice that the first fail will stop further testing.  So<br/>\nyou need to create another test method (a public method that<br/>\nreturns void and takes no arguments) and move some code into<br/>\nthat method.  The code you move should be the one that you stil<br/>\nwant to do regardless whether the first one fail or not.  Don&#39;t worry<br/>\nabout duplicate code for now.<br/>\n<br/>\n5. Now do another one in another method, which should be the code<br/>\nyou want to continue even if the first two tests fail.<br/>\n<br/>\n6. Now that you have a good idea of the duplicated code, move them<br/>\nto the setUp() method so that they will be called automatically.<br/>\n<br/>\n7. Continue the steps.  Take care of the setUp and tearDown so that<br/>\nyour tests won&#39;t be dependent on each other (they can certainly call<br/>\neach other, though).<br/>\n<br/>\nHopefully this will get you started, unless, of course, I totally<br/>\nmisunderstood your motivation.  :)<br/>\n<br/>\nAnd keep in mind that this is by no means a trival task.  So be<br/>\nprepared and don&#39;t lose your focus. :)  Do something like write down<br/>\nthe steps you are going to do.<br/>\n<br/>\nShane<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:the_shark_tank@...\">the_shark_tank@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Shane,<br/>\n&gt;<br/>\n&gt; Well, I am writing a tool to test binary compatibility between<br/>\n&gt; versions.  Basically, I load each version up using my own class<br/>\n&gt; loader, and then compare them to eachother.  However, the way that I<br/>\n&gt; designed the program was that all the errors were stored, and then<br/>\n&gt; just printed out by the user however he wanted.  I wrote the code<br/>\n&gt; myself (both the toolkit code and the junit code).  I have tried<br/>\n&gt; making my (BC) code more test worthy, as suggested earlier in this<br/>\n&gt; forum, such as instead of printing the results, I have a getList<br/>\n&gt; method so I can compare the list to a hardcoded list, however, this<br/>\n&gt; does not seem to fit in with the mentality of unit test writing.  Is<br/>\n&gt; that a better picture of what I am trying to do?  I have a unit test<br/>\n&gt; running now, but I just feel that my design is very sloppy and<br/>\n&gt; amateurish.<br/>\n&gt;<br/>\n&gt; Thanks! </span></blockquote></div>", 
    "prevInTime": 2303, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "997303686", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 2303, 
    "headers": {
        "messageIdInHeader": "PDNCNzFBNTg2LkYwRjVGNkJGQGJvcmxhbmQuY29tPg==", 
        "referencesHeader": "PDlrczNjOSs1NWkxQGVHcm91cHMuY29tPg=="
    }
}