{
    "numMessagesInTopic": 22, 
    "nextInTime": 23111, 
    "senderId": "dsVnQCrKYY36sQF6rlyu_v8NNLk5LHxRHLqLQoiIZ1m1-fClYr-fEr8gd8QLrNKlPpcwM4MDBsi49cmbk32yY76ZgxtOFYx3-tw", 
    "systemMessage": true, 
    "subject": "Re: [junit] Re: Unit testing a private method??", 
    "from": "Mike Forsberg &lt;bigmike.f@...&gt;", 
    "authorName": "Mike Forsberg", 
    "msgSnippet": "It is scary to hear of code that may have broken functionality in a private method while the caller methods do not reveal the classes brokenness.  If a private", 
    "msgId": 23110, 
    "profile": "bigmike_f", 
    "topicId": 23073, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 421392598, 
    "messageBody": "<div id=\"ygrps-yiv-1697562583\">It is scary to hear of code that may have broken functionality in a private<br/>\nmethod while the caller methods do not reveal the classes brokenness.  If a<br/>\nprivate method were performing incorrectly, yet all the functionality<br/>\nexposed at the protected level and above works correctly, one would have to<br/>\nask, &quot;What is the man behind the curtain really doing?&quot;.<br/>\n<br/>\nIn a slightly different vain, if a developer were writing tests as sign<br/>\nposts to signify that an error has occurred, shouldn&#39;t that sign post be<br/>\nviewable at a higher then private level.<br/>\n<br/>\nConsider a public API that is tested thoroughly and is functionally<br/>\ncorrect.  Yet, there is a private method that still has a functional error.<br/>\nThis should be a signal that the extra incorrect functionality is<br/>\nunreachable or unnecessary.<br/>\n<br/>\nIn regards to... why do unit testing at all if everything is tested through<br/>\nfunctional testing.<br/>\n<br/>\nPersonally, if I could get every scenario to run at the<br/>\nintegration/functional level within the time I can run my unit tests, I&#39;d<br/>\nonly write unit tests to track down why the higher level tests are failing.<br/>\nIn this amazing world, a unit test would only be needed to track down a bug<br/>\nsince my brain is not big enough to hold the whole system in it&#39;s mind.<br/>\nHowever, once the bug is fixed, the unit test can grow stale.  As I&#39;d be<br/>\nassured that every possible scenario is tested.<br/>\n<br/>\nFor me, the reality is that customers don&#39;t care that<br/>\n- every method performs correctly<br/>\n- a given method supplies incorrect answers in certain conditions<br/>\nThey only care that the result they need is correct when they need it.<br/>\n<br/>\nSince it is the customer that is paying me, I&#39;d rather only care what they<br/>\ncare about.<br/>\n<br/>\nMaking a rough calculation that<br/>\n- The price of enough machines to run every integration/functional test<br/>\nwithin a reasonable amount of time is too much money.<br/>\n- I don&#39;t write perfect code, and I&#39;d most likely need targeted tests that<br/>\ncan run parts of the system in case there is a bug.<br/>\n- Since I know what I&#39;m changing when I change it, I can keep a<br/>\ncorresponding set of tests up-to-date with the code changes.<br/>\nIt behooves me to keep some unit tests laying around.<br/>\n<br/>\nThen, since they are laying around and are up-to-date, why not run all the<br/>\nones above the code that I&#39;m changing.  And thus I keep a set of unit tests<br/>\nfor each class.  Should I run all the unit test?  Nope, if their code was<br/>\nnot touched, then they should still pass.  If it is the case that the tests<br/>\nmight fail, then I might have bad architecture or class design.<br/>\n<br/>\nMy two cents,<br/>\n<br/>\nBig Mike<br/>\n<br/>\n<br/>\n2010/12/4 Cédric Beust ♔ &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cedric@...\">cedric@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; On Sat, Dec 4, 2010 at 6:58 AM, mphilipp1982 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mphilipp82@...\">mphilipp82@...</a>&lt;mphilipp82%40gmail.com&gt;&gt;<br/>\n&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; I absolutely agree with Charlie. Lasse Koskela recently blogged about<br/>\n&gt; this<br/>\n&gt; &gt; issue here:<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://lassekoskela.com/thoughts/24/test-everything-but-not-private-methods/\">http://lassekoskela.com/thoughts/24/test-everything-but-not-private-methods/</a><br/>\n&gt;<br/>\n&gt; Sorry, but Lasse seems to disagree with both Charlie and myself. He&#39;s<br/>\n&gt; saying<br/>\n&gt; that you should never test private methods directly, only indirectly<br/>\n&gt; through<br/>\n&gt; public methods.<br/>\n&gt;<br/>\n&gt; I find this angle puzzling, since as I said above, if you follow this<br/>\n&gt; reasoning, since all your code is already being tested indirectly by<br/>\n&gt; functional testing, why do unit testing at all?<br/>\n&gt;<br/>\n&gt; The main reason why I sometimes want to test private methods is not fear,<br/>\n&gt; as<br/>\n&gt; Lasse claims, but simply the fact that this functionality can break.<br/>\n&gt; Therefore, it deserves a test of its own.<br/>\n&gt;<br/>\n&gt; There are two extreme ways to test private methods, both bad:<br/>\n&gt;<br/>\n&gt; - Use reflection + setAccessible. Very fragile, avoid.<br/>\n&gt; - Use public methods that call this private method. Not good enough.<br/>\n&gt;<br/>\n&gt; I tend to favor the middle ground approach, which is to relax the scope of<br/>\n&gt; the method so that tests can see it. Making it package protected and<br/>\n&gt; putting<br/>\n&gt; a comment (&quot;/* for testing */&quot;) usually works, but if it doesn&#39;t, I don&#39;t<br/>\n&gt; have a problem with making this method public for testing.<br/>\n&gt;<br/>\n&gt; --<br/>\n&gt; Cédric<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 23109, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1291508256", 
    "canDelete": false, 
    "nextInTopic": 23111, 
    "prevInTopic": 23109, 
    "headers": {
        "inReplyToHeader": "PEFBTkxrVGlta0VjVWVQQUV5US0zPU52MG5uVnl1c054TU9yVT1iLWZidD00RUBtYWlsLmdtYWlsLmNvbT4=", 
        "messageIdInHeader": "PEFBTkxrVGltZ2RpT09BWkZicG1vUXlHSkhSeUYwcG9IdUZMaWlNRzh2Z3VEaEBtYWlsLmdtYWlsLmNvbT4=", 
        "referencesHeader": "PEFBTkxrVGluQTlQaDlFWEsreWI1QTllb1hnaG5DMDFnTHl3Z05VUkFReUhxM0BtYWlsLmdtYWlsLmNvbT4JPGlkZGt2ZCs2aWNlQGVHcm91cHMuY29tPgk8QUFOTGtUaW1rRWNVZVBBRXlRLTM9TnYwbm5WeXVzTnhNT3JVPWItZmJ0PTRFQG1haWwuZ21haWwuY29tPg=="
    }
}