{
    "numMessagesInTopic": 22, 
    "nextInTime": 23113, 
    "senderId": "dyg0z-Mbn35m0rOBEg0JKvE_soHoVHmOTp3OHHXsj-OErTOnxtuSwzLaZ14PAeLVurFo5lsYoTX8-MtiU9uEt5PO", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Unit testing a private method??", 
    "from": "David Saff &lt;david@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "... I tend to try many different approaches to software development, since I plan to be doing it for decades to come, and don t want to get stuck in a local", 
    "msgId": 23112, 
    "profile": "dsaff", 
    "topicId": 23073, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 341876227, 
    "messageBody": "<div id=\"ygrps-yiv-994011347\">2010/12/5 Cédric Beust ♔ &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cedric@...\">cedric@...</a>&gt;:<br/>\n<blockquote><span title=\"ireply\"> &gt; On Sat, Dec 4, 2010 at 4:17 PM, Mike Forsberg &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bigmike.f@...\">bigmike.f@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;&gt; For me, the reality is that customers don&#39;t care that<br/>\n&gt;&gt; - every method performs correctly<br/>\n&gt;&gt; - a given method supplies incorrect answers in certain conditions<br/>\n&gt;&gt; They only care that the result they need is correct when they need it.<br/>\n&gt;&gt;<br/>\n&gt;&gt; Since it is the customer that is paying me, I&#39;d rather only care what they<br/>\n&gt;&gt; care about.<br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt; That&#39;s a truth that too many engineers tend to forget about, and this is why<br/>\n&gt; in the grander scheme of things, functional tests are so much more important<br/>\n&gt; than unit tests.<br/>\n&gt;<br/>\n&gt; Here is the reality: unit tests are a comfort *for the developer*.<br/>\n&gt; Functional tests are a necessity *for the user*.<br/>\n&gt;<br/>\n&gt; Functional tests allow you to make sure that a functionality that you are<br/>\n&gt; shipping and that will be used by your consumers will work as expected.<br/>\n&gt;<br/>\n&gt; Unit tests give you no such guarantee. 100% unit tests might be passing and<br/>\n&gt; still, your application might be completely broken.<br/>\n&gt;<br/>\n&gt; This is the reason why if I&#39;m pressed with time and I have to choose between<br/>\n&gt; writing a unit test or a functional test, I will choose to write a<br/>\n&gt; functional test 100% of the time. Then later, if I find some extra time,<br/>\n&gt; I&#39;ll try to write a few unit tests that will allow me to converge toward<br/>\n&gt; problems faster. Because that&#39;s all unit tests enable: faster pinpointing of<br/>\n&gt; a problem. If 100% of your tests are functional, you will still find the<br/>\n&gt; problem but it might take you a little longer. Not a big deal.<br/>\n&gt;<br/>\n&gt; It&#39;s unfortunate that unit tests have become such a high focus of attention<br/>\n&gt; lately (and another reason why TDD makes me uncomfortable). High emphasis on<br/>\n&gt; unit tests and on TDD is engineers trying to make their work easier. It&#39;s a<br/>\n&gt; laudable goal, but it should never come at the expense of the person whom<br/>\n&gt; you are working for: the customer.<br/>\n&gt;<br/>\n&gt; And the only tests that really matter to the customer are functional tests.<br/>\n<br/>\n </span></blockquote>I tend to try many different approaches to software development, since<br/>\nI plan to be doing it for decades to come, and don&#39;t want to get stuck<br/>\nin a local maximum.  I pay special attention to techniques that people<br/>\nI trust say good things about, but I haven&#39;t tried, or haven&#39;t been<br/>\nsuccessful with.  At this point, I find that test-driven development,<br/>\nwith the discipline of changing my design when writing the unit tests<br/>\nhurts, produces the highest-quality software at the highest speed.  I<br/>\nexpect I&#39;ll continue to try variations on the formula and others.<br/>\n<br/>\nThis isn&#39;t the first time that Cedric and I have discussed this<br/>\nparticular point, so you can probably refer to previous mails on this<br/>\nlist if I don&#39;t expand every thought here.<br/>\n<br/>\n- Most engineers and craftsmen consider it professional to have<br/>\nstructures they use during design and construction that make their job<br/>\neasier, but might not obviously contribute to final quality from an<br/>\noutsider&#39;s perspective.  Home contractors might use scaffolding,<br/>\ntemporary lighting, pencil marks on the walls, clamps.  As a customer,<br/>\nI do not begrudge these tools, saying &quot;without that temporary<br/>\nlighting, you&#39;ll probably make more mistakes, and it might take you<br/>\nlonger to find them and fix them, but eventually it will get done.&quot;<br/>\n<br/>\n- On being &quot;pressed for time&quot;: I assume that a very experienced auto<br/>\nengineer can make a professional decision, when pressed for time,<br/>\nabout whether to thoroughly test the airbags in my car using crash<br/>\ntest dummies, or using a more isolated lab test.  I also really hope<br/>\nthat if both are valuable, a very professional auto engineer makes<br/>\nsure there&#39;s time in the schedule for both, and doesn&#39;t spend a lot of<br/>\ntime arguing with peers about which to drop in order to shorten the<br/>\nschedule.<br/>\n<br/>\n- No tests matter to the customer.  Working software matters to the<br/>\ncustomer.  What produces working software is a matter best<br/>\ninvestigated through history and experience.<br/>\n<br/>\nThanks,<br/>\n<br/>\n   David<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; --<br/>\n&gt; Cédric<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 23111, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1291580017", 
    "canDelete": false, 
    "nextInTopic": 23114, 
    "prevInTopic": 23111, 
    "headers": {
        "inReplyToHeader": "PEFBTkxrVGk9NUJFUnYtYmh0Qi0xRHUxYjl3T3ZFa3pDR0FYQnNLZ2VyNjRFN0BtYWlsLmdtYWlsLmNvbT4=", 
        "messageIdInHeader": "PEFBTkxrVGluZkxSR3hvNjBDb1oySDNGNzJFUjJKZm1Ua2JhenRzQ0pfU2dBNEBtYWlsLmdtYWlsLmNvbT4=", 
        "referencesHeader": "PEFBTkxrVGluQTlQaDlFWEsreWI1QTllb1hnaG5DMDFnTHl3Z05VUkFReUhxM0BtYWlsLmdtYWlsLmNvbT4JPGlkZGt2ZCs2aWNlQGVHcm91cHMuY29tPgk8QUFOTGtUaW1rRWNVZVBBRXlRLTM9TnYwbm5WeXVzTnhNT3JVPWItZmJ0PTRFQG1haWwuZ21haWwuY29tPgk8QUFOTGtUaW1nZGlPT0FaRmJwbW9ReUdKSFJ5RjBwb0h1RkxpaU1HOHZndURoQG1haWwuZ21haWwuY29tPgk8QUFOTGtUaT01QkVSdi1iaHRCLTFEdTFiOXdPdkVrekNHQVhCc0tnZXI2NEU3QG1haWwuZ21haWwuY29tPg=="
    }
}