{
    "numMessagesInTopic": 6, 
    "nextInTime": 23150, 
    "senderId": "Gi7C_fI_dxgAZgHUlqEzuwE_nIP-N50Gol7voWHYfU21wgAXRYbslkU0Hzp7T66vpFDONUyNv9JtllJYNc6U0wZDySprH0wzo8jLkbU", 
    "systemMessage": false, 
    "subject": "Re: [junit] The story of the JUnit license", 
    "from": "Bill Shannon &lt;bill.shannon@...&gt;", 
    "authorName": "Bill Shannon", 
    "msgSnippet": "... If you don t understand why people object to the patent litigation clause, well, then you re like me a few days ago, or like most of the people who use", 
    "msgId": 23149, 
    "profile": "bs00011", 
    "topicId": 23147, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 441293675, 
    "messageBody": "<div id=\"ygrps-yiv-2084788070\">Kent Beck wrote on 01/14/11 07:37 AM:<br/>\n<blockquote><span title=\"ireply\"> &gt; Commercial licenses<br/>\n&gt;<br/>\n&gt; About five years ago I began receiving questions from company lawyers about the<br/>\n&gt; CPL. They object to the patent provisions for reasons I cannot explain because I<br/>\n&gt; have never received an explanation that made sense to me. In these cases I offer<br/>\n&gt; to write a commercial license for JUnit with terms that meet their needs.<br/>\n&gt; Sometimes the inquirer purchases the license. Sometimes they don&#39;t.<br/>\n<br/>\n </span></blockquote>If you don&#39;t understand why people object to the patent litigation clause,<br/>\nwell, then you&#39;re like me a few days ago, or like most of the people who<br/>\nuse JUnit - you&#39;ve been completely fooled by the implications of the<br/>\nlicense.  Start here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Eclipse_Public_License#cite_note-patent_litigation_change-2\">http://en.wikipedia.org/wiki/Eclipse_Public_License#cite_note-patent_litigation_change-2</a><br/>\n<br/>\nAs I now understand it (IANAL), the CPL provides a huge disincentive to anyone<br/>\nwho depends on JUnit to enforce their patent rights with a contributor to<br/>\nJUnit *for software completely unrelated to JUnit*.  CPL (and EPL) contains<br/>\na similar patent retaliation clause limited to the licensed program (e.g.,<br/>\nJUnit), but it&#39;s this broader clause in CPL that is problematic.<br/>\n<br/>\nAs licensor, you might think this is a good thing.<br/>\n<br/>\nIf you believe software patents are evil, you might think this is a good thing.<br/>\n<br/>\nAs licensee, if you have a significant software patent portfolio, you should<br/>\nbe concerned.<br/>\n<br/>\nAsk IBM if they&#39;re willing to use someone else&#39;s software under the terms<br/>\nof the CPL license.<br/>\n<br/>\nI fully understand why you would want to offer commercial licenses for JUnit,<br/>\nand why changes that reduce your ability to make money that way would not<br/>\nbe attractive.<br/>\n<br/>\nAnd I understand that changing the license has some cost to you, for no<br/>\napparent benefit to *you*.<br/>\n<br/>\nI just think it&#39;s important for you to understand why others object to the<br/>\nlicense you&#39;ve chosen, even if you don&#39;t want to change it.  (Given the<br/>\nhistory you&#39;ve described, it&#39;s clear that you didn&#39;t choose this license<br/>\n*because* of this clause.)  I understand that you need to balance changes<br/>\nin the license that might further promote use and distribution of JUnit<br/>\nwith the cost to you of doing so and with your ability to make money by<br/>\nselling commercial licenses.<br/>\n<br/>\nDo you now understand why others have an issue with the license you&#39;re using?</div>", 
    "prevInTime": 23148, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1295040975", 
    "canDelete": false, 
    "nextInTopic": 23154, 
    "prevInTopic": 23148, 
    "headers": {
        "inReplyToHeader": "PDkwQkZCRTU2LTY1RjQtNDc4Ni1BQzdCLURBMUM5M0FFQTQ1NkBlYXJ0aGxpbmsubmV0Pg==", 
        "messageIdInHeader": "PDREMzBDMUNGLjkwNTAxMDdAb3JhY2xlLmNvbT4=", 
        "referencesHeader": "PDkwQkZCRTU2LTY1RjQtNDc4Ni1BQzdCLURBMUM5M0FFQTQ1NkBlYXJ0aGxpbmsubmV0Pg=="
    }
}