{
    "numMessagesInTopic": 6, 
    "nextInTime": 23148, 
    "senderId": "pNoirDp3LZ746Ql3ki_0Xloyti3czNcdxJDo5cJvHObhpegstmOw7bnSB3aMTQUIaPLjATYeL0Tx_DQkKkR5fLXhWtwrpw", 
    "systemMessage": false, 
    "subject": "The story of the JUnit license", 
    "from": "Kent Beck &lt;kentb@...&gt;", 
    "authorName": "Kent Beck", 
    "msgSnippet": "All, Since the question about the JUnit license came up recently, I thought I d clarify the story of why the license is the way it is. Pre-license For the", 
    "msgId": 23147, 
    "profile": "kentlbeck", 
    "topicId": 23147, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 173198504, 
    "messageBody": "<div id=\"ygrps-yiv-2133597040\">All,<br/>\n<br/>\nSince the question about the JUnit license came up recently, I thought I&#39;d clarify the story of why the license is the way it is.<br/>\n<br/>\nPre-license<br/>\n<br/>\nFor the first year or so of JUnit&#39;s existence we didn&#39;t have a license at all. The code was out there, people used it, nobody worried.<br/>\n<br/>\nCPL<br/>\n<br/>\nAfter a while it became clear that JUnit was going to be popular. At the same time IBM&#39;s lawyers discovered open source. Since Erich and I had been equally involved in the project from the first, we needed to have a license and it needed to be one that the IBM lawyers approved of. This was roughly the time that the CPL came out, I believe with IBM&#39;s support. We adopted the CPL, more or less by default.<br/>\n<br/>\nI want to be clear on this point. The CPL isn&#39;t a cunning trick or a political statement. It&#39;s just the license that made sense at the time.<br/>\n<br/>\nCommercial licenses<br/>\n<br/>\nAbout five years ago I began receiving questions from company lawyers about the CPL. They object to the patent provisions for reasons I cannot explain because I have never received an explanation that made sense to me. In these cases I offer to write a commercial license for JUnit with terms that meet their needs. Sometimes the inquirer purchases the license. Sometimes they don&#39;t.<br/>\n<br/>\nRe-licensing<br/>\n<br/>\nOne of the options is to issue JUnit under a new license that no one would object to.  I don&#39;t have any plans to do this. The costs of the conversion are considerable, and would be paid by me. The benefits of the conversion would accrue to large corporations with big legal staffs. It doesn&#39;t make sense to me to spend my time for free to make their lives easier. From my perspective, if a company can afford the lawyers to object to the CPL, then they can afford a commercial license. The vast majority of users have no concerns with the current license.<br/>\n<br/>\nI suppose there is a fantasy scenario where Large Corp. decides to sponsor JUnit for a bazillion dollars a year and as part of the deal I change the license, but that doesn&#39;t seem likely at this point.<br/>\n<br/>\nConclusion<br/>\n<br/>\nI can see that from the outside my position looks a bit like extortion: you (big company) don&#39;t want bad things to happen, you&#39;d better pay up. From my perspective, though, my position makes sense. If you can pay to object, you can pay to make the objection go away. I have donated many thousands of hours of my time to my community. Should I donate more of my time so lawyers can sleep better at night and give up a source of revenue in the process? That&#39;s the part that doesn&#39;t make sense to me. I can see the conflict between the two perspectives but I don&#39;t have a resolution.<br/>\n<br/>\nAnyway, that&#39;s the story of the JUnit license. I&#39;d be glad to engage in followup discussions here if folks have any questions or comments.</div>", 
    "prevInTime": 23146, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1295019454", 
    "canDelete": false, 
    "nextInTopic": 23148, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDkwQkZCRTU2LTY1RjQtNDc4Ni1BQzdCLURBMUM5M0FFQTQ1NkBlYXJ0aGxpbmsubmV0Pg=="
    }
}