{
    "numMessagesInTopic": 6, 
    "nextInTime": 23148, 
    "senderId": "ozEcmuikVS_FeEpTM_HCf0x0DiSt5XFKXNWdI_DRiEercWmXgmKNAuYxnSg8d4xmQL-Gjp34q5zbuCk7zGtTSIL0lAsfCw", 
    "systemMessage": false, 
    "subject": "The story of the JUnit license", 
    "from": "Kent Beck &lt;kentb@...&gt;", 
    "authorName": "Kent Beck", 
    "msgSnippet": "All, Since the question about the JUnit license came up recently, I thought I d clarify the story of why the license is the way it is. Pre-license For the", 
    "msgId": 23147, 
    "rawEmail": "Return-Path: &lt;kentb@...&gt;\r\nX-Sender: kentb@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nX-Received: (qmail 10015 invoked from network); 14 Jan 2011 15:37:36 -0000\r\nX-Received: from unknown (98.137.34.46)\n  by m4.grp.sp2.yahoo.com with QMQP; 14 Jan 2011 15:37:36 -0000\r\nX-Received: from unknown (HELO elasmtp-galgo.atl.sa.earthlink.net) (209.86.89.61)\n  by mta3.grp.sp2.yahoo.com with SMTP; 14 Jan 2011 15:37:36 -0000\r\nX-Received: from [71.34.232.109] (helo=[192.168.0.79])\n\tby elasmtp-galgo.atl.sa.earthlink.net with esmtpa (Exim 4.67)\n\t(envelope-from &lt;kentb@...&gt;)\n\tid 1PdliZ-0007pf-Kx; Fri, 14 Jan 2011 10:37:36 -0500\r\nContent-Type: text/plain; charset=us-ascii\r\nContent-Transfer-Encoding: quoted-printable\r\nDate: Fri, 14 Jan 2011 07:37:34 -0800\r\nTo: junit@yahoogroups.com\r\nMessage-Id: &lt;90BFBE56-65F4-4786-AC7B-DA1C93AEA456@...&gt;\r\nMime-Version: 1.0 (Apple Message framework v1082)\r\nX-Mailer: Apple Mail (2.1082)\r\nX-ELNK-Trace: 6d780abf06d998e474bf435c0eb9d478492f6637d49f10f713e34f610a5874f8b126e6df7710fe85350badd9bab72f9c350badd9bab72f9c350badd9bab72f9c\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Kent Beck &lt;kentb@...&gt;\r\nSubject: The story of the JUnit license\r\nX-Yahoo-Group-Post: member; u=173198504; y=JrYDhevOYO2RF5zSjsIqPv7pjCeKujv2TNWDiSA08AN7xMo8\r\nX-Yahoo-Profile: kentlbeck\r\n\r\nAll,\n\nSince the question about the JUnit license came up recently, I though=\r\nt I&#39;d clarify the story of why the license is the way it is.\n\nPre-license\n\n=\r\nFor the first year or so of JUnit&#39;s existence we didn&#39;t have a license at a=\r\nll. The code was out there, people used it, nobody worried.\n\nCPL\n\nAfter a w=\r\nhile it became clear that JUnit was going to be popular. At the same time I=\r\nBM&#39;s lawyers discovered open source. Since Erich and I had been equally inv=\r\nolved in the project from the first, we needed to have a license and it nee=\r\nded to be one that the IBM lawyers approved of. This was roughly the time t=\r\nhat the CPL came out, I believe with IBM&#39;s support. We adopted the CPL, mor=\r\ne or less by default.\n\nI want to be clear on this point. The CPL isn&#39;t a cu=\r\nnning trick or a political statement. It&#39;s just the license that made sense=\r\n at the time.\n\nCommercial licenses\n\nAbout five years ago I began receiving =\r\nquestions from company lawyers about the CPL. They object to the patent pro=\r\nvisions for reasons I cannot explain because I have never received an expla=\r\nnation that made sense to me. In these cases I offer to write a commercial =\r\nlicense for JUnit with terms that meet their needs. Sometimes the inquirer =\r\npurchases the license. Sometimes they don&#39;t.\n\nRe-licensing\n\nOne of the opti=\r\nons is to issue JUnit under a new license that no one would object to.  I d=\r\non&#39;t have any plans to do this. The costs of the conversion are considerabl=\r\ne, and would be paid by me. The benefits of the conversion would accrue to =\r\nlarge corporations with big legal staffs. It doesn&#39;t make sense to me to sp=\r\nend my time for free to make their lives easier. From my perspective, if a =\r\ncompany can afford the lawyers to object to the CPL, then they can afford a=\r\n commercial license. The vast majority of users have no concerns with the c=\r\nurrent license.\n\nI suppose there is a fantasy scenario where Large Corp. de=\r\ncides to sponsor JUnit for a bazillion dollars a year and as part of the de=\r\nal I change the license, but that doesn&#39;t seem likely at this point.\n\nConcl=\r\nusion\n\nI can see that from the outside my position looks a bit like extorti=\r\non: you (big company) don&#39;t want bad things to happen, you&#39;d better pay up.=\r\n From my perspective, though, my position makes sense. If you can pay to ob=\r\nject, you can pay to make the objection go away. I have donated many thousa=\r\nnds of hours of my time to my community. Should I donate more of my time so=\r\n lawyers can sleep better at night and give up a source of revenue in the p=\r\nrocess? That&#39;s the part that doesn&#39;t make sense to me. I can see the confli=\r\nct between the two perspectives but I don&#39;t have a resolution.\n\nAnyway, tha=\r\nt&#39;s the story of the JUnit license. I&#39;d be glad to engage in followup discu=\r\nssions here if folks have any questions or comments.\n", 
    "profile": "kentlbeck", 
    "topicId": 23147, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 173198504, 
    "prevInTime": 23146, 
    "contentTrasformed": false, 
    "postDate": "1295019454", 
    "canDelete": false, 
    "nextInTopic": 23148, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDkwQkZCRTU2LTY1RjQtNDc4Ni1BQzdCLURBMUM5M0FFQTQ1NkBlYXJ0aGxpbmsubmV0Pg=="
    }
}