{
    "numMessagesInTopic": 10, 
    "nextInTime": 23143, 
    "senderId": "yNMZb8Utl-K-CBoWJWR01KQ7YiiiPdFZ2dkq3UqT20rx4fux4g9MaU0RYfKvWNVRO59KjX6LJTsLHSKz-z89_-48pXjRqBIns-6N96PRzLBy", 
    "systemMessage": true, 
    "subject": "More modern license?", 
    "from": "&quot;jaroslavtulach&quot; &lt;jaroslav.tulach@...&gt;", 
    "authorName": "jaroslavtulach", 
    "msgSnippet": "Hello JUnit guys. I know my post is going to sound silly, but I ll try anyway. We have new lawyers. Our new lawyers seem to be concerned about the JUnit", 
    "msgId": 23142, 
    "profile": "jaroslavtulach", 
    "topicId": 23142, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 257102072, 
    "messageBody": "<div id=\"ygrps-yiv-1332295866\">Hello JUnit guys.<br/>\nI know my post is going to sound silly, but I&#39;ll try anyway.<br/>\n<br/>\nWe have new lawyers. Our new lawyers seem to be concerned about the JUnit license. True, JUnit&#39;s use of Common Public License is unique and sort of archaic. I don&#39;t know about any other (important) project using this license anymore.<br/>\n<br/>\nRight now we are holding our release and getting ready to remove JUnit from our standard installation. Silly, I know, JUnit is necessary part of any serious Java development, but there is not much we can do. Except to ask:<br/>\n<br/>\nDon&#39;t you want to relicense JUnit to some more commonly used license? EPL would be fine. At least I have not heard any complain about EPL from our new lawyers yet. Dual licensing to CPL & EPL probably too.<br/>\n<br/>\nThanks for reading my post and sorry for bothering. It just make me sad to see our software being crippled due to artificial licensing constraints.<br/>\n<br/>\nOn behalf of about 800000 active users of NetBeans IDE,<br/>\nJaroslav Tulach<br/>\nNetBeans Platform Architect</div>", 
    "prevInTime": 23141, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1294908554", 
    "canDelete": false, 
    "nextInTopic": 23143, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGlnbWVhYStoM2QzQGVHcm91cHMuY29tPg=="
    }
}