{
    "numMessagesInTopic": 7, 
    "nextInTime": 23180, 
    "senderId": "aKtTApcaU_tG2yzmhFTIr7dt1GvHcN73VApY8LM_YtRkxFA5ID5JhiOywTpezSgoGTvZPUqOxrm95t6M2nAmt0nkNaeUaANp6A", 
    "systemMessage": true, 
    "subject": "accessing JUnit runner/suite objects at runtime (or... rule for a suite)", 
    "from": "&quot;sdrothco&quot; &lt;steve.roth@...&gt;", 
    "authorName": "sdrothco", 
    "msgSnippet": "I have created a custom JUnit 4.8 category (and an associated suite to run this category), as well as an associated annotation which must be set. I need to", 
    "msgId": 23179, 
    "profile": "sdrothco", 
    "topicId": 23179, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 404695477, 
    "messageBody": "<div id=\"ygrps-yiv-1637420414\">I have created a custom JUnit 4.8 category (and an associated suite to run this category), as well as an associated annotation which must be set.<br/>\n<br/>\nI need to verify that for each class with the custom category, the custom annotation is set properly.<br/>\n<br/>\nI&#39;m trying to find a way to do this in JUnit, without forcing all my test classes to have a common base-class.<br/>\n<br/>\nSo far, the only way I can think of handling this is to create a Rule.  However, since a Rule does not seem to work with a Suite (and therefore Categories), I believe that would require a common base-class for all my tests, which is something I&#39;m trying to avoid.<br/>\n<br/>\nIt seems if I could access the JUnit objects directly-- either via a singleton/static API, or via fetching annotation objects, I could fetch my category, find its list of test classes, and iterate over them verifying the annotations.<br/>\n<br/>\nHas anyone tackled this before?  Any ideas?<br/>\n<br/>\nThanks<br/>\n-Steve</div>", 
    "prevInTime": 23178, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1295907421", 
    "canDelete": false, 
    "nextInTopic": 23185, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGloa3RvdCtjNzQ3QGVHcm91cHMuY29tPg=="
    }
}