{
    "numMessagesInTopic": 12, 
    "nextInTime": 23248, 
    "senderId": "Mv6YJpdDnDZXRZiDIb8ffFbhZyuZnSWeUUTqcqEaeLNTr9O3EmSUSn4Xi8_7LMhB6PRMaaPUo5UQYrmJX5sgXTkEBrEF7U3-nw", 
    "systemMessage": false, 
    "subject": "Misc improvements", 
    "from": "&quot;mguillemot&quot; &lt;mguillemot@...&gt;", 
    "authorName": "mguillemot", 
    "msgSnippet": "Hi, I would be interested to know if JUnit team would have interest in the features below for integration in JUnit. If yes, I would look at providing patches", 
    "msgId": 23247, 
    "profile": "mguillemot", 
    "topicId": 23247, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 29099502, 
    "messageBody": "<div id=\"ygrps-yiv-388869848\">Hi,<br/>\n<br/>\nI would be interested to know if JUnit team would have interest in the features below for integration in JUnit. If yes, I would look at providing patches and if not, I&#39;ll find an other way to waste my time ;-)<br/>\n<br/>\n- ForkingVMTestRunner<br/>\na runner executing the unit tests in a forked virtual machine allowing to test effect of command line JVM switches for instance<br/>\n<br/>\n- ParrallelRunner<br/>\nJUnit already contains nearly the whole code for that but not available as runner running tests in parallel<br/>\n<br/>\n- ParameterizedRunner<br/>\na runner far more flexible than JUnit&#39;s Parameterized runner allowing to configure usage per method (a bit like TestNG) and for different types<br/>\n<br/>\n- @NotYetImplemented<br/>\nthis is an annotation allowing to indicate that a unit test is expected to fail. A failure should be reported as success whereas a success should be reported as failure. This has proven to be far more interesting than @Ignore which is just a little better than removing a test: @NotYetImplemented allows to write tests for &quot;accepted&quot; bugs or future features and to get notified when they are fixed as side effect of other changes<br/>\n<br/>\n- assertEquals & IDE integration<br/>\nsmall improvement to throw ComparisonFailure not only for String comparison what allows IDE like Eclipse to better display differences between expected and actual result.<br/>\n<br/>\nCheers,<br/>\nMarc.</div>", 
    "prevInTime": 23246, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1297357789", 
    "canDelete": false, 
    "nextInTopic": 23251, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGlqMTY0dCsyZjI5QGVHcm91cHMuY29tPg=="
    }
}