{
    "numMessagesInTopic": 1, 
    "nextInTime": 23263, 
    "senderId": "P1hD0bJ_fEPPTPrFZ-S1WUlO7Nnopf7FwZUAYxXYKYSEUsKILwOZUGwb60zAZHMP3iz4oAPTDuJzypf7xSEd8RWD", 
    "systemMessage": false, 
    "subject": "JUnit issue responsiveness (was: Re: [junit] Re: Misc improvements)", 
    "from": "David Saff &lt;david@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "Marc, In your position, I d be frustrated, too.  I ll respond to the direct situation on the original thread, but I wanted to talk here about the larger", 
    "msgId": 23262, 
    "profile": "dsaff", 
    "topicId": 23262, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 341876227, 
    "messageBody": "<div id=\"ygrps-yiv-467584771\">Marc,<br/>\n<br/>\nIn your position, I&#39;d be frustrated, too.  I&#39;ll respond to the direct<br/>\nsituation on the original thread, but I wanted to talk here about the<br/>\nlarger context.<br/>\n<br/>\nFor those not aware of the context of Marc&#39;s comment, the<br/>\nhighest-voted issue on github is now over a year old, and there are<br/>\n140 open issues.  By reducing the time to resolve issues, we wouldn&#39;t<br/>\nlose the effort of motivated developers like Marc.<br/>\n<br/>\nHere&#39;s a first couple of steps.<br/>\n<br/>\n1) For several years now, issue triage and patch acceptance has been<br/>\none of several priorities that have competed for time during pair<br/>\nprogramming sessions between the developers.  One benefit was that the<br/>\nproject didn&#39;t get away from either of us, and we were able to<br/>\nevaluate proposed changes from multiple perspectives.  I&#39;m going to<br/>\ntry taking solo point on these activities, with Kent as advisor.  Give<br/>\nme a couple months to get a routine going, and then let me know if the<br/>\nproject seems like a more appealing place to contribute.<br/>\n<br/>\n2) As part of this, I&#39;ll try to provide feedback within a week on new<br/>\nissues and patches.  This may mean that feature requests we are<br/>\nunlikely to incorporate will get closed quickly, rather than left open<br/>\nand abandoned.  Let me know if it starts feeling like too much<br/>\npushback.<br/>\n<br/>\nWhile this will apply to new issues and patches, there&#39;s still a<br/>\nbacklog to get through.  I can&#39;t estimate how quickly I&#39;ll be able to<br/>\nget through it, nor am I sure in advance whether I will prioritize the<br/>\ncommunication backlog above all new development activities.  If you&#39;ve<br/>\nread this far, and would like to bump your issue or patch up in the<br/>\nqueue with a reminder message, I should see it.<br/>\n<br/>\nJUnit will likely continue to grow more slowly than your average open<br/>\nsource project.  This has had advantages in maintaining a coherent<br/>\ncore of concepts and limited churn in the core.  There are things like<br/>\nreporting and data parsing that the core junit.jar file is unlikely to<br/>\never do, as it strives to be &quot;the intersection of all useful test<br/>\nframeworks, not their union&quot;.  The Runners and Rules included in<br/>\njunit.jar have always been intended as examples and starting points<br/>\nfor further extension outside of the core.<br/>\n<br/>\nI think there could be value in a bundling of JUnitUnion: the JUnit<br/>\nCore, plus a set of very useful and reusable extensions managed by<br/>\npeople outside the core JUnit team.  I&#39;d love suggestions on the<br/>\ntechnical and managerial ways such a super-package could be maintained<br/>\nand distributed.<br/>\n<br/>\nThanks for sticking around.  Share and Enjoy.<br/>\n<br/>\n   David Saff<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Feb 14, 2011 at 3:47 AM, mguillemot &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mguillemot@...\">mguillemot@...</a>&gt; wrote:<br/>\n&gt; Hi David,<br/>\n&gt;<br/>\n&gt; not really the most motivating answer :-(<br/>\n&gt;<br/>\n&gt; Providing a clean patch requires time. I follow JUnit GitHub issues since long enough to have an idea of what happens there, therefore I will use my time for other activities.<br/>\n&gt;<br/>\n&gt; Cheers,<br/>\n&gt; Marc.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, David Saff &lt;david@...&gt; wrote:<br/>\n&gt;&gt;<br/>\n&gt;&gt; Marc,<br/>\n&gt;&gt;<br/>\n&gt;&gt; After the release of 4.9 (hopefully soon), my plan is to concentrate<br/>\n&gt;&gt; development and patching activity on GitHub issues with high vote<br/>\n&gt;&gt; counts.  I recommend posting these as GitHub issues<br/>\n&gt;&gt; (<a rel=\"nofollow\" target=\"_blank\" href=\"http://github.com/KentBeck/junit/issues)\">http://github.com/KentBeck/junit/issues)</a>--feel free to use this forum<br/>\n&gt;&gt; to encourage votes.  Thanks,<br/>\n&gt;&gt;<br/>\n&gt;&gt;    David Saff<br/>\n&gt;&gt;<br/>\n&gt;&gt; On Thu, Feb 10, 2011 at 12:09 PM, mguillemot &lt;mguillemot@...&gt; wrote:<br/>\n&gt;&gt; &gt; Hi,<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; I would be interested to know if JUnit team would have interest in the features below for integration in JUnit. If yes, I would look at providing patches and if not, I&#39;ll find an other way to waste my time ;-)<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; - ForkingVMTestRunner<br/>\n&gt;&gt; &gt; a runner executing the unit tests in a forked virtual machine allowing to test effect of command line JVM switches for instance<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; - ParrallelRunner<br/>\n&gt;&gt; &gt; JUnit already contains nearly the whole code for that but not available as runner running tests in parallel<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; - ParameterizedRunner<br/>\n&gt;&gt; &gt; a runner far more flexible than JUnit&#39;s Parameterized runner allowing to configure usage per method (a bit like TestNG) and for different types<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; - @NotYetImplemented<br/>\n&gt;&gt; &gt; this is an annotation allowing to indicate that a unit test is expected to fail. A failure should be reported as success whereas a success should be reported as failure. This has proven to be far more interesting than @Ignore which is just a little better than removing a test: @NotYetImplemented allows to write tests for &quot;accepted&quot; bugs or future features and to get notified when they are fixed as side effect of other changes<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; - assertEquals & IDE integration<br/>\n&gt;&gt; &gt; small improvement to throw ComparisonFailure not only for String comparison what allows IDE like Eclipse to better display differences between expected and actual result.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; Cheers,<br/>\n&gt;&gt; &gt; Marc.<br/>\n&gt;&gt; &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 23261, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1297701936", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PEFBTkxrVGluNTBnZzlhcG5odllOV1lVbml6MUU9THUtN0Jtbnk0c0tvWXZOekBtYWlsLmdtYWlsLmNvbT4="
    }
}