{
    "numMessagesInTopic": 4, 
    "nextInTime": 23348, 
    "senderId": "ndj7O3tzhg64psyotHQwMOR3B52AY8bi_lNoJxg2Qh5BirjKcxVkfpBEAMZG1e0PeZ0kHpUDe9An3M3QU1570lLx", 
    "systemMessage": false, 
    "subject": "Re: Progress on JUnit issues...", 
    "from": "David Saff &lt;david@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "[re-adding list] ... Note that the release frequency and pace of enhancements are only loosely connected. ... Would this help in all of the cases above?  I can", 
    "msgId": 23347, 
    "profile": "dsaff", 
    "topicId": 23310, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 341876227, 
    "messageBody": "<div id=\"ygrps-yiv-1655471761\">[re-adding list]<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Mar 21, 2011 at 9:34 AM, Rogerio &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rliesenfeld@...\">rliesenfeld@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Great news!<br/>\n&gt;<br/>\n&gt; I would really be happy to see more frequent JUnit releases, though. I believe there are big and important enhancements to be made.<br/>\n<br/>\nNote that the release frequency and pace of enhancements are only<br/>\nloosely connected.<br/>\n<br/>\n&gt; Specifically, I would like to see JUnit provide better support for other testing tools, such as mocking frameworks, BDD tools, tools for integration/functional testing, etc. There are literally dozens of other tools which today provide some form of JUnit integration, usually in the form of base test classes or custom runners for use in @RunWith annotations. Some examples include jMock, Mockito, JMockit (my own tool), PowerMock, JBehave, Spock, Spring Test.<br/>\n&gt;<br/>\n&gt; Ideally, users should not be forced to add specific code in each test class just so another tool can integrate itself to the JUnit test execution process. For example, a user shouldn&#39;t have to add a specific rule to each test class, or to annotate potentially hundreds of test classes with @RunWith. Instead, better integration hooks should be provided in the form of test run listeners, combined with a mechanism to install such listeners transparently at startup (see issue 80).<br/>\n<br/>\nWould this help in all of the cases above?  I can see how it might<br/>\nhelp for JMockit, which uses a static API accessed through<br/>\nconstructors.  However, other frameworks, like jMock, use a local<br/>\ncontainer like a Mockery or Context to protect tests in different<br/>\nthreads from each other, and so it makes sense to use something like<br/>\nRules to provide both the test hook and access to the container, so a<br/>\ngeneric listener framework helps little there.<br/>\n<br/>\nI just wanted to be sure how broad you believe the applicability of issue 80 is.<br/>\n<br/>\n&gt; Other needs that certain tools may have include the ability to have custom parameters in test methods (JMockit already does this, by modifying the JUnit implementation at runtime - not a clean solution, of course), and to obtain access to test class instances so that field injection can occur (this could be added into Description).<br/>\n&gt;<br/>\n&gt; Just like TestNG, JUnit is *fundamental software*. Other testing tools will only be able to provide the best user experience if integration can be made seamless.<br/>\n<br/>\nI&#39;ve long been a fan of the principle (imported from Perl) that &quot;All&#39;s<br/>\nfair if you predeclare&quot;.  I think that if using an extension requires<br/>\nmore than one line per extended class, that&#39;s a place the framework<br/>\ncan improve.  However, if users will give us that one line per class,<br/>\nwhether as a Rule, @RunWith, or base class (in my current order of<br/>\npreference), it has a big pay-off for both the framework and the user.<br/>\n For example, it allows IDEs and continuous integration frameworks to<br/>\nrun individual classes or methods or subsets without having to keep an<br/>\neye on a global configuration.  It also gives people who land in the<br/>\nsource code an easily-followable hint about what&#39;s going on.<br/>\n<br/>\nI&#39;d be happy to see an example where these goals (subset running and<br/>\nlocal code understanding) can be met while not requiring even one line<br/>\nof per-class predeclaration.<br/>\n<br/>\n   David<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, David Saff &lt;david@...&gt; wrote:<br/>\n&gt;&gt;<br/>\n&gt;&gt; All,<br/>\n&gt;&gt;<br/>\n&gt;&gt; Over the last week or so, I&#39;ve triaged almost 200 JUnit issues that<br/>\n&gt;&gt; have accumulated over the last year, closing about 80 truly invalid<br/>\n&gt;&gt; issues that were fixed, duplicates, or no longer made sense. I tagged<br/>\n&gt;&gt; the rest with:<br/>\n&gt;&gt; - regression bugs (9): there was an implementation of the feature that<br/>\n&gt;&gt; worked prior to the 4.9 beta (although potentially earlier than<br/>\n&gt;&gt; 4.8.x))<br/>\n&gt;&gt; - nonregression bugs (15): it is likely the feature has always failed<br/>\n&gt;&gt; in the documented way.<br/>\n&gt;&gt; - features (~95): additions to the (implicit) spec, with<br/>\n&gt;&gt; implementations to provide the additions.<br/>\n&gt;&gt;<br/>\n&gt;&gt; Thanks to everyone who has been submitting problems, proposals, and<br/>\n&gt;&gt; patches.  I&#39;m sorry that some of you have been waiting so long for a<br/>\n&gt;&gt; response.<br/>\n&gt;&gt;<br/>\n&gt;&gt; The next part of the development plan, in order:<br/>\n&gt;&gt;<br/>\n&gt;&gt; - Fix the regression bugs<br/>\n&gt;&gt; - Release a 4.9 beta 3<br/>\n&gt;&gt; - Hopefully 4.9b3 can become the final release.  (I am not planning<br/>\n&gt;&gt; any nonregression bug fixes or new features to get into the 4.9<br/>\n&gt;&gt; release.  We need to steer this ship back toward frequent releases.)<br/>\n&gt;&gt; - Create a github project for junit.contrib.<br/>\n&gt;&gt; - Go through the backlog of pull requests, to see which can be<br/>\n&gt;&gt; accepted as is, and which either need changes, or should be redirected<br/>\n&gt;&gt; into junit.contrib.<br/>\n&gt;&gt; - Work through non-regression bugs for further releases in the 4.9.x series<br/>\n&gt;&gt; - Choose a number of highly-rated feature requests to be the scope for<br/>\n&gt;&gt; 4.10, and begin (patch acceptance / implementation)<br/>\n&gt;&gt;<br/>\n&gt;&gt; I&#39;m excited to see this project keep moving forward,<br/>\n&gt;&gt;<br/>\n&gt;&gt;    David Saff<br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 23346, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1300804307", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 23313, 
    "headers": {
        "inReplyToHeader": "PGltN2s1citlcWZlQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PEFBTkxrVGluVFNvdFl6MkZQeUYxeHc4Mm5KWWl6ZnBKQm5QQWRST1dlRUw4TkBtYWlsLmdtYWlsLmNvbT4=", 
        "referencesHeader": "PEFBTkxrVGltazZDempDVHJRdW9LLUJhK1Q2T0JmUlVYaXFzUnBHdjFwYmZIZUBtYWlsLmdtYWlsLmNvbT4JPGltN2s1citlcWZlQGVHcm91cHMuY29tPg=="
    }
}