{
    "numMessagesInTopic": 1, 
    "nextInTime": 23346, 
    "senderId": "YxM3PaIx3d4VMfLG19IyHuG5NWB_FM4B1nGwZr5qMvmlME81SYm8gPV_QGcHVnDT9mQNTTyqdK_DYsxg5sMaPKMrcuQkXjUi2MQ4xmw", 
    "systemMessage": true, 
    "subject": "JUnitRunner that can execute methods in unloadable child classloaders?", 
    "from": "&quot;KARR, DAVID (ATTSI)&quot; &lt;dk068x@...&gt;", 
    "authorName": "KARR, DAVID (ATTSI)", 
    "msgSnippet": "I have a JUnit class that I would NOT call a unit test. Each method connects to a database and allocates a lot of memory. If I run the entire test class in", 
    "msgId": 23345, 
    "profile": "davidmichaelkarr19", 
    "topicId": 23345, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 405487700, 
    "messageBody": "<div id=\"ygrps-yiv-263797441\">I have a JUnit class that I would NOT call a unit test. Each method<br/>\nconnects to a database and allocates a lot of memory. If I run the<br/>\nentire test class in Eclipse, by the second test method it gets an<br/>\nOutOfMemory error. If I run each test method individually, however, I<br/>\ncan successfully run all of the test methods.<br/>\n<br/>\nI&#39;ve set Eclipse to run with just about the max -Xmx setting it can take<br/>\nwithout failing on startup (although that&#39;s probably irrelevant to<br/>\nthis). I&#39;ve set the -Xmx value in the run configurations for the class<br/>\nand individual methods as high as they will go without killing Eclipse<br/>\n(too high and I get an infinite number of &quot;SWT handle&quot; errors).<br/>\n<br/>\nI&#39;ve scanned through all the relevant run configuration, project, and<br/>\npreference settings, and I don&#39;t see anything that will help me be able<br/>\nto run the entire test class, as opposed to running each test method<br/>\nmanually.<br/>\n<br/>\nIt occurred to me that perhaps this is something a custom JUnitRunner<br/>\nclass might help with.  What if it could somehow set up a classloader<br/>\nhierarchy, where each test method is executed in a child classloader,<br/>\nwhich is unloaded at the end of the method?  I briefly looked at one<br/>\nJUnitRunner implementation, and it didn&#39;t look like this was possible,<br/>\nbut I&#39;ll ask, just in case.</div>", 
    "prevInTime": 23344, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1300580114", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PEUwNTI5QThGRkMyQzkxNDNBNUYxQkI5QTg5MTAxRDA2MENEM0RFODdAQkQwMU1TWE1CMDE4LlVTLkNpbmd1bGFyLk5ldD4="
    }
}