{
    "numMessagesInTopic": 13, 
    "nextInTime": 23376, 
    "senderId": "CnevzE1HjV5Agv5n3R4SY_-9Rfw8PEeOUtXV7zG3vrGwcPuu6eSEcPQrh9E9Sl8RwrvIoyXR3JjaAGAo4VuowWmISxwQseCtHc5xlgwyHedWWQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Is Reflection The best way of accessing private member variables and methods?", 
    "from": "Joakim Ohlrogge &lt;joakim.ohlrogge@...&gt;", 
    "authorName": "Joakim Ohlrogge", 
    "msgSnippet": "The argument: I don t like the idea of changing production code just for testing would not rub me the wrong way if the changes generally introduced for", 
    "msgId": 23375, 
    "profile": "j0hlrogge", 
    "topicId": 23362, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 261856052, 
    "messageBody": "<div id=\"ygrps-yiv-1089862502\">The argument: &quot;I don&#39;t like the idea of changing production code just for<br/>\ntesting&quot; would not rub me the wrong way if the changes generally introduced<br/>\nfor testing would not have other benefits as well (hence, the changes are<br/>\nnot just for testing at all). It would also not rub me the wrong way if it<br/>\nwas not he case that code that is written in a TDD manner turns out to be<br/>\ntestable pretty much by definition.<br/>\n<br/>\nPerhaps when I feel that I do something &quot;just for testing&quot; it is a good idea<br/>\nfor me to reflect upon if there is some way that I can achieve the<br/>\ntestability with other benefits as well. Perhaps now is not a good time to<br/>\nreflect so I write a note to myself to get back to the problem and reflect<br/>\nlater.<br/>\n<br/>\nThe whole testing private methods discussion would never rub me the wrong<br/>\nway either if I didn&#39;t feel that we chose to resort to technical voodoo in<br/>\norder to avoid changing how we generally approach problems and IMO are more<br/>\nor less guaranteed to miss out on an oportunity to learn.<br/>\n<br/>\nThe &quot;its not agile&quot; argument always rubs me the wrong way because it&#39;s<br/>\npointless. Frankly I don&#39;t care about being agile unless it works better<br/>\nthan something else I would be doing.<br/>\n<br/>\nI do the things I do because I know no better way of doing them right now.<br/>\nIf I could do less testing I would, since having lots of tests is also quite<br/>\npointless in itself. It is the effects of having them that I am after. Or<br/>\nseemingly it is the effect of writing them that I am after. I write lots of<br/>\ntests because I know no better way of ensuring that my code has quality and<br/>\nof driving me to reflect daily about design that helps me improve as a<br/>\nprogrammer.<br/>\n<br/>\nIf the point was lots of coverage and exercise every single method as a unit<br/>\nI would probably make all methods public... but it&#39;s not...<br/>\n<br/>\nBy the way, I have come to find that the private keyword is pretty overrated<br/>\n:)<br/>\n<br/>\nSorry for the rant... I just need to do that at least once every year :)<br/>\nAnyone is free to disagree and it may very well be because they are smarter<br/>\nor better programmers than I am. If there is anything worth reflecting on in<br/>\nwhat I wrote then it would be &quot;don&#39;t follow the rules, go after the effects&quot;<br/>\n/J<br/>\n-----------------------------------------------------<br/>\nJoakim Ohlrogge<br/>\nTwitter: @johlrogge<br/>\nBlog: johlrogge.wordpress.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 23374, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1301907077", 
    "canDelete": false, 
    "nextInTopic": 23377, 
    "prevInTopic": 23373, 
    "headers": {
        "inReplyToHeader": "PEJBTkxrVGltZ1VvRXVweC1iemFkMWhWNFk4MmNTZkF2dHpBQG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PEJBTkxrVGlrUmJ3MTRvUWlGQWM0a3dHN1NHdmJQVnBLNE9RQG1haWwuZ21haWwuY29tPg==", 
        "referencesHeader": "PGluMjdkZSs5aGViQGVHcm91cHMuY29tPiA8aW43ZHNwKzdpcjFAZUdyb3Vwcy5jb20+IDxBQU5Ma1RpbUNHVXJTbk5kbk1wSHJ2Vmp0YWduWFlPT3o2Vz1ZVHVmTjVfdlFAbWFpbC5nbWFpbC5jb20+IDxCQU5Ma1RpbWdVb0V1cHgtYnphZDFoVjRZODJjU2ZBdnR6QUBtYWlsLmdtYWlsLmNvbT4="
    }
}