{
    "numMessagesInTopic": 1, 
    "nextInTime": 2340, 
    "senderId": "6mFK3Gli3riCfZYUotj0mxhstYlByA1U8nDzaNL5z7kDA9BC1ywIsEhV0qvnU-_cra11SYqfvjATVnjLLmOpUMGWrDxgBfga3L5mGA60Hs86PQ", 
    "systemMessage": false, 
    "subject": "Announce: COMUnit 1.1 - a unit testing framework for testing COM Components", 
    "from": "&quot;Owen Rogers&quot; &lt;owen.rogers@...&gt;", 
    "authorName": "Owen Rogers", 
    "msgSnippet": "ANNOUNCE: COMUnit 1.1 is now available for download at http://comunit.sourceforge.net COMUnit is a Visual Basic port of the JUnit unit testing framework that ", 
    "msgId": 2339, 
    "topicId": 2339, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1762027048\">ANNOUNCE: COMUnit 1.1 is now available for download at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://comunit.sourceforge.net\">http://comunit.sourceforge.net</a><br/>\n<br/>\nCOMUnit is a Visual Basic port of the JUnit unit testing framework that<br/>\nis designed to facilitate developing unit tests for Microsoft COM<br/>\ncomponents.  COMUnit 1.1 is a production/stable version that has been<br/>\nand is actively being used for unit testing enterprise C++ and VB COM<br/>\ncomponents.  COMUnit has already been used in a number of Extreme<br/>\nProgramming projects and is well-suited to Test first design.<br/>\n<br/>\nNew in Version 1.1:<br/>\n- includes and installs Visual Studio templates making it quick and<br/>\nsimple to create new COMUnit test projects, UnitRunner forms or<br/>\nTestContainer classes.<br/>\n- includes the COMUnit Trace ActiveX control allowing easy tracing<br/>\nwithin COMUnit tests.  This is especially helpful for tracing the<br/>\nprogress of long acceptance tests that may have many asserts.<br/>\n- includes an installation program making it simple to register COMUnit<br/>\ncomponents and install the Visual Studio templates.<br/>\n<br/>\nFeatures:<br/>\n- test the public methods of any COM component interface that implements<br/>\nIUnknown<br/>\n- develop unit tests in any language that supports COM interfaces <br/>\n- all unit test code can be maintained in a single Visual Studio<br/>\nproject. No need to build an extra DLL to hold test code. <br/>\n- no need to build explicit TestSuites. Tests can be selected from the<br/>\nTestRunner user interface. <br/>\n- the framework is simple to learn consisting of only 3 interfaces and 5<br/>\nclasses. <br/>\n- all code is available as open source under the GNU Lesser General<br/>\nPublic License (LGPL) <br/>\n- test runners are available as ActiveX controls that can be easily<br/>\nextended and can be modularly added to test forms <br/>\n- well suited to XP Test first Design. <br/>\n<br/>\nany questions, comments or suggestions, feel free to send me an email or<br/>\npost a message on the COMUnit user&#39;s mailing list<br/>\n(mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:comunit-users@...\">comunit-users@...</a>)<br/>\ncheers,<br/>\nowen.</div>", 
    "prevInTime": 2338, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "997690638", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDQ0MDU5RDI5NzdFRjRDNERCODEwRTM3ODkwRTMzNDZFMDhERUUwQHNlbHVuaW5mbWFpbDAxLndyay5mcmFtZmFibGFicy5uZXQ+"
    }
}