{
    "numMessagesInTopic": 2, 
    "nextInTime": 23404, 
    "senderId": "wO9cpdh00bc_x8Ka07l5QiH14jZe2fo_ltrmo7fM6sXx02eswrVjPNYd8FBJLkt3xMU0EOZJ0-UXjycBzle0lg", 
    "systemMessage": true, 
    "subject": "How to log junit test run results to a database. Easy way to create a hook?", 
    "from": "&quot;jokap&quot; &lt;jokap@...&gt;", 
    "authorName": "jokap", 
    "msgSnippet": "Hi! I posted this question on stackoverflow. Below you can see the original link. We use junit for integration tests. The tests are being run in Eclipse and", 
    "msgId": 23403, 
    "profile": "jokap", 
    "topicId": 23403, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 27666326, 
    "messageBody": "<div id=\"ygrps-yiv-1782337849\">Hi! <br/>\n<br/>\nI posted this question on stackoverflow. Below you can see the original link.<br/>\n<br/>\nWe use junit for integration tests. The tests are being run in Eclipse and Jenkins.<br/>\n<br/>\nNow i would like to log all junit test run results to a database for easy reporting (i want to log test class / method name, environment, duration and success). I had thought about parsing the junit result xmls but to log it directly to a database sounds good to me, too. It sounds intrusive but also pretty elegant.<br/>\n<br/>\nNormally we just annotate a test method with the @Test annotation and voila, we have our junit test method.<br/>\n<br/>\nThat means we have no additional framework around junit and i want to keep it that way! <br/>\nI fear that means that if i want to implement that kind of logging i will probably have to hack into junit.<br/>\n<br/>\nHas anybody done so and can give advice if that works nicely? Maybe you have an idea on how/where to place the hook in junit. Or are there easier approaches to my problem?<br/>\n<br/>\nThanks!<br/>\n<br/>\nedit: To clarify, we already have junit test results of single test runs. You can get them out of eclipse (export junit result) or out of jenkins. Running our junit test suites in Jenkins also allows us to track test failure rates of test suites over time. It shows you a nice chart that tracks how many tests of passed over time. In each jenkins build you can see which tests passed, also in comparison to the last run. We need a bit more. We want to be able to analyse the performance (duration) of certain testcases over time, over multiple runs, maybe also how they behave differently in different environments. Extract trends. Do some data mining.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://stackoverflow.com/questions/5722431/how-to-log-junit-test-run-results-to-a-database\">http://stackoverflow.com/questions/5722431/how-to-log-junit-test-run-results-to-a-database</a><br/>\n<br/>\ncheers!</div>", 
    "prevInTime": 23402, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1304004092", 
    "canDelete": false, 
    "nextInTopic": 23404, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGlwYzBscyt0dXFyQGVHcm91cHMuY29tPg=="
    }
}