{
    "numMessagesInTopic": 24, 
    "nextInTime": 23479, 
    "senderId": "CdKdswM-HCY_jM8DFj19PG-5sritbntl1Bic1xjX0G5xpEuWEZVlJJAsbLlr6EQ4Zx-VU1jCxYw5uLMgo7U4_DM5T44ZXuw2X94TsHcm", 
    "systemMessage": false, 
    "subject": "Re: [junit] Not knowing the tests in advance when providing a test runner", 
    "from": "Esko Luontola &lt;esko.luontola@...&gt;", 
    "authorName": "Esko Luontola", 
    "msgSnippet": "... Yes, I m focusing on running the tests. From a testing framework s point of view, Jumi provides a similar interface as JUnit s @RunWith annotation and the", 
    "msgId": 23478, 
    "profile": "egeluontola", 
    "topicId": 23466, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 395435659, 
    "messageBody": "<div id=\"ygrps-yiv-858079376\">Joakim Ohlrogge wrote on 23.6.2011 11:48:<br/>\n<blockquote><span title=\"ireply\"> &gt; I think this is where my idea was different. I planned to delegate the<br/>\n&gt; running completely to other frameworks and just be flexible about what they<br/>\n&gt; can report back. So it becomes more of a presentation-issue (it seems to me<br/>\n&gt; that you are also focusing on running the tests, especially being clever<br/>\n&gt; about ordering the run sequence for high probability of catching failing<br/>\n&gt; tests fast).<br/>\n<br/>\n </span></blockquote>Yes, I&#39;m focusing on running the tests. From a testing framework&#39;s point <br/>\nof view, Jumi provides a similar interface as JUnit&#39;s @RunWith <br/>\nannotation and the related APIs.<br/>\n<br/>\nJumi will also include things such as test discovery and starting up the <br/>\nJVM instance, which previously have been taken care of build tools and <br/>\nIDEs. There will also be a graphical UI, so that it would be usable even <br/>\nwithout IDE integration. My goal is to solve some cross-cutting concerns <br/>\nwhich affect the full tool chain of running tests. It will also try to <br/>\nminimize the small differences between running tests in a build tool vs <br/>\nIDE, and protect from the effects of bugs in IDEs&#39; support for running <br/>\ntests (I&#39;ve encountered many such issues).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It also looks very promising with focus on performance. Have you looked into<br/>\n&gt; incremental running alá SBT or is that left to tools like SBT?<br/>\n<br/>\n </span></blockquote>I know about SBT&#39;s incremental compiler. Does it also do something smart <br/>\nrelated running tests?<br/>\n<br/>\nSBT and FSC were my inspirations for class loader caching: Jumi will use <br/>\na separate class loader for library JARs and cache it, so that when <br/>\nrunning tests there would not be the overhead of loading a large <br/>\nlibrary&#39;s classes (for example on my C2Q6600 it takes over 200ms to load <br/>\nGuice the first time). With Java 6 and before, class loading is single <br/>\nthreaded (Java 7 will have parallel classloading), so that has been a <br/>\nbottleneck for running tests in parallel.<br/>\n<br/>\nJUnit Max&#39;s way of reordering tests, so that those which fail the most <br/>\nlikely are run first, is also one thing that I&#39;ll include. I have a <br/>\nhabit of waiting for the tests to finish executing before typing more, <br/>\nso the UI will also give some feedback about when the <br/>\nmost-likely-to-fail tests have been run, so that I could resume typing <br/>\nfaster. And running tests in parallel is of course a must - finally some <br/>\nuse for my 4 CPU cores. :)<br/>\n<br/>\nThe above optimizations are especially aimed for speeding up test suites <br/>\nwhich run in a matter of seconds. If it takes 3 seconds to run all <br/>\ntests, a speedup of 0.5 seconds is big.<br/>\n<br/>\nI&#39;ll also provide something for big companies which are full of mediocre <br/>\ndevelopers writing slow tests. Running tests in a cluster is outside the <br/>\nscope of Jumi&#39;s core functionality, but I&#39;ll create a commercial plugin <br/>\nfor that. (Who wouldn&#39;t want to get a living from writing open source? <br/>\n;) I&#39;m not sure how much running tests in a cluster would speed up <br/>\nalready fast test suites, because of network latency, but I&#39;ll try and <br/>\nsee what I can do about it.<br/>\n<br/>\n-- <br/>\nEsko Luontola<br/>\nwww.orfjackal.net</div>", 
    "prevInTime": 23477, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1308828977", 
    "canDelete": false, 
    "nextInTopic": 23479, 
    "prevInTopic": 23477, 
    "headers": {
        "inReplyToHeader": "PEJBTkxrVGlrVHRubW1ZLTJhMjNHRTJDMy1NQnR2YmpaU3N3QG1haWwuZ21haWwuY29tPg==", 
        "messageIdInHeader": "PDRFMDMyNTMxLjgwMzAyQGdtYWlsLmNvbT4=", 
        "referencesHeader": "PGl0Zmk1YSt1NTJjQGVHcm91cHMuY29tPiA8NEUwMjE0RDQuMjA0MDUwNEBnbWFpbC5jb20+IDxCQU5Ma1RpbWFibU9LUnZDNmpQTjdEYlBTMjdmS3plVkpUZ0BtYWlsLmdtYWlsLmNvbT4gPDRFMDJGNDRBLjYwMjA1MDhAZ21haWwuY29tPiA8QkFOTGtUaWtUdG5tbVktMmEyM0dFMkMzLU1CdHZialpTc3dAbWFpbC5nbWFpbC5jb20+"
    }
}