{
    "numMessagesInTopic": 5, 
    "nextInTime": 23554, 
    "senderId": "i9mbiYP3AfGONs4bJMf7pV0Mrz6QEgcIn-2LifWw9mwWoxDrq4Zc3KLhKEaZgRreaW1gXg_nZOMyWE9_89TMBZAoEKqzqT5wTvfiDXty", 
    "systemMessage": false, 
    "subject": "Mixing parameterized and non-parameterized tests in the same test class", 
    "from": "Esko Luontola &lt;esko.luontola@...&gt;", 
    "authorName": "Esko Luontola", 
    "msgSnippet": "I have a situation where I m using the Parameterized runner in a test class, where some of the tests are parameterized but others are not. Here is the test", 
    "msgId": 23553, 
    "profile": "egeluontola", 
    "topicId": 23553, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 395435659, 
    "messageBody": "<div id=\"ygrps-yiv-1045044743\">I have a situation where I&#39;m using the Parameterized runner in a test <br/>\nclass, where some of the tests are parameterized but others are not.<br/>\n<br/>\nHere is the test class in question. The test class is checking the <br/>\ndependencies and contents of the Maven artifacts produced by the build. <br/>\nI have some special build requirements which require me to use Maven <br/>\nShade Plugin to bundle external (and in one case also internal) <br/>\ndependencies into the same JAR, and these build tests have been <br/>\nextremely helpful (more details at the first episodes of <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.orfjackal.net/lets-code#jumi)\">http://www.orfjackal.net/lets-code#jumi)</a>.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"https://github.com/orfjackal/jumi/blob/730378ddf5260cdcb44285c5c75e7a7ca5447407/end-to-end-tests/src/test/java/fi/jumi/test/BuildTest.java\">https://github.com/orfjackal/jumi/blob/730378ddf5260cdcb44285c5c75e7a7ca5447407/end-to-end-tests/src/test/java/fi/jumi/test/BuildTest.java</a><br/>\n<br/>\nThe first two tests are parameterized. They check each artifact for its <br/>\nexpected dependencies and contents.<br/>\n<br/>\nThe third test is checking one of the artifacts which was checked <br/>\nalready earlier, but this time a copy the JAR which which is embedded <br/>\ninside another JAR (it&#39;s used in bootstrapping the application). Since <br/>\nthis test is slow (~150ms), I want to avoid running it many times. <br/>\nLogically it&#39;s related to the things checked by the parameterized tests, <br/>\nso I want to keep it close to them, but it itself is not parameterized. <br/>\nRight now I&#39;ve solved the issue with a hack, so all but one <br/>\nparameterized execution skip the test.<br/>\n<br/>\nThe fourth and fifth test are tests against all of the parameters. It&#39;s <br/>\ntesting the test data, to make sure that some project-wide principles <br/>\nare followed (i.e. no visible dependencies to external libraries). These <br/>\ntests also are not parameterized. Fortunately they are quick, so I <br/>\nhaven&#39;t tried to avoid running them many times.<br/>\n<br/>\n<br/>\nWhat are your suggestions for mixing parameterized and non-parameterized <br/>\ntests? Some creative use of nested classes?<br/>\n<br/>\nI&#39;ve been thinking about extending Parameterized so that I can annotate <br/>\nwhich methods are parameterized and which are not, by adding either <br/>\n@ParameterizedTest or @NonParameterized annotations to the test methods. <br/>\nThe non-parameterized methods would be run only once, probably using the <br/>\nfirst element in the test data (passing null to the constructor is <br/>\nanother option; now it would fail in the constructor, but I should <br/>\nanyways relocate the couple of method calls which are now in the <br/>\nconstructor).<br/>\n<br/>\n-- <br/>\nEsko Luontola<br/>\nwww.orfjackal.net</div>", 
    "prevInTime": 23552, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1313102547", 
    "canDelete": false, 
    "nextInTopic": 23556, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDRFNDQ1QUQzLjYwODAzMDFAZ21haWwuY29tPg=="
    }
}