{
    "numMessagesInTopic": 3, 
    "nextInTime": 23556, 
    "senderId": "UeQ_AV5DSTGTx6MZjLlwqjv9SWQzS_7hcp1TdZlHyi2wE_kRNiZSKChS2B8QscigwXoBOmhTdB9tNJkYJkS4p5fvcVg96HLckxAdtw", 
    "systemMessage": false, 
    "subject": "Re: [junit] Introductory JUnit questions", 
    "from": "Gerard Meszaros &lt;gmkayaker@...&gt;", 
    "authorName": "Gerard Meszaros", 
    "msgSnippet": "... What s a Main Class? I ve never, ever used one ;-) ... No, you would bypass the main class, instantiate the specific class (Angle) directly and invoke", 
    "msgId": 23555, 
    "profile": "gmkayaker", 
    "topicId": 23552, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 326652084, 
    "messageBody": "<div id=\"ygrps-yiv-1079203068\">On 8/11/2011 9:17 AM, Michael wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Hello group,<br/>\n&gt;<br/>\n&gt; As a novice JUnit user (I tried it briefly 5 years ago but never got<br/>\n&gt; very far with it), I want to use it for a work project. We code in the<br/>\n&gt; latest version of Java using NetBeans 6.9.1. I was able to generate the<br/>\n&gt; boilerplate JUnit class for a class I&#39;m developing (source class: Angle;<br/>\n&gt; test class: AngleTest) and had some questions just from playing around<br/>\n&gt; with it for a few minutes yesterday:<br/>\n&gt;<br/>\n&gt; 1. It seems that since NB has built-in JUnit support (i.e. Run File), I<br/>\n&gt; don&#39;t need to have an associated Main class under the Test Packages.<br/>\n&gt; True or false?<br/>\n&gt;<br/>\n </span></blockquote>What&#39;s a Main Class? I&#39;ve never, ever used one ;-)<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; 2. If I do decide to use a Main class as my test harness for my JUnit<br/>\n&gt; classes, I assume I have to declare an instance of the test class. True<br/>\n&gt; or false?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>No, you would bypass the main class, instantiate the specific class (Angle) <br/>\ndirectly and invoke methods on the instance.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; 3. Furthermore, if I were to instantiate the test class and run it under<br/>\n&gt; my Main, wouldn&#39;t I basically have to make a call to each test* method<br/>\n&gt; explicitly? It seems like &quot;Run File&quot; does that for me.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I don&#39;t use NB so I don&#39;t know how NB does it. Normally, JUnit calls the test <br/>\nmethod and the test method calls the method under test. No main involved anywhere.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; 4. I was able to just do &quot;Run File&quot; on AngleTest.java and it ran for me<br/>\n&gt; in a split screen window at the bottom of NB. Kind of cool - gives me<br/>\n&gt; pass/fail and TTE (time to execute) stats. I noticed, however, that<br/>\n&gt; everything failed because JUnit by default puts in some boilerplate<br/>\n&gt; lines of code:<br/>\n&gt;<br/>\n&gt; - a line to compare the actual result with the expected result of a<br/>\n&gt; method invocation (this only happens sometimes, not on all methods such<br/>\n&gt; as a void print())<br/>\n&gt; - a call to assertEquals() on both operands to make sure they match<br/>\n&gt; - a comment that tells me to review the generated code and remove the<br/>\n&gt; default call to fail()<br/>\n&gt; - the call to fail() all of the time<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Just because some tool generated some code doesn&#39;t mean that the code is the <br/>\nright code; read an introductory book on writing unit tests, preferably using <br/>\nTest-Driven Development.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; The main questions I have about this arrangement are:<br/>\n&gt;<br/>\n&gt; 5. Am I supposed to go ahead and customize the values and/or code in the<br/>\n&gt; auto-generated test methods to test what I want? What&#39;s the better<br/>\n&gt; approach: Add more code for more test cases inside the method, or keep<br/>\n&gt; changing the existing code and re-running it until I&#39;m satisfied with<br/>\n&gt; the test results?<br/>\n&gt;<br/>\n&gt; Here&#39;s an example method from AngleTest (testing the rad2deg() method):<br/>\n&gt;<br/>\n&gt; /**<br/>\n&gt; * Test of rad2deg method, of class Angle.<br/>\n&gt; */<br/>\n&gt; @Test<br/>\n&gt; public void testRad2deg() {<br/>\n&gt; System.out.println(&quot;rad2deg&quot;);<br/>\n&gt; double rad = (Math.PI/2); // NOTE: Changed from default 0.0<br/>\n&gt; double expResult = 90.0; // NOTE: Changed from default 0.0<br/>\n&gt; double result = Angle.rad2deg(rad);<br/>\n&gt; assertEquals(expResult, result, 0.0);<br/>\n&gt; }<br/>\n&gt;<br/>\n&gt; 6. If I deliberately set the result and expResult to be two different<br/>\n&gt; things and also remove the call to fail(), will assertEquals() take care<br/>\n&gt; of raising a flag saying, &quot;Hey dummy, your results didn&#39;t match!&quot;?<br/>\n&gt;<br/>\n </span></blockquote>Yes.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; 7. What happens if I set a value for the angle in degrees and make a<br/>\n&gt; call to something like setDegrees(value)? How can that even fail anyway<br/>\n&gt; (i.e. what&#39;s the point of having the test method)?<br/>\n&gt;<br/>\n </span></blockquote>You tell me! Your tests should specify what the software is supposed to do, not <br/>\nthe other way around.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 8. If I just remove the auto-generated calls to fail() as the comment<br/>\n&gt; suggests, then how am I going to know if my test is failing or not?<br/>\n&gt; Essentially what I&#39;m seeing is that I can rig the test however I want,<br/>\n&gt; which is not entirely what I&#39;d like to happen.<br/>\n&gt;<br/>\n </span></blockquote>See previous question.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; My class under test (CUT) Angle is just that: A class that stores<br/>\n&gt; different representations of angles (degrees and radians) for my<br/>\n&gt; project. (Please don&#39;t suggest that I use any such existing class<br/>\n&gt; already out there...I write all my code from scratch for several<br/>\n&gt; reasons.)<br/>\n&gt;<br/>\n&gt; Thanks for your patience...I can&#39;t find any other current appropriate<br/>\n&gt; forum to ask these questions. I want to take full advantage of JUnit&#39;s<br/>\n&gt; capabilities to help me write unit test cases.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>You would not need to ask all these questions if you had read the introductory <br/>\ntutorial on JUnit at least.. Just playing with the NB menu options doesn&#39;t teach <br/>\nyou everything you need to know. Learning how to write good unit tests is <br/>\nsomething that will take more than a few minutes or hours.<br/>\n<br/>\nBest wishes,<br/>\n<br/>\nGerard<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Mike<br/>\n&gt;<br/>\n&gt; P.S. I realize it would probably be helpful to attach both Angle.java<br/>\n&gt; and AngleTest.java. If anyone has a suggestion for what to do about<br/>\n&gt; that, I&#39;ll gladly post them. (Neither class is proprietary.)<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>-- <br/>\nGerard Meszaros<br/>\n1-403-827-2967</div>", 
    "prevInTime": 23554, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1313103645", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 23554, 
    "headers": {
        "inReplyToHeader": "PGoyMHJxbStlaHQyQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDRFNDQ1RjFELjcwOTAwMDRAZ21haWwuY29tPg==", 
        "referencesHeader": "PGoyMHJxbStlaHQyQGVHcm91cHMuY29tPg=="
    }
}