{
    "numMessagesInTopic": 3, 
    "nextInTime": 23553, 
    "senderId": "ycRTxhvuQiPCFhQWKD9wdObpXA9lcOfTX5lOdgh0PL1RCH2sykEvvKYMWwfuHbBHmvPkq7Wh_kjohxEm0VOsbvHZ0YGW", 
    "systemMessage": true, 
    "subject": "Introductory JUnit questions", 
    "from": "&quot;Michael&quot; &lt;mfeher00@...&gt;", 
    "authorName": "Michael", 
    "msgSnippet": "Hello group, As a novice JUnit user (I tried it briefly 5 years ago but never got very far with it), I want to use it for a work project.  We code in the ", 
    "msgId": 23552, 
    "profile": "mfeher00", 
    "topicId": 23552, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 113290378, 
    "messageBody": "<div id=\"ygrps-yiv-1671660449\">Hello group,<br/>\n<br/>\nAs a novice JUnit user (I tried it briefly 5 years ago but never got<br/>\nvery far with it), I want to use it for a work project.  We code in the<br/>\nlatest version of Java using NetBeans 6.9.1.  I was able to generate the<br/>\nboilerplate JUnit class for a class I&#39;m developing (source class: Angle;<br/>\ntest class: AngleTest) and had some questions just from playing around<br/>\nwith it for a few minutes yesterday:<br/>\n<br/>\n1. It seems that since NB has built-in JUnit support (i.e. Run File), I<br/>\ndon&#39;t need to have an associated Main class under the Test Packages. <br/>\nTrue or false?<br/>\n<br/>\n2. If I do decide to use a Main class as my test harness for my JUnit<br/>\nclasses, I assume I have to declare an instance of the test class.  True<br/>\nor false?<br/>\n<br/>\n3. Furthermore, if I were to instantiate the test class and run it under<br/>\nmy Main, wouldn&#39;t I basically have to make a call to each test* method<br/>\nexplicitly?  It seems like &quot;Run File&quot; does that for me.<br/>\n<br/>\n4. I was able to just do &quot;Run File&quot; on AngleTest.java and it ran for me<br/>\nin a split screen window at the bottom of NB.  Kind of cool - gives me<br/>\npass/fail and TTE (time to execute) stats.  I noticed, however, that<br/>\neverything failed because JUnit by default puts in some boilerplate<br/>\nlines of code:<br/>\n<br/>\n- a line to compare the actual result with the expected result of a<br/>\nmethod invocation (this only happens sometimes, not on all methods such<br/>\nas a void print())<br/>\n- a call to assertEquals() on both operands to make sure they match<br/>\n- a comment that tells me to review the generated code and remove the<br/>\ndefault call to fail()<br/>\n- the call to fail() all of the time<br/>\n<br/>\nThe main questions I have about this arrangement are:<br/>\n<br/>\n5. Am I supposed to go ahead and customize the values and/or code in the<br/>\nauto-generated test methods to test what I want?  What&#39;s the better<br/>\napproach: Add more code for more test cases inside the method, or keep<br/>\nchanging the existing code and re-running it until I&#39;m satisfied with<br/>\nthe test results?<br/>\n<br/>\nHere&#39;s an example method from AngleTest (testing the rad2deg() method):<br/>\n<br/>\n     /**<br/>\n      * Test of rad2deg method, of class Angle.<br/>\n      */<br/>\n     @Test<br/>\n     public void testRad2deg() {<br/>\n         System.out.println(&quot;rad2deg&quot;);<br/>\n         double rad = (Math.PI/2);     // NOTE: Changed from default 0.0<br/>\n         double expResult = 90.0;      // NOTE: Changed from default 0.0<br/>\n         double result = Angle.rad2deg(rad);<br/>\n         assertEquals(expResult, result, 0.0);<br/>\n     }<br/>\n<br/>\n6. If I deliberately set the result and expResult to be two different<br/>\nthings and also remove the call to fail(), will assertEquals() take care<br/>\nof raising a flag saying, &quot;Hey dummy, your results didn&#39;t match!&quot;?<br/>\n<br/>\n7. What happens if I set a value for the angle in degrees and make a<br/>\ncall to something like setDegrees(value)?  How can that even fail anyway<br/>\n(i.e. what&#39;s the point of having the test method)?<br/>\n<br/>\n8. If I just remove the auto-generated calls to fail() as the comment<br/>\nsuggests, then how am I going to know if my test is failing or not? <br/>\nEssentially what I&#39;m seeing is that I can rig the test however I want,<br/>\nwhich is not entirely what I&#39;d like to happen.<br/>\n<br/>\nMy class under test (CUT) Angle is just that: A class that stores<br/>\ndifferent representations of angles (degrees and radians) for my<br/>\nproject.  (Please don&#39;t suggest that I use any such existing class<br/>\nalready out there...I write all my code from scratch for several<br/>\nreasons.)<br/>\n<br/>\nThanks for your patience...I can&#39;t find any other current appropriate<br/>\nforum to ask these questions.  I want to take full advantage of JUnit&#39;s<br/>\ncapabilities to help me write unit test cases.<br/>\n<br/>\nMike<br/>\n<br/>\nP.S. I realize it would probably be helpful to attach both Angle.java<br/>\nand AngleTest.java.  If anyone has a suggestion for what to do about<br/>\nthat, I&#39;ll gladly post them.  (Neither class is proprietary.)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 23551, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1313075862", 
    "canDelete": false, 
    "nextInTopic": 23554, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGoyMHJxbStlaHQyQGVHcm91cHMuY29tPg=="
    }
}