{
    "numMessagesInTopic": 11, 
    "nextInTime": 23694, 
    "senderId": "TnnnZ2UDLHwaqAzRev4BEYXrybPKynb2cMPRGQwzTCnaxZMONDof5gKYcd9PTHMMecnsEtS7BrfeYb0xjfYkVvGa", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Alphabetizing test method run order?", 
    "from": "David Saff &lt;david@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "... That s a fair request.  Actually, I think the code has evolved to the point that adding a feature to ParentRunner to support this would be remarkably easy:", 
    "msgId": 23693, 
    "profile": "dsaff", 
    "topicId": 23671, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 341876227, 
    "messageBody": "<div id=\"ygrps-yiv-1396440352\">On Thu, Sep 22, 2011 at 9:08 AM, mjfarwell &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:matthew@...\">matthew@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, Kevin Cooney &lt;kcooney@...&gt; wrote:<br/>\n&gt;&gt;<br/>\n&gt;&gt; On Tue, Sep 20, 2011 at 3:07 AM, Dominik Dorn &lt;dorn@...&gt; wrote:<br/>\n&gt;&gt;<br/>\n&gt;&gt; &gt; **<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt; &gt; Hmm... I think it would be even better to _ensure_ that the test cases are<br/>\n&gt;&gt; &gt; run<br/>\n&gt;&gt; &gt; in a random order but provide a summary at the end of the testrun where the<br/>\n&gt;&gt; &gt; order gets printed.<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; -10<br/>\n&gt;&gt;<br/>\n&gt;&gt; A number of projects I worked on used to do this. While this may initially<br/>\n&gt;&gt; seem like a good idea, it was problematic for us for a number of reasons.<br/>\n&gt;&gt;<br/>\n&gt;&gt; If the tests are run in a random order, then a small change to a test or a<br/>\n&gt;&gt; class under test could cause a completely unrelated test to fail. Many<br/>\n&gt;&gt; developers will assume that it is their change that caused the problem,<br/>\n&gt;&gt; leading them in a wild goose chase trying to see which of their changes<br/>\n&gt;&gt; caused the problems and why, and when they realize it is due to the test<br/>\n&gt;&gt; ordering, they need to do a big context switch back to their original<br/>\n&gt;&gt; task. This would be made worse by the fact that simply rerunning the tests<br/>\n&gt;&gt; would cause them to pass again (or worse, cause a different test to fail).<br/>\n&gt;&gt;<br/>\n&gt;&gt; Note that I don&#39;t think developers should be writing tests where the outcome<br/>\n&gt;&gt; depends on the ordering that the test methods were run. I just don&#39;t think<br/>\n&gt;&gt; we should assume that fixing the tests with this problem is necessarily as<br/>\n&gt;&gt; important as what the developer is trying to do.<br/>\n&gt;&gt;<br/>\n&gt;&gt; Making the test order random by default also does not necessarily make it<br/>\n&gt;&gt; easier to track down problems with ordering of tests, since if you ran the<br/>\n&gt;&gt; failing test suite again, you would get a different run order. JUnit could<br/>\n&gt;&gt; print out the random seed used for that particular run, but then developers<br/>\n&gt;&gt; would have to figure out how to pass the previous random seed back to the<br/>\n&gt;&gt; test (how to do this would depend on which IDE or build system they used).<br/>\n&gt;<br/>\n&gt; +10.<br/>\n&gt;<br/>\n&gt;&gt; If developers want the ordering to be shuffled, they should use a custom<br/>\n&gt;&gt; runner that shuffles the tests. We used to do this in our JUnit3 tests with<br/>\n&gt;&gt; a custom subclass of TestSuite. It used a random seed based on the<br/>\n&gt;&gt; System.currentTimeMillis() at midnight, so if a particular ordering caused<br/>\n&gt;&gt; the tests to fail, it was reproducible for the rest of the day.<br/>\n&gt;&gt; Unfortunately, developers often assumed that the breakage was caused by one<br/>\n&gt;&gt; of the changes submitted since the most recent green run of<br/>\n&gt;&gt; the continuous build.<br/>\n&gt;<br/>\n&gt; I think this is a very good point. The ordering absolutely needs to be deterministic by default, so any problems are reproducible easily.<br/>\n&gt;<br/>\n&gt;&gt; Personally, I don&#39;t need the test ordering to be defined, but I need it to<br/>\n&gt;&gt; be deterministic. If I build the same code with the same JDK and run it in<br/>\n&gt;&gt; the same JRE on the same kernel on a different day, the tests should run in<br/>\n&gt;&gt; the same order. We often re-run tests that failed earlier in the day, using<br/>\n&gt;&gt; the same source code, to try to determine which failures were due to flaky<br/>\n&gt;&gt; tests. Having the tests run in a different order would make it much more<br/>\n&gt;&gt; difficult to do this analysis.<br/>\n&gt;<br/>\n&gt; I do use the ordering of junit tests, not because the tests are inter-dependent, but simply because I have slow tests and fast tests. I use junit for integration tests, so I run a batch from junit, and look at the results of the batch. Some tests have small datasets (10-15 seconds) and some have large datasets (10 minutes). I put the small ones first so I can either stop the test if the first fails, or do something else for ten minutes.<br/>\n&gt;<br/>\n&gt; If I have to run these tests using a different Runner, then that&#39;s fine, but I would rather not have to change anything (major).<br/>\n&gt;<br/>\n&gt;&gt; I suggest that JUnit4 order the tests by the hash code of the test method<br/>\n&gt;&gt; name. If there is a tie, JUnit could compare the test names using the<br/>\n&gt;&gt; natural ordering defined by String.compareTo(String) (possibly in reverse<br/>\n&gt;&gt; :-)<br/>\n&gt;<br/>\n&gt; I would suggest we use the principle of least surprise here. If the hashCode is used as an ordering, yes it is deterministic, but it will seem random. If you use the test name, it is less surprising. People are used to tests being run in bytecode order.<br/>\n&gt;<br/>\n&gt; If you change the order then at least change it so that if people have problems due to ordering they can easily change the order. Yes, I know that their tests are broken, but they probably do too. If the order is based upon the hashCode, I have to either run that test with a custom Runner (and make sure that it&#39;s usable in Eclipse, Jenkins, maven, etc. etc.)[*]. If the order is simply the name, then all I have to do to &#39;fix&#39; my problem is change the name.<br/>\n<br/>\n </span></blockquote>That&#39;s a fair request.  Actually, I think the code has evolved to the<br/>\npoint that adding a feature to ParentRunner to support this would be<br/>\nremarkably easy:<br/>\n<br/>\n@RunWith(Suite.class)<br/>\n@SuiteClasses({...})<br/>\npublic class MySuite {<br/>\n  @SortWith public static Sorter alpha = Sorters.ALPHABETICAL;<br/>\n  @FilterWith public static Filter category = new<br/>\nCategoryFilter(MyCategory.class);<br/>\n}<br/>\n<br/>\nAnyone want to take a crack at it?<br/>\n<br/>\n   David Saff<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; Matthew Farwell.<br/>\n&gt;<br/>\n&gt; [*] Or change the hashCode. For instance, I could have two tests:<br/>\n&gt;<br/>\n&gt; public void testStuff()<br/>\n&gt; public void testMoreStuff()<br/>\n&gt;<br/>\n&gt; These run in order as above. If the hashCode were used to order them, then we get testMoreStuff() then testStuff(). So to keep the original order we have to change testMoreStuff to testMoreStuffTextToIncreaseHashCode() :-)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 23692, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1316701532", 
    "canDelete": false, 
    "nextInTopic": 23814, 
    "prevInTopic": 23691, 
    "headers": {
        "inReplyToHeader": "PGo1ZmMwbitpNmEwQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PENBQ2o4QnVOUWktSnFGZTk9cGRTOTdzV1pvVTdLb0pvY19BYUV1Y2taNmpRN2trNVdRUUBtYWlsLmdtYWlsLmNvbT4=", 
        "referencesHeader": "PENBQTNFK2VXOGsxSEJBYWotLXQ1N1pRNEh5LUhaYkp4NDl5RTgzTUZEeXhFZ19UbUF3UUBtYWlsLmdtYWlsLmNvbT4JPGo1ZmMwbitpNmEwQGVHcm91cHMuY29tPg=="
    }
}