{
    "numMessagesInTopic": 4, 
    "nextInTime": 23707, 
    "senderId": "LvWh9SOwZ-QcD3iGWaIwITwta8_DaHQRsIvDjgAALJMRCSBLH4M_SBcpxfSlGNnEVAAQX_th0flQZvhsL-vWQXAyROHoKxEpXhvsLpU", 
    "systemMessage": false, 
    "subject": "Testing individual test cases from command line.", 
    "from": "&quot;lewismc2&quot; &lt;lewis.mcgibbney@...&gt;", 
    "authorName": "lewismc2", 
    "msgSnippet": "Hi list, I m embarking on a pretty monumental JUnit test writing journey as part of a larger vision of improving code integrity as well as expanding our", 
    "msgId": 23706, 
    "profile": "lewismc2", 
    "topicId": 23706, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 477902181, 
    "messageBody": "<div id=\"ygrps-yiv-633946532\">Hi list,<br/>\n<br/>\nI&#39;m embarking on a pretty monumental JUnit test writing journey as part of a larger vision of improving code integrity as well as expanding our testing activities. Before I begin writing the tests I have been working (frustratingly) on this particular Jira issue [1]. In summary, the issue attempts to add the functionality to a script [2] that will enable us to test individual test cases from the command line rather than have to run every JUnit test case when we wish to review changes or review performance of new test cases. I am however not getting very far with setting the correct environment variable and could do with some guidance. The patch which I&#39;m trying to apply would allow us to run <br/>\n<br/>\nbin/nutch junit org.apache.nutch.testCase<br/>\n<br/>\nThis would then run the specified test case class. I&#39;m positive that my problem is the export classpath environment variable which should point to the test case directory. I&#39;m just not able to add the class  paths, therefore I get an exception and stack trace error (NoClassDef) whenever I try to run a test case. <br/>\n<br/>\nFinally, just to clarify, I&#39;m using the TestRunner class to run the tests.<br/>\n<br/>\nAny help, guidance etc would be greatly appreciated as it will enable me to progress with writing and fixing some 20-30 test classes. If I can provide any more information please advise.<br/>\n<br/>\nThank you in advance<br/>\n<br/>\nLewis    <br/>\n<br/>\n[1] <a rel=\"nofollow\" target=\"_blank\" href=\"https://issues.apache.org/jira/browse/NUTCH-672\">https://issues.apache.org/jira/browse/NUTCH-672</a><br/>\n[2] <a rel=\"nofollow\" target=\"_blank\" href=\"https://svn.apache.org/repos/asf/nutch/trunk/src/bin/nutch\">https://svn.apache.org/repos/asf/nutch/trunk/src/bin/nutch</a></div>", 
    "prevInTime": 23705, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1317066502", 
    "canDelete": false, 
    "nextInTopic": 23707, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGo1cWt1NisyaGkwQGVHcm91cHMuY29tPg=="
    }
}