{
    "numMessagesInTopic": 4, 
    "nextInTime": 23716, 
    "senderId": "W9_099TFBmeRF5I-tlxoJVFTKh7UcqoU8xv4LvSbkxIqWqPimPBM5bH1caQqizkNY4sLujsTSxvGAkQoPWtIAiym", 
    "systemMessage": false, 
    "subject": "Re: [junit] Test names and Parmaterized", 
    "from": "David Saff &lt;david@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "bwm, Thanks for checking in.  The current implementation of Parameterized is a dead end, for several reasons.  I have plans for a completely different, much", 
    "msgId": 23715, 
    "profile": "dsaff", 
    "topicId": 23714, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 341876227, 
    "messageBody": "<div id=\"ygrps-yiv-637030384\">bwm,<br/>\n<br/>\nThanks for checking in.  The current implementation of Parameterized<br/>\nis a dead end, for several reasons.  I have plans for a completely<br/>\ndifferent, much more flexible approach to the needs that Parameterized<br/>\nsatisfies, but it will likely be months before these see the light of<br/>\nday.  In the meantime, have you seen JUnitParams?<br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://code.google.com/p/junitparams/)\">http://code.google.com/p/junitparams/)</a>  It&#39;s the best of several<br/>\nreplacement schemes that I&#39;ve seen so far.<br/>\n<br/>\n   David<br/>\n<br/>\nOn Wed, Sep 28, 2011 at 6:25 PM, bwmplusuniquifier<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:brian@...\">brian@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; This has probably come up before.  Please forgive me for I failed to find an answer.<br/>\n&gt;<br/>\n&gt; I&#39;m using @RunWith(Parameterized.class) and want to have test names other than foo[int]. foo[int] isn&#39;t very helpful e.g. in Jenkins logs.<br/>\n&gt;<br/>\n&gt; Is there a way for the test to specify the name it should be known by?<br/>\n&gt;<br/>\n&gt; For now, I&#39;ve taken the Parameterized source code and modified it so that if the test class has a getTestName() method the runner will call that to get the test name.  This is currently working and I&#39;d be happy to share.<br/>\n&gt;<br/>\n&gt; However, I did have to bodge things more than I like to get it to work.  If I do the straightforward change, then the framework asks for the test name from the runner before the test object is created.  I&#39;m currently dealing with this by creating the test object when the test runner is created, i.e. in the constructor of the test runner and keeping it around for the lifetime of the test runner.  This works - but may violate some design assumptions I don&#39;t know about and means that any exception that can be thrown creating a test object can cause an initialization exception.<br/>\n&gt;<br/>\n&gt; I think this is useful functionality - I know of others who have also wanted something like this.  There are suggestions on StackOverflow for example to use the first parameter of a parameterset as the test name.  I think letting the test specify a getTestName method and defaulting to the current mechanism if there isn&#39;t one is better as its more backward compatible and gives the test developer more control.<br/>\n&gt;<br/>\n&gt; So:<br/>\n&gt;<br/>\n&gt;  o is there an existing or planned way to support naming individual parameterized tests?<br/>\n&gt;<br/>\n&gt;  o are you interested in the approach/code I&#39;m trying?<br/>\n&gt;<br/>\n&gt;  o if so, what would be the best way to integrate into the existing framework so that the test object is created before the test name is requested?<br/>\n&gt;<br/>\n&gt; bwm<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 23714, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1317316062", 
    "canDelete": false, 
    "nextInTopic": 23718, 
    "prevInTopic": 23714, 
    "headers": {
        "inReplyToHeader": "PGo2MDZ0MSt0dnJlQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PENBQ2o4QnVPYjlCdjJlZ2JDakhwOVZyWGtGQkZxSzdEMjZPeFlLclVXTW1LPTd6Q0EzUUBtYWlsLmdtYWlsLmNvbT4=", 
        "referencesHeader": "PGo2MDZ0MSt0dnJlQGVHcm91cHMuY29tPg=="
    }
}