{
    "numMessagesInTopic": 10, 
    "nextInTime": 23755, 
    "senderId": "HoRY1PjLgyLhzD3R7LTd1ra43H3vDqOGgS8AVzEnugRx2BKDOH0KOZkTIQGCBS9TJh8koziPwmeQwFn2jzxPkKvUyHtW", 
    "systemMessage": false, 
    "subject": "Re: [junit] Open up Description class to allow arbitrary test hierarchies?", 
    "from": "Bill Venners &lt;bill@...&gt;", 
    "authorName": "Bill Venners", 
    "msgSnippet": "Hi Matthew, Actually we are planning to fix Eclipse very soon. The next release of ScalaTest, version 2.0, will include enhancements to support IDE", 
    "msgId": 23754, 
    "profile": "billvenners", 
    "topicId": 23742, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 416990097, 
    "messageBody": "<div id=\"ygrps-yiv-1595482897\">Hi Matthew,<br/>\n<br/>\nActually we are planning to &quot;fix Eclipse&quot; very soon. The next release of ScalaTest, version 2.0, will include enhancements to support IDE integration, and before releasing 2.0 we&#39;re going to help do the actual integration work for Eclipse, IDEA, and NetBeans. That way we can be sure we have it right before releasing the ScalaTest enhancements. I would like your feedback on it. I&#39;ll post announcements of preview snapshots on the scalatest-users mailing list, so please join that if you&#39;d like to give input.<br/>\n<br/>\nThanks.<br/>\n<br/>\nBill<br/>\n----<br/>\nBill Venners<br/>\nArtima, Inc.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.artima.com\">http://www.artima.com</a><br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Nov 3, 2011, at 5:50 AM, Matthew Farwell &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:matthew@...\">matthew@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Hi,<br/>\n&gt; <br/>\n&gt; I&#39;m interested in this, though for slightly different reasons, maybe we<br/>\n&gt; could exchange ideas on this. I haven&#39;t exactly thought this through in<br/>\n&gt; detail, but I think my requirements come down to being able to store<br/>\n&gt; arbitrary information in a Description, a key.<br/>\n&gt; <br/>\n&gt; I&#39;m interesting in testing with Scala, and there are (at least) two generic<br/>\n&gt; problems:<br/>\n&gt; <br/>\n&gt; 1) Tests which are not linked to a specific method, but are run as separate<br/>\n&gt; tests. Scalatest for example allows the following<br/>\n&gt; <br/>\n&gt; @RunWith(classOf[JUnitRunner])<br/>\n&gt; class FileSpec extends FlatSpec with ShouldMatchers {<br/>\n&gt; <br/>\n&gt; &quot;A Stack&quot; should &quot;pop values in last-in-first-out order&quot; in {<br/>\n&gt; }<br/>\n&gt; <br/>\n&gt; it should &quot;throw NoSuchElementException if an empty stack is popped&quot; in {<br/>\n&gt; }<br/>\n&gt; }<br/>\n&gt; <br/>\n&gt; This creates a single method with the two tests within. However, the<br/>\n&gt; JUnitRunner runs the single method but records the two tests separately.<br/>\n&gt; This can be seen in Eclipse, see attached scalatest1.png. Now if I double<br/>\n&gt; click on the test name in the junit view, it tries to find a method of that<br/>\n&gt; name, and fails. Obviously, to correct this would require a fix to Eclipse,<br/>\n&gt; but if I could store the file & line number instead of the method name, I<br/>\n&gt; could jump to the appropriate line.<br/>\n&gt; <br/>\n&gt; 2) Scala allows spaces and other characters in method names, but these<br/>\n&gt; names are munged on compilation. For instance, space gets translated to<br/>\n&gt; $0020.<br/>\n&gt; <br/>\n&gt; class FileTest extends AssertionsForJUnit {<br/>\n&gt; @Test def `foo bar`() = {<br/>\n&gt; <br/>\n&gt; }<br/>\n&gt; }<br/>\n&gt; <br/>\n&gt; Here the jump to in Eclipse works correctly, but the displayed description<br/>\n&gt; in Eclipse isn&#39;t nice, see scalatest2.png.<br/>\n&gt; <br/>\n&gt; So in both cases, the string I would like to display (in Eclipse, surefire<br/>\n&gt; whatever) doesn&#39;t match the method name, either because there is no method<br/>\n&gt; name or because It&#39;s not the same thing. I think that I could work around<br/>\n&gt; most issues is Eclipse etc if the test runner could add some arbitrary<br/>\n&gt; information to the description, which it could subsequently use. A string<br/>\n&gt; would be fine, because I could define the contents of that String, but<br/>\n&gt; arbitrary data would be even better. String would be simpler for everyone I<br/>\n&gt; think.<br/>\n&gt; <br/>\n&gt; Please note that I&#39;m just thinking aloud at the minute, and I haven&#39;t<br/>\n&gt; actually done any proof of concepts as yet, but if you have any ideas,<br/>\n&gt; please feel free to take this to email.<br/>\n&gt; <br/>\n&gt; Matthew Farwell.<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 23753, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1320444086", 
    "canDelete": false, 
    "nextInTopic": 23755, 
    "prevInTopic": 23753, 
    "headers": {
        "inReplyToHeader": "PENBT0Jrb0ZYeGJZMXpBV1NxTytxdnoxa1VXVVhZV3p1NWJ6K3Rpdk1PM083QlRSSEU5Z0BtYWlsLmdtYWlsLmNvbT4=", 
        "messageIdInHeader": "PDkxMDBFNEFDLTI2MkQtNEUwNi04RjZGLUZBRjZCRUE3NUU3NUBhcnRpbWEuY29tPg==", 
        "referencesHeader": "PENBT0Jrb0ZYeGJZMXpBV1NxTytxdnoxa1VXVVhZV3p1NWJ6K3Rpdk1PM083QlRSSEU5Z0BtYWlsLmdtYWlsLmNvbT4="
    }
}