{
    "numMessagesInTopic": 10, 
    "nextInTime": 23756, 
    "senderId": "ON4M5gGAW3fjerzsAjoAVlmPgOHwVHDtx2xl5Lkh5F6CGJa-hpuzObU06z5As9VVh8VKj1szpiZrucP2_XQKXSNHjdUwiXVeaAo", 
    "systemMessage": true, 
    "subject": "Re: [junit] Open up Description class to allow arbitrary test hierarchies?", 
    "from": "Dawid Weiss &lt;dawid.weiss@...&gt;", 
    "authorName": "Dawid Weiss", 
    "msgSnippet": "I think your reasons are aligned with mine -- the problem is that a test s visual description for the user interface and where it points to should be", 
    "msgId": 23755, 
    "topicId": 23742, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 223548916, 
    "messageBody": "<div id=\"ygrps-yiv-1516765002\">I think your reasons are aligned with mine -- the problem is that a test&#39;s<br/>\nvisual description for the user interface and where it &quot;points to&quot; should<br/>\nbe separate things. My thoughts on the subject so far are that Description<br/>\nshould provide a String with the human description and some sort of an<br/>\n(empty) interface, let&#39;s call it a TestSource which would provide<br/>\nadditional hints which resource to open and where. So something like this<br/>\n(ideas, not implementation):<br/>\n<br/>\nDescription {<br/>\n  String getDescription();<br/>\n  List&lt;TestSource&gt; getSource();<br/>\n}<br/>\n<br/>\nI can think of numerous advantages of such an approach, for example a<br/>\nsingle parameterized test could open the test case&#39;s source code by<br/>\nreturning:<br/>\n<br/>\nJavaTestSource {<br/>\n  String className();<br/>\n  String methodName(); // full signature?<br/>\n}<br/>\n<br/>\nbut it could also point to the file with parameterized test data and open<br/>\n_that_ as well, as in:<br/>\n<br/>\nFileTestSource {<br/>\n  File file();<br/>\n  int line();<br/>\n}<br/>\n<br/>\nNot giving much thought about the implementation, but you get the idea.<br/>\nObviously this would be a major pain for all tools that use JUnit because<br/>\nthis would pretty much break backwards compatibility... but I&#39;m all for it<br/>\nif a new major revision of JUnit is to ever see the light of day.<br/>\n<br/>\nTemporarily, and interestingly, Eclipse (and Ant and other tools I think)<br/>\ncan be cheated a bit -- they all use a JUnit version provided by the user&#39;s<br/>\nclasspath via reflective access typically (they don&#39;t have fixed version<br/>\ndependency). If you &quot;classpath-shadow&quot; your JUnit&#39;s Description (by<br/>\nprepending classpath with your own Description class, keeping the same API)<br/>\nyou can do anything you with with the descriptions... This is a dirty hack<br/>\nthough :(<br/>\n<br/>\nDawid<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Nov 3, 2011 at 10:50 AM, Matthew Farwell &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:matthew@...\">matthew@...</a>&gt;wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Hi,<br/>\n&gt;<br/>\n&gt; I&#39;m interested in this, though for slightly different reasons, maybe we<br/>\n&gt; could exchange ideas on this. I haven&#39;t exactly thought this through in<br/>\n&gt; detail, but I think my requirements come down to being able to store<br/>\n&gt; arbitrary information in a Description, a key.<br/>\n&gt;<br/>\n&gt; I&#39;m interesting in testing with Scala, and there are (at least) two generic<br/>\n&gt; problems:<br/>\n&gt;<br/>\n&gt; 1) Tests which are not linked to a specific method, but are run as separate<br/>\n&gt; tests. Scalatest for example allows the following<br/>\n&gt;<br/>\n&gt; @RunWith(classOf[JUnitRunner])<br/>\n&gt; class FileSpec extends FlatSpec with ShouldMatchers {<br/>\n&gt;<br/>\n&gt; &quot;A Stack&quot; should &quot;pop values in last-in-first-out order&quot; in {<br/>\n&gt; }<br/>\n&gt;<br/>\n&gt; it should &quot;throw NoSuchElementException if an empty stack is popped&quot; in {<br/>\n&gt; }<br/>\n&gt; }<br/>\n&gt;<br/>\n&gt; This creates a single method with the two tests within. However, the<br/>\n&gt; JUnitRunner runs the single method but records the two tests separately.<br/>\n&gt; This can be seen in Eclipse, see attached scalatest1.png. Now if I double<br/>\n&gt; click on the test name in the junit view, it tries to find a method of that<br/>\n&gt; name, and fails. Obviously, to correct this would require a fix to Eclipse,<br/>\n&gt; but if I could store the file & line number instead of the method name, I<br/>\n&gt; could jump to the appropriate line.<br/>\n&gt;<br/>\n&gt; 2) Scala allows spaces and other characters in method names, but these<br/>\n&gt; names are munged on compilation. For instance, space gets translated to<br/>\n&gt; $0020.<br/>\n&gt;<br/>\n&gt; class FileTest extends AssertionsForJUnit {<br/>\n&gt; @Test def `foo bar`() = {<br/>\n&gt;<br/>\n&gt; }<br/>\n&gt; }<br/>\n&gt;<br/>\n&gt; Here the jump to in Eclipse works correctly, but the displayed description<br/>\n&gt; in Eclipse isn&#39;t nice, see scalatest2.png.<br/>\n&gt;<br/>\n&gt; So in both cases, the string I would like to display (in Eclipse, surefire<br/>\n&gt; whatever) doesn&#39;t match the method name, either because there is no method<br/>\n&gt; name or because It&#39;s not the same thing. I think that I could work around<br/>\n&gt; most issues is Eclipse etc if the test runner could add some arbitrary<br/>\n&gt; information to the description, which it could subsequently use. A string<br/>\n&gt; would be fine, because I could define the contents of that String, but<br/>\n&gt; arbitrary data would be even better. String would be simpler for everyone I<br/>\n&gt; think.<br/>\n&gt;<br/>\n&gt; Please note that I&#39;m just thinking aloud at the minute, and I haven&#39;t<br/>\n&gt; actually done any proof of concepts as yet, but if you have any ideas,<br/>\n&gt; please feel free to take this to email.<br/>\n&gt;<br/>\n&gt; Matthew Farwell.<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 23754, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1320488010", 
    "canDelete": false, 
    "nextInTopic": 23756, 
    "prevInTopic": 23754, 
    "headers": {
        "inReplyToHeader": "PENBT0Jrb0ZYeGJZMXpBV1NxTytxdnoxa1VXVVhZV3p1NWJ6K3Rpdk1PM083QlRSSEU5Z0BtYWlsLmdtYWlsLmNvbT4=", 
        "messageIdInHeader": "PENBTTIxUnRfelBKTGZHZk9kZVBHam8yaUF3UmZCNFB5NE85X09lR2Z2RERPb2duPUdUd0BtYWlsLmdtYWlsLmNvbT4=", 
        "referencesHeader": "PENBT0Jrb0ZYeGJZMXpBV1NxTytxdnoxa1VXVVhZV3p1NWJ6K3Rpdk1PM083QlRSSEU5Z0BtYWlsLmdtYWlsLmNvbT4="
    }
}