{
    "numMessagesInTopic": 10, 
    "nextInTime": 23769, 
    "senderId": "5HSblGyxGm2JMO4fKc93NNKa23cuNxbhcmxS0mhuCtKBYHvSVeD41uf3rupqNcfZ7uQ9IGfEKhqrQMs6y5E6allpSTU", 
    "systemMessage": false, 
    "subject": "Reporting on test runs from a custom Runner", 
    "from": "&quot;jfuerth&quot; &lt;jfuerth@...&gt;", 
    "authorName": "jfuerth", 
    "msgSnippet": "Hi everyone, I ve created a custom Runner meant to help with performance and scalability testing. It lets you create tests like this: ", 
    "msgId": 23768, 
    "profile": "jfuerth", 
    "topicId": 23768, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 511044896, 
    "messageBody": "<div id=\"ygrps-yiv-220282102\">Hi everyone,<br/>\n<br/>\nI&#39;ve created a custom Runner meant to help with performance and scalability testing. It lets you create tests like this:<br/>\n<br/>\n@RunWith(PerfRunner.class)<br/>\npublic class MultiThreadUsageExampleTest {<br/>\n<br/>\n  @Test<br/>\n  public void demonstrationTest(<br/>\n      @Varying(from=1, to=10) int threadCount,<br/>\n      @Varying(from=100000, to=1000000, step=100000) int entryCount) {<br/>\n<br/>\n      // code here that relies on threadCount and entryCount<br/>\n  }<br/>\n<br/>\n}<br/>\n<br/>\nIn the above example, my runner calls demonstrationTest() 100 times, with parameter values (1, 100000), (2, 100000), ... (1, 200000), ... (10, 1000000).<br/>\n<br/>\nWhat I want to do now is produce charts of how long each call took. There are a lot of approaches, but I don&#39;t know which is &quot;right.&quot;<br/>\n<br/>\n1. Register a TestListener and write my own reports to disk from it (but is there a generic way to register listeners?)<br/>\n2. Create my own main program that runs the test suite, and have it create the report when the suite is done (maybe this is the only way to register a TestListener anyhow?)<br/>\n3. Transform the XML output of the ant junit task (but then it&#39;s bound to Ant)<br/>\n4. Transform the XML output of the maven-surefure-plugin (but then it&#39;s bound to Maven)<br/>\n5. Write performance results to disk directly from my TestRunner (should work in any environment, but feels like a dirty approach)<br/>\n<br/>\nOther ideas are welcome too, of course. My test runner is open source and published on GitHub; I want a solution that can work for everyone. So I think ideas 3 and 4 are out.<br/>\n<br/>\nHas anyone else thought about getting data from custom test runners into human-readable reports?<br/>\n<br/>\n-Jonathan</div>", 
    "prevInTime": 23767, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1323900117", 
    "canDelete": false, 
    "nextInTopic": 23769, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGpjYjZjbCszY3JpQGVHcm91cHMuY29tPg=="
    }
}