{
    "numMessagesInTopic": 12, 
    "nextInTime": 23787, 
    "senderId": "tF3ujaAi_Q6SsKxSE0Ftl0MeDq_EgYiRWZVqTCqX5SUbnpsQQQhUMqip4H6a4geZTFrH_Ks9d_vwIMCk_24wm5YJ", 
    "systemMessage": false, 
    "subject": "Re: Runner for maven", 
    "from": "&quot;hkaipe&quot; &lt;hkaipe@...&gt;", 
    "authorName": "hkaipe", 
    "msgSnippet": "Hi Kristian Do you really want a transition from RunListener? To an outside observer - a JUnit Runner describes its test-executions and reports their outcome", 
    "msgId": 23786, 
    "profile": "hkaipe", 
    "topicId": 23785, 
    "spamInfo": {
        "reason": "6", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 478409128, 
    "messageBody": "<div id=\"ygrps-yiv-1544609004\">Hi Kristian<br/>\n<br/>\nDo you really want a transition from RunListener?<br/>\n<br/>\nTo an outside observer - a JUnit Runner &quot;describes&quot; its test-executions and reports their outcome to the RunNotifier, which forward the info to RunListener, which is the interface that 3rd-party test-running applications (e.g. IDEs, Maven-Surefire etc) are expected to use.<br/>\n<br/>\nI have seen IDE-project test-extensions try to go beyond RunListener/RunNotifier and start to joggle with Runner internals (e.g. test-instance creation/setup, method-executions etc) and the result is something I don&#39;t like much. It works for simple cases but with customized Runner-classes and new JUnit-features (e.g. the introduction of JUnit-Rules) the result is usually bad and it discourages the IDE users (i.e. the developers) from taking full advantage of JUnit!<br/>\n<br/>\nHowever, Maven (versions 2.0-2.2) and its Surefire-plugin has handled the JUnit-integration wonderfully, as far as I know, so your post worries me a little. What is it that you want to accomplish by moving away from the successful(!) &quot;Junitcore+RunListener based approach&quot;?<br/>\n<br/>\nHenrik<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, kristian@... wrote:<br/>\n&gt;<br/>\n&gt; Hi,<br/>\n&gt; <br/>\n&gt; I maintain the junit provider for maven-surefire, and I&#39;m looking into transitioning from  a Junitcore+RunListener based approach to an approach based on something like BlockJUnit4ClassRunner.<br/>\n&gt; <br/>\n&gt; Unfortunately I cannot subclass the BlockJUnit4ClassRunner since the client code itself may need to do that, so I&#39;d somehow need to put &quot;my&quot; <br/>\n&gt; Runner in front of the client-supplied one, maybe something proxy like.<br/>\n&gt; <br/>\n&gt; Anyone have any tips on this, maybe some existing code that does this ?<br/>\n&gt; <br/>\n&gt; Kristian<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 23785, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1325627136", 
    "canDelete": false, 
    "nextInTopic": 23787, 
    "prevInTopic": 23785, 
    "headers": {
        "inReplyToHeader": "PGpkdWI5MytjbnE0QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGpkdnN1MCsxMG83ZkBlR3JvdXBzLmNvbT4="
    }
}