{
    "numMessagesInTopic": 20, 
    "nextInTime": 23970, 
    "senderId": "C2A3NqUAglxrVy0ycpJYQJnwAdlHHCdrwgRsRs7uXLS6sY6PV7UHOcxg3rMrUaTeaO7NQ8roTiHSYq9bKOxs_wheUa2GqJF6uQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Feedback Required | Extending Junit to perform Data Driven Testing", 
    "from": "Michael Feher &lt;mfeher00@...&gt;", 
    "authorName": "Michael Feher", 
    "msgSnippet": "Hi, I m glad someone else spoke up.  Though I m a very infrequent user of JUnit, I must confess that getting the daily emails about the enhanced capabilities", 
    "msgId": 23969, 
    "profile": "mfeher00", 
    "topicId": 23950, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 113290378, 
    "messageBody": "<div id=\"ygrps-yiv-1301319017\">Hi,<br/>\n<br/>\nI&#39;m glad someone else spoke up.  Though I&#39;m a very infrequent user of JUnit, I must confess that getting the daily emails about the enhanced capabilities of JUnit these days has shown a possibly powerful tool that&#39;s become a little byzantine for the casual user to be able to work with.<br/>\n<br/>\nOne thing I haven&#39;t seen is something that bridges the knowledge gap.  What I mean is, JUnit&#39;s been around for many years now, but to my knowledge, outside of this group, there&#39;s still only two useful websites and even those (at last check) don&#39;t seem as comprehensive as they could be (comparing it to something like the Java SE API, for example).  So there&#39;s all this esoterica being discussed here, and the websites look like they haven&#39;t been updated in years.  There&#39;s a gap there.  I find myself getting lost in casually following these discussions thinking, &quot;What if you just want to run a test class to unit-test an application class?  What is all this fancy stuff going on now and these different strange names and applications people are using?&quot;  I&#39;ve done enough non-JUnit unit testing to know how the tool should be useable for those applications, but I am definitely lost when it comes to TestRunners and all this other stuff I&#39;ve seen.<br/>\n<br/>\nThis isn&#39;t really a complaint so much as an observation.  Thanks for reading.<br/>\n<br/>\nMike<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Anuj &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:anujkumar1516@...\">anujkumar1516@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> <br/>\nSent: Tuesday, September 4, 2012 5:03 AM<br/>\nSubject: [junit] Re: Feedback Required | Extending Junit to perform Data Driven Testing<br/>\n <br/>\n<br/>\n  <br/>\nHi Teemu,<br/>\nI think I share the feelings with you that JUnits simplicity was its winning edge. A simple @Test annotation with a simple @RunWith did a lot of things for us for a long time. Although in the same breath I would also like to state the fact that the things around us change constantly. IMHO, during the constant changes, we should be able to hold on to the simple things and build on top of that to accommodate the changing requirements. <br/>\nThere is a great need in the IT world currently to do data driven testing such that the data is not coupled with the test. The main benefit it gives is the ability to control data and test separately, which results in less coupling and ultimately better maintenance.<br/>\n<br/>\nEasyTest is trying to achieve exactly that by extending JUnit in a way  that its simplicity is conserved(EasyTest works with @Test annotations) and at the same time users have the ability to specify the data outside of their test classes. <br/>\n<br/>\nDo have a look at EasyTest and share your thoughts with us. Its always good to get feedback from the people who have experience in the related field. Here&#39;s EasyTest for your reference:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"https://github.com/EaseTech/easytest\">https://github.com/EaseTech/easytest</a><br/>\n<br/>\nCheers!<br/>\nAnuj<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, Teemu Kanstrén &lt;tkanstren@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi all,<br/>\n&gt; <br/>\n&gt;  Maybe I am a bit off topic, but I think JUnit used to be really nice when<br/>\n&gt; you looked it up and it was so simple to use and understand. Now you get<br/>\n&gt; these rules, theories, runners, and all kinds of strange things. They are<br/>\n&gt; nice for anyone needing to extend JUnit to integrate with something<br/>\n&gt; external but I wish the user never needs to see the stuff..<br/>\n&gt; <br/>\n&gt;  I like the basic use of annotations in JUnit 4 but I prefer to have any<br/>\n&gt; more complex stuff written in the code and not in the annotations.<br/>\n&gt; <br/>\n&gt;  Of course, it is nice to have the option and support those who like a<br/>\n&gt; different type of an approach.<br/>\n&gt; <br/>\n&gt;  Just saying... :)<br/>\n&gt; <br/>\n&gt; Teemu<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 23968, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1346770637", 
    "canDelete": false, 
    "nextInTopic": 23970, 
    "prevInTopic": 23968, 
    "headers": {
        "inReplyToHeader": "PGsyNGc1aCs4bWoyQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDEzNDY3NzA2MzcuMzYwNTAuWWFob29NYWlsTmVvQHdlYjE2MTkwMi5tYWlsLmJmMS55YWhvby5jb20+", 
        "referencesHeader": "PENBR2FnTD1kNkVoVXROQkc3VV9hWStWUzJLN3RERE4wdDR2Y2Ird0pLRHVKV2FfSzErd0BtYWlsLmdtYWlsLmNvbT4gPGsyNGc1aCs4bWoyQGVHcm91cHMuY29tPg=="
    }
}