{
    "numMessagesInTopic": 3, 
    "nextInTime": 25, 
    "senderId": "-D1BeCVCPjW0gKTPe-MPLlNbZltWNTE7uJMHXIlYq6ekYKr2URa8TDsa2g-uE3mkcXlEVA_nWtWKCGMWXu1HPFxq1aQzPmORU6wkCYXlSfmw4iDw", 
    "systemMessage": false, 
    "subject": "Re: [junit] Automatic test finding / JUnitX (was: How to hook test cases  into GUI testrunner)", 
    "from": "Andreas Heilwagen &lt;andreas.heilwagen@...&gt;", 
    "authorName": "Andreas Heilwagen", 
    "msgSnippet": "... I started JUnitX after reading the Refactoring-book of Martin Fowler. During my vacation I had real fun refactoring JUnit and afterwards I have been", 
    "msgId": 24, 
    "topicId": 24, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-723870655\">Benjamin Schroeder wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; By the way, what are some of the forces that led you to start JUnitX?  I<br/>\n&gt; haven&#39;t had a chance to really play with it, but might -- it looks like it<br/>\n&gt; could have some nice stuff.  (I&#39;m not sure whether I&#39;d use the major<br/>\n&gt; functionality of access to restricted classes and members or not, though.)<br/>\n&gt; Does it work with JDK 1.1?<br/>\n<br/>\n </span></blockquote>I started JUnitX after reading the Refactoring-book of Martin Fowler.<br/>\nDuring my vacation I had real fun refactoring JUnit and afterwards I<br/>\nhave been curious how it would be possible to access private methods,<br/>\nclasses and attributes across packages. So I had to extend JUnit in<br/>\nmany aspects. Also the Swing GUI required more clicks than I liked to<br/>\naccess the tree of tests. So I reworked the Swing and Text UIs.<br/>\n<br/>\nNow it is a challenge to submit the changes to JUnit. I hope that JUnit<br/>\nsoon gives me the opportunity to give my best changes to it after<br/>\nhaving somebody reviewing them. So I am sad that it is a branch<br/>\ndevelopment. But I will definitely support _all_ JUnit features in<br/>\nthe JUnitX versions until everything has been merged sufficiently.<br/>\n<br/>\nI never tested the stuff with JDK 1.1. But it should be possible to<br/>\nbackport the stuff. Are you interested in doing that? Than you might<br/>\nwant to join <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:extreme-java@egroups.com\">extreme-java@egroups.com</a>, the JUnitX and XPTest mailinglist<br/>\nI set up for developers.<br/>\n<br/>\nConcerning testing private code, it depends on your preferences.<br/>\nGenerally<br/>\nit would be better not to access private code since there is a reason<br/>\nfor beeing private. But sometimes you might want to ensure that<br/>\ncomplex algorithms work corrently and there it could be helpful to<br/>\naccess the inner state of a class. See it as a kind of last resort to<br/>\nbe sure that a test case tests the right stuff completely. It should<br/>\nnot become the general way of testing your production classes.<br/>\n<br/>\nRegards,<br/>\n<br/>\nAndreas.</div>", 
    "prevInTime": 23, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "974394979", 
    "canDelete": false, 
    "nextInTopic": 27, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDNBMTQxNjYzLjk2QjdGQ0ZGQGV4dHJlbWUtamF2YS5kZT4=", 
        "referencesHeader": "PEI2MzcyOTQ2LjE5OEYlc2Nocm9lZGVyQHN1cmZyZWUuY29tPg=="
    }
}