{
    "numMessagesInTopic": 6, 
    "nextInTime": 2402, 
    "senderId": "WxAEZubXMuYDFG45FT7lWBaGbRpuwad1edscGp4j9MLHdri172mibZEcsuWM4hP-EhWRTdaWZhmQGCP92CdVTL8jN3AG91Hg7Q", 
    "systemMessage": false, 
    "subject": "RE: [junit] organizing tests, and the setUp() method", 
    "from": "&quot;Alan Bram&quot; &lt;alan@...&gt;", 
    "authorName": "Alan Bram", 
    "msgSnippet": "... desirable ... and ... First of all, thank you Johannes and Jason for your replies to my question.  This has gotten me to thinking, and is becoming even", 
    "msgId": 2401, 
    "topicId": 2397, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1594456746\"><blockquote><span title=\"ireply\">&gt; Here I would like to ask a question...  Do you think it would be a<br/>\n </span></blockquote>desirable<br/>\n<blockquote><span title=\"ireply\"> &gt; design decision to refactor your class(es) to reflect the first method of<br/>\n&gt; testing?  That is have a base class that handles TCP/IP traffic requests<br/>\n </span></blockquote>and<br/>\n<blockquote><span title=\"ireply\"> &gt; then two decendents (one that tunnels through SSL and one that doesn&#39;t).<br/>\n<br/>\n </span></blockquote>First of all, thank you Johannes and Jason for your replies to my<br/>\nquestion.  This has gotten me to thinking, and is becoming even more<br/>\ninteresting.  Specifically, it is very interesting how thinking about<br/>\ntesting affects the design of the product code.<br/>\n<br/>\nIn my particular case it is already true that (virtually) all of the<br/>\ncode I&#39;m trying to test doesn&#39;t care whether we&#39;re using SSL or not.<br/>\nThe beauty of these SSL libraries is precisely that they allow you to<br/>\ntreat a socket as a socket, whether or not it has SSL going on under<br/>\nthe covers.<br/>\n<br/>\nSo, in a way, that suggests that if all I want to test is my code,<br/>\nthen I shouldn&#39;t have to test the same thing twice.  All I (should)<br/>\nwant to do is to verify that my code produces the results I think it<br/>\nshould, given a certain input.  That would be true Unit Testing.<br/>\n<br/>\nNow I had a number of problems recently that I traced not to failure<br/>\nof my code to do what I thought it should do, but rather to<br/>\ndiscrepancies between the behavior of plain sockets and SSL sockets.<br/>\nIn other words, the SSL libraries had bugs in them.  (For example, one<br/>\nproblem concerned how the server should protect itself from an I/O<br/>\noperation that takes an &quot;impossibly&quot; long duration.)<br/>\n<br/>\nSo then I thought maybe what I&#39;m trying to do here isn&#39;t really Unit<br/>\nTesting.  Because I&#39;m trying to test the operation of the system as a<br/>\nwhole (or at least a part of it that is bigger than one &quot;unit&quot;).  So<br/>\nwhat is it?  Is it &quot;Functional Testing&quot;?  I don&#39;t think so, because<br/>\nthis unusual error case isn&#39;t something that I would expect I could<br/>\nfind in a collection of User Stories.<br/>\n<br/>\nIn retrospect, I can come up with a characterization of the problem<br/>\nand say that I made certain assumptions about the behavior of the<br/>\nsockets API.  Given that was the case, it would have been prudent of<br/>\nme to write (very simple) test cases that verify those assumptions,<br/>\nand run them on both plain and SSL sockets.  These tests, of course,<br/>\nwould be very simple, and wouldn&#39;t involve any of my product code.<br/>\n<br/>\nPresumably if I tested the assumptions correctly in both cases, then I<br/>\nwouldn&#39;t have to test my code in both of its configurations (since<br/>\nfrom its point of view it&#39;s not really doing anything different in the<br/>\ntwo different cases).<br/>\n<br/>\nIs this another form of testing (&quot;Assumption Testing&quot;)?  Or perhaps<br/>\nanother way to look at it is that I&#39;m a &quot;customer&quot; of the SSL library<br/>\nprovider, and I need to have my own &quot;Acceptance Test&quot; of the<br/>\nfunctionality that I expect it to provide?<br/>\n<br/>\nAnd, even if I try to persuade myself that this would be the correct<br/>\nway to test, somehow I&#39;m nervous that I would miss a test case, or not<br/>\nbe aware of some assumption that I had made.<br/>\n<br/>\n - Alan Bram</div>", 
    "prevInTime": 2400, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "998089473", 
    "canDelete": false, 
    "nextInTopic": 2402, 
    "prevInTopic": 2400, 
    "headers": {
        "messageIdInHeader": "PDAwMTcwMWMxMjc3MCRmYmFlOWU3MCQ3NjliYjFkMEBBQlJBTT4="
    }
}