{
    "numMessagesInTopic": 18, 
    "nextInTime": 24017, 
    "senderId": "8BBnon_AMu4RkmCfslDtuZ8fbEMIQmz9CTTb2cbLoCdZcn9x5zsA2nh7EnAyQlMYJR3UURiFelmI5wxIHiH9c9P6yzJO0nnAPs9B2A", 
    "systemMessage": false, 
    "subject": "Type safe categories", 
    "from": "&quot;sebastian_4711&quot; &lt;usenet@...&gt;", 
    "authorName": "sebastian_4711", 
    "msgSnippet": "Hello, we start using categories in a project to distinguish unit and integration tests using database. Our requirement is to run unit tests from within", 
    "msgId": 24016, 
    "profile": "sebastian_4711", 
    "topicId": 24016, 
    "spamInfo": {
        "reason": "3", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 221114014, 
    "messageBody": "<div id=\"ygrps-yiv-769383133\">Hello,<br/>\n<br/>\nwe start using categories in a project to distinguish unit and integration tests using database. Our requirement is to run unit tests from within Eclipse and using Maven.<br/>\n<br/>\nThe experience was rather disappointing. <br/>\n<br/>\nThe support for categories in Eclipse is completely missing.  Maven plugin did not work out of the box as the wrong test executor was instantiated. Once this was fixed, we found that the category class must be available in the class path of all projects, else the plugin fails with a ClassNotFoundException. <br/>\n<br/>\nWhy are categories not plain strings as in TestNG? This would prevent class not found exceptions and in addition removes the requirement to have a dependency on the single module containing the categories. If you like you can still use String constants to be &quot;name safe&quot;.<br/>\n<br/>\nEvaluating TestNG as an alternative lead to the following results:<br/>\n- Good support in the Eclipse Plugin and Maven<br/>\n-- Groups (= categories) are found by the Eclipse plugin<br/>\n- TestNG does not create a new instance per test. As a consequence all fields must be set in @BeforeMethod. Using a normal constructor causes unexpected results.<br/>\n- @BeforeMethod is not executed, if a group is specified. There is a @BeforeGroup annotation which makes the whole thing much more complex.<br/>\n<br/>\nBest Regards<br/>\n<br/>\nSebastian</div>", 
    "prevInTime": 24015, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1348166901", 
    "canDelete": false, 
    "nextInTopic": 24017, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGszZm9kbCtmbnFxQGVHcm91cHMuY29tPg=="
    }
}