{
    "numMessagesInTopic": 6, 
    "nextInTime": 2403, 
    "senderId": "63QrFNZczEDdx9ftooWKzLLGhYH8b56ELdAtMMoqAi_ck9VlGRipSXMObaY1zTz5hmCZN770DEZ3sWQ5PC6ZBvkvfBVUmipk", 
    "systemMessage": false, 
    "subject": "Re: [junit] organizing tests, and the setUp() method", 
    "from": "Johannes Link &lt;john.link@...&gt;", 
    "authorName": "Johannes Link", 
    "msgSnippet": "Alan, ... IMO there are two kinds of testing you have to touch here. The first one ... If you rely on a library which you think (a) contains bugs that prevent", 
    "msgId": 2402, 
    "topicId": 2397, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-59307373\">Alan,<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Now I had a number of problems recently that I traced not to failure<br/>\n&gt; of my code to do what I thought it should do, but rather to<br/>\n&gt; discrepancies between the behavior of plain sockets and SSL sockets.<br/>\n&gt; In other words, the SSL libraries had bugs in them.  (For example, one<br/>\n&gt; problem concerned how the server should protect itself from an I/O<br/>\n&gt; operation that takes an &quot;impossibly&quot; long duration.)<br/>\n&gt; <br/>\n&gt; So then I thought maybe what I&#39;m trying to do here isn&#39;t really Unit<br/>\n&gt; Testing.  Because I&#39;m trying to test the operation of the system as a<br/>\n&gt; whole (or at least a part of it that is bigger than one &quot;unit&quot;).  So<br/>\n&gt; what is it?  Is it &quot;Functional Testing&quot;?  I don&#39;t think so, because<br/>\n&gt; this unusual error case isn&#39;t something that I would expect I could<br/>\n&gt; find in a collection of User Stories.<br/>\n<br/>\n </span></blockquote>IMO there are two kinds of testing you have to touch here. The first one<br/>\nyou describe correctly:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is this another form of testing (&quot;Assumption Testing&quot;)?  Or perhaps<br/>\n&gt; another way to look at it is that I&#39;m a &quot;customer&quot; of the SSL library<br/>\n&gt; provider, and I need to have my own &quot;Acceptance Test&quot; of the<br/>\n&gt; functionality that I expect it to provide?<br/>\n<br/>\n </span></blockquote>If you rely on a library which you think<br/>\n(a) contains bugs that prevent you from doing what you want to do with<br/>\nit<br/>\n(b) might change its interface in the future<br/>\n(c) you don&#39;t understand thoroughly enough<br/>\n<br/>\nthen, build your own test suites for the things you expect from that<br/>\nlibrary. &quot;Assumption Testing&quot; might be a good name for it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And, even if I try to persuade myself that this would be the correct<br/>\n&gt; way to test, somehow I&#39;m nervous that I would miss a test case, or not<br/>\n&gt; be aware of some assumption that I had made.<br/>\n<br/>\n </span></blockquote>This is a problem you have with any test suite - you can never be sure.<br/>\nIt&#39;s more of a concern when you can only do specification-based testing,<br/>\ni.e. when you don&#39;t have the sources to suggest other test cases.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Presumably if I tested the assumptions correctly in both cases, then I<br/>\n&gt; wouldn&#39;t have to test my code in both of its configurations (since<br/>\n&gt; &gt;from its point of view it&#39;s not really doing anything different in the<br/>\n&gt; two different cases).<br/>\n<br/>\n </span></blockquote>To some extent you are right but not quite: Testing individual objects<br/>\ndoes not guarantee that the collaboration/interaction between tested<br/>\nobjects works (anti-composition axiom). That&#39;s why I&#39;d always test at<br/>\nleast some basic functionality with both configurations. You might check<br/>\nthe book<br/>\n&quot;McGregor & Sykes: Practical guide for testing object-oriented systems&quot;<br/>\nwhich covers interaction testing rather thoroughly.<br/>\n<br/>\nJohannes</div>", 
    "prevInTime": 2401, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "998123370", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 2401, 
    "headers": {
        "messageIdInHeader": "PDNCN0UyNzZBLkNGM0MzMjRDQGdteC5uZXQ+", 
        "referencesHeader": "PDAwMTcwMWMxMjc3MCRmYmFlOWU3MCQ3NjliYjFkMEBBQlJBTT4="
    }
}