{
    "numMessagesInTopic": 2, 
    "nextInTime": 2404, 
    "senderId": "GS97WodHZZlU_Vac8ravc4z64PJt3A5Sx4HBiglPrhvVRAy8ZwxCcos_NkH6bPMO4Om62EolsfBh6X3zHfTYvse3MGJcoy9NBeNBWIowvQgTWn4", 
    "systemMessage": false, 
    "subject": "Unit testing/Third-party libraries", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains762@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... [...] You have to assume that third-party software works when you integrate with it. You have to assume that Java works. You have to assume that anyone you", 
    "msgId": 2403, 
    "topicId": 2403, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-254800454\"><blockquote><span title=\"ireply\">&gt;Presumably if I tested the assumptions correctly in both cases, then I<br/>\n&gt;wouldn&#39;t have to test my code in both of its configurations (since<br/>\n&gt;from its point of view it&#39;s not really doing anything different in the<br/>\n&gt;two different cases).<br/>\n </span></blockquote>[...]<br/>\n<br/>\nYou have to assume that third-party software works when you integrate with <br/>\nit. You have to assume that Java works. You have to assume that anyone you <br/>\ndidn&#39;t write yourself works, otherwise you&#39;re testing someone else&#39;s code, <br/>\nand that is testing you shouldn&#39;t have to do.<br/>\n<br/>\nBut their stuff has bugs. I posted an example of a bug in IBM&#39;s EJB <br/>\nimplementation on Wiki. They have an Enumeration that isn&#39;t really an <br/>\nEnumeration. I only found this out during unit tests. It happens.<br/>\n<br/>\nSo what can you do?<br/>\n<br/>\nFortunately, XP has a solution: quick releases and acceptance tests force <br/>\nyou to integrate early and often so that you can expose these bugs in <br/>\nthird-party software earlier. The good news is that, through unit testing, <br/>\nyou can find these third-party bugs more easily. I would not be the least <br/>\nbit surprised if I were the first person ever to find this bug in IBM&#39;s EJB <br/>\nimplementation. After all, who would bother calling &quot;nextElement()&quot; when <br/>\n&quot;hasMoreElements()&quot; returns false? My acceptance test did, because I wanted <br/>\nto avoid subtle bugs, so I looked under every rock.<br/>\n<br/>\nBut at least I found the bug early in my integration with the library, <br/>\nreported it, and perhaps they&#39;ll fix it. What acceptance testing did was <br/>\nmake the bug show up now, rather than six months from now at an Australian <br/>\ncustomer&#39;s site. That would be a hefty travel bill.<br/>\n<br/>\nSo for unit testing, you have to assume that libraries work, otherwise you <br/>\ncan&#39;t truly unit test. But make sure you have the appropriate <br/>\nintegration/acceptance tests; otherwise, you&#39;ll not find bugs in those <br/>\nlibraries soon enough.<br/>\n<br/>\nJBR.<br/>\n<br/>\n_________________________________________________________________<br/>\nGet your FREE download of MSN Explorer at <a rel=\"nofollow\" target=\"_blank\" href=\"http://explorer.msn.com/intl.asp\">http://explorer.msn.com/intl.asp</a></div>", 
    "prevInTime": 2402, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "998190000", 
    "canDelete": false, 
    "nextInTopic": 2413, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PEYzNm5xRUJRZFdmRk1WcEhnTEgwMDAwMzg3ZUBob3RtYWlsLmNvbT4="
    }
}