{
    "numMessagesInTopic": 2, 
    "nextInTime": 24052, 
    "senderId": "FCmTfSTxo5eptSviGkOoiBIMv3Luv-dvDVBvgpNgeMOc6POY2tCYf17b4i4TFYXaAUiYsqgVvxJ-1tVf1hZL41S9-CkHT4liEDknztU5Ijg6Akdw", 
    "systemMessage": false, 
    "subject": "JUnit Mailing List Etiquette", 
    "from": "Simon Chappell &lt;simonpeterchappell@...&gt;", 
    "authorName": "Simon Chappell", 
    "msgSnippet": "Once again, it s time for a little reminder of some of the finer points of JUnit mailing list etiquette. This will be posted now and then; not often enough to", 
    "msgId": 24051, 
    "rawEmail": "Return-Path: &lt;simonpeterchappell@...&gt;\r\nX-Sender: simonpeterchappell@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nX-Received: (qmail 60397 invoked from network); 11 Oct 2012 20:21:01 -0000\r\nX-Received: from unknown (98.137.34.44)\n  by m9.grp.sp2.yahoo.com with QMQP; 11 Oct 2012 20:21:01 -0000\r\nX-Received: from unknown (HELO mail-wg0-f49.google.com) (74.125.82.49)\n  by mta1.grp.sp2.yahoo.com with SMTP; 11 Oct 2012 20:21:00 -0000\r\nX-Received: by mail-wg0-f49.google.com with SMTP id gg4so1496907wgb.6\n        for &lt;junit@yahoogroups.com&gt;; Thu, 11 Oct 2012 13:20:59 -0700 (PDT)\r\nMIME-Version: 1.0\r\nX-Received: by 10.180.76.11 with SMTP id g11mr469092wiw.13.1349986859651; Thu,\n 11 Oct 2012 13:20:59 -0700 (PDT)\r\nX-Received: by 10.216.234.86 with HTTP; Thu, 11 Oct 2012 13:20:59 -0700 (PDT)\r\nDate: Thu, 11 Oct 2012 15:20:59 -0500\r\nMessage-ID: &lt;CALgAf83wd1FYZZjacHoA4+PWqPWYeXn7MPs6jNeQuV6Ex08xMA@...&gt;\r\nTo: junit@yahoogroups.com\r\nX-eGroups-Msg-Info: 2:4:8:0:1\r\nFrom: Simon Chappell &lt;simonpeterchappell@...&gt;\r\nSubject: JUnit Mailing List Etiquette\r\nX-Yahoo-Group-Post: member; u=211142374; y=Ivj60s7mETP6LUPPil8T1WAma4IqNjKeRygQkFdvbweFoDg4Vg\r\nX-Yahoo-Profile: spchappell\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\n\r\nOnce again, it&#39;s time for a little reminder of some of the finer points of\nJUnit mailing list etiquette. This will be posted now and then; not often\nenough to be spam, but often enough to keep our newer members aware of how\nwe conduct business around here.\n\nDear members and readers of the JUnit mailing list,\n\nAround here, we love testing. Not only do we love testing, we love to\ndiscuss any and all aspects of testing, often with enthusiasm and passion.\nThis is good. This is the reason that this mailing list exists. On top of\nall this, we are very keen to help others understand this strange\naffliction we have; medical name &quot;testus infectus&quot;, better known as being\ntest infected. We love to answer questions and help those new to the joy\nmove further down the road towards test enlightenment. In the classic\nspirit of hospitality, our list is your list, our test cases are your test\ncases. Please make yourself at home and enjoy the journey. :-)\n\nThat said, there are some things that we don&#39;t love, so sit tight and\nlisten up.\n\nWe don&#39;t love people who haven&#39;t, or won&#39;t, read the JUnit Frequently Asked\nQuestions (FAQ) document, lovingly maintained by Mike Clark or the &quot;Smart\nQuestions&quot; document written and maintained by Eric S. Raymond. Here are the\nlinks, go forth and read ...\n\nhttp://junit.sourceforge.net/doc/faq/faq.htm\n\nhttp://www.catb.org/~esr/faqs/smart-questions.html\n\nWe don&#39;t love people who think that we&#39;ll do their homework assignments for\nthem. Back when I was a lad, we didn&#39;t have the Internet and we had to do\nour own homework assignments without the aid of all the knowledge and\ninformation that you have available to you today. (And yes, now that you\nask, I did walk uphill both ways to school through the snow.)\n\nWe don&#39;t love people who are incapable of using a search engine, but are\nyet somehow capable of signing up onto this mailing list so that they can\nask questions that ten seconds of searching would reveal the answer to.\nLearn how to use a search engine. Around here, Google seems quite popular.\nHere&#39;s a link; learn to love it and use it.\n\nhttp://www.google.com/\n\nWe don&#39;t love job postings. We do love having jobs (or at least, we like\nthe pay) and we do like to look at job postings, but we like to look at\nthem in more logical places like job websites. So, please don&#39;t be upset\nwhen a moderator deletes your carefully worded prose describing yet another\ntesting job.\n\nWe don&#39;t love thread hijacking. That&#39;s when you start a different subject\nby replying to a previous conversation and not even changing the subject\nline. We like to discuss a variety of subjects, so please feel free to be\ninspired to ask side-questions during ongoing conversations. Just do so by\nstarting a fresh thread with a unique subject line.\n\nLastly, we don&#39;t love people who whine, moan and generally sound like\npetulant children after they&#39;ve been told that they have violated one of\nthe &quot;laws of the land&quot; around here. It&#39;s a big old Internet; feel free to\ntake your questions and/or tantrums somewhere else if you don&#39;t like the\nway we do things around here.\n\nSimon\n(One of the JUnit mailing list moderators)\n\n-- \nsimonpeter.org | simonpeter.com | newlife-upc.org\n\n\n[Non-text portions of this message have been removed]\n\n\n", 
    "profile": "spchappell", 
    "topicId": 18753, 
    "spamInfo": {
        "reason": "4", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 211142374, 
    "prevInTime": 24050, 
    "contentTrasformed": false, 
    "postDate": "1349986859", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 18753, 
    "headers": {
        "messageIdInHeader": "PENBTGdBZjgzd2QxRllaWmphY0hvQTQrUFdxUFdZZVhuN01QczZqTmVRdVY2RXgwOHhNQUBtYWlsLmdtYWlsLmNvbT4="
    }
}