{
    "numMessagesInTopic": 17, 
    "nextInTime": 24076, 
    "senderId": "WF8POvPlN8b3RRioX5i_6nu2LvGhZ-KMFj8nQFPV6WTn8QXrnuAm0D4YC0l3l24NA0EOOKbhlRolkiduKsZRhzEHaMUR", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: JUnit 4.11-beta-1 is released", 
    "from": "Paul King &lt;paulk@...&gt;", 
    "authorName": "Paul King", 
    "msgSnippet": "+1 on the creation of a junit-core  (or whatever name but without Hamcrest as a requirement) Cheers, Paul.", 
    "msgId": 24075, 
    "topicId": 24052, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 215576703, 
    "messageBody": "<div id=\"ygrps-yiv-1673234420\">+1 on the creation of a junit-core  (or whatever name but without Hamcrest as a requirement)<br/>\n<br/>\nCheers, Paul.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 2/11/2012 6:59 AM, Paul Holser wrote:<br/>\n&gt; Marc, I agree that Hamcrest is a terrific library for expressing expected test outcomes. So is FEST-Assert. If my tests are small and focused enough, I might even roll with native Java assertions. The AssertionError (or, really, any exception that propagates out of a test) represents sort of an implicit contract between test and runner: signal the test as failed if the exception makes it out of the test unhandled. There are lots of ways to satisfy that contract; I&#39;m not sure that one based on Hamcrest has to be the answer.<br/>\n&gt;<br/>\n&gt; The time period between JUnit 4.4 and 4.11 was challenging for those developers who wanted some of the goodness of Hamcrest &gt; 1.1, what with the attendant Maven exclusions, surprising failures, and so forth. It led me to wonder whether Assert/Assume ought to be separate from the core of JUnit. Then, the putative &quot;junit-assertions&quot; module could depend on Hamcrest if it so chose, and &quot;junit-core&quot; (made-up module that doesn&#39;t exist right now) wouldn&#39;t have to. Further, developers could choose to use junit-assertions or not; Hamcrest alone (with MatcherAssert.assertThat()) or not; FEST-Assert, etc.<br/>\n&gt;<br/>\n&gt; I think of AssumptionViolatedException as another implicit contract between test and runner. Right now, though, unless you want to depend on a public-but-not-published AssumptionViolatedException class that you need Hamcrest to use, org.junit.Assume is the only way to satisfy that contract. Better would be to have AssumptionViolatedException be part of &quot;junit-core&quot;, not depending on Hamcrest, and letting Assume live in &quot;junit-assertions&quot; and handle the Hamcrest matching.<br/>\n&gt;<br/>\n&gt; I&#39;ll send more under separate cover, maybe as a GitHub issue, as this doesn&#39;t pertain so much to JUnit 4.11 beta 1 as it does a consideration for the next major version of JUnit. I think it&#39;d be interesting to explore segmenting JUnit into a multi-module project with dependencies teased out a bit.<br/>\n&gt;<br/>\n&gt; Thanks again for your excellent work and stewardship!<br/>\n&gt;<br/>\n&gt; --p<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a> &lt;mailto:junit%40yahoogroups.com&gt;, Marc Philipp &lt;mphilipp82@...&gt; wrote:<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; From my very personal point-of-view I cannot imagine using JUnit without<br/>\n&gt;  &gt; Hamcrest anymore.<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; @Paul: What would be the benefit of &quot;breaking the dependency&quot; entirely?<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; @Mirko: Why shouldn&#39;t you be able to use a different version of Hamcrest?<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; Regards, Marc<br/>\n&gt;  &gt;<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; [Non-text portions of this message have been removed]<br/>\n&gt;  &gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 24074, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1351810075", 
    "canDelete": false, 
    "nextInTopic": 24076, 
    "prevInTopic": 24074, 
    "headers": {
        "inReplyToHeader": "PGs2dW5yNCsxdW1hQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDUwOTJGQzFCLjEwNTA0MDJAYXNlcnQuY29tLmF1Pg==", 
        "referencesHeader": "PGs2dW5yNCsxdW1hQGVHcm91cHMuY29tPg=="
    }
}