{
    "topicId": 2411, 
    "postDate": "998332595", 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "from": "&quot;John Goalby&quot; &lt;jgoalby@...&gt;", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "E_VAXg3osZdRasIN8e3CuqCGabKPwp9HJctq2xW7MccsvG_AHr_PF9rKLL7sAhMN3CT3QGYHiDHyWGscz7xbxBhGJ6t4ErDOAfQ", 
    "nextInTime": 2413, 
    "userId": 0, 
    "prevInTime": 2411, 
    "prevInTopic": 2411, 
    "headers": {
        "messageIdInHeader": "PEY4MUlxdVBkYllwUlBjU0s0T2IwMDAxMWJiMkBob3RtYWlsLmNvbT4="
    }, 
    "authorName": "John Goalby", 
    "numMessagesInTopic": 2, 
    "msgSnippet": "Seems to me that the ideal solution is for 3rd party library creators to include their unit tests as part of their library. This not only gives more", 
    "contentTrasformed": false, 
    "msgId": 2412, 
    "nextInTopic": 0, 
    "systemMessage": false, 
    "rawEmail": "Return-Path: &lt;jgoalby@...&gt;\r\nX-Sender: jgoalby@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-7_3_1); 20 Aug 2001 18:41:31 -0000\r\nReceived: (qmail 99904 invoked from network); 20 Aug 2001 18:36:35 -0000\r\nReceived: from unknown (10.1.10.27)\n  by m8.onelist.org with QMQP; 20 Aug 2001 18:36:35 -0000\r\nReceived: from unknown (HELO hotmail.com) (216.33.149.81)\n  by mta2 with SMTP; 20 Aug 2001 18:36:35 -0000\r\nReceived: from mail pickup service by hotmail.com with Microsoft SMTPSVC;\n\t Mon, 20 Aug 2001 11:36:35 -0700\r\nReceived: from 63.227.223.70 by lw4fd.law4.hotmail.msn.com with HTTP;\tMon, 20 Aug 2001 18:36:35 GMT\r\nTo: junit@yahoogroups.com\r\nBcc: \r\nSubject: Re: [junit] RE: organizing tests, and third party libraries\r\nDate: Mon, 20 Aug 2001 11:36:35 -0700\r\nMime-Version: 1.0\r\nContent-Type: text/plain; format=flowed\r\nMessage-ID: &lt;F81IquPdbYpRPcSK4Ob00011bb2@...&gt;\r\nX-OriginalArrivalTime: 20 Aug 2001 18:36:35.0724 (UTC) FILETIME=[0A9A34C0:01C129A7]\r\nFrom: &quot;John Goalby&quot; &lt;jgoalby@...&gt;\r\n\r\nSeems to me that the ideal solution is for 3rd party library\ncreators to include their unit tests as part of their library.\n\nThis not only gives more credibility to the library but also\ngives developers using the library a source for sample code.\n\nI recently used junit for the first time on a smallish project.\nThe project was a kind of communications library.  It was to\nbe used inhouse.  I gave the code to the people that were\ngoing to be using the library.  I heard nothing from them. I\nwas worried that they weren&#39;t using the library.  It turns out\nthat they didn&#39;t need me as I had junit tests and javadocs.\nThey didn&#39;t find a single bug (not that there isn&#39;t any) and\nso had no issues.\n\nJohn.\n\n----Original Message Follows----\n &gt;Now I had a number of problems recently that I traced not to failure\n &gt;of my code to do what I thought it should do, but rather to\n &gt;discrepancies between the behavior of plain sockets and SSL sockets.\n &gt;In other words, the SSL libraries had bugs in them.[...]\n &gt;\n &gt;So then I thought maybe what I&#39;m trying to do here isn&#39;t really Unit\n &gt;Testing. [...]\n &gt;\n &gt;In retrospect, I can come up with a characterization of the problem\n &gt;and say that I made certain assumptions about the behavior of the\n &gt;sockets API.  Given that was the case, it would have been prudent of\n &gt;me to write (very simple) test cases that verify those assumptions,\n &gt;and run them on both plain and SSL sockets.  These tests, of course,\n &gt;would be very simple, and wouldn&#39;t involve any of my product code.\n &gt;\n &gt;Presumably if I tested the assumptions correctly in both cases, then I\n &gt;wouldn&#39;t have to test my code in both of its configurations (since\n &gt;from its point of view it&#39;s not really doing anything different in the\n &gt;two different cases).\n &gt;\n &gt;Is this another form of testing (&quot;Assumption Testing&quot;)?  Or perhaps\n &gt;another way to look at it is that I&#39;m a &quot;customer&quot; of the SSL library\n &gt;provider, and I need to have my own &quot;Acceptance Test&quot; of the\n &gt;functionality that I expect it to provide?\n\nYour tests of a third-party API are your acceptance tests of that API. If\nyou give them to the maker of the API, they can be their unit tests or their\nacceptance tests.\n\nI have found testing a third-party library to be extremely valuable...\nWhenever you get a new version of that third-party library, you can run all\nyour tests to see if the library makers have fixed known bugs, created new\nbugs, or changed assumptions....\n\nOnce you are confident of the third-party library&#39;s functionality, you could\nchoose to use Mock objects in the production code unit tests, or continue to\nuse the actual library objects.\n\n\n\n_________________________________________________________________\nGet your FREE download of MSN Explorer at http://explorer.msn.com/intl.asp\n\n\n", 
    "subject": "Re: [junit] RE: organizing tests, and third party libraries"
}