{
    "numMessagesInTopic": 8, 
    "nextInTime": 24134, 
    "senderId": "2ePOY8ZE0qC7GlR7men7jW06unNdZ_KiJ3f3wWjH-TBVMiCZW8EwWdJorvCTC8kMdL6dpVj9_eilC0NbhOPOuT45Hp-SQ9hmHfAn6-diKx7wisI", 
    "systemMessage": false, 
    "subject": "Re: [junit] junit in three IDEs", 
    "from": "Jaroslav Tulach &lt;jaroslav.tulach@...&gt;", 
    "authorName": "Jaroslav Tulach", 
    "msgSnippet": "Dear command line lover. Your request is special. It might match the NetBeans vision of the IDE reproducing to 100% everything that happens on command line.", 
    "msgId": 24133, 
    "profile": "jaroslavtulach", 
    "topicId": 24129, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 473773717, 
    "messageBody": "<div id=\"ygrps-yiv-144854084\">Dear command line lover.<br/>\nYour request is special. It might match the NetBeans vision of the IDE <br/>\nreproducing to 100% everything that happens on command line. Give it a try. <br/>\nNetBeans have excellent support for Maven, can deal quite well with (even 3rd <br/>\nparty created) Ant scripts and there is an experimental support for Gradle.<br/>\n<br/>\nHowever, this still requires your checkout is buildable from command line. <br/>\nChecking-out a single file and hoping the IDE will think-up the surrounding <br/>\nenvironment is beyond the scope of what NetBeans (and obviously any other IDE) <br/>\ncan do. <br/>\n<br/>\nWe are trying to aim at &quot;self describing sources&quot;: When you have (you have <br/>\nchecked out) sources that a (supported) command line tool can understood, <br/>\nNetBeans understands it as well.<br/>\n<br/>\n-jt<br/>\n<br/>\nDne Út 27. listopadu 2012 14:11:11, Fenn napsal(a):<br/>\n<blockquote><span title=\"qreply\"> &gt; hi folks,<br/>\n&gt; I am a old command-line loving unix geek, but I want to get trendy and<br/>\n&gt; learn at least one IDE.  Up until now vi+BASH has been my IDE of<br/>\n&gt; choice.  I also already program in about two dozen languages.<br/>\n&gt; To try out my sea legs I want to compare and contract Eclipse,<br/>\n&gt; Netbeans, and IntelliJ IDEA against the following use case:<br/>\n&gt; I need to grock some java code in an existing SVN repository.  I want<br/>\n&gt; to pull down one existing java file, write some junit tests, but not<br/>\n&gt; pull down the entire giant project it is attached to.  I may need some<br/>\n&gt; moch objects too just to get it to compile, and to make the junit<br/>\n&gt; tests work.<br/>\n&gt; Most of the how-to and intro stuff I can find on these IDEs starts<br/>\n&gt; with &quot;so you make your FIRST project, then pull down some menus, and<br/>\n&gt; the wonderful IDE helps you type in your FIRST java program, then if<br/>\n&gt; you really want to you can save the entire project in CVS!&quot;  This is<br/>\n&gt; hardly EVER the scenario I run into.  It is more likely I need to jump<br/>\n&gt; into the middle of thousands or millions of existing files and learn<br/>\n&gt; to swim without breaking anything, maybe even fix a bug or add a<br/>\n&gt; feature.<br/>\n&gt; <br/>\n&gt; Can anyone give me some tips on the &quot;best&quot; way to do this with his or<br/>\n&gt; her favorite IDE and some selection of plugins?<br/>\n&gt; <br/>\n&gt; Brian Fennell </span></blockquote></div>", 
    "prevInTime": 24132, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1354648952", 
    "canDelete": false, 
    "nextInTopic": 24134, 
    "prevInTopic": 24130, 
    "headers": {
        "inReplyToHeader": "PENBR0p3aTlqMWJOZ2pUWj1Ib0phMUxDNmZLdUhoZjhEcjE1d0x4N3l2anJMeHhIb19HUUBtYWlsLmdtYWlsLmNvbT4=", 
        "messageIdInHeader": "PDY5Mzc3MjQuSDNkcE42UnQwTUBsb2dvdXRpaz4=", 
        "referencesHeader": "PENBR0p3aTlqMWJOZ2pUWj1Ib0phMUxDNmZLdUhoZjhEcjE1d0x4N3l2anJMeHhIb19HUUBtYWlsLmdtYWlsLmNvbT4="
    }
}