{
    "numMessagesInTopic": 31, 
    "nextInTime": 24179, 
    "senderId": "aVy3Nk4D-HtSRlY2smu2XvSdVFJi_0L-IxZZHxU5Jkik8v5v1ewS9bYQig0OyOTb-uRU2Al8BVjWaeny4Kx7gkvO8O5KI_JYqCoD2Kjv_E_SqF_QTQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Is it Time for JUnit 5", 
    "from": "Malte Finsterwalder &lt;malte@...&gt;", 
    "authorName": "Malte Finsterwalder", 
    "msgSnippet": "Hi David, ... JUnit for me is still the de facto standard for unit testing in Java. It s integrated in all the major IDEs from the start. It s known by pretty", 
    "msgId": 24178, 
    "profile": "maltefinsterwalder", 
    "topicId": 24156, 
    "spamInfo": {
        "reason": "3", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 199072473, 
    "messageBody": "<div id=\"ygrps-yiv-1018738102\">Hi David,<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 18 December 2012 18:35, David Saff &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:saff@...\">saff@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Thinking more about this, I think that what defines JUnit, as Neale points<br/>\n&gt; out, is its philosophy, and the community of people who buy into that<br/>\n&gt; philosophy.  So I think that when considering a new version, we could<br/>\n&gt; certainly consider strongly following the design examples of other<br/>\n&gt; frameworks, like Jumi or others, but in the end, a JUnit 5 would be built<br/>\n&gt; piece by piece by submissions to this community.<br/>\n&gt;<br/>\n<br/>\nJUnit for me is still the de facto standard for unit testing in Java.<br/>\nIt&#39;s integrated in all the major IDEs from the start.<br/>\nIt&#39;s known by pretty much every Java Developer.<br/>\nEven if they don&#39;t use it or don&#39;t use it well, it&#39;s still the first unit<br/>\ntesting framework that comes to mind.<br/>\n<br/>\nThis has probably to do with the trust in the people who guide and develop<br/>\nJUnit. But I really don&#39;t know<br/>\nMoving towards JUnit 5 I think it will be hard to to loose this status, I<br/>\nthink.<br/>\n<br/>\nWhen it makes sense to use an existing library (and licences allow), I see<br/>\nno principal problem in reusing something like Jumi for JUnit 5.<br/>\nI have no idea, whether that makes sense at all, since I didn&#39;t look into<br/>\nJumi.<br/>\nI just don&#39;t think that JUnit 5 should necessarily be &quot;built piece by piece<br/>\nby submissions to this community&quot;.<br/>\nUsing Hamcrest inside JUnit 4 was a great move and it is an external<br/>\nlibrary.<br/>\n<br/>\n<br/>\n&gt; I think also that the compatibility between JUnit 3 and JUnit 4 was<br/>\n&gt; instrumental in making it useful for teams, and I&#39;d like to see a similar<br/>\n&gt; focus on backward compatibility moving forward.<br/>\n&gt;<br/>\n<br/>\nI also think, that backwards compatibility for executing JUnit 4 Tests at<br/>\nleast is a must.<br/>\nIf I can&#39;t gracefully migrate towards JUnit 5 I would have a problem and<br/>\nmany other as well.<br/>\nI&#39;m not sure whether we still need JUnit 3 support, though.<br/>\nJUnit 4 is old enough, that I think we could kill JUnit 3 if that makes<br/>\nthings easier.<br/>\n<br/>\n<br/>\n&gt; One last thought: one of the biggest confusions about JUnit 4 was the fact<br/>\n&gt; that it was both a version number referring to a new release of a software<br/>\n&gt; package, _and_ the only useful name for the collection of new libraries<br/>\n&gt; included in that release.  Starting in JUnit 5, I think a different naming<br/>\n&gt; scheme would be quite helpful.  Choosing a scheme that I&#39;m positive we<br/>\n&gt; _won&#39;t_ use, for example:<br/>\n&gt;<br/>\n&gt; - The runner and interfaces introduced in JUnit &lt;= 3 would be JUnit Cupcake<br/>\n&gt; - The runner and interfaces introduced in JUnit 4 would be JUnit Donut<br/>\n&gt; - The runner and interfaces introduced in JUnit 5 would be JUnit Eclair<br/>\n&gt;<br/>\n<br/>\nI think JUnit 4 was a great naming.<br/>\nI made clear, that the new software release also brough the new libraries.<br/>\nI don&#39;t see that as a problem.<br/>\n<br/>\nAnd doing the same with JUnit 5 would be consistent with that.<br/>\nSo when JUnit 5 changes the interface for tests and also brings a new<br/>\nrelease (of course) I would still call it JUnit 5 and everyone should know<br/>\nwhat&#39;s meant.<br/>\nI think it would be much more confusing If you started to introduce two<br/>\nnames. One for the software release version and one for the interface.<br/>\nThen I would have to say something like: I use JUnit 5 but I&#39;m writing<br/>\nJUnit Donut style tests? And who can remember those strange names anyways?<br/>\nDo you remember the last two names of Eclipse and can sort them? Or any<br/>\nother product that uses naming for that matter?<br/>\nI can&#39;t.<br/>\nBut I can easily remember JUnit 3, 4 and 5. And I have no problem in<br/>\nstating that I use JUnit 5 with JUnit 4 style tests.<br/>\n<br/>\nOn the other hand I strongly believe that, whatever you do, it will work<br/>\nout ok for two reasons:<br/>\n1) JUnit is just too established and too well known.<br/>\n2) I trust in Kent and you, to stear JUnit in a good direction and to<br/>\nlisten to the community.<br/>\n<br/>\nGreetings,<br/>\n   Malte<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 24177, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1355911072", 
    "canDelete": false, 
    "nextInTopic": 24180, 
    "prevInTopic": 24174, 
    "headers": {
        "inReplyToHeader": "PENBTHJ3LVB5N0Jqd1VMYmkrOTQ5WUpGdTBDNGR2M3RmNXNpZXl2akMwQ3R0PWczekZ0UUBtYWlsLmdtYWlsLmNvbT4=", 
        "messageIdInHeader": "PENBTFMxMi1NNS1Qbm8xb3JlKzQ2MWFUbTlpa1pIPXNKOVhIYnZ5LV91UG40ZG1TRDBlZ0BtYWlsLmdtYWlsLmNvbT4=", 
        "referencesHeader": "PGthNms0ays1NHBiQGVHcm91cHMuY29tPgk8Q0FMcnctUHhwN1VUb2g1TlEwY3ZHZkxuNjI3bmMtK2tUM1JoQWFtcnlvRl9xRVYyRVR3QG1haWwuZ21haWwuY29tPgk8NTBDOTA3RjAuNjAzMDEwN0BnbWFpbC5jb20+CTxDQUxydy1QeFBkOEJ0ZFk9RlVNU1NLWmJyMzI5RTdaTTJuSGdwZEVQR1J1MjFORnNjUEFAbWFpbC5nbWFpbC5jb20+CTw1MENBNzM5MC42MDMwODA3QGdtYWlsLmNvbT4JPDUwQ0YwNTMyLjgwNDAwMDNAb3BlbmNyZWRvLmNvbT4JPENBTHJ3LVB5N0Jqd1VMYmkrOTQ5WUpGdTBDNGR2M3RmNXNpZXl2akMwQ3R0PWczekZ0UUBtYWlsLmdtYWlsLmNvbT4="
    }
}