{
    "numMessagesInTopic": 31, 
    "nextInTime": 24175, 
    "senderId": "5GqmEQrYkOXHxeC1yXxj29AwbOg5bHY1QrGBhyty9RuQF2z1ljX8EetKxUqSh3tz-9wKwGv2j5guGv_2d-p0q8vRFA", 
    "systemMessage": false, 
    "subject": "Re: [junit] Is it Time for JUnit 5", 
    "from": "David Saff &lt;saff@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "Thinking more about this, I think that what defines JUnit, as Neale points out, is its philosophy, and the community of people who buy into that philosophy.", 
    "msgId": 24174, 
    "profile": "saffatgoogle", 
    "topicId": 24156, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 525765722, 
    "messageBody": "<div id=\"ygrps-yiv-1585713088\">Thinking more about this, I think that what defines JUnit, as Neale points<br/>\nout, is its philosophy, and the community of people who buy into that<br/>\nphilosophy.  So I think that when considering a new version, we could<br/>\ncertainly consider strongly following the design examples of other<br/>\nframeworks, like Jumi or others, but in the end, a JUnit 5 would be built<br/>\npiece by piece by submissions to this community.<br/>\n<br/>\nI think also that the compatibility between JUnit 3 and JUnit 4 was<br/>\ninstrumental in making it useful for teams, and I&#39;d like to see a similar<br/>\nfocus on backward compatibility moving forward.<br/>\n<br/>\nOne last thought: one of the biggest confusions about JUnit 4 was the fact<br/>\nthat it was both a version number referring to a new release of a software<br/>\npackage, _and_ the only useful name for the collection of new libraries<br/>\nincluded in that release.  Starting in JUnit 5, I think a different naming<br/>\nscheme would be quite helpful.  Choosing a scheme that I&#39;m positive we<br/>\n_won&#39;t_ use, for example:<br/>\n<br/>\n- The runner and interfaces introduced in JUnit &lt;= 3 would be JUnit Cupcake<br/>\n- The runner and interfaces introduced in JUnit 4 would be JUnit Donut<br/>\n- The runner and interfaces introduced in JUnit 5 would be JUnit Eclair<br/>\n<br/>\nThanks,<br/>\n<br/>\n   David<br/>\n<br/>\n<br/>\nOn Mon, Dec 17, 2012 at 6:42 AM, Neale Upstone<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:neale.upstone@...\">neale.upstone@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On 14/12/12 00:32, Esko Luontola wrote:<br/>\n&gt; &gt; David Saff wrote on 13.12.2012 17:47:<br/>\n&gt; &gt;&gt; There&#39;s been a lot of things we&#39;ve wanted to do<br/>\n&gt; &gt;&gt; all along with JUnit that I&#39;ve designed first in my head the way they<br/>\n&gt; would<br/>\n&gt; &gt;&gt; have worked in a language with lambdas, and then redesigned to fit the<br/>\n&gt; &gt;&gt; grain of a lambda-less language. Assertions (and mocks) have especially<br/>\n&gt; &gt;&gt; contorted themselves in ways that they might finally now be able to<br/>\n&gt; relax.<br/>\n&gt; &gt; Yes, assertions could probably get much benefit from lambdas.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I support the idea of having assertions as a separate library which is<br/>\n&gt; &gt; decoupled from the testing framework (the same way as Hamcrest,<br/>\n&gt; &gt; FEST-Assert and probably others). The testing framework would then focus<br/>\n&gt; &gt; fully on the test execution model (e.g. test isolation, execution order,<br/>\n&gt; &gt; rules and other metaprogramming).<br/>\n&gt; +1 : Separate library would certainly help those of us who are trying to<br/>\n&gt; manage large teams and to ensure they do things like use<br/>\n&gt; assertThat(blah, is(blah)) instead of assertEquals(blah, blah)<br/>\n&gt; (assertThat is type safe for refactoring, where assertEquals isn&#39;t)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; There is wide variablity in how assertions can be done (especially in<br/>\n&gt; &gt; different languages). I don&#39;t have strong opinions about what an assert<br/>\n&gt; &gt; should be like, and seems that there are as many kinds of asserts as<br/>\n&gt; &gt; there are testing frameworks.<br/>\n&gt; &gt;<br/>\n&gt; &gt; There is less variablity in testing frameworks&#39; execution model, but<br/>\n&gt; &gt; those differences are often at a more fundamental level (e.g. test<br/>\n&gt; &gt; isolation vs. shared state). I and others hold strong opinions about<br/>\n&gt; them.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Thus I would like to be able to mix and match the frameworks and<br/>\n&gt; &gt; assertions separately, sometimes even using multiple assertion libraries<br/>\n&gt; &gt; in the same test.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;&gt; - The fact that a Description is both the immutable single name of a<br/>\n&gt; test<br/>\n&gt; &gt;&gt; node, and a mutable builder for the test structure, and then later an<br/>\n&gt; &gt;&gt; immutable reference for the test structure, is exasperating.<br/>\n&gt; &gt;&gt; - The reliance on reflectively-discovered constructors for extensibility<br/>\n&gt; &gt;&gt; causes some awkwardness.<br/>\n&gt; &gt;&gt; - The IDE-centric idea that one should be enable to enumerate all tests<br/>\n&gt; &gt;&gt; before any is run places some binding constraints, and should be at most<br/>\n&gt; &gt;&gt; optional in a world in which tests are often run by daemons many more<br/>\n&gt; times<br/>\n&gt; &gt;&gt; a day than by humans.<br/>\n&gt; &gt; I&#39;ve noticed those as well. I&#39;ve already addressed each of those in Jumi:<br/>\n&gt; &gt;<br/>\n&gt; &gt; - A testing framework must assign a unique immutable TestId for each<br/>\n&gt; &gt; test in a test class, which is then used to send events of when the test<br/>\n&gt; &gt; was started, finished, failed etc. The TestId implies a tree structure<br/>\n&gt; &gt; of tests (to be used in test result reports). Everything is expressed as<br/>\n&gt; &gt; immutable events (Jumi relies heavily on Event Sourcing). See details at<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://jumi.fi/api/jumi-api/fi/jumi/api/drivers/SuiteNotifier.html\">http://jumi.fi/api/jumi-api/fi/jumi/api/drivers/SuiteNotifier.html</a><br/>\n&gt; &gt;<br/>\n&gt; &gt; - The fi.jumi.api.drivers.Driver which corresponds<br/>\n&gt; &gt; org.junit.runner.Runner requires a zero-argument constructor. The test<br/>\n&gt; &gt; class et al is passed as method argument to<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://jumi.fi/api/jumi-api/fi/jumi/api/drivers/Driver.html#findTests\">http://jumi.fi/api/jumi-api/fi/jumi/api/drivers/Driver.html#findTests</a><br/>\n&gt; &gt;<br/>\n&gt; &gt; - Jumi starts executing tests as soon as possible, at both the suite and<br/>\n&gt; &gt; test class levels. At suite level, test class execution starts<br/>\n&gt; &gt; asynchronously before all test classes are discovered (i.e. before Jumi<br/>\n&gt; &gt; has finished traversing the directories containing test classes). At<br/>\n&gt; &gt; test class level, more tests can be found during test execution (for<br/>\n&gt; &gt; example Specsy requires this) and the new test executions can be started<br/>\n&gt; &gt; asynchronously in parallel (depending on the testing framework and<br/>\n&gt; &gt; whether the user has disabled parallelism for that test class or the<br/>\n&gt; &gt; whole suite).<br/>\n&gt; Nice! I like the idea of getting on with probably CPU bound stuff while<br/>\n&gt; may be IO bound on class scan<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;&gt; - There are as many perfect models of test status possibilities as there<br/>\n&gt; &gt;&gt; are developers. Passed/Failed? Passed/Failed/Skipped?<br/>\n&gt; &gt;&gt; Passed/Failed/Ignored, etc. The current design bakes one required system<br/>\n&gt; &gt;&gt; pretty deep into the internals, unnecessarily.<br/>\n&gt; &gt; That&#39;s been on my mind for a long time, but I haven&#39;t yet figured out a<br/>\n&gt; &gt; good way to support all the variations, so I&#39;m deferring the decision. I<br/>\n&gt; &gt; would love to hear your ideas.<br/>\n&gt; &gt;<br/>\n&gt; &gt; A very flexible way would be to allow tagging tests with arbitrary<br/>\n&gt; &gt; keywords, but then the problem will be that how each of those keywords<br/>\n&gt; &gt; should affect the user interface. There would have to be at least some<br/>\n&gt; &gt; keywords with specific meaning, which brings us back to the original<br/>\n&gt; &gt; question of which states to support.<br/>\n&gt; &gt;<br/>\n&gt; &gt; To get started we could list all the variations in use today and the use<br/>\n&gt; &gt; cases for using each of them (e.g. it&#39;s an acceptance tests for a<br/>\n&gt; &gt; feature which has not yet been implemented). I&#39;m hoping there to be 5 or<br/>\n&gt; &gt; less different reasons that are served by test statuses.<br/>\n&gt; I&#39;d love to see status improvements. A classic case is assumptions. We<br/>\n&gt; want to show failed assumptions on our Jenkins dashboard.<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;&gt; Now, should the framework to which I&#39;d contribute time to fix these<br/>\n&gt; &gt;&gt; problems be called JUnit 5, or something entirely different? That&#39;s<br/>\n&gt; &gt;&gt; another kettle of fish, with some interesting options to consider. Looks<br/>\n&gt; &gt;&gt; like we have at least 9 months to consider them at length.<br/>\n&gt; &gt; 9 months, like giving birth to a baby. I suppose the names of quite many<br/>\n&gt; &gt; people have been pondered for that long. :)<br/>\n&gt; &gt;<br/>\n&gt; &gt; JUnit&#39;s name is well known, so it&#39;s a marketing bonus. On the other<br/>\n&gt; &gt; hand, the software industry moves quickly and good technology can get<br/>\n&gt; &gt; popular regardless of its name.<br/>\n&gt; &gt;<br/>\n&gt; I think JUnit has a philosophy of simplicity. Delivering more<br/>\n&gt; simplicity would be worthy of the name JUnit 5 (or should 5,6,7 be<br/>\n&gt; skipped and call it JUnit 8 ;) )<br/>\n&gt;<br/>\n&gt; Neale<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 24173, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1355852124", 
    "canDelete": false, 
    "nextInTopic": 24178, 
    "prevInTopic": 24172, 
    "headers": {
        "inReplyToHeader": "PDUwQ0YwNTMyLjgwNDAwMDNAb3BlbmNyZWRvLmNvbT4=", 
        "messageIdInHeader": "PENBTHJ3LVB5N0Jqd1VMYmkrOTQ5WUpGdTBDNGR2M3RmNXNpZXl2akMwQ3R0PWczekZ0UUBtYWlsLmdtYWlsLmNvbT4=", 
        "referencesHeader": "PGthNms0ays1NHBiQGVHcm91cHMuY29tPiA8Q0FMcnctUHhwN1VUb2g1TlEwY3ZHZkxuNjI3bmMtK2tUM1JoQWFtcnlvRl9xRVYyRVR3QG1haWwuZ21haWwuY29tPiA8NTBDOTA3RjAuNjAzMDEwN0BnbWFpbC5jb20+IDxDQUxydy1QeFBkOEJ0ZFk9RlVNU1NLWmJyMzI5RTdaTTJuSGdwZEVQR1J1MjFORnNjUEFAbWFpbC5nbWFpbC5jb20+IDw1MENBNzM5MC42MDMwODA3QGdtYWlsLmNvbT4gPDUwQ0YwNTMyLjgwNDAwMDNAb3BlbmNyZWRvLmNvbT4="
    }
}