{
    "numMessagesInTopic": 30, 
    "nextInTime": 24288, 
    "senderId": "dswmRi1Npk7fHYbhl5_xBL58pHDGw-SPL4PICebhHs3IF4869lCAVmdN1kE7mAV7H1OzKKG2XGVgBNxtCr0AdSjM7oj0b62D", 
    "systemMessage": false, 
    "subject": "Re: [junit] Feedback requested: Impending changes to RunListener", 
    "from": "Kevin Cooney &lt;kcooney@...&gt;", 
    "authorName": "Kevin Cooney", 
    "msgSnippet": "Sorry in advance if this is too wordy . Getting an API correct is hard work, and the discussion helps. ... Given the thread so far, I d be highly surprised if", 
    "msgId": 24287, 
    "profile": "kevincooney2000", 
    "topicId": 24274, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 475263748, 
    "messageBody": "<div id=\"ygrps-yiv-595090136\">Sorry in advance if this is &quot;too wordy&quot;. Getting an API correct is hard<br/>\nwork, and the discussion helps.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Feb 7, 2013 at 6:28 AM, Gilles Scokart &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gscokart@...\">gscokart@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Why not simply add an optional interface ThreadSafeRunListener (with the<br/>\n&gt; same method name or without method)?  The burdon on the provider is even<br/>\n&gt; smaller than with the annotation (they just have to add an implements<br/>\n&gt; clause, and don&#39;t need to add a dependency).<br/>\n&gt;<br/>\n<br/>\nGiven the thread so far, I&#39;d be highly surprised if we decided to add a new<br/>\ndependency. If we go with using an annotation, we would have an annotation<br/>\nprovided with JUnit that you could use. Does that change your view?<br/>\n<br/>\nRunListener is an abstract class, not an interface (which has been handy<br/>\nwhen we&#39;ve wanted to add new notification methods) so I&#39;m not sure if<br/>\nhaving a ThreadSafeRunListener interface makes sense. We could have<br/>\nThreadSafeRunListener which is a subclass of RunListener with no additional<br/>\nmethods.<br/>\n<br/>\n<br/>\n&gt;<br/>\n&gt; But before, you should be sure that the trouble is on having multiple<br/>\n&gt; concurrent calls to a single listener, or not having trouble iterating<br/>\n&gt; throught the list of listners concurrently.<br/>\n&gt;<br/>\n<br/>\nFixing one without fixing the other is actually harder than fixing them<br/>\nboth. If there&#39;s a concern that we could break existing uses, we can ping<br/>\nthe thread when the changes stabilize a bit more.<br/>\n<br/>\n<br/>\n&gt;<br/>\n&gt; Note also that it is usually a bad idea to call a &quot;Listener&quot; while holding<br/>\n&gt; a lock.  So the ThreadSafe listener should be strongly recommended and the<br/>\n&gt; non thread safe version should be deprecated.<br/>\n&gt;<br/>\n<br/>\nI&#39;m not sure I agree (but I&#39;m very interested in others thoughts). JUnit is<br/>\nused by all types of users, from novice to advanced. It is often the first<br/>\nand only third-party library a novice user uses. Novice users are highly<br/>\nlikely to not handle thread-safety issues. Thread-safety issues in a<br/>\nlistener could lead to all sorts of confusing results. I think we need to<br/>\nmake it easy for novice users to add listeners without worrying about<br/>\nthread-safety issues, and possible for advanced users to have thread-safe<br/>\nlisteners.<br/>\n<br/>\nWe could limit the scope of the lock we use for non-thread-safe listeners.<br/>\nCurrently, it&#39;s essentially a global lock. We could make the lock<br/>\nper-listener, but that might result in user-visible behavior changes.<br/>\n<br/>\nThanks for the feedback. Keep it coming!<br/>\n<br/>\n-- Kevin<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 24286, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1360259966", 
    "canDelete": false, 
    "nextInTopic": 24288, 
    "prevInTopic": 24282, 
    "headers": {
        "inReplyToHeader": "PENBRExSNVhKSkg0K083VTFvaHQxZEc0V3BYaHJiPXhqNUU9dTBkT2lLU2NtcFM9WXhxUUBtYWlsLmdtYWlsLmNvbT4=", 
        "messageIdInHeader": "PENBQTNFK2VYa0dtZnJCZlhnTnVVRj1vRnVfNTM4ZHBYYlNpLWRnYj1GU1dWTnhYelYrQUBtYWlsLmdtYWlsLmNvbT4=", 
        "referencesHeader": "PENBQTNFK2VYcUY2RE5RYzByNUhla2oxZ0UtUHlCbnZqNF9UTmJWZ1JVbytFZWt4d2hqd0BtYWlsLmdtYWlsLmNvbT4gPENBRExSNVhKSkg0K083VTFvaHQxZEc0V3BYaHJiPXhqNUU9dTBkT2lLU2NtcFM9WXhxUUBtYWlsLmdtYWlsLmNvbT4="
    }
}