{
    "numMessagesInTopic": 1, 
    "nextInTime": 2434, 
    "senderId": "aO9xVRf1UkveC6jqtEfXemKrXZuxJj0CQwI_7Pxj710q2Yhj5JlXH0GZrT02mTC6ak0z8EW439FpqAzjOg7h1D8ZgCnSGl_HG-U", 
    "systemMessage": false, 
    "subject": "manually constructing suites has never been so sweet", 
    "from": "Shane Celis &lt;shane@...&gt;", 
    "authorName": "Shane Celis", 
    "msgSnippet": "I m currently using Junit to do integration testing (or functional testing), rather than unit testing. This involves a number of differences from what the", 
    "msgId": 2433, 
    "topicId": 2433, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-167791217\">I&#39;m currently using Junit to do integration testing (or functional testing),<br/>\nrather than unit testing. This involves a number of differences from what<br/>\nthe standard Junit methodology would suggest. It&#39;s important to understand<br/>\nthat the modifications I&#39;ve made aren&#39;t necessarily applicable to everyone<br/>\nwho&#39;s doing unit testing, but for those of you out there who feel that<br/>\nsometimes Junit gets in the way of doing other sorts of testing this may<br/>\nhelp. For anyone stricly doing unit testing and that relies on their suites<br/>\nbeing dynamically generated by the testrunner, these refinements probably<br/>\nwon&#39;t be of any use to you.<br/>\n<br/>\nFor instance, a lot of the information my tests require isn&#39;t available<br/>\nuntil the test is run or is generated during runtime and needs to be passed<br/>\nbetween the tests. Fixtures are not really applicable to this sort of<br/>\ntesting. Another thing that began to happen was I started mangling my own<br/>\ntest method names in a sort of ad hoc way of passing arguments to the tests.<br/>\nTo try and fix these two situations, I&#39;ve made the following extensions to<br/>\nJunit. <br/>\n<br/>\n* One test object for a series of tests (rather than the standard one test<br/>\ninstance per test) <br/>\n* Call test methods with arguments <br/>\n<br/>\nFor me this makes the feel of Junit much more natural. It also provides<br/>\ncompile time checks that wouldn&#39;t normally happen until runtime. This is<br/>\nmade possible by Proxies for classes ( <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gnufoo.org/jcfe/index.html\">http://www.gnufoo.org/jcfe/index.html</a><br/>\n). <br/>\n<br/>\nThese two pieces of code should illustrate the difference. Old Style: <br/>\n<br/>\nTestSuite suite = new TestSuite();<br/>\nsuite.add(new TestTest(&quot;testPassed&quot;));<br/>\nsuite.add(new TestTest(&quot;testFailed&quot;));<br/>\nsuite.add(new TestTest(&quot;testErrored&quot;));<br/>\n// can&#39;t do this with the current TestCase in Junit<br/>\n// suite.add(new TestTest(&quot;testArgs&quot;, new Object[] { &quot;ugly&quot; }));<br/>\nreturn suite;<br/>\n<br/>\nNew Style: <br/>\n<br/>\nProxyTestSuite suite = new ProxyTestSuite();<br/>\n//suite.oneTestInstancePerTest(false);<br/>\nTestTest tc = (TestTest) suite.getTestProxy(new TestTest());<br/>\ntc.testPassed();<br/>\ntc.testFailed();<br/>\ntc.testErrored();<br/>\n// TestProxies can accept arguments<br/>\n// tc.testArgs(&quot;pretty&quot;);<br/>\nreturn suite;<br/>\n<br/>\nThese two pieces of code are effectively the same (neglecting the commented<br/>\nout testlet that accepts arguments), except one is cleaner, easier to read<br/>\nin my opinion, and has more checks that happen at compile time. Also the new<br/>\nstyle allows for one to optionally choose between one test instance per test<br/>\n(default) or one test instance for all tests of that type. <br/>\n<br/>\nThe source is available at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gnufoo.org/junit/index.html\">http://www.gnufoo.org/junit/index.html</a> The<br/>\ncontent of which is basically copied in this email.  The dynamic proxies of<br/>\nclasses might be useful for creating mock objects that don&#39;t conform to an<br/>\ninterface as well.  <br/>\n<br/>\n-shane</div>", 
    "prevInTime": 2432, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "998421702", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDE3MUQzODFGQjREMkQzMTE5OThCMDBEMEI3M0VBQjEwODE4RDQ2QHhjZnRlY2guY29tPg=="
    }
}