{
    "numMessagesInTopic": 15, 
    "nextInTime": 2436, 
    "senderId": "1psB9l1eHB45gR_QIEuwJNKtpDCVI0aZ3J1GADo-oAYmXA2LImwoeo-_fNANVotfz6InNzwgks8kDaF-7KczLB0LuFZwTsDd", 
    "systemMessage": false, 
    "subject": "Re: [junit] About mock object :!", 
    "from": "&quot;Steve Freeman&quot; &lt;steve@...&gt;", 
    "authorName": "Steve Freeman", 
    "msgSnippet": "Thanks for your interest. We ve started a couple of mailing lists on the mockobjects site. Adding mock implementations to a class can be painful and is a good", 
    "msgId": 2435, 
    "topicId": 2404, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-170655542\">Thanks for your interest. We&#39;ve started a couple of mailing lists on the mockobjects site. \r<br/>\n\r<br/>\nAdding mock implementations to a class can be painful and is a good test of the quality of the code (and, sometimes, of your decompiler). The secret is to be completely ruthless about implementing only the methods that you need, rather than reproducing the original behaviour. If you have the option, some gentle refactoring can often get you through -- particularly hiding the creation of objects so that you can intervene and substitute a mock. \r<br/>\n\r<br/>\nxpdeveloper is now up after a network failure.\r<br/>\n\r<br/>\nSteve\r<br/>\n\r<br/>\nFrom: &quot;Shane Duan&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sduan@...\">sduan@...</a>&gt;\r<br/>\n<blockquote><span title=\"qreply\"> &gt; This is also something I am working on these days.\r<br/>\n&gt; \r<br/>\n&gt; I think the correct statement should be &#39;If you don&#39;t want to bother writing mock object code, You can only mock object it from\r<br/>\n&gt; interface&#39;.  That&#39;s because interface is just a collection of methods, so they are relatively easier.  It turned out that the code\r<br/>\n&gt; for writing mock objects FOR INTERFACE can be refactored so came the EasyMock(<a rel=\"nofollow\" target=\"_blank\" href=\"http://tammofreese.de/easymock/index.html)\">http://tammofreese.de/easymock/index.html)</a> and\r<br/>\n&gt; MockMaker (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.xpdeveloper.com/cgi-bin/wiki.cgi?MockMaker)\">http://www.xpdeveloper.com/cgi-bin/wiki.cgi?MockMaker)</a>.\r<br/>\n&gt; \r<br/>\n&gt; As for mock objects for classes, things are a lot harder.  For example, the first thing I have encountered is how to call the super\r<br/>\n&gt; constructor from the mock objects and pass the valid parameters.  And the static methods, singletons just make things almost\r<br/>\n&gt; impossible.  After several struggles, I now understand anti-pattern a lot better. :)\r<br/>\n&gt; \r<br/>\n&gt; There are two sites I have found so far:\r<br/>\n&gt; MockObjects (<a rel=\"nofollow\" target=\"_blank\" href=\"http://mockobjects.sourceforge.net/index.html)\">http://mockobjects.sourceforge.net/index.html)</a> and\r<br/>\n&gt; ExtendObjects (The link is on MockMaker page but somehow the XDeveloper is download since last Saturday).  I haven&#39;t had chance to\r<br/>\n&gt; go through the latter and the MockObjects is creating a library of mock objects, which is the best solution I have seen so far.\r<br/>\n&gt; \r<br/>\n&gt; I have grown great interest in mock objects and I would like to share the experience with fellow developers, as long as this is not\r<br/>\n&gt; off the topic. </span></blockquote></div>", 
    "prevInTime": 2434, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "998438474", 
    "canDelete": false, 
    "nextInTopic": 2436, 
    "prevInTopic": 2410, 
    "headers": {
        "messageIdInHeader": "PDAyZWIwMWMxMmFhMCQ1ZTBiMDkwMCQwMTAwMDA1YUBnYXRld2F5Pg==", 
        "referencesHeader": "PDlscWxldis1NGtnQGVHcm91cHMuY29tPiA8M0I4MTNCREIuOUQ0MDA3RTdAYm9ybGFuZC5jb20+"
    }
}