{
    "numMessagesInTopic": 5, 
    "nextInTime": 24377, 
    "senderId": "loM3ZsxdxVve2lFmG6jHJnw9IqGAaKVnVTuj01qdL9l94bYHTRaqDb3GXBUt-gI73oLk2ROhiRkKhR7p45b2wSagR2-ZoJAUP8QoaiiJEioU16Gyr9Zo1AktdNx6LpI", 
    "systemMessage": true, 
    "subject": "Re: [junit] Externally activated (global) rules", 
    "from": "=?ISO-8859-1?Q?Henning_Gro=DF?= &lt;igaffai@...&gt;", 
    "authorName": "Henning Groß", 
    "msgSnippet": "Hi Kevin! Thank you very much for your feedback! First some words to the environment: In the project I need the feature we currently have 9 developers and it ", 
    "msgId": 24376, 
    "profile": "henninggro", 
    "topicId": 24374, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 547300611, 
    "messageBody": "<div id=\"ygrps-yiv-1744408366\">Hi Kevin!<br/>\nThank you very much for your feedback! First some words to the environment:<br/>\n<br/>\nIn the project I need the feature we currently have 9 developers and it<br/>\nmight be more. Even freelancers. There are something around 20k tests. What<br/>\nwe want to achieve is to enable a global timeout rule that applies<br/>\ndifferent timeouts to tests depending on their category (eg SlowTests.class<br/>\nmay take longer than other tests). Also there are other things to take into<br/>\nconsideration (eg is some context already loaded, otherwise the timeout<br/>\nwill be increased).<br/>\nThis rule already exists and is registered in some abstract base class. Its<br/>\nworking fine.<br/>\nHaving this amount of tests makes it very hard to make sure that every<br/>\nclass is annotated with it. Also not all tests inherit from the abstract<br/>\ntest class and I would like to keep it that way. It would be just some work<br/>\nto put the rule in every test but what about tests written in the future.<br/>\nI need to make sure that the rule is applied to every test especially when<br/>\nthe developer forgets about it. Its a rule that is intended to avoid<br/>\ndevelopers slowing down jenkins build by writing slow tests without<br/>\nannotating them as such.<br/>\n<br/>\nThat said using a different runner is not an option. Also we already have a<br/>\nhard time mixing spring-runner, mockito-runner, junitparam-runner (btw<br/>\nwe/you should copy some of that behaviour as it is a lot more flexible than<br/>\njunit parameterized test [1])) aso-behaviour (btw: we/you need to think<br/>\nabout the runner-concept. it would be a lot better to have one runner and<br/>\nregistering behaviour to it (eg being able to register as many &quot;runners&quot; as<br/>\nI want to).<br/>\n<br/>\nScanning classpath is a good thing. We already use classpathsuite [2]. That<br/>\nenables us to create suites without having to specify all classes in it<br/>\n(another feature that would very well fit junit). We could for example<br/>\nannotate a rule with a classifier (basepacke, package or package.classname)<br/>\nand it would get applied to everything that matches. But this kind of<br/>\nbehaviour would introduce a completely new way of configuration to junit (a<br/>\nlittle cdi/spring-ish). Maybe it would be a good idea to overthink the<br/>\njunit-concept leading this direction anyway but I get the feeling its a<br/>\nlittle too much for this concern.<br/>\n<br/>\nAt last I do not think the external switch is a problem as its highly<br/>\noptional. If you use it, you know what you are doing. Dont you think so?<br/>\n<br/>\n[1] <a rel=\"nofollow\" target=\"_blank\" href=\"https://code.google.com/p/junitparams/\">https://code.google.com/p/junitparams/</a><br/>\n[2] <a rel=\"nofollow\" target=\"_blank\" href=\"http://johanneslink.net/projects/cpsuite.jsp\">http://johanneslink.net/projects/cpsuite.jsp</a><br/>\n<br/>\n<br/>\n2013/4/29 Kevin Cooney &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kcooney@...\">kcooney@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Henning,<br/>\n&gt;<br/>\n&gt; Sorry for the lack of response. JUnit is maintained by volunteers, and<br/>\n&gt; sometimes our day jobs get busy. I was waiting for David to respond (I am a<br/>\n&gt; sometimes contributor) but here are my thoughts.<br/>\n&gt;<br/>\n&gt; This is an interesting idea. Note that you could get what you want with a<br/>\n&gt; custom runner.<br/>\n&gt;<br/>\n&gt; My concern with adding Rules via system properties that someone running the<br/>\n&gt; tests in their IDE would see different results compared to the test runs<br/>\n&gt; from Maven. Sure, you could tell your IDE to run the tests with the same<br/>\n&gt; system properties, but it would be unexpected for most people to have to<br/>\n&gt; take a special step to make the tests run the same way as they did in the<br/>\n&gt; continuous build.<br/>\n&gt;<br/>\n&gt; Could you find some way to define the global rules via code? Perhaps you<br/>\n&gt; could add a DynamicRule to all of your tests that could apply the addition<br/>\n&gt; rules. Alternatively, you could have a class in the same package as the<br/>\n&gt; tests that defined the global rules for tests in that package (though I&#39;m<br/>\n&gt; not sure there is a platform-independent way to scan all of the classes in<br/>\n&gt; a package that works for all runtime/deployment environments)<br/>\n&gt;<br/>\n&gt; -- Kevin<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Mon, Apr 29, 2013 at 7:09 AM, Henning Groß &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:igaffai@...\">igaffai@...</a><br/>\n&gt; &gt;wrote:<br/>\n&gt;<br/>\n&gt; &gt; **<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Hi!<br/>\n&gt; &gt; I have a use-case where I need to enable rules based on external<br/>\n&gt; &gt; parameters. Therefore I cannot activate them in code. I have submitted a<br/>\n&gt; &gt; pull request:<br/>\n&gt; &gt;<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"https://github.com/junit-team/junit/pull/668/files\">https://github.com/junit-team/junit/pull/668/files</a><br/>\n&gt; &gt;<br/>\n&gt; &gt; There are some little things to fix but its an easy and functional<br/>\n&gt; &gt; extension. Anyone mind to fix the code to a state that will get merged? I<br/>\n&gt; &gt; did not get any feedback until now. Whole team in holidays?<br/>\n&gt; &gt;<br/>\n&gt; &gt; Also I am wondering when 4.12 will be released. Any plans?<br/>\n&gt; &gt;<br/>\n&gt; &gt; Regards and thank you!<br/>\n&gt; &gt; Henning.<br/>\n&gt; &gt;<br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 24375, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1367306212", 
    "canDelete": false, 
    "nextInTopic": 24377, 
    "prevInTopic": 24375, 
    "headers": {
        "inReplyToHeader": "PENBQTNFK2VWblo0Uk9faEZORVNoWlRYOTdYRm1reWMxR1ppelc3UDZYcThxVlN2dU1WZ0BtYWlsLmdtYWlsLmNvbT4=", 
        "messageIdInHeader": "PENBTjY0VEdDLUFWeUwxS3RFVVh4Mm83ZVNSbVdfUGktQ182RXRFa01xVS1oQjErdHQxUUBtYWlsLmdtYWlsLmNvbT4=", 
        "referencesHeader": "PENBTjY0VEdEWlZaVysxNXhyUXhMVllhT3l5ZUQyRHljSjljeDJoVWFfeDcyUStQV2dvZ0BtYWlsLmdtYWlsLmNvbT4JPENBQTNFK2VWblo0Uk9faEZORVNoWlRYOTdYRm1reWMxR1ppelc3UDZYcThxVlN2dU1WZ0BtYWlsLmdtYWlsLmNvbT4="
    }
}