{
    "numMessagesInTopic": 3, 
    "nextInTime": 24410, 
    "senderId": "OgFAzQwGZDC0OAAv2JSRJGdm36ebRU8knfHqSt2nWIUj_9O0Bk1oZHNlG6sNdemL-Gm_yXHH4YrCYGTqHabb7hJRK3KUZiz8hL-rVEZNg1yQcrSPg1hJinw5ia-PKDU", 
    "systemMessage": false, 
    "subject": "Rework runner concept / intellij or eclipse formatter file?", 
    "from": "=?ISO-8859-1?Q?Henning_Gro=DF?= &lt;igaffai@...&gt;", 
    "authorName": "Henning Groß", 
    "msgSnippet": "I think the runner concept is one of the bigger flaws in junit. If you want a certain behaviour you need to use a specific runner. Often you will want more", 
    "msgId": 24409, 
    "profile": "henninggro", 
    "topicId": 24409, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 547300611, 
    "messageBody": "<div id=\"ygrps-yiv-614885083\">I think the runner concept is one of the bigger flaws in junit. If you want<br/>\na certain behaviour you need to use a specific runner. Often you will want<br/>\nmore than just one behaviour. For example you may want the spring runner<br/>\nwith junit and jparams behaviour. Sometimes you will find a way to makr<br/>\nthat work. Sometimes you just dont. A rework of the runner-concept,<br/>\nintroducing something like a chain for the behaviour-part would be a good<br/>\nidea, i guess. This could either be achieved by introducing a runner that<br/>\ndoes the work or by introducing this concept deeper into the framework. How<br/>\nare your thoughts on this? It could only work well when introduced to junit<br/>\nand the old concept would get marked deprecated as this makes<br/>\nrunner-providers like spring migrate to the new concept. I would be willing<br/>\nto give it a try and implement this if you think its a good idea. Another<br/>\nthing: anyone got junit formatter file?<br/>\nRegards, Henning<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 24408, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1372411103", 
    "canDelete": false, 
    "nextInTopic": 24410, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PENBTjY0VEdDcGVHckx1LTc1cz1MM3ZoSzlaT1UrWmpDd3FFZGFhMGNLN2lWZT1HZXA5QUBtYWlsLmdtYWlsLmNvbT4="
    }
}