{
    "numMessagesInTopic": 5, 
    "nextInTime": 24543, 
    "senderId": "H1VnowCZf8C0hsunEZifiOmtQLDOdF6CvYUYNUOk1fthrVDyVLF2dtOqbysDcvjyOHFBOftRh1AnVb7K", 
    "systemMessage": false, 
    "subject": "Re: [junit] New assertEquals() for Beans", 
    "from": "janschankin@...", 
    "authorName": "", 
    "msgSnippet": "Moin! We already have written a solution based on the java.bean-api which is part of the jdk. It just dives recursive into the object-tree and compares the", 
    "msgId": 24542, 
    "profile": "janschankin", 
    "topicId": 24539, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 562384088, 
    "messageBody": "<div id=\"ygrps-yiv-1772514614\">Moin!<br><br>We already have written a solution based on the java.bean-api which is part of the jdk. It just dives recursive into the object-tree and compares the properties. If a property is not equal, the property-name will be shown in the standard error / fail-message in junit. It already does what we want, but it is not open available right now and we would like to use that in several projects. <br><br>We could create a maven-artefact in our company-maven-repository, to make it available for all projects in our company, but we think this might be usefull for everyone. Also we think that this is quite a small change and it would be far more elegant to include this in junit itself instead of creating a new artifact that has only this single feature.<br>So we would like to contribute to junit by adding this to the Assert-class. <br><br>I hope that this is the correct group to get in touch with the junit-maintenance. I would be glad to discuss this in depth if you like the idea!<br><br>Greetings!<br>Jan</div>", 
    "prevInTime": 24540, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1400143622", 
    "canDelete": false, 
    "nextInTopic": 24543, 
    "prevInTopic": 24540, 
    "headers": {
        "inReplyToHeader": "PENBS2k0MjczUDUzbVdRT0VGbXZzU0pHejZDV2Jrckx3ZEFCOFRDPW9lOFRDV08tdXM1QUBtYWlsLmdtYWlsLmNvbT4=", 
        "messageIdInHeader": "PGxsMXV1NisxaGJlODBoQFlhaG9vR3JvdXBzLmNvbT4=", 
        "referencesHeader": "PGxsMDcwcysxc2YxaW1qQFlhaG9vR3JvdXBzLmNvbT4JPENBS2k0MjczUDUzbVdRT0VGbXZzU0pHejZDV2Jrckx3ZEFCOFRDPW9lOFRDV08tdXM1QUBtYWlsLmdtYWlsLmNvbT4="
    }
}