{
    "numMessagesInTopic": 15, 
    "nextInTime": 2456, 
    "senderId": "OpP-U6psOkMciD6NhYcszbOZRyV8JhMV4W10oNC1wPrOuhfhYh5Zu7reC0w7fRk2GI_WWEwo_p-o3zXGQmLVSBh6xatq", 
    "systemMessage": false, 
    "subject": "Re: Mocking classes (was RE: [junit] About mock object :!)", 
    "from": "Shane Duan &lt;sduan@...&gt;", 
    "authorName": "Shane Duan", 
    "msgSnippet": "I tried but I am in this situation: Say if you have two classes, Class1 and Class2 interating with each other.  Now you want to test Class1 so you build a mock", 
    "msgId": 2455, 
    "topicId": 2404, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1822103981\">I tried but I am in this situation:<br/>\n<br/>\nSay if you have two classes, Class1 and Class2 interating with each other.  Now you want to test Class1 so you build a mock for Class2.  And then you have a test case for<br/>\nClass2 using a mock for Class1. In this situation, you actually want to load MockClass1 when you test Class2, and load the real object Class1 when you are testing Class1,<br/>\nwhile your choice can only be either load MockClass1 or load Class1 all the time.  So the source tree won&#39;t work, because as long as you use default class loader, you either<br/>\nload Class1 all the time or MockClass1 all the time.<br/>\n<br/>\nSo class loaders might be a good idea, but things get pretty complicated when you have, say, 10 classes.  When you need to figure out what to load and what not to load, the<br/>\nwork just became too big, well, at least for me.  My initial motivation for using JUnit was to help me have more REAL work done for less effort, not to build some fancy<br/>\nclass loaders and testing framework.  Plus I wouldn&#39;t ever dream of convincing everyone to learn how to use class loader, which I am sure is way out of the job description.<br/>\n:)<br/>\n<br/>\nSo if I am going to spend a lot of time anyway, I&#39;d rather refactor the code to make the testing easy, and improve the design on the way.  I think this fits into &#39;simplest<br/>\npossible&#39; principle also.<br/>\n<br/>\n<br/>\nSteve Freeman wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Neil Swingler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nswingler@...\">nswingler@...</a>&gt; said:<br/>\n&gt;<br/>\n&gt; &gt; I did wonder about using classloaders to load mock versions of specified classes.<br/>\n&gt;<br/>\n&gt; That&#39;s an interesting idea.<br/>\n&gt;<br/>\n&gt; &gt; One possibility would be to use an alternative source tree for mock classes<br/>\n&gt; &gt; with the same fully qualified name.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Another possibility would be to load a class from a different package in the same source<br/>\n&gt; &gt; tree and rename it.<br/>\n&gt;<br/>\n&gt; One things that&#39;s important not to miss, however, is that the _process_ of using mock objects pushes the code towards a more compositional style (which is a Good Thing).<br/>\n&gt;<br/>\n&gt; Of course, sometimes you have to jump through hoops when working with third-party libraries.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a> </span></blockquote></div>", 
    "prevInTime": 2454, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "998508680", 
    "canDelete": false, 
    "nextInTopic": 2457, 
    "prevInTopic": 2438, 
    "headers": {
        "messageIdInHeader": "PDNCODQwODg4Ljk4MEI2MjNEQGJvcmxhbmQuY29tPg==", 
        "referencesHeader": "PDIwMDEwODIyMDgzOS5mN004ZDIzMTM5ODNAY2hpY2tlbi5va2NoaWNrZW4uY29tPg=="
    }
}