{
    "numMessagesInTopic": 18, 
    "nextInTime": 24580, 
    "senderId": "4rMcQDgc_SUa_8bHL4GPKKM5rKq6FUVTZeOZp-GAoyVBxOSsPK3nJx0soL896ai1rBu14uMEmRjMJVO8BiI", 
    "systemMessage": false, 
    "subject": "Re: JUnit 4.12-beta-1 is released", 
    "from": "devnullaccount@...", 
    "authorName": "", 
    "msgSnippet": "Hi, I ve tried porting an in-house runner that previously has been using 4.8 into 4.12-beta-1 and and I ve found no issues that must be fixed. So to me it", 
    "msgId": 24579, 
    "profile": "devnullaccount", 
    "topicId": 24572, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 563548509, 
    "messageBody": "<div id=\"ygrps-yiv-1369896506\">Hi,<br><br>I&#39;ve tried porting an in-house runner that previously has been using 4.8 into 4.12-beta-1 and and I&#39;ve found no issues that must be fixed. So to me it looks ready for release.<br><br>One thing that was slightly annoying is that instead of removing org.junit.internal.AssumptionViolatedException, you&#39;ve deprecated and duplicated it into org.junit.AssumptionViolatedException. This caused me some headache as we had code catching the former class type and suddenly it looked like assumptions had stopped working until I realized I had to change the import statement. For the future, I&#39;d prefer that you just remove the original class as then we&#39;ll get a compiler error instead of runtime failures.<br><br>And just as one extra data point: I&#39;m all in favor of you removing old deprecated classes as you&#39;ve done with the runner that another poster disagreed with. I had no problems at all with that part of the porting of our runner.<br><br>By the way, do you have any estimates on when 4.12 will be released? I&#39;m in progress of upgrading our junit-dependency and would like to do that to 4.12 directly and don&#39;t have to go to 4.11 and upgrade again in a month or two. So if you have an estimated release date, I can plan accordingly.<br><br>BR,<br>&nbsp; Chris</div>", 
    "prevInTime": 24578, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1407754441", 
    "canDelete": false, 
    "nextInTopic": 24580, 
    "prevInTopic": 24578, 
    "headers": {
        "inReplyToHeader": "PENBSGhZVko2WlRwVGFGNTBGWFA2d0tKNFc5Nmtjcj0rdVdRdWlLQjE9NzVhVjdFTk5IQUBtYWlsLmdtYWlsLmNvbT4=", 
        "messageIdInHeader": "PGxzYTdjOSsxaGo0ajNiQFlhaG9vR3JvdXBzLmNvbT4=", 
        "referencesHeader": "PENBSGhZVko2WlRwVGFGNTBGWFA2d0tKNFc5Nmtjcj0rdVdRdWlLQjE9NzVhVjdFTk5IQUBtYWlsLmdtYWlsLmNvbT4="
    }
}