{
    "numMessagesInTopic": 18, 
    "nextInTime": 24578, 
    "senderId": "I7n9whZVAQQquAHG6wKhvvGL1cKxHxCSrrv0g4rFpN1X6qNdxTksli4mRg4c6l6STQ54FYZuRLtiwX49Up79t361sxk-FbJJ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: JUnit 4.12-beta-1 is released", 
    "from": "Kevin Cooney &lt;kcooney@...&gt;", 
    "authorName": "Kevin Cooney", 
    "msgSnippet": "Hello, Henrik. Thanks for your feedback. My responses are inlined below On Mon, Aug 4, 2014 at 3:40 AM, hkaipe@ymail.com [junit] ", 
    "msgId": 24577, 
    "profile": "kevincooney2000", 
    "topicId": 24572, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 475263748, 
    "messageBody": "<div id=\"ygrps-yiv-1769073126\"><div dir=\"ltr\"><div class=\"ygrps-yiv-1769073126gmail_extra\"><div><div>Hello, Henrik. Thanks for your feedback. My responses are inlined below</div></div><br><blockquote><span title=\"qreply\"> <div class=\"ygrps-yiv-1769073126gmail_quote\">On Mon, Aug 4, 2014 at 3:40 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hkaipe@...\">hkaipe@...</a> [junit] <span dir=\"ltr\">&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>&gt;</span> wrote:<br>\n\n<blockquote class=\"ygrps-yiv-1769073126gmail_quote\" style=\"margin:0px 0px 0px 0.8ex;border-left-width:1px;border-left-color:rgb(204,204,204);border-left-style:solid;padding-left:1ex;\">\n\n\n<u></u>\n\n\n\n\n\n\n\n\n\n \n<div style=\"background-color:rgb(255,255,255);\">\n<span> </span>\n\n\n<div>\n  <div>\n\n\n    <div>\n      \n      \n      <p>Hello<br><br>I am sorry for trashing the party but I have a couple of concerns that are very likely to slow down the adoption of JUnit-4.12 among the providers of 3rd-party tools ...<br><br> --- 1) Don&#39;t remove JUnit4ClassRunner! (in package org.junit.internal.runners)<br>\n\n</p></div></div></div></div></blockquote><div>This was a hard choice. JUnit4ClassRunner was starting to become a maintenance burden. When evaluating our options, we realized that JUnit4ClassRunner has been deprecated for six years, and debated whether we should delete it.</div>\n\n<div><br></div><div>Things to note</div><div><br></div><div>- JUnit4ClassRunner was deprecated six years ago with a comment that we would delete it in the next JUnit version</div><div>- We are now releasing 4.12, which is seven versions after we said we would delete the class</div>\n\n<div>- BlockJUnit4ClassRunner the replacement for JUnit4ClassRunner) has been available since 4.5</div><div>- JUnit4ClassRunner isn&#39;t designed to be extended</div><div>- JUnit4ClassRunner doesn&#39;t support many features that are core parts of JUnit (particularly Rules)</div>\n\n<div><br></div><div>Given all these issues, we decided to delete these classes. Third party runners that still use JUnit4ClassRunner should migrate to BlockJUnit4ClassRunner and target 4.5.</div><div><br></div><div>Yes, some teams might have to wait for 3rd-party runners to upgrade to 4.5 APIs, and that might slow adoption for some projects. But the end result will be more third-party runners that will support Rules (and will hopefully automatically get other new features we might add).</div>\n\n<div><br></div><div>There may be a very small percentage of projects that want to upgrade their 3rd-party runner to get bug fixes but the next version of that runner requires 4.5 and the project hasn&#39;t upgraded JUnit since before 4.5 was released. Hopefully that is a small number of projects.</div>\n\n<div><br></div><div>In any case, the deleted classes are self-contained. Since JUnit is open source, 3rd-party runners are welcome to copy the deleted classes into their own package tree as long as they do it in a way that&#39;s compatible with our license. </div>\n\n<blockquote class=\"ygrps-yiv-1769073126gmail_quote\" style=\"margin:0px 0px 0px 0.8ex;border-left-width:1px;border-left-color:rgb(204,204,204);border-left-style:solid;padding-left:1ex;\"><div style=\"background-color:rgb(255,255,255);\"><div><div>\n<div>\n<p><br>I have developed a number of 3rd-party runnners myself and I want the JUnit community to know that as a 3rd-party runner developer you want the latest version of your runner to work with any version of JUnit! - Otherwise the end-users (test-developers) will be less likely to start using your runner because they probably don&#39;t want to deal with the version-conflict hell that might raise between JUnit and your 3rd-party runner.<br>\n\n<br>A couple of good examples are the 3rd-party runners MockitoJUnitRunner (from Mockito - <a rel=\"nofollow\" target=\"_blank\" href=\"http://mockito.org\">http://mockito.org</a>) and CallbackParamsRunner (from CallbackParams - <a rel=\"nofollow\" target=\"_blank\" href=\"http://callbackparams.org\">http://callbackparams.org</a>)</p>\n\n</div></div></div></div></blockquote><div>MockitoJUnitRunner extends BlockJUnit4ClassRunner, and appears to be equivalent to MockitoJUnitRunner (which extends the now-deleted runner)</div><div><br></div><div>CallbackParams appears unaffected. CallbackParamsRunner extends Runner and EnumRunner extends ParentRunner.</div>\n\n<blockquote class=\"ygrps-yiv-1769073126gmail_quote\" style=\"margin:0px 0px 0px 0.8ex;border-left-width:1px;border-left-color:rgb(204,204,204);border-left-style:solid;padding-left:1ex;\"><div style=\"background-color:rgb(255,255,255);\"><div><div>\n<div>\n<p>Now I do think that both of these runners will run just fine with JUnit-4.12-beta-1 but their builds would fail the day they decide to upgrade their JUnit dependency</p></div></div></div></div></blockquote><div><br></div>\n\n<div>Yes, at some point the developers of these runners will have to choose between using new APIs that were released in 4.12 and later vs having their runners support JUnit 4.4 and earlier.</div><blockquote class=\"ygrps-yiv-1769073126gmail_quote\" style=\"margin:0px 0px 0px 0.8ex;border-left-width:1px;border-left-color:rgb(204,204,204);border-left-style:solid;padding-left:1ex;\">\n\n<div style=\"background-color:rgb(255,255,255);\"><div><div><div><p><br> --- 2) Please remove pull-request #625 from the release! (The annotation @...)<br><br>I think this pull-request represents a very poor design choice that - at best - might help performance only for JUnit runners that executes their tests with concurrent threads. I would like to point out that most smaller unit-tests do not!! - but they still suffer from the same RunListener slowness that this issue is supposed to address ...<br>\n\n</p></div></div></div></div></blockquote><div>I think you might be misunderstanding the issues that this series of commits was addressing. </div><div><br></div><div>Prior to 4.12, a good portion of the JUnit code was not thread safe, so the result of running tests in parallel was completely undefined by the JVM.<br>\n\n</div><div><br></div><div>A few developers went trough a lot of effort to find and fix the thread-safety issues. Unfortunately, the RunListener API did not specify that implementations need to be thread-safe, and even some implementations of RunListener in JUnit were not thread safe.</div>\n\n<div><br></div><div>What we decided to do was to treat existing RunListener implementations as not thread safe, which means we had to do synchronization. RunListener implementations that can depend on JUnit 4.12 APIs can use the @... annotation to indicate that their listener is thread-safe, so doesn&#39;t need synchronization.</div>\n\n<div><br></div><div>The alternative would be to assume that all listeners are thread safe. If that assumption was </div><div>wrong, then JUnit could report incorrect results from test runs. This didn&#39;t seem like a good option, so we decided that it is better to sacrifice some speed for better correctness guarantees.</div>\n\n<div><br></div><div>Note that for modern JVMs, the cost of an uncontested lock is extremely low, so I don&#39;t believe this should have a noticeable impact on tests that are not run in parallel. Please let us know if you observe performance problems from these changes.</div>\n\n<div><br></div><div>-- Kevin</div><div><br></div></div></span></blockquote></div></div>\n</div>", 
    "prevInTime": 24576, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1407307680", 
    "canDelete": false, 
    "nextInTopic": 24578, 
    "prevInTopic": 24576, 
    "headers": {
        "inReplyToHeader": "PGxybm51NCsxZzlydWJyQFlhaG9vR3JvdXBzLmNvbT4=", 
        "messageIdInHeader": "PENBQTNFK2VYTWc1RS1QN0QyNUVtSDNEYUxQWS1FcndneDJlWEdyaDRiUF8wPVVqTmJXUUBtYWlsLmdtYWlsLmNvbT4=", 
        "referencesHeader": "PENBSGhZVko2WlRwVGFGNTBGWFA2d0tKNFc5Nmtjcj0rdVdRdWlLQjE9NzVhVjdFTk5IQUBtYWlsLmdtYWlsLmNvbT4gPENBS2k0MjczVXhmOVBuMDAyWHIxN3drUTVjN3Jld3c5Y0ZCdzdmTFFFbThmX0pXYmU5QUBtYWlsLmdtYWlsLmNvbT4gPGxyZTRkYis5NmFwNG9AWWFob29Hcm91cHMuY29tPiA8bHJubnU0KzFnOXJ1YnJAWWFob29Hcm91cHMuY29tPg=="
    }
}