{
    "numMessagesInTopic": 18, 
    "nextInTime": 24579, 
    "senderId": "ZiCuXpwLrxn6fFhoN7LfLPHEADR3vWy9UZw_1nBrou9reC3SdXq2vZ8ms80gc6P72-cDPG-d7Q", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: JUnit 4.12-beta-1 is released", 
    "from": "hkaipe@...", 
    "authorName": "", 
    "msgSnippet": "Hi Kevin I am sorry to say this but from your response it seems like my reasoning did not make any sense at all to you. - and consequently you did not", 
    "msgId": 24578, 
    "profile": "hkaipe", 
    "topicId": 24572, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 478409128, 
    "messageBody": "<div id=\"ygrps-yiv-1952140779\">Hi Kevin<br><br>I am sorry to say this but from your response it seems like my reasoning did not make any sense at all to you. - and consequently you did not understand any of my concerns. After some more thinking I will now try again to make my point by using more detail and some example scenarios - but the best would probably be if we could spend some time together so that I can carefully demonstrate what kind of problems that e.g. 3rd-party runner developers have to deal with. - Please let me know if you are about to spend time in Stockholm any time soon ...<br><br><blockquote><span title=\"ireply\"> &gt; This was a hard choice. JUnit4ClassRunner was starting to become a maintenance burden. When<br>&gt; evaluating our options, we realized that JUnit4ClassRunner has been deprecated for six years,<br>&gt; and debated whether we should delete it.<br><br> </span></blockquote>If JUnit4ClassRunner has become &quot;a maintenance burden&quot; then I suggest you stop maintaining it - I have absolutely no problem with that. - But I have no idea how this maintenance burden could possibly give you reason to DELETE IT? To preserve functionality for a deprecated class could be difficult - but to preserve compile-compatibility, which I was clearly asking for, is very simple!<br><br>We are all familiar with another project that, just like JUnit, has a number of 3rd-parties that depend on it. Its latest API-documentation can be found here:<br>http://docs.oracle.com/javase/8/docs/api<br>It has been under active development for about 20 years, i.e. slightly longer than JUnit, and has naturally been forced to deal with deprecation scenarios a number of times. Over the years it has happened that behavior-compatibility has been broken (i.e. modified functionality). I also think there are a few cases when method- or constructor-overloading has broken the compile-compatibility but those problems were easily resolved with explicit argument casting. But AFAIK there are no examples on broken compile-compatibility because of deprecation and discontinued maintenance!<br><br>I suggest that you now carefully consider the wise deprecation strategy of this other project and also this Jedi saying:<br>&quot;The choices of one shape the futures of all.&quot;<br>This saying is especially relevant if &quot;one&quot; is the JUnit project, on which so many other projects are dependent, so let&#39;s imagine a project that has been without activity for a few years and suddenly gets a new budget and development is restarted. Someone upgrades to JUnit-4.12 and consequently an unlucky someone else discovers that an important test cannot run. The unlucky (junior) developer can encounter the problem in different ways:<br><br>&nbsp;- With some luck the developer encounters a compilation error:<br>&quot;cannot access JUnit4ClassRunner&quot;<br><br>&nbsp;- With less luck the developer encounters a test initialization-error with a strange message:<br>&quot;Type [unknown] not present&quot;<br><br>I assume the JUnit team considered these circumstances during the &quot;evaluating our options&quot; phase and concluded it to be OK - but I am of the opinion that the above scenarios can &quot;shape the futures of all&quot; in sad directions:<br>1) Unlucky developer asks the team &quot;Did anyone change something?&quot;<br>2) Team answers &quot;no&quot;<br>3) Unlucky developer asks again<br>...<br>10) A team member says &quot;I have upgraded JUnit - but that should not affect anything&quot;<br>11) Unlucky developer responds &quot;I guess not&quot;<br>12) Unlucky developer asks again<br>...<br>20) Unlucky developer tries to downgrade JUnit - and problem was found!!<br>21) Project runs over budget<br>...<br>999) Turns out an important goverment function was dependent on the success of the project<br>...<br>9999) Taxes are raised to cover costs of inefficient goverment functions (i.e. &quot;the futures of all&quot; have been shaped)<br><br>I am by no means a product lifecycle guro but I still think I can suggest a much better solution in this case. - How about simply changing the super-class of &quot;JUnit4ClassRunner&quot; from &quot;Runner&quot; to a new class that has the name &quot;Runner_is_incompatible_with_JUnit_version_4_12_or_later&quot; and looks similar to this:<br><br>abstract class Runner_is_incompatible_with_JUnit_version_4_12_or_later extends Runner {<br><br>&nbsp; /* Constructor that throws an InitializationError! */<br>&nbsp; protected Runner_is_incompatible_with_JUnit_version_4_12_or_later(Class&lt;?&gt; testClass)<br>&nbsp; throws InitializationError {<br><br>&nbsp;&nbsp;&nbsp; RunWith runWith = testClass.getAnnotation(RunWith.class);<br>&nbsp;&nbsp;&nbsp; String runnerClassName = (runWith == null ? getClass() : runWith.value()).getName();<br><br>&nbsp;&nbsp;&nbsp; throw new InitializationError(<br>&nbsp;&nbsp;&nbsp; &quot;Some kind of message that tries to explain for the developer that &quot; + testClass<br>&nbsp;&nbsp;&nbsp; + &quot; uses runner &quot; + runnerClassName + &quot;, which is incompatible with JUnit-4.12, &quot;<br>&nbsp;&nbsp;&nbsp; + &quot; and perhaps also give the developer a few options on how this can be dealt with etc ...&quot;);<br>&nbsp; }<br>}<br><br>This solution would result in a test-failure with a much better message that IMHO helps the developer find the problem much quicker. - I also think that my suggestion would put an insignificant maintenance burden on the JUnit community, whereas simply deleting JUnit4ClassRunner is a neglective behaviour that passes on significant maintenance burdens on other projects that in turn will be less able to &quot;shape the futures of all&quot; in an efficient manner!<br><br>---<br>The above reasoning does mostly concern runners that have been developed internally, within an organisation or project, to deal with certain locally occuring circumstances.<br><br>For the general-purpose runners MockitoJUnitRunner and CallbackParamsRunner there are road-blocks that can take care of the compatibility problems before the problem is passed on to the anonymous unlucky developer - but it still is a case of passing on a JUnit &quot;maintenance burden&quot; to other projects.<br><br>I&#39;d say that your analyses of these runners&#39; dependency on JUnit4ClassRunner is flawed. You surprise me a bit by first making a correct statement saying that &quot;JUnit4ClassRunner isn&#39;t designed to be extended&quot; but when you investigate these 3rd-party runners you are only considering the parent-class of the API runner-classes. A hint on the design-patterns used for these runners can be found on this link:<br>http://en.wikipedia.org/wiki/Delegation_pattern<br><br>BTW - I am pretty sure that MockitoJUnitRunner extends Runner. - At least it does so where I have been looking:<br>http://docs.mockito.googlecode.com/hg/latest/org/mockito/runners/MockitoJUnitRunner.html<br><br>... where we have the latest javadoc, right? - and ...<br>https://github.com/mockito/mockito/blob/master/src/org/mockito/runners/MockitoJUnitRunner.java<br><br>... where we find the most recent source-code, which is well-documented and constitutes an easy-to-understand example of the delegation pattern. I cannot figure out where you would have read that MockitoJUnitRunner extends BlockJUnit4ClassRunner?<br><br>BR /Henrik Kaipe<br><br>PS<br>I be back with more detail and examples on the RunListener thread-safety/concurrency stuff on a separate post. - Now it is time to sleep.<br>DS</div>", 
    "prevInTime": 24577, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1407614745", 
    "canDelete": false, 
    "nextInTopic": 24579, 
    "prevInTopic": 24577, 
    "headers": {
        "inReplyToHeader": "PENBQTNFK2VYTWc1RS1QN0QyNUVtSDNEYUxQWS1FcndneDJlWEdyaDRiUF8wPVVqTmJXUUBtYWlsLmdtYWlsLmNvbT4=", 
        "messageIdInHeader": "PGxzNXV1cCsxaGhqNm4wQFlhaG9vR3JvdXBzLmNvbT4=", 
        "referencesHeader": "PENBSGhZVko2WlRwVGFGNTBGWFA2d0tKNFc5Nmtjcj0rdVdRdWlLQjE9NzVhVjdFTk5IQUBtYWlsLmdtYWlsLmNvbT4gPENBS2k0MjczVXhmOVBuMDAyWHIxN3drUTVjN3Jld3c5Y0ZCdzdmTFFFbThmX0pXYmU5QUBtYWlsLmdtYWlsLmNvbT4gPGxyZTRkYis5NmFwNG9AWWFob29Hcm91cHMuY29tPiA8bHJubnU0KzFnOXJ1YnJAWWFob29Hcm91cHMuY29tPgk8Q0FBM0UrZVhNZzVFLVA3RDI1RW1IM0RhTFBZLUVyd2d4MmVYR3JoNGJQXzA9VWpOYldRQG1haWwuZ21haWwuY29tPg=="
    }
}