{
    "numMessagesInTopic": 18, 
    "nextInTime": 24582, 
    "senderId": "AxLiG91jngMzj5fe5A7qF-AZTRH8AqaHwrSncCdKHLVOWjOg7chsb-2pIsHBeHQ2SolAQ0DQux4DIvH9prvphFV6iw", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: JUnit 4.12-beta-1 is released", 
    "from": "David Saff &lt;saff@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "Henrik, For JUnit4ClassRunner, it may be easiest to boil down to a particular example.  Would you mind choosing one third-party runner that currently extends", 
    "msgId": 24581, 
    "profile": "saffatgoogle", 
    "topicId": 24572, 
    "spamInfo": {
        "reason": "12", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 525765722, 
    "messageBody": "<div id=\"ygrps-yiv-1181959513\"><div dir=\"ltr\">Henrik,<div><br></div><div>For JUnit4ClassRunner, it may be easiest to boil down to a particular example. &nbsp;Would you mind choosing one third-party runner that currently extends JUnit4ClassRunner, so that we can see how this choice affects users of that library?</div>\n\n<div><br></div><div>&nbsp; &nbsp;David Saff</div></div><div class=\"ygrps-yiv-1181959513gmail_extra\"><br><br><blockquote><span title=\"qreply\"> <div class=\"ygrps-yiv-1181959513gmail_quote\">On Mon, Aug 4, 2014 at 6:40 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hkaipe@...\">hkaipe@...</a> [junit] <span dir=\"ltr\">&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>&gt;</span> wrote:<br>\n\n<blockquote class=\"ygrps-yiv-1181959513gmail_quote\" style=\"margin:0 0 0 .8ex;border-left:1px #ccc solid;padding-left:1ex;\">\n\n\n<u></u>\n\n\n\n\n\n\n\n\n\n \n<div style=\"background-color:#fff;\">\n<span>&nbsp;</span>\n\n\n<div>\n  <div>\n\n\n    <div>\n      \n      \n      <p>Hello<br><br>I am sorry for trashing the party but I have a couple of concerns that are very likely to slow down the adoption of JUnit-4.12 among the providers of 3rd-party tools ...<br><br>&nbsp;--- 1) Don&#39;t remove JUnit4ClassRunner! (in package org.junit.internal.runners)<br>\n\n<br>I have developed a number of 3rd-party runnners myself and I want the JUnit community to know that as a 3rd-party runner developer you want the latest version of your runner to work with any version of JUnit! - Otherwise the end-users (test-developers) will be less likely to start using your runner because they probably don&#39;t want to deal with the version-conflict hell that might raise between JUnit and your 3rd-party runner.<br>\n\n<br>A couple of good examples are the 3rd-party runners MockitoJUnitRunner (from Mockito - <a rel=\"nofollow\" target=\"_blank\" href=\"http://mockito.org\">http://mockito.org</a>) and CallbackParamsRunner (from CallbackParams - <a rel=\"nofollow\" target=\"_blank\" href=\"http://callbackparams.org\">http://callbackparams.org</a>)<br>\n\n<br>Both runner implementations extends JUnits Runner base-class. They both work as thin wrappers that hand over the main part of the test-execution to whichever JUnit-runner is appropriate for the JUnit-version on classpath, while they stay in the background ensuring that their intended features are magically appended on the test-execution with whichever extension points are appropriate for the JUnit-version at hand.<br>\n\n<br>In this manner the runners will work with JUnit-4.4 (or even older versions) but they will also work fine with later JUnit-versions, therewith allowing their end-users to upgrade JUnit separatly in order to also benefit from new JUnit-features (such as JUnit-rules etc).<br>\n\n<br>Now I do think that both of these runners will run just fine with JUnit-4.12-beta-1 but their builds would fail the day they decide to upgrade their JUnit dependency (e.g. if they want to leverage from some new JUnit feature in 4.12). - So in the end this will slow down the adoption of 4.12 in these 3rd-party projects because an upgrade would force their communities to extra efforts in order to preserve their backward-compatibility to older JUnit-version (such as 4.4).<br>\n\n<br>&nbsp;--- 2) Please remove pull-request #625 from the release! (The annotation @...)<br><br>I think this pull-request represents a very poor design choice that - at best - might help performance only for JUnit runners that executes their tests with concurrent threads. I would like to point out that most smaller unit-tests do not!! - but they still suffer from the same RunListener slowness that this issue is supposed to address ...<br>\n\n<br>A much better solution that would be generally beneficial to all types of JUnit runners would be to offer RunListener implementors some sort of concurrency API that allows RunListener implementations to use assynchronous execution of the parts that might take a long time. - That way it would be possible for all runners to seamlessly benefit from RunListeners that have clever assynchronous concurrency features!!<br>\n\n<br>I can discuss this RunListener stuff forever but I don&#39;t really have the time - so I invite other clever people to join the discussion ...<br><br>---<br>BR /Henrik Kaipe</p>\n\n    </div>\n     \n\n    \n    <div style=\"color:#fff;min-height:0;\"></div>\n\n\n</div>\n\n\n\n  \n\n\n\n\n\n\n</div></div></blockquote></div><br></span></blockquote></div>\n</div>", 
    "prevInTime": 24580, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1407778385", 
    "canDelete": false, 
    "nextInTopic": 24583, 
    "prevInTopic": 24580, 
    "headers": {
        "inReplyToHeader": "PGxybm51NCsxZzlydWJyQFlhaG9vR3JvdXBzLmNvbT4=", 
        "messageIdInHeader": "PENBTHJ3LVB5WU11XzMrM3lOaXJPY3VTUUVHdU9KUTdfQVk5d0Z3Z3dKZXdMMD1may03d0BtYWlsLmdtYWlsLmNvbT4=", 
        "referencesHeader": "PENBSGhZVko2WlRwVGFGNTBGWFA2d0tKNFc5Nmtjcj0rdVdRdWlLQjE9NzVhVjdFTk5IQUBtYWlsLmdtYWlsLmNvbT4gPENBS2k0MjczVXhmOVBuMDAyWHIxN3drUTVjN3Jld3c5Y0ZCdzdmTFFFbThmX0pXYmU5QUBtYWlsLmdtYWlsLmNvbT4gPGxyZTRkYis5NmFwNG9AWWFob29Hcm91cHMuY29tPiA8bHJubnU0KzFnOXJ1YnJAWWFob29Hcm91cHMuY29tPg=="
    }
}