{
    "numMessagesInTopic": 18, 
    "nextInTime": 24592, 
    "senderId": "fzaLxvOmImF0_w0kUhWt6aTty1ZLhfd58BK7TPHLzEOQt8EG3XY1WTXge1dkG387fll7HQlLrCZKTcRMssjX-_-KLXWMGA", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: JUnit 4.12-beta-1 is released", 
    "from": "Chris &lt;devnullaccount@...&gt;", 
    "authorName": "Chris", 
    "msgSnippet": "inline. ... Like I said, our code is IMO overly restrictive and I agree that isAssignableFrom should work as well, so I would assume it is unlikely that anyone", 
    "msgId": 24591, 
    "profile": "devnullaccount", 
    "topicId": 24572, 
    "spamInfo": {
        "reason": "3", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 563548509, 
    "messageBody": "<div id=\"ygrps-yiv-470436690\">inline.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;    Hi,<br/>\n&gt;&gt;<br/>\n&gt;&gt;    to some extent, I think it was the fault of our code using it, which seems overly restrictive:<br/>\n&gt;&gt;    if (&lt;something&gt; && exception.getClass().equals(org.junit.internal.AssumptionViolatedException.class))<br/>\n&gt;<br/>\n&gt;I think you could use Class.isAssignableFrom(Class) instead, but if you could give more context, I could give a better suggestion. More context would also allow me to update the release notes to warn about this.<br/>\n<br/>\n </span></blockquote>Like I said, our code is IMO overly restrictive and I agree that isAssignableFrom should work as well, so I would assume it is unlikely that anyone else would run into this issue.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;I believe we introduced the external AssumptionViolatedException so that projects would not have to import internal classes. If introducing the external AssumptionViolatedException causes a lot of problems, then maybe we need to just accept that AssumptionViolatedException should not have been internal but we can&#39;t do anything about it.<br/>\n<br/>\n </span></blockquote>See above. Keep it as you have it in the beta<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;&gt;    By the way, the removal of &quot;exit()&quot; from JUnitSystem was a bit annoying as I ended having to copy in MainRunner (from your tests) into our project as we&#39;re also testing some System.exit conditions.<br/>\n&gt;<br/>\n&gt;I filed <a rel=\"nofollow\" target=\"_blank\" href=\"https://github.com/junit-team/junit/issues/975\">https://github.com/junit-team/junit/issues/975</a> to track this.<br/>\n&gt;<br/>\n&gt;On the one hand, it would be nice if we were free to make non-backwards-compatible changes to internal classes. On the other hand, we have had some classes that were internal when they shouldn&#39;t have been. In this particular case, it would be trivial to add the method back (and the method is trivial to maintain going forward), so IMHO we should add it back.<br/>\n&gt; <br/>\n&gt;<br/>\n&gt;&gt;    I can see why it is nicer to remove a test-only API from the source part, but when the cost is 290 lines of MainRunner to save JUnitSystem subclasses from writing a 3-line method, then I&#39;m not so sure it is a gain. But I can live with it.<br/>\n&gt;<br/>\n&gt;JUnitSystem is an internal class. If you believe we should have an external version, could you please file a feature request and outline your use case?<br/>\n<br/>\n </span></blockquote>The use case is that we have implemented a replacement for JunitCore (not inheritance due to how our project needs to work) and we test it the same fashion as JUnitCoreTest, i.e. we have something similar to runMain and pass it in a JUnitSystem (an anonymous implementation in the testcase). As I said, it&#39;s not a big issue, I can live with copying something like MainRunner into our test tree, your call.<br/>\n<br/>\nI don&#39;t have an account on github and am a bit too lazy to create one to file a report on this ;) As I said in my initial mail, I&#39;m fine with this release.<br/>\n<br/>\n/Chris</div>", 
    "prevInTime": 24590, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1407912160", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 24590, 
    "headers": {
        "inReplyToHeader": "PENBQTNFK2VXOEhpUVJnYnMxcD1Ya2tRLTZVcmVOZnh5bTJUWWY1ZG1WYjlyWFZzcFlKZ0BtYWlsLmdtYWlsLmNvbT4=", 
        "messageIdInHeader": "PDE0MDc5MTIxNjAuNTc2MzkuWWFob29NYWlsQmFzaWNAd2ViMTczMjAxLm1haWwuaXIyLnlhaG9vLmNvbT4="
    }
}