{
    "numMessagesInTopic": 5, 
    "nextInTime": 24599, 
    "senderId": "4QDvlglRZ2r98m2o1fQslEgpD1nqZiA7WrKdinDARux8E4BeO5FNaDYypWrsw8wpP3AY7TvbWwGaEGBmnkk55mkFdGpt", 
    "systemMessage": false, 
    "subject": "JUnit shouldn&#39;t be advertised as only for &quot;unit testing&quot;", 
    "from": "&quot;KARR, DAVID&quot; &lt;dk068x@...&gt;", 
    "authorName": "KARR, DAVID", 
    "msgSnippet": "One thing I battle in my work is a misconception about what unit testing is, and what JUnit is for.  In my view, there are three kinds of automated tests:", 
    "msgId": 24598, 
    "profile": "davidmichaelkarr19", 
    "topicId": 24598, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 405487700, 
    "messageBody": "<div id=\"ygrps-yiv-929161590\">One thing I battle in my work is a misconception about what &quot;unit testing&quot; is, and what &quot;JUnit&quot; is for.  In my view, there are three kinds of automated tests: unit, integration, and acceptance.  You can easily use JUnit to write automated tests for all of these.  I often run into people who are confused by this, because they think that anything using JUnit is a unit test.  Even the first page of the JUnit web page adds to this confusion.  It says:<br/>\n<br/>\n    &quot;JUnit is a simple framework to write repeatable tests. It is an instance of the xUnit architecture for unit testing frameworks.&quot;<br/>\n<br/>\nThe first statement is good, but not the second one.  It would be better to change &quot;unit testing&quot; to &quot;automated testing&quot;, although &quot;repeatable tests&quot; is ok.  I don&#39;t think there&#39;s much point in writing &quot;repeatable tests&quot; unless you&#39;re going to automate them.<br/>\n<br/>\nThe wikipedia page on JUnit is even worse in this regard.  No one here is technically responsible for that, but it would be a good idea to revise that (I started to look at editing that, but I&#39;d prefer to collaborate with existing authors of the page).  It should emphasize that JUnit can and should be used for any kind of Java-based automated testing, even with acceptance testing, which could be used to test deployed packages written in any programming language.</div>", 
    "prevInTime": 24597, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1412619956", 
    "canDelete": false, 
    "nextInTopic": 24599, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PEI4RDE2NEJFRDk1NkM1NDM5ODc1OTUxODk1Q0I0QjIyMjY5QkRBNDVAQ0FGUkZEMU1TR1VTUklBLklUU2VydmljZXMuc2JjLmNvbT4="
    }
}