{
    "numMessagesInTopic": 6, 
    "nextInTime": 24608, 
    "senderId": "BfiJYQ15MK4aMJOrO0lMjW5yecIzcARmUzAJqO7hqnWeYCdT9QE9QwFudDrRcjlt9S46qZSZbMfdBqB98gQZVAWCJvdezu_sRXdr5u0x", 
    "systemMessage": false, 
    "subject": "Re: [junit] Quo Vadis JUnit", 
    "from": "Esko Luontola &lt;esko.luontola@...&gt;", 
    "authorName": "Esko Luontola", 
    "msgSnippet": "I ll go over the topics on by one, adding some more related topics. For some of them I ve implemented a solution in the Jumi test runner (http://jumi.fi/) in", 
    "msgId": 24607, 
    "rawEmail": "Return-Path: &lt;esko.luontola@...&gt;\r\nX-Sender: esko.luontola@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nX-Received: (qmail 19458 invoked by uid 102); 23 Oct 2014 17:45:15 -0000\r\nX-Received: from unknown (HELO mtaq5.grp.bf1.yahoo.com) (10.193.84.36)\n  by m6.grp.bf1.yahoo.com with SMTP; 23 Oct 2014 17:45:15 -0000\r\nX-Received: (qmail 22789 invoked from network); 23 Oct 2014 17:45:14 -0000\r\nX-Received: from unknown (HELO mail-lb0-f177.google.com) (98.139.245.163)\n  by mtaq5.grp.bf1.yahoo.com with SMTP; 23 Oct 2014 17:45:14 -0000\r\nX-Received: by mail-lb0-f177.google.com with SMTP id w7so1267724lbi.36\n        for &lt;junit@yahoogroups.com&gt;; Thu, 23 Oct 2014 10:45:13 -0700 (PDT)\r\nX-Received: by 10.152.8.12 with SMTP id n12mr6685721laa.51.1414086313619;\n        Thu, 23 Oct 2014 10:45:13 -0700 (PDT)\r\nX-Original-Return-Path: &lt;esko.luontola@...&gt;\r\nX-Received: from [10.0.0.2] (217-119-47-47.cust.suomicom.net. [217.119.47.47])\n        by mx.google.com with ESMTPSA id l11sm998459lbb.27.2014.10.23.10.45.11\n        for &lt;junit@yahoogroups.com&gt;\n        (version=TLSv1 cipher=ECDHE-RSA-RC4-SHA bits=128/128);\n        Thu, 23 Oct 2014 10:45:12 -0700 (PDT)\r\nMessage-ID: &lt;54493EAC.5040300@...&gt;\r\nDate: Thu, 23 Oct 2014 20:45:16 +0300\r\nUser-Agent: Mozilla/5.0 (Windows NT 6.1; WOW64; rv:24.0) Gecko/20100101 Thunderbird/24.6.0\r\nMIME-Version: 1.0\r\nTo: junit@yahoogroups.com\r\nReferences: &lt;m2a2ja+l7ojrp@...&gt;\r\nIn-Reply-To: &lt;m2a2ja+l7ojrp@...&gt;\r\nContent-Type: text/plain; charset=UTF-8; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nSubject: Re: [junit] Quo Vadis JUnit\r\nX-Yahoo-Group-Post: member; u=395435659; y=yOX-Wa-mHEDGoeKUGrJv4IOlneavx0sXPVqvOJI_6ZW4XPP-UUs\r\nX-Yahoo-Profile: egeluontola\r\nFrom: Esko Luontola &lt;esko.luontola@...&gt;\r\n\r\nI&#39;ll go over the topics on by one, adding some more related topics. For \nsome of them I&#39;ve implemented a solution in the Jumi test runner \n(http://jumi.fi/) in which case I will point out how I did it there.\n\n\n## Test names ##\n\nI think test names should allow any characters, including space and \npunctuation, so that they could be written as sentences describing the \ndesired features. At most newline may be disallowed.\n\n\n## Test identification ##\n\nA concern related to test names is test identification. In Jumi test \nnames do not have to be unique. For test identification it uses \nhierarchial numeric IDs \n(https://github.com/orfjackal/jumi/blob/master/jumi-api/src/main/java/fi/jumi/api/drivers/TestId.java) \nwhich also signify the order in which the tests should be shown in test \nresults as a tree. Those IDs are not shown to the user and since the IDs \nmay change between test runs (e.g. if reflection returns test methods in \ndifferent order), using them for test filtering might not work, but \nfiltering would work better based on test names.\n\n\n## Multiple execution/cascading names ##\n\nIn Jumi tests may be executed multiple times and a test&#39;s execution may \ncontain the execution of other tests as sub-steps, in an arbitrarily \nnested structure. This supports all the &quot;BDD frameworks&quot; which often use \nnesting for organizing tests. See \nhttps://github.com/orfjackal/jumi/wiki/Execution-Model-and-Terminology\n\n\n## Global Rules ##\n\nI don&#39;t know how this could be fully solved without tying it to the \ndetails of a particular testing framework. Even with JUnit 4 each \norg.junit.runner.Runner implementation is responsible for handling the \nrules itself. It may be hard/impossible to create global rules that wrap \nthe individual test methods of any testing frameworks.\n\nAs a limited solution, rules at the level of the whole suite or \nindividual test classes should be possible. For example a rule which \nstarts up the application/databases once before all tests and shuts it \ndown after all the tests are finished. Or a rule that wraps around the \nexecution of a test class, for example to set a timeout.\n\nI wonder how it should be declared that which global rules to use. \nProbably explicitly listing them in a configuration would be best. \nClasspath scanning would make it too unpredictable and it would delay \nthe first test&#39;s execution until after the scanning is finished.\n\n\n## Finding Tests ##\n\nAgreed, there should be a common way for doing this to avoid minor \ndifferences between tools. That&#39;s why also in Jumi I&#39;ve implemented test \ndiscovery as a built-in feature. It crawls though the compile output \ndirectories and looks for files which match a regex or glob pattern. \nTest execution happens in parallel with test discovery, starting \nimmediately when the first test class is found.\n\nUsing naming patterns has the added benefit that it&#39;s not tied to .class \nfiles, but may be used by frameworks which store tests in text files \n(e.g. Cucumber and other BDD frameworks) or in other programming \nlanguages (e.g. Clojure).\n\n\n## Finding Tests Incrementally ##\n\nIn some testing frameworks where test are declared as method calls (by \npassing in the test name and a closure), especially with nested tests, \nit&#39;s not possible to find out a list of all tests before executing any \ntests. This is one of the reasons why I created the Jumi test runner, \nbecause in the Specsy testing framework (http://specsy.org/) I had to \nuse hacks to work around the JUnit 4 test runner&#39;s assumption of knowing \nwhat tests exists before executing them (otherwise some IDEs behave \nweirdly).\n\n\n## Jump to source code ##\n\nSince there are lots of different ways of declaring tests, currently \nIDEs need to have custom support for each testing framework. I&#39;ve been \nthinking that it might be possible for a testing framework to report to \nthe test runner the location of each test (i.e. file and line number), \nso that IDEs would not need to figure it out themselves.\n\nFor JUnit 4 style testing frameworks, this could be done by reading line \nnumbers from the bytecode of the test methods. For testing frameworks \nwhere tests are declared by passing the test name and a closure as \narguments to a method, this could be done by creating an Exception and \nreading the line number of the calling method from the stack trace elements.\n\n\n## Filtering ##\n\nRelated to the above discussion about test identification, I think using \ntest names is the most reliable method of filtering tests, with the \n(minor) caveat that running a single method may not be possible if two \ntests have the same name in the same class.\n\nRelated to the above discussion about cascading and nested tests, I \nthink that test filtering will need to take into account the test \nhierarchy. So instead of just a single filtering pattern (regex?), there \nwould need to be a list of them, one for each depth level of tests.\n\nI have some doubts whether it will be possible to create a filtering \nmechanism that fits every testing framework. Some frameworks may be able \nto support the filtering mechanism only partly. Also IDE support may \nhave to vary between testing frameworks - in the general case the IDE \nwill know what tests exists only after the tests have been run once, \ni.e. it would not be possible to select inside the editor &quot;run only this \ntest&quot; unless the IDE has custom support for the testing framework in \nquestion.\n\n\n## Test Groups ##\n\nRelated to filtering and finding tests is test groups/categories. For \nexample we want to make it easy to run just unit tests without \nintegration tests. I think a good solution would be the ability to give \ntextual tags for test classes, and then the ability to specify \nexpressions such as &quot;!db & !jms&quot; to include/exclude tests with a \nparticular tag.\n\n\n## Order of Tests ##\n\nI think this is a very testing framework specific aspect - how to \ndeclare the execution order or dependencies between tests. When \neverything is single-threaded, then the testing framework should already \nbe in full control of the order of executing things. But when parallel \ntest execution is added to the mix, some support from the test runner \nmight be needed, for example to say that some test classes should not be \nrun in parallel (because of e.g. a shared database).\n\nFor Jumi I&#39;m planning on implementing support for restricting the \nparallelism by annotating test classes (currently everything is in \nparallel). I&#39;m thinking about having three options: (1) run each test \nmethod in parallel, (2) run tests methods in this class sequentially but \nallow other test classes to be run in parallel with it, (3) run this \ntest class sequentially and don&#39;t run anything else in parallel with it. \nI think #1 and #3 will at least be needed, but for #2 I&#39;m wondering \nwhether it should be made more generic by using test groups, for example \n&quot;don&#39;t run tests tagged with &#39;db&#39; in parallel with any other tests \ntagged with &#39;db&#39;&quot;.\n\nAnd as to what comes to execution order within one test class, for \nexample TestNG&#39;s dependent methods \n(http://testng.org/doc/documentation-main.html#dependent-methods), I \nthink Jumi is already generic enough: There the testing framework starts \ntest method executions by submitting them to an \njava.util.concurrent.Executor and it is possible for the testing \nframework to delay submitting some test to the Executor until all the \ntests it depends on have finished executing.\n\n-- \nEsko Luontola\nwww.orfjackal.net\n\n", 
    "profile": "egeluontola", 
    "topicId": 24605, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 395435659, 
    "prevInTime": 24606, 
    "contentTrasformed": false, 
    "postDate": "1414086316", 
    "canDelete": false, 
    "nextInTopic": 24608, 
    "prevInTopic": 24606, 
    "headers": {
        "inReplyToHeader": "PG0yYTJqYStsN29qcnBAWWFob29Hcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDU0NDkzRUFDLjUwNDAzMDBAZ21haWwuY29tPg==", 
        "referencesHeader": "PG0yYTJqYStsN29qcnBAWWFob29Hcm91cHMuY29tPg=="
    }
}