{
    "numMessagesInTopic": 10, 
    "nextInTime": 24627, 
    "senderId": "rxMJT0k23iIxwVbn0B-3vzI7cAb91JvVb1aeR9Efndylti5JvboIkDhoUTvLDFMBCM7pBpP1rys7fCjnb0uaM1d-Sg", 
    "systemMessage": false, 
    "subject": "Re: [junit] Decoupling JUnit and Hamcrest", 
    "from": "Stefan &lt;stefan@...&gt;", 
    "authorName": "Stefan", 
    "msgSnippet": "Hi, I m not a developer of junit nor hamcrest and I don t feel the pain of the tight integration of junit and hamcrest that prevents both from moving on but", 
    "msgId": 24626, 
    "topicId": 24625, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 515214438, 
    "messageBody": "<div id=\"ygrps-yiv-611668155\"><html>\n  <head>\n    \n  </head>\n  \n    Hi,<br>\n    <br>\n    I&#39;m not a developer of junit nor hamcrest and I don&#39;t feel the pain\n    of the tight integration of junit and hamcrest that &quot;prevents both\n    from moving on&quot; but I&#39;m a heavy user of both.<br>\n    I don&#39;t think it&#39;s a good idea to separate the hamcrest integration\n    from junit into it&#39;s own library.<br>\n    <br>\n    At the moment JUnit dictates the hamcrest version to be used but\n    also guarantees compatibility with this version.<br>\n    With the new library hamcrest developers will dictate the junit\n    version that is compatible with a specific hamcrest release. This is\n    only a change in responsibility but has no benefits.<br>\n    <br>\n    Of course there is also the opportunity to provide a broader range\n    of compatible versions. But this opportunity also means more work\n    for the maintainers and slower adoption by users. JUnit 4.12 uses\n    hamcrest 1.3. What if JUnit moves on to 4.13, 4.14 and hamcrest\n    releases 2.0 and 2.1 respectively. Will there be a version which is\n    compatible with hamcrest 2.1 and JUnit 4.13? Will there be a version\n    which is compatible with JUnit 4.14 and hamcrest 1.3?<br>\n    <br>\n    As a developer who want&#39;s to use JUnit 4.14 - <b>how do I know\n      which hamcrest-junit-integration version to use? What will stop me\n      from using a wrong version?</b> For example I might be tempted to\n    update JUnit to 4.14 but forget to update\n    hamcrest-junit-integration. There might be changes of the behaviour\n    of JUnit that might cause some of my tests to pass always although\n    they should fail. On the other hand: JUnit 4.14 might be binary\n    incompatible to JUnit 4.12 - where to look for the right version of\n    hamcrest-junit-integration?<br>\n    <br>\n    If hamcrest moves on to 2.0 - which could be binary incompatible to\n    1.3 due to the major version change (haven&#39;t checked) - <b>how long\n      will hamcrest 1.3 be supported with latest JUnit versions by\n      hamcrest-junit-integration?</b> I&#39;m asking because we also use\n    JMock which depends on hamcrest as well. If I update to an\n    incompatible 2.0 I need also an update of JMock....<br>\n    (( Actually I cannot update JMock without big effort because there\n    was an incompatible change from 2.5.1 to 2.6 .... ))<br>\n    <br>\n    On the other hand this will slow down speed for adoption of new\n    JUnit versions because we have to wait until a new\n    hamcrest-junit-integration version is out or at least someone has\n    built the appropriate version with latest JUnit release and verified\n    unit tests are still passing. It will also increase the effort\n    necessary to try JUnit release candidates or snapshots in real\n    projects (because I also have to checkout and build the integration\n    library myself to be sure there is no problem with that... and if\n    there is a problem I need to fix it myself or stop using latest\n    JUnit release candidate).<br>\n    <br>\n    ----<br>\n    IMHO decoupling JUnit and hamcrest has more drawbacks than benefits.\n    Although I see it can be a chance for hamcrest to move on. I don&#39;t\n    think JUnit as a project will profit that much. JUnit users might\n    have a broader choice of compatible hamcrest versions but this\n    requires some effort (of the maintainers of\n    hamcrest-junit-integration). I think this might only work well for\n    JUnit users if the JUnit team commits to that integration project\n    and is able to push out new releases of the\n    hamcrest-junit-integration together with new JUnit releases.<br>\n    <br>\n    <br>\n    Regards,<br>\n    Stefan<br>\n    <br>\n    <br>\n    <div class=\"ygrps-yiv-611668155moz-cite-prefix\">Am 07.01.2015 um 08:31 schrieb Stefan\n      Birkner <a rel=\"nofollow\" class=\"ygrps-yiv-611668155moz-txt-link-abbreviated\" target=\"_blank\" href=\"mailto:mail@...\">mail@...</a> [junit]:<br>\n    </div>\n    <blockquote><span title=\"qreply\"> <blockquote\n\n type=\"cite\"> <span style=\"display:none;\"> </span>\n      \n          <div id=\"ygrps-yiv-611668155ygrp-text\">\n            <p>FYI: Nat Pryce took a first step for decoupling JUnit and\n              Hamcrest:<br>\n              <a rel=\"nofollow\" class=\"ygrps-yiv-611668155moz-txt-link-freetext\" target=\"_blank\" href=\"http://natpryce.com/articles/000806.html\">http://natpryce.com/articles/000806.html</a><br>\n            </p>\n          </div>\n          \n      \n      \n    </blockquote>\n    <br>\n  \n</span></blockquote></html>\n</div>", 
    "prevInTime": 24625, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1420749984", 
    "canDelete": false, 
    "nextInTopic": 24627, 
    "prevInTopic": 24625, 
    "headers": {
        "inReplyToHeader": "PENBSGhZVko1OGN1NU1DS3FkYVZmR3E2OVI2MDI2Z2tOVUZBNVBDNFJrRms0TmFlU2lSQUBtYWlsLmdtYWlsLmNvbT4=", 
        "messageIdInHeader": "PDU0QUVFQ0EwLjgwMTA5MDVAY3lwaG9yaWEubmV0Pg==", 
        "referencesHeader": "PENBSGhZVko1OGN1NU1DS3FkYVZmR3E2OVI2MDI2Z2tOVUZBNVBDNFJrRms0TmFlU2lSQUBtYWlsLmdtYWlsLmNvbT4="
    }
}