{
    "numMessagesInTopic": 10, 
    "nextInTime": 24630, 
    "senderId": "gMq2LX7aesni1KnSSgwPQIGzQJ9PHfwjK-YCllIU3wf4vmZ2iDYC75V0gsgzffQ_0-5QAPyG35UDNE98IILpZ5md1U-BK-joeImfNFn5K6maVCJ1IsbiyKs", 
    "systemMessage": false, 
    "subject": "Re: [junit] Decoupling JUnit and Hamcrest", 
    "from": "Stephen Connolly &lt;stephen.alan.connolly@...&gt;", 
    "authorName": "Stephen Connolly", 
    "msgSnippet": "Well I think this thread should be opened up to more than just people called Stefan , I personally think any of the other forms of the Steven name is wide", 
    "msgId": 24629, 
    "rawEmail": "Return-Path: &lt;stephen.alan.connolly@...&gt;\r\nReceived: (qmail 13653 invoked by uid 7800); 12 Jan 2015 11:05:22 -0000\r\nX-Sender: stephen.alan.connolly@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nX-Received: (qmail 20627 invoked by uid 102); 11 Jan 2015 20:21:49 -0000\r\nX-Received: from unknown (HELO mtaq4.grp.bf1.yahoo.com) (10.193.84.143)\n  by m5.grp.bf1.yahoo.com with SMTP; 11 Jan 2015 20:21:49 -0000\r\nX-Received: (qmail 19474 invoked from network); 11 Jan 2015 20:21:49 -0000\r\nX-Received: from unknown (HELO mail-oi0-f41.google.com) (98.138.100.119)\n  by mtaq4.grp.bf1.yahoo.com with SMTP; 11 Jan 2015 20:21:49 -0000\r\nX-Received: by mail-oi0-f41.google.com with SMTP id i138so18200661oig.0\n        for &lt;junit@yahoogroups.com&gt;; Sun, 11 Jan 2015 12:21:48 -0800 (PST)\r\nMIME-Version: 1.0\r\nX-Received: by 10.60.155.195 with SMTP id vy3mr15523388oeb.62.1421007708255;\n Sun, 11 Jan 2015 12:21:48 -0800 (PST)\r\nX-Received: by 10.60.14.232 with HTTP; Sun, 11 Jan 2015 12:21:48 -0800 (PST)\r\nIn-Reply-To: &lt;0825663A-6F8B-4083-8953-68106EEAA06E@...&gt;\r\nReferences: &lt;CAHhYVJ58cu5MCKqdaVfGq69R6026gkNUFA5PC4RkFk4NaeSiRA@...&gt;\n\t&lt;54AEECA0.8010905@...&gt;\n\t&lt;CAHhYVJ4qn_xvb+cZiqzrm5E4WF3-qvT_xEzsJPS0rx=hNecU3Q@...&gt;\n\t&lt;0825663A-6F8B-4083-8953-68106EEAA06E@...&gt;\r\nDate: Sun, 11 Jan 2015 20:21:48 +0000\r\nMessage-ID: &lt;CA+nPnMxnUZ+dYAEEicoOtVkxEX0j9jbfRObeqnPdR+Qy6_6L3w@...&gt;\r\nTo: &quot;junit@yahoogroups.com&quot; &lt;junit@yahoogroups.com&gt;\r\nContent-Type: multipart/alternative; boundary=089e0102dc32ac7e36050c662345\r\nSubject: Re: [junit] Decoupling JUnit and Hamcrest\r\nX-Yahoo-Group-Post: member; u=458231986; y=AHDDGNO0kzLWT51xHaw3WjNxk7a57LfkxYIt23AILR7yn1CdrsCqRIhkRPHrAg\r\nX-Yahoo-Profile: stephenalanconnolly\r\nX-Original-From: Stephen Connolly &lt;stephen.alan.connolly@...&gt;\r\nX-eGroups-Approved-By: dsaff &lt;david@...&gt; via email; 12 Jan 2015 11:05:22 -0000\r\nFrom: Stephen Connolly &lt;stephen.alan.connolly@...&gt;\r\n\r\n\r\n--089e0102dc32ac7e36050c662345\r\nContent-Type: text/plain; charset=UTF-8\r\n\r\nWell I think this thread should be opened up to more than just people\ncalled &quot;Stefan&quot;, I personally think any of the other forms of the Steven\nname is wide enough to be opening up ;-)\n\nFrom having played with how some of the JavaScript testing frameworks work,\nI would tend to agree.\n\nJUnit should focus on test execution. A lot of people have strong opinions\non how an assertion framework&#39;s DSL should look... But the assertion\nframeworks can all agree that an assertion failure should result in an\nAssertionError, and the message of the exception is what went wrong.\n\nThe only other point where I think an assertion framework needs to\ninterface with a test runner is assumptions.\n\nIf we can find a way to have a shared assumption exception class (could be\na simple one class jar file pushed to Central for everyone to use, could be\na text matching on the name of the assertion error class tree... Just\ndecide an interface spec then the assertion framework should be out of the\nloop... Which is a good thing.\n\nI think Stefan&#39;s concerns about cross version compatibility are moot for\nthis case as the way to decouple them is through an agreed upon\njava.lang.AssertionError class, so the spec becomes simpler not more complex\n\nSo Stefan, I agree with your plan, and I agree with Stefan&#39;s experiments in\nderiving a TDD framework using TDD but I disagree with Stefan&#39;s fears of\ncompatability hell as in this case the refactoring will reduce the overlap\nand hence the opertunity for compatability hell\n\n-Stephen\n\n\nOn Sunday, 11 January 2015, Stefan Bechtold stefan.bechtold@... [junit] &lt;\njunit@yahoogroups.com&gt; wrote:\n\n&gt; Hi,\n&gt;\n&gt; this seems to be a discussion from Stefan to Stefan, so I cant hesitate to\n&gt; post an answer. ;-)\n&gt;\n&gt; I really think that separation is a good thing and should be enforced by\n&gt; the JUnit team. Hamcrest is a great framework for assertions, but in some\n&gt; cases it is not needed or not the best fit. So the test writers should have\n&gt; to possibility to choose the assertion framework of their choice and the\n&gt; testing framework should smoothly work with it.\n&gt;\n&gt; What&#39;s behind my opinion? Some months ago I was playing around with\n&gt; different unit testing frameworks. While I was doing so I asked myself the\n&gt; question: How do you develop a unit testing framework using TDD practices?\n&gt; I sat down and started to create the first bits of code that would\n&gt; represent a &quot;unit test&quot;. With this very simple test in place I wrote some\n&gt; production code to execute the test case. Fun it was! I tried some more\n&gt; tests and continued to play around like this for some hours and when I\n&gt; finished I realized that I had developed a very rudimental unit testing\n&gt; framework. While being very rudimental, the framework still supports things\n&gt; like:\n&gt;\n&gt; - @Test, @Before, @After, @Ignore, @Context (like the hierarchical context\n&gt; runner for JUnit)\n&gt; - Test Groups and Test Suites,\n&gt; - Reporters (still no support for Listeners, but soon to come ;-))\n&gt; - Extendable Tests Creators (you can register a Factory to support your\n&gt; own Test Cases, like cucumber files, etc.)\n&gt;\n&gt; The core idea of the framework was not to create a new standard, but to\n&gt; play around with TDD for building a Unit Testing Framework. I came up with\n&gt; two guidelines, which I think are very important for a next generation of\n&gt; JUnit (5.x for example):\n&gt;\n&gt; 1. Provide a flexible and extendable framework that only cares about the\n&gt; execution and reporting of test cases and results\n&gt; 2. Don&#39;t struggle with things third party libraries can offer, i.e. don&#39;t\n&gt; try to be the one-and-only tool for TDD\n&gt;\n&gt; In order to be flexible and extendable, I think there should be some kind\n&gt; of application context that third party libraries may register themselves\n&gt; for certain activities, e.g. finding test cases (no longer limited to\n&gt; annotated Java Classes, input can be anything like cucumber tests),\n&gt; providing assertions (I simply used Hamcrest in my tests, but the user of\n&gt; the framework should be free to choose anything that throws an\n&gt; AssertionError), or to run tests multiple times or expect exceptions (I\n&gt; used Java 8 lambdas to create a very well readable syntax for it). I\n&gt; finally felt like this is the way to go: Separate the core framework from\n&gt; things that can be easily provided separately.\n&gt;\n&gt; To give a very short impression of what a test will look like using my\n&gt; framework, look at this test case:\n&gt;\n&gt; // ...\n&gt;\n&gt; public class TestContextTest {\n&gt;   @Test\n&gt;   public void givenInvalidTestContext_createInstanceFails() throws\n&gt; Exception {\n&gt;     expectThrowable(AssertionError.class).withMessage(&quot;Class not\n&gt; instantiable&quot;).in(() -&gt; {\n&gt;       TestClass testClass = new\n&gt; TestClass(TestContextWithPrivateConstructor.class);\n&gt;       TestContext testContext = new TestContext(testClass,\n&gt; TestContextWithPrivateConstructor.InvalidContext.class);\n&gt;       testContext.createTestInstance();\n&gt;     });\n&gt;   }\n&gt;\n&gt;   @Context\n&gt;   public class GivenTestContextWithSingleTest {\n&gt;     // ...\n&gt;\n&gt;     @Before\n&gt;     public void setupTestContext() throws Exception {\n&gt;       parentInstance = new TestContextWithSingleTest();\n&gt;       testClass = new TestClassMock(parentInstance);\n&gt;       testContext = new TestContext(testClass,\n&gt; TestContextWithSingleTest.TestContext.class);\n&gt;     }\n&gt;\n&gt;     @Test\n&gt;     public void createsAValidTestInstanceOfClassUnderTest() throws\n&gt; Exception {\n&gt;       TestContextWithSingleTest.TestContext instance =\n&gt; testContext.createTestInstance();\n&gt;       assertThat(instance,\n&gt; is(instanceOf(TestContextWithSingleTest.TestContext.class)));\n&gt;     }\n&gt;\n&gt;     // ...\n&gt;   }\n&gt;\n&gt;   // ...\n&gt; }\n&gt;\n&gt; Code taken from:\n&gt; https://github.com/bechte/JUT/blob/master/src/test/java/de/bechte/jut/testables/TestContextTest.java\n&gt; (I crunched some lines for readability reasons).\n&gt;\n&gt; For those who are interested in more details, I uploaded JUT at github:\n&gt; https://github.com/bechte/JUT - I really think it is worth a look at and\n&gt; we might use some ideas from it for a future JUnit release (especially the\n&gt; lambda style expressions for exception handling, which I think is much more\n&gt; readable). :-)\n&gt;\n&gt; All the best,\n&gt;\n&gt; Stefan\n&gt;\n&gt; Am 08.01.2015 um 23:15 schrieb Stefan Birkner mail@...\n&gt; &lt;javascript:;&gt; [junit] &lt;junit@yahoogroups.com &lt;javascript:;&gt;&gt;:\n&gt;\n&gt; &gt;\n&gt; &gt; Hi Stefan,\n&gt; &gt;\n&gt; &gt; thank you for your feedback.\n&gt; &gt;\n&gt; &gt; The JUnit team itself wants to get rid of the Hamcrest dependency.\n&gt; Basically Hamcrest is an assertion library (like AssertJ, Truth, ...) and\n&gt; it can be independent from JUnit. Therefore it must only use JUnit&#39;s\n&gt; interfaces (AssertionError and AssumptionViolatedException) and JUnit must\n&gt; not use Hamcrest. Both is possible, but it needs a new JUnit major release.\n&gt; &gt;\n&gt; &gt; ciao,\n&gt; &gt; stefan\n&gt; &gt;\n&gt; &gt; 2015-01-08 21:46 GMT+01:00 Stefan stefan@... &lt;javascript:;&gt;\n&gt; [junit] &lt;junit@yahoogroups.com &lt;javascript:;&gt;&gt;:\n&gt; &gt;\n&gt; &gt; Hi,\n&gt; &gt;\n&gt; &gt; I&#39;m not a developer of junit nor hamcrest and I don&#39;t feel the pain of\n&gt; the tight integration of junit and hamcrest that &quot;prevents both from moving\n&gt; on&quot; but I&#39;m a heavy user of both.\n&gt; &gt; I don&#39;t think it&#39;s a good idea to separate the hamcrest integration from\n&gt; junit into it&#39;s own library.\n&gt; &gt;\n&gt; &gt; At the moment JUnit dictates the hamcrest version to be used but also\n&gt; guarantees compatibility with this version.\n&gt; &gt; With the new library hamcrest developers will dictate the junit version\n&gt; that is compatible with a specific hamcrest release. This is only a change\n&gt; in responsibility but has no benefits.\n&gt; &gt;\n&gt; &gt; Of course there is also the opportunity to provide a broader range of\n&gt; compatible versions. But this opportunity also means more work for the\n&gt; maintainers and slower adoption by users. JUnit 4.12 uses hamcrest 1.3.\n&gt; What if JUnit moves on to 4.13, 4.14 and hamcrest releases 2.0 and 2.1\n&gt; respectively. Will there be a version which is compatible with hamcrest 2.1\n&gt; and JUnit 4.13? Will there be a version which is compatible with JUnit 4.14\n&gt; and hamcrest 1.3?\n&gt; &gt;\n&gt; &gt; As a developer who want&#39;s to use JUnit 4.14 - how do I know which\n&gt; hamcrest-junit-integration version to use? What will stop me from using a\n&gt; wrong version? For example I might be tempted to update JUnit to 4.14 but\n&gt; forget to update hamcrest-junit-integration. There might be changes of the\n&gt; behaviour of JUnit that might cause some of my tests to pass always\n&gt; although they should fail. On the other hand: JUnit 4.14 might be binary\n&gt; incompatible to JUnit 4.12 - where to look for the right version of\n&gt; hamcrest-junit-integration?\n&gt; &gt;\n&gt; &gt; If hamcrest moves on to 2.0 - which could be binary incompatible to 1.3\n&gt; due to the major version change (haven&#39;t checked) - how long will hamcrest\n&gt; 1.3 be supported with latest JUnit versions by hamcrest-junit-integration?\n&gt; I&#39;m asking because we also use JMock which depends on hamcrest as well. If\n&gt; I update to an incompatible 2.0 I need also an update of JMock....\n&gt; &gt; (( Actually I cannot update JMock without big effort because there was\n&gt; an incompatible change from 2.5.1 to 2.6 .... ))\n&gt; &gt;\n&gt; &gt; On the other hand this will slow down speed for adoption of new JUnit\n&gt; versions because we have to wait until a new hamcrest-junit-integration\n&gt; version is out or at least someone has built the appropriate version with\n&gt; latest JUnit release and verified unit tests are still passing. It will\n&gt; also increase the effort necessary to try JUnit release candidates or\n&gt; snapshots in real projects (because I also have to checkout and build the\n&gt; integration library myself to be sure there is no problem with that... and\n&gt; if there is a problem I need to fix it myself or stop using latest JUnit\n&gt; release candidate).\n&gt; &gt;\n&gt; &gt; ----\n&gt; &gt; IMHO decoupling JUnit and hamcrest has more drawbacks than benefits.\n&gt; Although I see it can be a chance for hamcrest to move on. I don&#39;t think\n&gt; JUnit as a project will profit that much. JUnit users might have a broader\n&gt; choice of compatible hamcrest versions but this requires some effort (of\n&gt; the maintainers of hamcrest-junit-integration). I think this might only\n&gt; work well for JUnit users if the JUnit team commits to that integration\n&gt; project and is able to push out new releases of the\n&gt; hamcrest-junit-integration together with new JUnit releases.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Regards,\n&gt; &gt; Stefan\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt; Am 07.01.2015 um 08:31 schrieb Stefan Birkner mail@...\n&gt; &lt;javascript:;&gt; [junit]:\n&gt; &gt;&gt;\n&gt; &gt;&gt; FYI: Nat Pryce took a first step for decoupling JUnit and Hamcrest:\n&gt; &gt;&gt; http://natpryce.com/articles/000806.html\n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt;\n&gt; [Non-text portions of this message have been removed]\n&gt;\n&gt;\n&gt;\n&gt; ------------------------------------\n&gt; Posted by: Stefan Bechtold &lt;stefan.bechtold@... &lt;javascript:;&gt;&gt;\n&gt; ------------------------------------\n&gt;\n&gt;\n&gt; ------------------------------------\n&gt;\n&gt; Yahoo Groups Links\n&gt;\n&gt;\n&gt;\n&gt;\n\n-- \nSent from my phone\n\r\n--089e0102dc32ac7e36050c662345\r\nContent-Type: text/html; charset=UTF-8\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nWell I think this thread should be opened up to more than just people calle=\r\nd &quot;Stefan&quot;, I personally think any of the other forms of the Stev=\r\nen name is wide enough to be opening up ;-)&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;From having =\r\nplayed with how some of the JavaScript testing frameworks work, I would ten=\r\nd to agree.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;JUnit should focus on test execution. =\r\nA lot of people have strong opinions on how an assertion framework&#39;s DS=\r\nL should look... But the assertion frameworks can all agree that an asserti=\r\non failure should result in an AssertionError, and the message of the excep=\r\ntion is what went wrong.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;The only other point wher=\r\ne I think an assertion framework needs to interface with a test runner is a=\r\nssumptions.=C2=A0&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;If we can find a way to have a s=\r\nhared assumption exception class (could be a simple one class jar file push=\r\ned to Central for everyone to use, could be a text matching on the name of =\r\nthe assertion error class tree... Just decide an interface spec then the as=\r\nsertion framework should be out of the loop... Which is a good thing.&lt;/div&gt;=\r\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;I think Stefan&#39;s concerns about cross version compatibil=\r\nity are moot for this case as the way to decouple them is through an agreed=\r\n upon java.lang.AssertionError class, so the spec becomes simpler not more =\r\ncomplex&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;So Stefan, I agree with your plan, and I agree w=\r\nith Stefan&#39;s experiments in deriving a TDD framework using TDD but I di=\r\nsagree with Stefan&#39;s fears of compatability hell as in this case the re=\r\nfactoring will reduce the overlap and hence the opertunity for compatabilit=\r\ny hell&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;-Stephen&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;div&gt;&lt;br&gt;On Sunday, =\r\n11 January 2015, Stefan Bechtold &lt;a href=3D&quot;mailto:stefan.bechtold@...&quot;&gt;=\r\nstefan.bechtold@...&lt;/a&gt; [junit] &lt;&lt;a href=3D&quot;mailto:junit@yahoogroups.=\r\ncom&quot;&gt;junit@yahoogroups.com&lt;/a&gt;&gt; wrote:&lt;br&gt;&lt;blockquote class=3D&quot;gmail_quo=\r\nte&quot; style=3D&quot;margin:0 0 0 .8ex;border-left:1px #ccc solid;padding-left:1ex&quot;=\r\n&gt;Hi,&lt;br&gt;\n&lt;br&gt;\nthis seems to be a discussion from Stefan to Stefan, so I can=\r\nt hesitate to post an answer. ;-)&lt;br&gt;\n&lt;br&gt;\nI really think that separation i=\r\ns a good thing and should be enforced by the JUnit team. Hamcrest is a grea=\r\nt framework for assertions, but in some cases it is not needed or not the b=\r\nest fit. So the test writers should have to possibility to choose the asser=\r\ntion framework of their choice and the testing framework should smoothly wo=\r\nrk with it.&lt;br&gt;\n&lt;br&gt;\nWhat&#39;s behind my opinion? Some months ago I was pl=\r\naying around with different unit testing frameworks. While I was doing so I=\r\n asked myself the question: How do you develop a unit testing framework usi=\r\nng TDD practices? I sat down and started to create the first bits of code t=\r\nhat would represent a &quot;unit test&quot;. With this very simple test in =\r\nplace I wrote some production code to execute the test case. Fun it was! I =\r\ntried some more tests and continued to play around like this for some hours=\r\n and when I finished I realized that I had developed a very rudimental unit=\r\n testing framework. While being very rudimental, the framework still suppor=\r\nts things like:&lt;br&gt;\n&lt;br&gt;\n- @Test, @Before, @After, @Ignore, @Context (like =\r\nthe hierarchical context runner for JUnit)&lt;br&gt;\n- Test Groups and Test Suite=\r\ns,&lt;br&gt;\n- Reporters (still no support for Listeners, but soon to come ;-))&lt;b=\r\nr&gt;\n- Extendable Tests Creators (you can register a Factory to support your =\r\nown Test Cases, like cucumber files, etc.)&lt;br&gt;\n&lt;br&gt;\nThe core idea of the fr=\r\namework was not to create a new standard, but to play around with TDD for b=\r\nuilding a Unit Testing Framework. I came up with two guidelines, which I th=\r\nink are very important for a next generation of JUnit (5.x for example):&lt;br=\r\n&gt;\n&lt;br&gt;\n1. Provide a flexible and extendable framework that only cares about=\r\n the execution and reporting of test cases and results&lt;br&gt;\n2. Don&#39;t str=\r\nuggle with things third party libraries can offer, i.e. don&#39;t try to be=\r\n the one-and-only tool for TDD&lt;br&gt;\n&lt;br&gt;\nIn order to be flexible and extenda=\r\nble, I think there should be some kind of application context that third pa=\r\nrty libraries may register themselves for certain activities, e.g. finding =\r\ntest cases (no longer limited to annotated Java Classes, input can be anyth=\r\ning like cucumber tests), providing assertions (I simply used Hamcrest in m=\r\ny tests, but the user of the framework should be free to choose anything th=\r\nat throws an AssertionError), or to run tests multiple times or expect exce=\r\nptions (I used Java 8 lambdas to create a very well readable syntax for it)=\r\n. I finally felt like this is the way to go: Separate the core framework fr=\r\nom things that can be easily provided separately.&lt;br&gt;\n&lt;br&gt;\nTo give a very s=\r\nhort impression of what a test will look like using my framework, look at t=\r\nhis test case:&lt;br&gt;\n&lt;br&gt;\n// ...&lt;br&gt;\n&lt;br&gt;\npublic class TestContextTest {&lt;br&gt;\n=\r\n=C2=A0 @Test&lt;br&gt;\n=C2=A0 public void givenInvalidTestContext_createInstanceF=\r\nails() throws Exception {&lt;br&gt;\n=C2=A0 =C2=A0 expectThrowable(AssertionError.=\r\nclass).withMessage(&quot;Class not instantiable&quot;).in(() -&gt; {&lt;br&gt;\n=\r\n=C2=A0 =C2=A0 =C2=A0 TestClass testClass =3D new TestClass(TestContextWithP=\r\nrivateConstructor.class);&lt;br&gt;\n=C2=A0 =C2=A0 =C2=A0 TestContext testContext =\r\n=3D new TestContext(testClass, TestContextWithPrivateConstructor.InvalidCon=\r\ntext.class);&lt;br&gt;\n=C2=A0 =C2=A0 =C2=A0 testContext.createTestInstance();&lt;br&gt;=\r\n\n=C2=A0 =C2=A0 });&lt;br&gt;\n=C2=A0 }&lt;br&gt;\n&lt;br&gt;\n=C2=A0 @Context&lt;br&gt;\n=C2=A0 public =\r\nclass GivenTestContextWithSingleTest {&lt;br&gt;\n=C2=A0 =C2=A0 // ...&lt;br&gt;\n&lt;br&gt;\n=\r\n=C2=A0 =C2=A0 @Before&lt;br&gt;\n=C2=A0 =C2=A0 public void setupTestContext() thro=\r\nws Exception {&lt;br&gt;\n=C2=A0 =C2=A0 =C2=A0 parentInstance =3D new TestContextW=\r\nithSingleTest();&lt;br&gt;\n=C2=A0 =C2=A0 =C2=A0 testClass =3D new TestClassMock(p=\r\narentInstance);&lt;br&gt;\n=C2=A0 =C2=A0 =C2=A0 testContext =3D new TestContext(te=\r\nstClass, TestContextWithSingleTest.TestContext.class);&lt;br&gt;\n=C2=A0 =C2=A0 }&lt;=\r\nbr&gt;\n&lt;br&gt;\n=C2=A0 =C2=A0 @Test&lt;br&gt;\n=C2=A0 =C2=A0 public void createsAValidTes=\r\ntInstanceOfClassUnderTest() throws Exception {&lt;br&gt;\n=C2=A0 =C2=A0 =C2=A0 Tes=\r\ntContextWithSingleTest.TestContext instance =3D testContext.createTestInsta=\r\nnce();&lt;br&gt;\n=C2=A0 =C2=A0 =C2=A0 assertThat(instance, is(instanceOf(TestCont=\r\nextWithSingleTest.TestContext.class)));&lt;br&gt;\n=C2=A0 =C2=A0 }&lt;br&gt;\n&lt;br&gt;\n=C2=A0=\r\n =C2=A0 // ...&lt;br&gt;\n=C2=A0 }&lt;br&gt;\n&lt;br&gt;\n=C2=A0 // ...&lt;br&gt;\n}&lt;br&gt;\n&lt;br&gt;\nCode take=\r\nn from: &lt;a href=3D&quot;https://github.com/bechte/JUT/blob/master/src/test/java/=\r\nde/bechte/jut/testables/TestContextTest.java&quot; target=3D&quot;_blank&quot;&gt;https://git=\r\nhub.com/bechte/JUT/blob/master/src/test/java/de/bechte/jut/testables/TestCo=\r\nntextTest.java&lt;/a&gt; (I crunched some lines for readability reasons).&lt;br&gt;\n&lt;br=\r\n&gt;\nFor those who are interested in more details, I uploaded JUT at github: &lt;=\r\na href=3D&quot;https://github.com/bechte/JUT&quot; target=3D&quot;_blank&quot;&gt;https://github.c=\r\nom/bechte/JUT&lt;/a&gt; - I really think it is worth a look at and we might use s=\r\nome ideas from it for a future JUnit release (especially the lambda style e=\r\nxpressions for exception handling, which I think is much more readable). :-=\r\n)&lt;br&gt;\n&lt;br&gt;\nAll the best,&lt;br&gt;\n&lt;br&gt;\nStefan&lt;br&gt;\n&lt;br&gt;\nAm 08.01.2015 um 23:15 sc=\r\nhrieb Stefan Birkner &lt;a href=3D&quot;javascript:;&quot; onclick=3D&quot;_e(event, &#39;cvm=\r\nl&#39;, &#39;mail@...&#39;)&quot;&gt;mail@...&lt;/a&gt; [juni=\r\nt] &lt;&lt;a href=3D&quot;javascript:;&quot; onclick=3D&quot;_e(event, &#39;cvml&#39;, &#39;j=\r\nunit@yahoogroups.com&#39;)&quot;&gt;junit@yahoogroups.com&lt;/a&gt;&gt;:&lt;br&gt;\n&lt;br&gt;\n&gt;&lt;br=\r\n&gt;\n&gt; Hi Stefan,&lt;br&gt;\n&gt;&lt;br&gt;\n&gt; thank you for your feedback.&lt;br&gt;\n&gt;&lt;b=\r\nr&gt;\n&gt; The JUnit team itself wants to get rid of the Hamcrest dependency. =\r\nBasically Hamcrest is an assertion library (like AssertJ, Truth, ...) and i=\r\nt can be independent from JUnit. Therefore it must only use JUnit&#39;s int=\r\nerfaces (AssertionError and AssumptionViolatedException) and JUnit must not=\r\n use Hamcrest. Both is possible, but it needs a new JUnit major release.&lt;br=\r\n&gt;\n&gt;&lt;br&gt;\n&gt; ciao,&lt;br&gt;\n&gt; stefan&lt;br&gt;\n&gt;&lt;br&gt;\n&gt; 2015-01-08 21:46 GM=\r\nT+01:00 Stefan &lt;a href=3D&quot;javascript:;&quot; onclick=3D&quot;_e(event, &#39;cvml&#39;=\r\n, &#39;stefan@...&#39;)&quot;&gt;stefan@...&lt;/a&gt; [junit] &lt;&lt;a hr=\r\nef=3D&quot;javascript:;&quot; onclick=3D&quot;_e(event, &#39;cvml&#39;, &#39;junit@yahoogr=\r\noups.com&#39;)&quot;&gt;junit@yahoogroups.com&lt;/a&gt;&gt;:&lt;br&gt;\n&gt;&lt;br&gt;\n&gt; Hi,&lt;br&gt;\n&g=\r\nt;&lt;br&gt;\n&gt; I&#39;m not a developer of junit nor hamcrest and I don&#39;t f=\r\neel the pain of the tight integration of junit and hamcrest that &quot;prev=\r\nents both from moving on&quot; but I&#39;m a heavy user of both.&lt;br&gt;\n&gt; I=\r\n don&#39;t think it&#39;s a good idea to separate the hamcrest integration =\r\nfrom junit into it&#39;s own library.&lt;br&gt;\n&gt;&lt;br&gt;\n&gt; At the moment JUnit=\r\n dictates the hamcrest version to be used but also guarantees compatibility=\r\n with this version.&lt;br&gt;\n&gt; With the new library hamcrest developers will =\r\ndictate the junit version that is compatible with a specific hamcrest relea=\r\nse. This is only a change in responsibility but has no benefits.&lt;br&gt;\n&gt;&lt;b=\r\nr&gt;\n&gt; Of course there is also the opportunity to provide a broader range =\r\nof compatible versions. But this opportunity also means more work for the m=\r\naintainers and slower adoption by users. JUnit 4.12 uses hamcrest 1.3. What=\r\n if JUnit moves on to 4.13, 4.14 and hamcrest releases 2.0 and 2.1 respecti=\r\nvely. Will there be a version which is compatible with hamcrest 2.1 and JUn=\r\nit 4.13? Will there be a version which is compatible with JUnit 4.14 and ha=\r\nmcrest 1.3?&lt;br&gt;\n&gt;&lt;br&gt;\n&gt; As a developer who want&#39;s to use JUnit 4.=\r\n14 - how do I know which hamcrest-junit-integration version to use? What wi=\r\nll stop me from using a wrong version? For example I might be tempted to up=\r\ndate JUnit to 4.14 but forget to update hamcrest-junit-integration. There m=\r\night be changes of the behaviour of JUnit that might cause some of my tests=\r\n to pass always although they should fail. On the other hand: JUnit 4.14 mi=\r\nght be binary incompatible to JUnit 4.12 - where to look for the right vers=\r\nion of hamcrest-junit-integration?&lt;br&gt;\n&gt;&lt;br&gt;\n&gt; If hamcrest moves on t=\r\no 2.0 - which could be binary incompatible to 1.3 due to the major version =\r\nchange (haven&#39;t checked) - how long will hamcrest 1.3 be supported with=\r\n latest JUnit versions by hamcrest-junit-integration? I&#39;m asking becaus=\r\ne we also use JMock which depends on hamcrest as well. If I update to an in=\r\ncompatible 2.0 I need also an update of JMock....&lt;br&gt;\n&gt; (( Actually I ca=\r\nnnot update JMock without big effort because there was an incompatible chan=\r\nge from 2.5.1 to 2.6 .... ))&lt;br&gt;\n&gt;&lt;br&gt;\n&gt; On the other hand this will =\r\nslow down speed for adoption of new JUnit versions because we have to wait =\r\nuntil a new hamcrest-junit-integration version is out or at least someone h=\r\nas built the appropriate version with latest JUnit release and verified uni=\r\nt tests are still passing. It will also increase the effort necessary to tr=\r\ny JUnit release candidates or snapshots in real projects (because I also ha=\r\nve to checkout and build the integration library myself to be sure there is=\r\n no problem with that... and if there is a problem I need to fix it myself =\r\nor stop using latest JUnit release candidate).&lt;br&gt;\n&gt;&lt;br&gt;\n&gt; ----&lt;br&gt;\n&=\r\ngt; IMHO decoupling JUnit and hamcrest has more drawbacks than benefits. Al=\r\nthough I see it can be a chance for hamcrest to move on. I don&#39;t think =\r\nJUnit as a project will profit that much. JUnit users might have a broader =\r\nchoice of compatible hamcrest versions but this requires some effort (of th=\r\ne maintainers of hamcrest-junit-integration). I think this might only work =\r\nwell for JUnit users if the JUnit team commits to that integration project =\r\nand is able to push out new releases of the hamcrest-junit-integration toge=\r\nther with new JUnit releases.&lt;br&gt;\n&gt;&lt;br&gt;\n&gt;&lt;br&gt;\n&gt; Regards,&lt;br&gt;\n&gt; =\r\nStefan&lt;br&gt;\n&gt;&lt;br&gt;\n&gt;&lt;br&gt;\n&gt;&lt;br&gt;\n&gt; Am 07.01.2015 um 08:31 schrieb S=\r\ntefan Birkner &lt;a href=3D&quot;javascript:;&quot; onclick=3D&quot;_e(event, &#39;cvml&#39;,=\r\n &#39;mail@...&#39;)&quot;&gt;mail@...&lt;/a&gt; [junit]:&lt;br&gt;=\r\n\n&gt;&gt;&lt;br&gt;\n&gt;&gt; FYI: Nat Pryce took a first step for decoupling JUni=\r\nt and Hamcrest:&lt;br&gt;\n&gt;&gt; &lt;a href=3D&quot;http://natpryce.com/articles/000806=\r\n.html&quot; target=3D&quot;_blank&quot;&gt;http://natpryce.com/articles/000806.html&lt;/a&gt;&lt;br&gt;\n&=\r\ngt;&gt;&lt;br&gt;\n&gt;&lt;br&gt;\n&gt;&lt;br&gt;\n&gt;&lt;br&gt;\n&gt;&lt;br&gt;\n&gt;&lt;br&gt;\n&lt;br&gt;\n&lt;br&gt;\n&lt;br&gt;\n[No=\r\nn-text portions of this message have been removed]&lt;br&gt;\n&lt;br&gt;\n&lt;br&gt;\n&lt;br&gt;\n-----=\r\n-------------------------------&lt;br&gt;\nPosted by: Stefan Bechtold &lt;&lt;a href=\r\n=3D&quot;javascript:;&quot; onclick=3D&quot;_e(event, &#39;cvml&#39;, &#39;stefan.bechtold=\r\n@...&#39;)&quot;&gt;stefan.bechtold@...&lt;/a&gt;&gt;&lt;br&gt;\n-------------------------=\r\n-----------&lt;br&gt;\n&lt;br&gt;\n&lt;br&gt;\n------------------------------------&lt;br&gt;\n&lt;br&gt;\nYah=\r\noo Groups Links&lt;br&gt;\n&lt;br&gt;\n&lt;*&gt; To visit your group on the web, go to:&lt;b=\r\nr&gt;\n=C2=A0 =C2=A0 &lt;a href=3D&quot;http://groups.yahoo.com/group/junit/&quot; target=3D=\r\n&quot;_blank&quot;&gt;http://groups.yahoo.com/group/junit/&lt;/a&gt;&lt;br&gt;\n&lt;br&gt;\n&lt;*&gt; Your e=\r\nmail settings:&lt;br&gt;\n=C2=A0 =C2=A0 Individual Email | Traditional&lt;br&gt;\n&lt;br&gt;\n&l=\r\nt;*&gt; To change settings online go to:&lt;br&gt;\n=C2=A0 =C2=A0 &lt;a href=3D&quot;http:=\r\n//groups.yahoo.com/group/junit/join&quot; target=3D&quot;_blank&quot;&gt;http://groups.yahoo.=\r\ncom/group/junit/join&lt;/a&gt;&lt;br&gt;\n=C2=A0 =C2=A0 (Yahoo! ID required)&lt;br&gt;\n&lt;br&gt;\n&l=\r\nt;*&gt; To change settings via email:&lt;br&gt;\n=C2=A0 =C2=A0 &lt;a href=3D&quot;javascri=\r\npt:;&quot; onclick=3D&quot;_e(event, &#39;cvml&#39;, &#39;junit-digest@...=\r\nm&#39;)&quot;&gt;junit-digest@yahoogroups.com&lt;/a&gt;&lt;br&gt;\n=C2=A0 =C2=A0 &lt;a href=3D&quot;java=\r\nscript:;&quot; onclick=3D&quot;_e(event, &#39;cvml&#39;, &#39;junit-fullfeatured@yaho=\r\nogroups.com&#39;)&quot;&gt;junit-fullfeatured@yahoogroups.com&lt;/a&gt;&lt;br&gt;\n&lt;br&gt;\n&lt;*&gt=\r\n; To unsubscribe from this group, send an email to:&lt;br&gt;\n=C2=A0 =C2=A0 &lt;a hr=\r\nef=3D&quot;javascript:;&quot; onclick=3D&quot;_e(event, &#39;cvml&#39;, &#39;junit-unsubsc=\r\nribe@yahoogroups.com&#39;)&quot;&gt;junit-unsubscribe@yahoogroups.com&lt;/a&gt;&lt;br&gt;\n&lt;br&gt;\n=\r\n&lt;*&gt; Your use of Yahoo Groups is subject to:&lt;br&gt;\n=C2=A0 =C2=A0 &lt;a href=\r\n=3D&quot;https://info.yahoo.com/legal/us/yahoo/utos/terms/&quot; target=3D&quot;_blank&quot;&gt;ht=\r\ntps://info.yahoo.com/legal/us/yahoo/utos/terms/&lt;/a&gt;&lt;br&gt;\n&lt;br&gt;\n&lt;/blockquote&gt;&lt;=\r\n/div&gt;&lt;/div&gt;&lt;br&gt;&lt;br&gt;-- &lt;br&gt;Sent from my phone&lt;br&gt;\n\r\n--089e0102dc32ac7e36050c662345--\r\n\n", 
    "profile": "stephenalanconnolly", 
    "topicId": 24625, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 458231986, 
    "prevInTime": 24628, 
    "contentTrasformed": false, 
    "postDate": "1421007708", 
    "canDelete": false, 
    "nextInTopic": 24630, 
    "prevInTopic": 24628, 
    "headers": {
        "inReplyToHeader": "PDA4MjU2NjNBLTZGOEItNDA4My04OTUzLTY4MTA2RUVBQTA2RUBtZS5jb20+", 
        "messageIdInHeader": "PENBK25Qbk14blVaK2RZQUVFaWNvT3RWa3hFWDBqOWpiZlJPYmVxblBkUitReTZfNkwzd0BtYWlsLmdtYWlsLmNvbT4=", 
        "referencesHeader": "PENBSGhZVko1OGN1NU1DS3FkYVZmR3E2OVI2MDI2Z2tOVUZBNVBDNFJrRms0TmFlU2lSQUBtYWlsLmdtYWlsLmNvbT4JPDU0QUVFQ0EwLjgwMTA5MDVAY3lwaG9yaWEubmV0Pgk8Q0FIaFlWSjRxbl94dmIrY1ppcXpybTVFNFdGMy1xdlRfeEV6c0pQUzByeD1oTmVjVTNRQG1haWwuZ21haWwuY29tPgk8MDgyNTY2M0EtNkY4Qi00MDgzLTg5NTMtNjgxMDZFRUFBMDZFQG1lLmNvbT4="
    }
}