{
    "numMessagesInTopic": 1, 
    "nextInTime": 24738, 
    "senderId": "zQesIOJycNQVvmaMvKg_PRhW3AkUA_oo6LvHF_YYPmU7gfIG_DjsI4ApTiuXc3T71UIP8oKX6EYqa4KEfzXz-dOQ", 
    "systemMessage": false, 
    "subject": "2016 Keeper of the Green Bar: Marc Philipp", 
    "from": "David Saff &lt;david@...&gt;", 
    "authorName": "David Saff", 
    "msgSnippet": "All, JUnit as an open-source project has evolved: - from an experimental bit of pair-programming on an airplane - to a continuing agile project with 2 or 3", 
    "msgId": 24737, 
    "profile": "dsaff", 
    "topicId": 24737, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 341876227, 
    "messageBody": "<div id=\"ygrps-yiv-2052716942\"><div dir=\"ltr\"><div>All,<br></div><div><br></div><div>JUnit as an open-source project has evolved:</div><div><br></div><div>- from an experimental bit of pair-programming on an airplane</div><div>- to a continuing agile project with 2 or 3 devs working together on a shared screen</div><div>- to today, when it is best seen as a traditional open-source project, hosted on GitHub, with an issue tracker and a team of committers who evaluate incoming pull requests.</div><div><br></div><div>In the first decade or so of JUnit&#39;s existence, project leadership and project contributors were largely synonymous, and decisions were made by unanimous consent.  For a few years, I was making most of the decisions solo.  But then a group of excellent developers with more wisdom and time than I began to contribute time and direction, as I became more and more involved with non-JUnit projects.</div><div><br></div><div>For clarity in the user and developer community, we wanted to make the leadership structure of JUnit a little more explicit.  So we&#39;re introducing the role of Keeper of the Green Bar.</div><div><br></div><div>The Keeper:</div><div><br></div><div>1) Makes simple decisions without the need for consultation.</div><div><br></div><div>2) Refers complex decisions to the appropriate group of consultants, e.g. the other maintainers, and then makes a decision based on their feedback.</div><div><br></div><div>3) Has a good instinct for which is which.  :-)</div><div><br></div><div>This is a one-year renewable position, which can change hands each calendar year.</div><div><br></div><div>It&#39;s my pleasure to declare that by unanimous consent of the current JUnit maintainers, the Keeper of the Green Bar for 2016 is Marc Philipp. Marc has been keeping the lights on for JUnit on GitHub for several years now, and has been instrumental in the creation of the crowdfunded JUnit Lambda project that is giving JUnit a vision of the future.  We&#39;re excited to see where JUnit is headed in the new year!</div><div><br></div><div>Thanks,</div><div><br></div><div>David Saff</div></div></div>", 
    "prevInTime": 24736, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1452198472", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PENBQ2o4QnVQYXhqM0U3ZTB6TWo0Q05FSGhFenAtRU9DX2hhaFlQUmdiQ3BoWlZLRjh3d0BtYWlsLmdtYWlsLmNvbT4="
    }
}