{
    "numMessagesInTopic": 7, 
    "nextInTime": 24755, 
    "senderId": "cZBx73OTTBec8-h1u8gDGBt22xAuNP665UVogCFN9yWaQp034V3kttjfl7hQzaLY9qc7aoD_nzgTAcov9RQtRAuWukXkhg", 
    "systemMessage": false, 
    "subject": "Parallel runner & Eclipse?", 
    "from": "Chris &lt;devnullaccount@...&gt;", 
    "authorName": "Chris", 
    "msgSnippet": "Hi, this may be somewhat out of scope, but I m posting here anyway since I have tried other relevant places with no replies :) We have a company-internal JUnit", 
    "msgId": 24754, 
    "profile": "devnullaccount", 
    "topicId": 24754, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 563548509, 
    "messageBody": "<div id=\"ygrps-yiv-1034146224\">Hi,<br/>\n<br/>\nthis may be somewhat out of scope, but I&#39;m posting here anyway since I have tried other relevant places with no replies :)<br/>\n<br/>\nWe have a company-internal JUnit 4 runner that can spawn multiple parallel &quot;workers&quot; to run our JUnit tests in parallel by dividing test classes between the workers (we would have liked to make it public, but company policy, yada yada). It has worked fine for years and gives a large speedup when we run the suite from commandline/ant.<br/>\nBut with more recent versions of Eclipse and Java 8, even single-worker operation eats up nearly the entire CPU and Eclipse seems to spawn up an insane amount of threads to run JUnit tests. So using multiple workers only slows down the runtime from Eclipse since we&#39;re basically swapping between the threads.<br/>\nWe have not managed to figure out exactly which version it happened and not sure if the problem existed with Java 7 or not, so I can&#39;t say if it is eclipse, java 8 or the eclipse junit plugin that is the bad guy. But since ant can take advantage of the parallelism on the same machine with the same java version, Eclipse seems like the culprit here.<br/>\n<br/>\nIs there anyone around here that has a clue if e.g. the Eclipse JUnit plugin has changed in a way that would cause this or if it is &quot;base Eclipse&quot; behavior. If anyone has some ideas on a workaround, that would be even better!<br/>\n<br/>\nBR,<br/>\n  Chris</div>", 
    "prevInTime": 24753, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1475830898", 
    "canDelete": false, 
    "nextInTopic": 24755, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDIxNjIwNzgyOS42NTgwMjQuMTQ3NTgzMDg5ODg0OUBtYWlsLnlhaG9vLmNvbT4=", 
        "referencesHeader": "PDIxNjIwNzgyOS42NTgwMjQuMTQ3NTgzMDg5ODg0OS5yZWZAbWFpbC55YWhvby5jb20+"
    }
}