{
    "numMessagesInTopic": 10, 
    "nextInTime": 2535, 
    "senderId": "oUD-sX7sH3veuTDmZ0wcURvpoBdKUaVhzZs5urPN2k3xS4aC85X8pIDoWbMpNgUEQWYtMHx-3BJG8XVGT5bc0Bm6vg5S14lKWjbCVWqm1dy3RQs", 
    "systemMessage": false, 
    "subject": "Failing multiple times in one test", 
    "from": "Laurent Duperval &lt;lduperval@...&gt;", 
    "authorName": "Laurent Duperval", 
    "msgSnippet": "Hi, I m writing a test whose purpose is to make sure that a Hashtable contains a certain set of keys. Basically, the test will make sure that someone filling ", 
    "msgId": 2534, 
    "topicId": 2534, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-854171509\">Hi,<br/>\n<br/>\nI&#39;m writing a test whose purpose is to make sure that a Hashtable contains a<br/>\ncertain set of keys. Basically, the test will make sure that someone filling<br/>\nout a form on the web provides all the mandatory info.<br/>\n<br/>\nI was thinking of creating the hash table with every set of keys, then to<br/>\nremove one key each time to test all the keys and make sure that the<br/>\nprocessing fails for each mandatory key. Now, I&#39;m looking for the best way<br/>\nto show a failure. I could do a fail() and have to run the test multiple<br/>\ntimes until I get my processing correctly. This approach is pretty stop and<br/>\ngo. I could also have the test fill an ArrayList with all the parameters<br/>\nthat failed. But that&#39;s not quite what I want either. I&#39;d like a way to make<br/>\nthe test fail for every parameter that is missing and consider each of the<br/>\niterations as one test. For example, if I want to check for last name, first<br/>\nname and email address, I&#39;d like to only write one method that checks for<br/>\nthe existence of each of these items. But in my report, I want &quot;Tests run:<br/>\n3&quot; not &quot;1&quot;. How do I approach this?<br/>\n<br/>\nThanks,<br/>\n<br/>\nL<br/>\n<br/>\n-- <br/>\nLaurent Duperval &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lduperval@...\">lduperval@...</a>&gt;<br/>\n<br/>\nLa lettre, exsangue et chiffonnée, hors d&#39;haleine mais triomphante, aboutit<br/>\nenfin entre les mains de celui qui suscita toute l&#39;extraordinaire odyssée<br/>\nd&#39;émotion que je viens de vous narrer: MOI!<br/>\n                                             -Achille Talon</div>", 
    "prevInTime": 2533, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "999262207", 
    "canDelete": false, 
    "nextInTopic": 2544, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDIwMDEwODMxMTI1MTUyLkE2NEMwNDY4RDBAbGVuYXJkLm1pY3JvY2VsbGk1LmNvbT4="
    }
}