{
    "numMessagesInTopic": 13, 
    "nextInTime": 2639, 
    "senderId": "NFl9BPldwf0VUy4wi5L100tvx5omsnkXhTcQ93OawGi57aOqZmH4K7AzIS4ZVl_dVOmgPvr1EtTCyZA_tyBJuYFl9nDG_4ZqYLOKJUupmdemVg", 
    "systemMessage": false, 
    "subject": "Re: [junit] German book on Junit and test first ready for review", 
    "from": "Vladimir Bossicard &lt;vladimir@...&gt;", 
    "authorName": "Vladimir Bossicard", 
    "msgSnippet": "... I haven t read the entire book (did quick overview + read the chapter about JUnit) but this book presents the testing methodology and not only JUnit.  I", 
    "msgId": 2638, 
    "topicId": 2616, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-362405498\"><blockquote><span title=\"ireply\">&gt; &gt; In the world of languages, there is English and there is also French,<br/>\n&gt; &gt; German, Hindi...  Several books already exist in English so one in<br/>\n&gt; &gt; German cannot arm.<br/>\n&gt; <br/>\n&gt; While I have many books that mention JUnit, I have yet to read one that<br/>\n&gt; is about JUnit. Any recommendations. Alas, being a parochial American,<br/>\n&gt; English is the only language in which I can read technical books.<br/>\n<br/>\n </span></blockquote>I haven&#39;t read the entire book (did quick overview + read the chapter about JUnit) but this book presents the testing methodology and not only JUnit.  I don&#39;t think that you can write 200+ pages about JUnit.  The chapter about JUnit is about 20 pages and describes how to write a test case, a suite and execute tests.  Nothing new if you have access to the documentation.<br/>\n<br/>\nWhat is more interesting about this book is the presentation of several testing methods (mock objects for ex.).  I think this book is worth reading but if you don&#39;t want to learn German (...) you will find plenty of other books written in a language you better understand.<br/>\n<br/>\n-Vladimir</div>", 
    "prevInTime": 2637, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1000142480", 
    "canDelete": false, 
    "nextInTopic": 2640, 
    "prevInTopic": 2636, 
    "headers": {
        "messageIdInHeader": "PDIwMDEwOTEwMTcyMTIwLjE4NDA0LmNwbXRhQGMwMDcuc252LmNwLm5ldD4="
    }
}