{
    "numMessagesInTopic": 1, 
    "nextInTime": 2657, 
    "senderId": "TNq7qmfSu541kPefWn-9-XB4rAVk_G8P-N4mhRPy9g2Qhn1uJd6MbhqDvGSxIYRnbRJ6WOq1haqMKMqDlvdzQoyUkQ", 
    "systemMessage": false, 
    "subject": "OT: Info on Automated testing w/Ant & Junit?", 
    "from": "Paul Michali &lt;pcm@...&gt;", 
    "authorName": "Paul Michali", 
    "msgSnippet": "Can someone give me pointers to info on how I can setup automated building & testing for Java apps? I m looking at doing frequent builds (e.g. nightly builds)", 
    "msgId": 2656, 
    "topicId": 2656, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-2058077582\">Can someone give me pointers to info on how I can setup automated<br/>\nbuilding & testing for Java apps? I&#39;m looking at doing frequent<br/>\nbuilds (e.g. nightly builds) and am not sure how to get all the<br/>\npieces to work together.<br/>\n<br/>\nHere&#39;s what I (think I) know so far...<br/>\n<br/>\nThe development platform is Windows NT 4.0 SP 6.<br/>\n<br/>\nI have an Java application, Ant, and JUnit. I can, via Ant, build<br/>\nand run the JUnit tests that I have created.<br/>\n<br/>\nI just grabbed a copy of CVS and placed all the files under CVS.<br/>\n<br/>\nI downloaded TomCat and installed Tomcat and can start it up.<br/>\n<br/>\nI downloaded CruiseControl, JCVS, and jcvslet.<br/>\n<br/>\n<br/>\nHere&#39;s where I&#39;m stuck and could use pointers to some info/docs<br/>\non this stuff.<br/>\n<br/>\nA) How to setup CVS to allow other developers to access/change the<br/>\n   code (server mode)? I D/Led JCVS client code, but I&#39;m not sure<br/>\n   what I need to do, to get a CVS server going. Do I run the<br/>\n   jcvslet? If so how? I&#39;d like to understand how to setup to use<br/>\n   CVS in a multi-developer environment (I used to other tools).<br/>\n<br/>\nB) It sounds like to automate the build I need to run CruiseControl.<br/>\n   Part of the setup for CruiseControl says to install a servlet<br/>\n   engine (TomCat). I have done that, but I don&#39;t know how to configure<br/>\n   TomCat (type 1,2 or 3 mode). Also I don&#39;t know how to install the<br/>\n   WAR file like they are saying. I guess I don&#39;t have a grasp yet on<br/>\n   all this servlet stuff (any book suggestions?).<br/>\n<br/>\nC) I&#39;d like to get to the point where it checks to see if files have<br/>\n   been altered (checked in) and will automatically check out the<br/>\n   latest code and build it, run the tests, and e-mail me the results.<br/>\n   It sounds like CruiseCOntrol will do all this. Is that correct? Do<br/>\n   I have to run CVS in server (versus local) mode to do all this?<br/>\n<br/>\n<br/>\nWow! There sure is alot to all this. If you have any insights, know of<br/>\nweb pages or docs, or newsgroups where this has been hashed out<br/>\nalready, I sure would appreciate any info you can provide.<br/>\n<br/>\nThanks in advance!<br/>\n<br/>\n <br/>\nPCM (Paul Michali)<br/>\n<br/>\nCarrier Voice Gateway Business Unit (CVGBU)<br/>\nCisco Systems, Inc.<br/>\n250 Apollo Drive<br/>\nChelmsford, MA 01824<br/>\n<br/>\nPhone : (800) 572-6771 x 45817  (978) 244-5817 [direct]<br/>\nPaging: (800) 365-4578 [voice]  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pcm@...\">pcm@...</a> [email page]</div>", 
    "prevInTime": 2655, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1000396913", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDNCQTBEODcxLjM2N0I0M0NDQGNpc2NvLmNvbT4="
    }
}