{
    "numMessagesInTopic": 5, 
    "nextInTime": 2715, 
    "senderId": "y3p--L5IPzDASmQcIRJNkYBohzEdi7YrndURJDLbf6ure1WSGwzbPwD8Uvnv1nFG7YAIbTxezLXZ7U2UG4LynyhWpPwsLMRfERJUBiua", 
    "systemMessage": false, 
    "subject": "Best way to do &quot;Test Matrix&quot;", 
    "from": "&quot;David Corbin&quot; &lt;dcorbin@...&gt;", 
    "authorName": "David Corbin", 
    "msgSnippet": "Please consider this example: I have an interface Foo (or even a base class).   I have a number of implemetations of Foo (Bar, Jam, Zip).  Now, as it turns", 
    "msgId": 2714, 
    "topicId": 2714, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-2060473930\">Please consider this example:<br/>\n<br/>\nI have an interface Foo (or even a base class).   I have a number of<br/>\nimplemetations of Foo (Bar, Jam, Zip).  Now, as it turns out, I can write<br/>\nFooTest with five different test*() methods, and provided it knows which Foo<br/>\nImplementation to get, it will pass all 5 tests.   In the interest of OOAO,<br/>\nI&#39;ve been solving this problem using inheritance.  I rename FooTest to<br/>\nFooTestCase, then implement BarTest, JamTest, and ZipTest.  Now, I don&#39;t<br/>\nreally like this one too much because I end up with a lot of classes that<br/>\nwho&#39;s only difference ought to be parameterized, but it works great.  It has<br/>\nthe virtue that the tests are clearly named, too.<br/>\n<br/>\nThe other way I&#39;ve considered, is to modify the constructor to take an<br/>\nadditional argument besides the testName.  I don&#39;t like this because then<br/>\nI&#39;ve got to manually construct TestSuites and possibly name each test<br/>\nmanually. I happen to be a big fan of automation and<br/>\nsuite.add(BarTest.class).<br/>\n<br/>\nAre there any other suggestions on how to implement a TestMatrix?</div>", 
    "prevInTime": 2713, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1000980729", 
    "canDelete": false, 
    "nextInTopic": 2715, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDAwMjYwMWMxNDFiYyRiNjI3YzAwMCQyN2EzZTljN0BnYXRlcz4="
    }
}