{
    "numMessagesInTopic": 11, 
    "nextInTime": 2742, 
    "senderId": "vyENCpLaWyp73lVSPyxTeAOIFDIVjC8oYweoKohnzPRXgzLp6Rof7ReQago-CTj4GGG1VP4kQAFNmem1o9Xvsh5z1TLKAJTN", 
    "systemMessage": false, 
    "subject": "Re: [junit] Test-first paper", 
    "from": "Johannes Link &lt;john.link@gmx.net&gt;", 
    "authorName": "Johannes Link", 
    "msgSnippet": "... Steve, I have tried to write a similar chapter for the test-first book I m writing at the moment. What evetually made me drop the mock approach for JDBC", 
    "msgId": 2741, 
    "topicId": 2739, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-295901320\"><blockquote><span title=\"ireply\">&gt; Here&#39;s something I&#39;ve been working on. It&#39;s a paper that talks about some<br/>\n&gt; techniques for developing a database application test-first. The example<br/>\n&gt; code is in the cvs respository on sourceforge, accessible via<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mockobjects.com\">http://www.mockobjects.com</a><br/>\n&gt; <br/>\n&gt;  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mockobjects.com/papers/jdbc_testfirst.html\">http://www.mockobjects.com/papers/jdbc_testfirst.html</a><br/>\n&gt; <br/>\n&gt; Comments, etc?<br/>\n&gt; <br/>\n&gt; Steve<br/>\n<br/>\n </span></blockquote>Steve,<br/>\nI have tried to write a similar chapter for the test-first book I&#39;m writing<br/>\nat the moment. What evetually made me drop the mock approach for JDBC code<br/>\nis:<br/>\n- The setup of the mocks was more and more of a nightmare. If you really<br/>\nwant to test the correct usage of JDBC, you have to check state-dependent<br/>\nbehaviour across objects. For instance, you have to check that a statement won&#39;t be<br/>\nreused if its connection has been closed, or that your statement has not<br/>\nbeen reused for another query to execute before you have read all the results;<br/>\nand so on and on.<br/>\n- The test code got too brittle for my taste. During refactoring I<br/>\nconstantly changed the way how I queried the database and handed on result sets etc.<br/>\nSo I found myself changing the test code again and again. I think your example<br/>\nis too stable to show this disadvantage.<br/>\n- Testing that the SQL is right requires some kind of SQL-Parser. It&#39;s not a<br/>\nproblem for static SQL strings but it is one when SQL code is somehow<br/>\nassembled dynamically - which was the case in the example I had chosen and which<br/>\nseemed to be natural when striving for the simples thing.<br/>\n<br/>\nThe problem might be that JDBC itself was designed without test first and<br/>\ntestability in mind. One might probably come up with an API that is much better<br/>\nsuited for testing.<br/>\n<br/>\nJohannes</div>", 
    "prevInTime": 2740, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1001406337", 
    "canDelete": false, 
    "nextInTopic": 2745, 
    "prevInTopic": 2739, 
    "headers": {
        "messageIdInHeader": "PDM0NTguMTAwMTQwNjMzN0B3d3cxMi5nbXgubmV0Pg=="
    }
}