{
    "numMessagesInTopic": 11, 
    "nextInTime": 2746, 
    "senderId": "S3Gfqgs5gqwGF-5aUludESJoDhkh0MD05ZDyH0g8R0h0GCyc-quXq0723B6K_cfcO15AsneBOkHCV7G_YIZsZrV3Ij_5u3YA", 
    "systemMessage": false, 
    "subject": "Re: [junit] Test-first paper", 
    "from": "&quot;Steve Freeman&quot; &lt;steve@...&gt;", 
    "authorName": "Steve Freeman", 
    "msgSnippet": "We ve been having similar debates on the mock objects list and I still believe that the jury s out (of course). We ve spent some time working on our coding", 
    "msgId": 2745, 
    "topicId": 2739, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1105988218\">We&#39;ve been having similar debates on the mock objects list and I still believe that the jury&#39;s out (of course). We&#39;ve spent some time working on our coding style and aspects of the library. There&#39;s not much code to see, but it flows better than it used to when we use it. We&#39;ve found that the trick is to figure out just how little you can put in a test.\r<br/>\n\r<br/>\nFrom: &quot;Johannes Link&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:john.link@...\">john.link@...</a>&gt;\r<br/>\n<blockquote><span title=\"ireply\"> &gt; - The setup of the mocks was more and more of a nightmare. If you really\r<br/>\n&gt; want to test the correct usage of JDBC, you have to check state-dependent\r<br/>\n&gt; behaviour across objects. For instance, you have to check that a statement won&#39;t be\r<br/>\n&gt; reused if its connection has been closed, or that your statement has not\r<br/>\n&gt; been reused for another query to execute before you have read all the results;\r<br/>\n&gt; and so on and on.\r<br/>\n\r<br/>\n </span></blockquote>It&#39;s hard to argue this in the abstract. Do you have some examples we can work with?\r<br/>\n\r<br/>\n<blockquote><span title=\"ireply\"> &gt; - Testing that the SQL is right requires some kind of SQL-Parser. It&#39;s not a\r<br/>\n&gt; problem for static SQL strings but it is one when SQL code is somehow\r<br/>\n&gt; assembled dynamically - which was the case in the example I had chosen and which\r<br/>\n&gt; seemed to be natural when striving for the simples thing.\r<br/>\n\r<br/>\n </span></blockquote>Agreed, parsing SQL for tests is a Bad Idea. We got into mock objects in the first place to avoid parsing HTML. What&#39;s the smallest thing you could say about a given SQL string that gives you enough confidence to continue? Matching a couple of substrings?\r<br/>\n\r<br/>\n<blockquote><span title=\"ireply\"> &gt; The problem might be that JDBC itself was designed without test first and\r<br/>\n&gt; testability in mind. One might probably come up with an API that is much better\r<br/>\n&gt; suited for testing.\r<br/>\n\r<br/>\n </span></blockquote>Absolutely! Although at least it is specified with interfaces rather than classes. I believe that there&#39;s at least one simplified DB library around on the net.\r<br/>\n\r<br/>\nSteve</div>", 
    "prevInTime": 2744, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1001462742", 
    "canDelete": false, 
    "nextInTopic": 2746, 
    "prevInTopic": 2741, 
    "headers": {
        "messageIdInHeader": "PDAwYmUwMWMxNDYxZiQwZWU5ODUwMCQwMTAwMDA1YUBnYXRld2F5Pg==", 
        "referencesHeader": "PDM0NTguMTAwMTQwNjMzN0B3d3cxMi5nbXgubmV0Pg=="
    }
}