{
    "numMessagesInTopic": 10, 
    "nextInTime": 2757, 
    "senderId": "70h3aHNt9ttp7IXKLh97Jj9t8l4Ilr-e_O49QpuAC_lzuPpAD9jSo3eOp9NuSEM6oMKe_1uXcnz4Ehg6LQkPZnxwzxxVAdM6awCSQrETGA", 
    "systemMessage": false, 
    "subject": "Re: Multithreaded code", 
    "from": "Emily Bache &lt;emily.bache@...&gt;", 
    "authorName": "Emily Bache", 
    "msgSnippet": "Thanks Eric for an enlightening reply! The code example you have given is clearly more robust than what I came up with. I ve added it to my test suite, and", 
    "msgId": 2756, 
    "topicId": 2726, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-2036156314\">Thanks Eric for an enlightening reply! The code example you have given is<br/>\nclearly more robust than what I came up with. I&#39;ve added it to my test<br/>\nsuite, and (after minor modification to remove typos) it runs and passes,<br/>\nwhich is great. <br/>\n<br/>\nThere is just one thing I&#39;m unsure of - this test proves that while one<br/>\nthread holds the lock on the record, the other thread can find out that it<br/>\nis locked by calling isRecordLocked(). However, the second thread never<br/>\nrequests the lock, so it&#39;s not testing that the second thread blocks in the<br/>\nobtainLock() call until the lock becomes available. That was the requirement<br/>\nI was trying to test :-) <br/>\n<br/>\nYou picked up on several points I was unsure of how to tackle, though, such<br/>\nas how to make my test code run in a predictable manner by avoiding timing<br/>\nissues, and making the test run as fast as possible by avoiding sleep()<br/>\nstatements. I intend to refactor my other tests to use these approaches as<br/>\nfar as possible. <br/>\n<br/>\nThe other problem I can see is that the test code is far more complicated<br/>\nthan the code being tested! (the implementations for obtainLock() and<br/>\nreleaseLock() are about 5 lines each) Is that true in general for threaded<br/>\ncode? Does there come a point when it is no longer worth testing that it&#39;s<br/>\ncorrect, and trying instead to in some way prove that it works by inspection<br/>\nand review?<br/>\n<br/>\nEmily</div>", 
    "prevInTime": 2755, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1001502630", 
    "canDelete": false, 
    "nextInTopic": 2759, 
    "prevInTopic": 2737, 
    "headers": {
        "messageIdInHeader": "PDcwMEVBMTdBMTQyQUQzMTE4QTFFMDAwOEM3MjRCQ0I0RUI3QTBEQGFnYmdudHMwMy5hZ2JnLmludHJhbmV0Pg=="
    }
}