{
    "numMessagesInTopic": 3, 
    "nextInTime": 2766, 
    "senderId": "BJ-UxarBTvBUTLly4XQs1G9WXFggJqgsif2M1ECrFxDCpZNfB4hcQk_Myu3PQBpYoz88Q4UCYK32bJiLRVYr_Nbawkvv8JNgtkOZAA", 
    "systemMessage": false, 
    "subject": "Test framework improvement", 
    "from": "Berin Loritsch &lt;bloritsch@...&gt;", 
    "authorName": "Berin Loritsch", 
    "msgSnippet": "I have been using JUnit 3.7 for a couple of months now, and have run accross something very frustrating.  We (the Apache Avalon project) use Ant to do our", 
    "msgId": 2765, 
    "topicId": 2765, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-719392701\">I have been using JUnit 3.7 for a couple of months now, and<br/>\nhave run accross something very frustrating.  We (the Apache<br/>\nAvalon project) use Ant to do our builds and automated testing,<br/>\nhowever the behavior for test collection is different based<br/>\non wether a Test is a TestCase or a TestSuite.<br/>\n<br/>\nYour FAQ suggests that for one-time setup code you need to run<br/>\nit in a TestSuite.  The problem is this, we have an abstract<br/>\nTestCase that takes a configuration file and sets up a standard<br/>\nenvironment and several testcases written against it.  I want<br/>\nto make the environment to be built once for each TestCase.<br/>\nI can&#39;t simply change the class I extend to TestSuite because<br/>\nTestSuite does not inherit Assert.  Doing that requires modifying<br/>\na large number of tests that are already written.<br/>\n<br/>\nInstead, I had to do _alot_ of hackery to force my tests to be<br/>\nrun once and respect the run-once code.<br/>\n<br/>\nIn order to make my life easier, and other people&#39;s life easier<br/>\nyou should do one of two things:<br/>\n<br/>\n* allow TestSuite to inherit Assert, or<br/>\n* define a marker interface that runs a test AS IS (no automatic<br/>\n  dumping into a TestSuite).<br/>\n<br/>\nI guess another alternative is to change the behavior of TestSuite<br/>\nto invoke only one class per TestCase, and merely iterate over the<br/>\npublic &quot;test&quot; methods.  Currently, TestSuite instantiates a whole<br/>\nnew class for *each* method invokation.  This is IMO wasteful--and<br/>\nbreaks common understandings of how a class works.</div>", 
    "prevInTime": 2764, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1001539347", 
    "canDelete": false, 
    "nextInTopic": 2789, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDNCQjI0NzEzLjk3OUY4QzRDQGFwYWNoZS5vcmc+"
    }
}