{
    "numMessagesInTopic": 7, 
    "nextInTime": 2771, 
    "senderId": "x3jZjDcvwx8pNJikqbZM24kOxyu5lkcWYdzqVPOk4AmqsfssaDP6oykDhY1W8sp3WjmSmnj0YUiNjL4NRI9KGCukM1um", 
    "systemMessage": false, 
    "subject": "Re: [junit] Testing Applets", 
    "from": "Eric Vought &lt;evought@...&gt;", 
    "authorName": "Eric Vought", 
    "msgSnippet": "... Well, the first thing to suggest is that its no different from testing any other application (as Bob Koss points out). To expand on that, the thing which", 
    "msgId": 2770, 
    "topicId": 2767, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1985705652\">On Wed, 26 Sep 2001, Jamie Nettles wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I want to test an applet or pieces of an applet using jUnit.  Any<br/>\n&gt; suggestions?<br/>\n<br/>\n </span></blockquote>Well, the first thing to suggest is that its no different from testing any<br/>\nother application (as Bob Koss points out). To expand on that, the thing<br/>\nwhich makes an application is just its main method. Everything else is<br/>\njust a collection of objects and classes which can be unit tested.<br/>\nSimilarly, what makes an applet an applet is just the fact that you have<br/>\nan Applet implementation which ties all the rest of your classes together<br/>\ninto a working whole. The rest is just objects and classes which you can<br/>\neasily test.<br/>\n<br/>\nIt is relatively straight forward to write an applet in such a way that<br/>\nyou can actually run it either as an applet or standalone. You do that by<br/>\nseparating all of the function of the applet into other classes which are<br/>\nsimply delegated to by a very thin Applet implementation. Even your main<br/>\nPanel can be separated out easily. You can then instantiate that Panel<br/>\neither inside the Applet or inside a Frame created from your application.<br/>\nIf your applet runs in its own Frame, this is even easier. This type of<br/>\nmodularization will also make the code much easier to unit test.<br/>\n<br/>\nYou don&#39;t, therefore, need to run your unit tests in a web browser. They<br/>\nare run standalone from one of the junit testrunners, just like with<br/>\neverything else. You can change security settings around testcases to<br/>\nsimulate the default restrictions of a browser. It *is* possible to<br/>\nautomate testing of applets running in browsers for purposes of<br/>\nportability testing, for instance, but this is non-trivial and should be<br/>\navoided unless/until really necessary. (It&#39;s really functional testing,<br/>\nnot unit testing)<br/>\n<br/>\n[Aside: Has anyone thought about creating an Applet based TestRunner? This<br/>\nwould make it significantly easier for folks (like us) that do portability<br/>\ntesting across a gagillion VMs. When I did some of this sort of work for<br/>\nIBM (Orion/On Demand Server), we had to write the browser based test<br/>\nautomation pretty much from scratch and it was not fun to get it to run in<br/>\nthe various browser targets. Changes in the security API and better<br/>\nconformance since then plus the very modular nature of junit should make<br/>\nit *almost* trivial now. Is anyone else interested?]<br/>\n<br/>\n-- <br/>\nEric Vought<br/>\nChief Technical Officer - QLUE Consulting, Inc.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:evought@...\">evought@...</a> toll-free: 888-771-3538  RTP area: 919-816-9901</div>", 
    "prevInTime": 2769, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1001601457", 
    "canDelete": false, 
    "nextInTopic": 2774, 
    "prevInTopic": 2768, 
    "headers": {
        "inReplyToHeader": "PDYxODAxOUUyMDg0REQyMTE5OTAxMDA4MEM4MENBNDEyRTI4MDI5QG1haWwuaW50LmluZm9ncmFwaC5jb20+", 
        "messageIdInHeader": "PFBpbmUuTE5YLjQuMzAuMDEwOTI3MTAxNTQ1MC4yMjMwNS0xMDAwMDBAYnJhaW4ucWx1ZS1sYW4+"
    }
}