{
    "numMessagesInTopic": 12, 
    "nextInTime": 2809, 
    "senderId": "wA0INCbAZhwphjUtXUYTjnT-bfewDhudONBsC6ZNw1AJFbUR0VozjT8jvPWwfMWx5XObCKCPVFoDlBj-VW8LjAt0RmIlXzobK1z_8g", 
    "systemMessage": false, 
    "subject": "Re: [junit] Tangled design (Re: Test framework improvement)", 
    "from": "Berin Loritsch &lt;bloritsch@...&gt;", 
    "authorName": "Berin Loritsch", 
    "msgSnippet": "Can I remind everyone that the initial request was for TestSuite to inherit from Assert just like TestCase does.  I had a couple other alternatives, but I am", 
    "msgId": 2808, 
    "topicId": 2801, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1320140610\">Can I remind everyone that the initial request was for TestSuite to inherit<br/>\nfrom Assert just like TestCase does.  I had a couple other alternatives,<br/>\nbut I am not trying to drastically change the JUnit framework.<br/>\n<br/>\nBerin Loritsch wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Eric Vought wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; I&#39;m not sure what Kent had in mind, but:<br/>\n&gt; &gt;<br/>\n&gt; &gt; In the first set of situations you mention (Logger hierarchies, config<br/>\n&gt; &gt; files, etc), these can often be dealt with by stubbing out these<br/>\n&gt; &gt; components.<br/>\n&gt; &gt;<br/>\n&gt; &gt; For example, although an application may use a complex logging<br/>\n&gt; &gt; hierarchy which routes different classes of messages to different files or<br/>\n&gt; &gt; hosts, the testcases are handed a Logger with a single listener which<br/>\n&gt; &gt; sends output to a single local file which is appropriately labelled and<br/>\n&gt; &gt; filed. Having this setup run for each test method does not slow my<br/>\n&gt; &gt; testcases down appreciably. It doesn&#39;t matter to the testcases where the<br/>\n&gt; &gt; Logger actually sends its output to- just that there is something there to<br/>\n&gt; &gt; accept events. I have a LoggerTestCase which performs this setup for me<br/>\n&gt; &gt; and I just don&#39;t worry about it.<br/>\n&gt; &gt;<br/>\n&gt; &gt; The issue is similar with config files. Most testcases don&#39;t care where<br/>\n&gt; &gt; the configuration data comes from. I just create a Map as a fixture which<br/>\n&gt; &gt; contains exactly what is needed for particular testcases. My code doesn&#39;t<br/>\n&gt; &gt; care what mechanism was used to populate the Map or what 10 gazillion<br/>\n&gt; &gt; other values might be available. The actual process of interpreting the<br/>\n&gt; &gt; config files or database or whatever is in a separate package and<br/>\n&gt; &gt; independently tested.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I think the design issue is making your classes much less dependent on the<br/>\n&gt; &gt; global state. Singletons are just one aspect of that. If these components<br/>\n&gt; &gt; are hidden behind nice interfaces, then you have a lot of freedom to<br/>\n&gt; &gt; decide just how much initialization is needed and can dumnmy out a lot of<br/>\n&gt; &gt; extra complexity.<br/>\n&gt; <br/>\n&gt; The thing to reiterate is that we are testing Components that live in a<br/>\n&gt; specific environment, and we must make sure they play nice in that environment.<br/>\n&gt; This makes sure that changes to the environment don&#39;t break the Components,<br/>\n&gt; and vice versa.  You can&#39;t test that with dummy stuff.<br/>\n&gt; <br/>\n&gt; Not all our testcases use this heavy process--Only the testcases that test<br/>\n&gt; Components.  We have a lot of helper classes that we test individually--without<br/>\n&gt; the extra bulk.<br/>\n&gt; <br/>\n&gt; Sometime during the test cycle we need to perform the environment tests, so<br/>\n&gt; I would rather do it with JUnit than with a production system ;).<br/>\n&gt; <br/>\n&gt; &gt; RMI *is* an issue and is one of the places I have had significant problems<br/>\n&gt; &gt; with per-testcase fixtures. This and other testing issues led to me<br/>\n&gt; &gt; dramatically reducing my use of RMI.<br/>\n&gt; <br/>\n&gt; I don&#39;t typically use RMI in most cases, however we do have a component that<br/>\n&gt; exposes an RMI interface, so we need to test it.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a> </span></blockquote></div>", 
    "prevInTime": 2807, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1002051104", 
    "canDelete": false, 
    "nextInTopic": 2809, 
    "prevInTopic": 2807, 
    "headers": {
        "messageIdInHeader": "PDNCQkExNjIwLkYyREQ4NzU4QGFwYWNoZS5vcmc+", 
        "referencesHeader": "PFBpbmUuTE5YLjQuMzAuMDExMDAyMTQ1MjQyMC44NzQ3LTEwMDAwMEBicmFpbi5xbHVlLWxhbj4gPDNCQkExNTRBLjZFREE4QUZFQGFwYWNoZS5vcmc+"
    }
}