{
    "numMessagesInTopic": 6, 
    "nextInTime": 2835, 
    "senderId": "ZGYGR8yMy7Xsmw8bflfObcLEDJMyvDl1Uu-Z_bBSAH1JKDpOz50BfcD4jZO5ytyMmaL0YrT2UsOw_G5Mkv4bWq_pTrE1", 
    "systemMessage": false, 
    "subject": "Re: [junit] The upcoming &quot;assert&quot; keyword in JDK 1.4", 
    "from": "Eric Vought &lt;evought@...&gt;", 
    "authorName": "Eric Vought", 
    "msgSnippet": "Yeah, I had some converstaions with Sun folks about that. Thing is, that I didn t find their arguments compelling and they basically brushed off the ", 
    "msgId": 2834, 
    "topicId": 2823, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-803612535\">Yeah, I had some converstaions with Sun folks about that. Thing is, that I<br/>\ndidn&#39;t find their arguments compelling and they basically brushed off the<br/>\nalternatives that were presented to them. We have a particularly<br/>\nfunctional assertion package that doesn&#39;t require a keyword, and although:<br/>\n<br/>\nAssert.assertion(y &lt; 0);<br/>\n<br/>\nis a little more verbose than:<br/>\n<br/>\nassert: y &lt; 0;<br/>\n<br/>\nWhen you look at the additional flexibility and code clarity of a class:<br/>\n<br/>\nAssert.notNull(foo);<br/>\nAssert.checkParam(y &lt; 0); (throws an IllegalArgumentException)<br/>\nAssert.checkState(state, OPEN); (throws an InvalidStateException)<br/>\n<br/>\nthe JDK 1.4 approach loses out. The arguments that they needed it to<br/>\nbe a keyword so that they could produce better diagnostics also doesn&#39;t<br/>\nfloat. They could have created a special class with some additional<br/>\ncompiler Magic, just like String, Class, Thread, and so forth,<br/>\nwithout adding a new keyword, let alone a new syntactic production. I<br/>\nthink that if they had bothered to explore options they could have found<br/>\na viable one. Our package is just one of a large number that found a way<br/>\nto support assertions without changing the language.<br/>\n<br/>\nIn any case, the damage is done, so there is probably no point in<br/>\ncontinuing to argue. I do appreciate the addition of the feature; I just<br/>\nthink that they were a little heavy handed with the implementation of what<br/>\nshould have been a minor change. It makes me wonder how much they will<br/>\nbreak with the new generics support that&#39;s in the works.<br/>\n<br/>\nYour sed suggestion is a good one. I&#39;ve started hacking out a Perl script.<br/>\nOne problem I have is comming up with a logical package name to replace<br/>\n&quot;com.qlue.util.assert&quot;. I suppose I could use &quot;assertions&quot; as it will only<br/>\nbe in the imports statement and the length doesn&#39;t matter much.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, 3 Oct 2001, S. J. Stremler wrote:<br/>\n<br/>\n&gt; Eric Vought wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; &quot;assert&quot; has been deprecated in JUnit, replaced by assertTrue().<br/>\n&gt; &gt;<br/>\n&gt; &gt; &lt;rant&gt;Of course, that still leaves hundreds of existing references to<br/>\n&gt; &gt; change (per project), but Sun didn&#39;t appear to care, even though it was<br/>\n&gt; &gt; hardly necessary for them to make it a reserved word, much less add a new<br/>\n&gt; &gt; gramattical production to the language. It&#39;s worse for use, since we have<br/>\n&gt; &gt; a support package named &quot;assert&quot; which all of our packages depend on, so<br/>\n&gt; &gt; we can&#39;t just deprecate a single method.<br/>\n&gt; &gt;<br/>\n&gt; &gt; It always amazes me when folks go through the trouble to create a nice,<br/>\n&gt; &gt; object oriented language with hierarchical namespaces and can&#39;t figure<br/>\n&gt; &gt; out how to add a feature without modifying the syntax.<br/>\n&gt; &gt; &lt;/rant&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; OK, I feel a little better.<br/>\n&gt;<br/>\n&gt; Um, find, grep, and sed are your friends.<br/>\n&gt;<br/>\n&gt; Something like (on a fresh copy of your source tree(s) in case it breaks):<br/>\n&gt;<br/>\n&gt; find $directory -name &#39;*.java&#39; -exec fgrep -l &#39;&#92;.assert&#92;.&#39; {} &#92;; &gt; targets<br/>\n&gt; foreach i ( cat targets )<br/>\n&gt;    mv $i ${i}.save<br/>\n&gt;    sed -e &#39;s/&#92;.assert&#92;./.Assert./&#39; &lt; ${i}.save &gt; $i<br/>\n&gt; end<br/>\n&gt;<br/>\n&gt; ....should take care of much of the work, no?  YMMV, of course.<br/>\n&gt;<br/>\n&gt; The folks at Sun made a good case (at JavaOne 2001) for why it needs to<br/>\n&gt; be a keyword. And &quot;assert&quot; is the most useful keyword to use -- in the<br/>\n&gt; long run, it&#39;s better to bite the bullet and deal with an improved<br/>\n&gt; language rather than letting random developers contort the language<br/>\n&gt; into something convenient for them but less clear for everyone else.<br/>\n&gt; After all, 1.3.x will be around for some time yet.<br/>\n&gt;<br/>\n&gt; 1.4 is in beta at the moment, so you still have time to devise a new<br/>\n&gt; packaging scheme, deprecate the old one, and convince everyone who uses<br/>\n&gt; your stuff to change.<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n-- <br/>\nEric Vought<br/>\nChief Technical Officer - QLUE Consulting, Inc.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:evought@...\">evought@...</a> toll-free: 888-771-3538  RTP area: 919-816-9901 </span></blockquote></div>", 
    "prevInTime": 2833, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1002144775", 
    "canDelete": false, 
    "nextInTopic": 2837, 
    "prevInTopic": 2828, 
    "headers": {
        "inReplyToHeader": "PDNCQkI3RUY4LjYzOENDMDk0QG5vc2MubWlsPg==", 
        "messageIdInHeader": "PFBpbmUuTE5YLjQuMzAuMDExMDAzMTcxMjI4MC44NzQ3LTEwMDAwMEBicmFpbi5xbHVlLWxhbj4="
    }
}