{
    "numMessagesInTopic": 19, 
    "nextInTime": 2947, 
    "senderId": "dxLWcFAvFqIY829EG9-_t6bodDksPp-UB1vHvkuPvpcA5YapEijtk5Mw-t7_xYoYdzuv6PsOfWmrbjlcRGuQwNkbb_ya", 
    "systemMessage": false, 
    "subject": "Re: [junit] HOW TO ASK QUESTIONS ON THIS GROUP", 
    "from": "Eric Vought &lt;evought@...&gt;", 
    "authorName": "Eric Vought", 
    "msgSnippet": "One problem that develops in many of these lists is that the greatest volume of posts is from people who are new to the API/product/language being supported", 
    "msgId": 2946, 
    "topicId": 2943, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-2115081346\">One problem that develops in many of these lists is that the greatest<br/>\nvolume of posts is from people who are new to the API/product/language<br/>\nbeing supported and therefore new to the list. Courtesy would demand that<br/>\nthe new user spend time exploring the site, the documentation, and so<br/>\nforth, plus perhaps monitor the list for a bit before posting to it.<br/>\nHowever, I have noticed two things, both of which surprise me in different<br/>\nways.<br/>\n<br/>\n1) Some people simply aren&#39;t courteous and really expect people to do<br/>\ntheir work for them. Many of these people seem to succeed at this in their<br/>\nworkplace and, when required to do something new, extend that practice to<br/>\nthe net. Over time, however, I&#39;ve discovered that the number of people in<br/>\nthis category is actually not large and that many people actually belong<br/>\nin the 2nd category.<br/>\n<br/>\n2) Some people simply don&#39;t have the first clue how to be courteous in<br/>\nthis environment. Typically they are either students or professionals who<br/>\nhave suddenly had new demands placed on them and are not self-starters.<br/>\nThey may try to figure things out at first, but simply have no context to<br/>\nstart. As they may already be frustrated and resentful, they give up<br/>\nquickly, especially if they are not strong in english.<br/>\n<br/>\nThe utter lack of context in this second group has surprised me greatly<br/>\nand I think it is hard for many in the OS community to grasp. For example,<br/>\nI still commonly run into junior programmers who don&#39;t know what a &quot;FAQ&quot;<br/>\nis or what a &quot;list archive&quot; is for. They see these words on the site but<br/>\ndon&#39;t know what to do with them.<br/>\n<br/>\nMost projects are organized similarly. I&#39;ve been around the internet<br/>\nenough that when I look at a new project I pretty much go through things<br/>\nin a set order and know exactly what to look for. If the things I need are<br/>\nnot there, I will most likely just skip it and go back to FreshMeat for a<br/>\ndifferent, similar project. Most people who answer questions on this list<br/>\nare the same. It is hard for me to believe that people still lack these<br/>\nskills, but they really do.<br/>\n<br/>\nEven if someone does know what these things are, I have watched people<br/>\nflounder for hours with a search engine or list archive becuase they don&#39;t<br/>\nhave good research skills and don&#39;t know what to search for or they don&#39;t<br/>\nknow how to work through the hits and figure out which ones are really<br/>\nrelevant to their issues. Again, this is especially true for people who<br/>\nare not strong in english.<br/>\n<br/>\nI am at a loss for how to deal with this effectively and would welcome<br/>\ndiscussion. One thing that I have seen have some positive effect is a FAQ<br/>\nposting at regular intervals (e.g. weekly) to the list. This posting<br/>\nshould be targetted at this second category of individuals, carefully<br/>\nexplaining where to find docs, tutorials, how to search the archives,<br/>\netc., as well as making a plain statement to the first category that they<br/>\nare expected to do their own homework. We might even consider making this<br/>\npost multi-language. The FAQ should also always be the first message a new<br/>\nsubscriber receives (replacing the current &quot;Welcome to JUnit&quot; message.<br/>\nThis adds a little clutter to the list, but, with a clear subject line<br/>\nit&#39;s easy to avoid and may reduce clutter overall.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, 15 Oct 2001, J. B. Rainsberger wrote:<br/>\n<br/>\n&gt; Ladies and Gentlemen:<br/>\n&gt;<br/>\n&gt; I am frankly quite concerned with the quality of the exchanges going on here<br/>\n&gt; in the last several weeks. It appears that many people think there are<br/>\n&gt; &quot;magic formulas&quot; for working with JUnit. As a result, they ask silly<br/>\n&gt; questions like, &quot;How do I test an EJB with JUnit????&quot; The people who know<br/>\n&gt; the answer get so tired of writing, &quot;Search this list. Try it. What are you<br/>\n&gt; having trouble testing?&quot; that they simply stop responding. As a result,<br/>\n&gt; questions are not being answered.<br/>\n&gt;<br/>\n&gt; I would like to ask everyone on this list to ask specific, pointed<br/>\n&gt; questions, with sample code, if at all possible. Instead of &quot;How to I test<br/>\n&gt; an EJB????&quot;, how about, &quot;I did X, Y and Z to test EJBs using JUnit, but it&#39;s<br/>\n&gt; too slow. Any tips for increasing speed? Here is a sample EJB tets case...&quot;?<br/>\n&gt;<br/>\n&gt; If you really don&#39;t know how to do X, try searching the web first. Try<br/>\n&gt; searching this list&#39;s archives next. If that does not get you going, then by<br/>\n&gt; all means, ask a specific, pointed question.<br/>\n&gt;<br/>\n&gt; Please, folks! I don&#39;t want to start ignoring this list because its readers<br/>\n&gt; show no initiative.<br/>\n&gt;<br/>\n&gt; JBR.<br/>\n&gt;<br/>\n&gt; _________________________________________________________________<br/>\n&gt; Get your FREE download of MSN Explorer at <a rel=\"nofollow\" target=\"_blank\" href=\"http://explorer.msn.com/intl.asp\">http://explorer.msn.com/intl.asp</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n-- <br/>\nEric Vought<br/>\nChief Technical Officer - QLUE Consulting, Inc.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:evought@...\">evought@...</a> toll-free: 888-771-3538  RTP area: 919-816-9901 </span></blockquote></div>", 
    "prevInTime": 2945, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1003176873", 
    "canDelete": false, 
    "nextInTopic": 2947, 
    "prevInTopic": 2943, 
    "headers": {
        "inReplyToHeader": "PEY1NU9QazBPNVNqTUt0V055bVcwMDAwNWY2M0Bob3RtYWlsLmNvbT4=", 
        "messageIdInHeader": "PFBpbmUuTE5YLjQuMzAuMDExMDE1MTUyMDE4MC4xNzg4LTEwMDAwMEBicmFpbi5xbHVlLWxhbj4="
    }
}