{
    "numMessagesInTopic": 1, 
    "nextInTime": 2963, 
    "senderId": "r8a9NJ6L_g5eKfcAdrJIFtqurupwJ_7ovifzpT0N3q3ksC9JOPmTbynvn_CSFRqLvXcbwJeoprkG9sNbQVBheTp_iMCKBHhGPNNklcfvohb3kwU", 
    "systemMessage": false, 
    "subject": "Re: [junit] Digest Number 322", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains762@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "Excuse me. I did not claim that there was *no* useful discussion here. I did claim that there is a lot of noise. There is. You can try to argue against that", 
    "msgId": 2962, 
    "profile": "nails762", 
    "topicId": 2962, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-785670247\">Excuse me.<br/>\n<br/>\nI did not claim that there was *no* useful discussion here. I did claim that <br/>\nthere is a lot of noise. There is. You can try to argue against that all you <br/>\nwant, and you&#39;d be wrong. Even today I saw a message saying, &quot;I think that&#39;s <br/>\na good question. I think an answer would be useful.&quot;<br/>\n<br/>\nDO WE REALLY NEED TO SAY THAT?! Do you really need to write to a mailing <br/>\nlist, &quot;Yeah. I wanna know too!&quot; OF COURSE YOU WANT TO KNOW! That&#39;s why you <br/>\nread the list. That&#39;s enough, thanks.<br/>\n<br/>\nCome on, folks. I was new at this once, too. Someone told me, &quot;Stop doing <br/>\nthat.&quot; I learned. Don&#39;t feel like you should be treated any differently. The <br/>\nbottom line is that there are far too many &quot;Would you tell me exactly what <br/>\nto do in order to test my application?&quot; questions. That is NOT what this <br/>\nlist is for!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;JUnit is a new thing for many people and this list must also be<br/>\n </span></blockquote>available to new users and not only to those who have already<br/>\ngot an answer to all questions.&lt;&lt;&lt;<br/>\n<br/>\nI never said that it should not be accessible to new users. It should not, <br/>\nhowever, be used as a SUBSTITUTE for learning; it is supposed to help us <br/>\nlearn about JUnit. Those who treat it like a magic answer box are the ones <br/>\nthat bother me.<br/>\n<br/>\nIncidentally, I learned about JUnit long before this list appeared. Do you <br/>\nthink I&#39;m some supergenius? No. I read, I tried and then I read some more. <br/>\nWhen I couldn&#39;t figure it out, I searched for answers. Why can&#39;t other <br/>\npeople do that?<br/>\n<br/>\nJBR.<br/>\n<br/>\n---- Begin original message ----<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In junit@y..., Eric Vought &lt;evought@q...&gt; wrote:<br/>\nand<br/>\n--- In junit@y..., &quot;J. B. Rainsberger&quot; &lt;jbrains762@h...&gt; wrote:<br/>\n.....<br/>\n &gt;Ladies and Gentlemen:<br/>\n &gt;<br/>\n &gt;I am frankly quite concerned with the quality of the exchanges<br/>\n &gt;going on here in the last several weeks. It appears that many<br/>\n &gt;people think there are &quot;magic formulas&quot; for working with JUnit.<br/>\n &gt;As a result, they ask silly questions like, &quot;How do I test an<br/>\n &gt;EJB with JUnit????&quot; The people who know the answer get so<br/>\n &gt;tired of writing, &quot;Search this list. Try it. What are you<br/>\n &gt;having trouble testing?&quot; that they simply stop responding.<br/>\n &gt;As a result, questions are not being answered.<br/>\n................<br/>\n<br/>\nI don&#39;t agree with these opinions. I think there has been<br/>\nvery good questions and answers (discussions) here. Of course<br/>\nit is good if the answers can already be found in a FAQ<br/>\nbut remember that the FAQ is something that is maintained<br/>\nusually by one person as on a list like this you can have several<br/>\nviews. Take as an example the answers yesterday of why you should use<br/>\nJUnit. I am sure you can find data on this already somewhere else.<br/>\n<br/>\nJUnit is a new thing for many people and this list must also be<br/>\navailable to new users and not only to those who have already<br/>\ngot an answer to all questions.<br/>\n<br/>\nKaarle Kaila<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nGet your FREE download of MSN Explorer at <a rel=\"nofollow\" target=\"_blank\" href=\"http://explorer.msn.com/intl.asp\">http://explorer.msn.com/intl.asp</a> </span></blockquote></div>", 
    "prevInTime": 2961, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1003252038", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PEYzOUtwRjNTSmp6ZGdKSTdmRzcwMDAwNjQ3M0Bob3RtYWlsLmNvbT4="
    }
}