{
    "numMessagesInTopic": 7, 
    "nextInTime": 2985, 
    "senderId": "ltpGDbWSq-4kegwQDmN-_9_vRsaFv5eHhdW0uOxLVt3D0C6ntx-oCWk1EwDVkfLsaJtlxIHCfop755VsSQdOdg9wQuuFPr9U6P-DaE-oEaw", 
    "systemMessage": false, 
    "subject": "RE: [junit] Re: swingui & jdk1.4", 
    "from": "Scott Stirling &lt;sstirling@...&gt;", 
    "authorName": "Scott Stirling", 
    "msgSnippet": "Here s a definitive answer (watch what you ask for ;- ), from my post to this group on 7/10/01.  If Jim wants to put in the FAQ, please do.  It s definitely", 
    "msgId": 2984, 
    "rawEmail": "Return-Path: &lt;sstirling@...&gt;\r\nX-Sender: sstirling@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_0_0_1); 17 Oct 2001 18:00:24 -0000\r\nReceived: (qmail 68104 invoked from network); 17 Oct 2001 18:00:23 -0000\r\nReceived: from unknown (10.1.10.142)\n  by 10.1.1.221 with QMQP; 17 Oct 2001 18:00:23 -0000\r\nReceived: from unknown (HELO uscamexcp005.allaire.com) (63.109.193.40)\n  by mta3 with SMTP; 17 Oct 2001 18:00:22 -0000\r\nReceived: by smtp.allaire.com with Internet Mail Service (5.5.2653.19)\n\tid &lt;4Y7SJQ15&gt;; Wed, 17 Oct 2001 14:00:14 -0400\r\nMessage-ID: &lt;4F47DCFADC8DD5118D2B00508B952D960C3989@...&gt;\r\nTo: &quot;&#39;junit@yahoogroups.com&#39;&quot; &lt;junit@yahoogroups.com&gt;\r\nSubject: RE: [junit] Re: swingui & jdk1.4\r\nDate: Wed, 17 Oct 2001 14:00:01 -0400\r\nMIME-Version: 1.0\r\nX-Mailer: Internet Mail Service (5.5.2653.19)\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nFrom: Scott Stirling &lt;sstirling@...&gt;\r\nX-Yahoo-Profile: jrun4\r\n\r\nHere&#39;s a definitive answer (watch what you ask for ;-&gt; ), from my post to\nthis group on 7/10/01.  If Jim wants to put in the FAQ, please do.  It&#39;s\ndefinitely in the top 5 FAQs on this list.\n****************************\n\nThe JUnit TestCaseClassLoader (the reloadable one) has a fundamental problem\nthat results in frequent LinkageErrors under the following conditions:\n\n1. You use the JUnit Swing UI.\n\n2.  You use JAXP in your test cases or any classes referenced in your test\ncases, or even any &quot;instanceof&quot; expressions that reference JAXP classes.\n(By JAXP I mean the whole set of javax.* classes plus the org.w3c.dom.* and\norg.xml.sax.* classes)\n\nI can go into this in depth, but the bottom line problems are that JUnit\nloads classes from the same place as the JVM&#39;s system loader; the classpath.\nThis necessitates the use of an exclusion list to filter out certain class\nnames that either must be loaded by the system loader, or you would like to\nhave loaded by the system loader.  The JUnit loader does not always delegate\nto the system loader when it should, particularly in the case of JAXP, which\nis a weird mix of classes whose names begin with the filtered &quot;javax.*&quot; and\nthe unfiltered &quot;org.w3c.*&quot; and org.xml.*&quot;.\n\nJAXP is a special case because it is based on a set of javax.* classes.  All\njavax.* classes are excluded from the JUnit loader by default (in the\ndefault excluded.properties file) in junit.jar.  But JAXP, as shipped from\nSun, comes with a bunch of other classes in org.w3c.* and org.xml.*.  The\ninteresting thing is a direct dependency between javax.* classes and some\nother classes not in the usual exclusion list of com.sun.*, javax.*, etc.\n\nSo what can happen, and frequently does when using the JUnit Swing UI with\ntest cases or other classes, such as Log4J, that use JAXP, is that the JUnit\nclass loader (properly) delegates javax.xml.* classes it &quot;sees&quot; to the\nsystem loader.  But then the system loader loads up a bunch of org.w3c.dom\nand/or org.xml.sax classes as the result of initializing and loading that\nJAXP class.  Later, if the JUnit loader comes across some org.w3c/xml class\nthat it&#39;s never seen before, it tries to load it because the classname\ndoesn&#39;t match one of the patterns in the exclude list.  \n\nBut it&#39;s already been loaded through the &quot;backdoor&quot; as the result of some\nother class loaded by the system loader (remember, the JVM keeps classes in\ntheir own namespace by identifying them by their fully qualified name plus\nthe instance of their _defining_ (not initiating) loader, AND, the JVM will\nattempt to assign all unloaded classes referenced by a defined class to that\ndefining class&#39;s loader).  The JVM&#39;s classresolver routine keeps track of\nall these class loading events and &quot;sees&quot; that the JUnit loader is\nattempting to define a class that has already been defined by the system\nloader.  That&#39;s wrong because according to the rules of loader constraints,\nJUnit should delegate this load to the system loader.\n\nYou can hack around this (I did) by catching the LinkageError in\nTestCaseClassLoader&#39;s loadClass() method and then making a recovery call to\nfindSystemClass() -- thereby delegating to the system loader after the fact\n(which is OK).  This hack only works some of the time, though, because now\nyou can have the reverse problem where the JUnit loader loads a host of\norg.*.* classes, and then the system loader violates the loader contraints\nat some point when it tries to do exactly what I described above with JAXP\nbecause it doesn&#39;t ever delegate to its child (the JUnit loader).\nInevitably, if your test cases use many JAXP and related XML classes, one or\nthe other ClassLoader will end violating the constraints whatever you do.\n\nSo the solution in the existing JUnit is to definitely add org.w3c.dom.* and\norg.xml.sax.* to your excluded.properties if you&#39;re using any JAXP stuff.\n\nWhat can we learn from this?  Well, one thing is that it&#39;s a good idea to\nhave your custom class loaders load classes from repositories other than the\nsystem classpath.  Note that the JVM&#39;s built-in classloaders work that way\n(one for the jre/ext dirs, another for the java.class.path).\n\nAnyway, the excluded.properties fix is just a matter of time before it\nbecomes standard in JUnit, since JAXP will be a standard part of the 1.4\nJDK.  It&#39;ll be just like having org.omg.* excluded.\n\nScott Stirling\n\n-----Original Message-----\nFrom: David V. Olivier [mailto:dolivier@...]\nSent: Wednesday, October 17, 2001 1:56 PM\nTo: junit@yahoogroups.com\nSubject: Re: [junit] Re: swingui & jdk1.4\n\n\nThis is similar to a question I had a week ago and I was told many other \nsubscribers had had the same type of question.  Perhaps this is a candidate \nfor the new FAQ.\n\nDavid Olivier\n\nAt 05:43 PM 10/17/2001 +0000, you wrote:\n&gt;I&#39;m having similar issues when test code that uses dom4j (which uses\n&gt;JAXP to instantiate an XML parser, like Xerces).  When I run under\n&gt;junit, it can&#39;t find some org.xml classes.  When I run standalone I\n&gt;have no problems.\n&gt;\n&gt;If anyone knows why, I&#39;d love to find out.\n&gt;\n&gt;--- In junit@y..., Anthony  Pereira &lt;apereira@3...&gt; wrote:\n&gt; &gt; Hi,\n&gt; &gt;\n&gt; &gt; I&#39;m not sure whether this is the place to submit what I&#39;m just\n&gt;going to\n&gt; &gt; write about, if not please do point me in the right direction,\n&gt;cheers.\n&gt; &gt;\n&gt; &gt; I came across a rather bizzare scenario, today using the\n&gt; &gt; junit.swingui.TestRunner in a java 1.4beta2 environment. In some of\n&gt;my code,\n&gt; &gt; I reference classes in org.w3c.dom and org.apache.crimson. Now, as\n&gt;soon as\n&gt; &gt; junit came across classes from these packages, it threw class not\n&gt;found\n&gt; &gt; exceptions. Please note that this doesn&#39;t happen in the the textui\n&gt;nor my\n&gt; &gt; own testing classes, since they are both in the classpath.\n&gt; &gt;\n&gt; &gt; org.w3c.dom specifically is in the rt.jar\n&gt; &gt; org.apache.crimson is a separate jar, which is on my classpath\n&gt; &gt;\n&gt; &gt; After a bit of digging around in the source code, specifically in\n&gt;the\n&gt; &gt; TestCaseClassLoader, I found out about the\n&gt;junit&#92;runner&#92;exclude.properties\n&gt; &gt; file. When I added these package names to that file, things seemed\n&gt;ok, and\n&gt; &gt; those exceptions didn&#39;t take place.\n&gt; &gt;\n&gt; &gt; What confused me was why it didn&#39;t find the classes, even though\n&gt;they was on\n&gt; &gt; my classpath, especially the org.w3c ones which are in the rt.jar\n&gt;(with\n&gt; &gt; 1.4). Furthermore, this was only a problem when using the swingui,\n&gt;with the\n&gt; &gt; textui, it was fine.\n&gt; &gt;\n&gt; &gt; I&#39;ve got it working now that I put those details in the\n&gt;exclude.properties\n&gt; &gt; file. Is this perhaps a issue with using 1.4?\n&gt; &gt;\n&gt; &gt; Any comments or explainations?\n&gt; &gt; Thanks\n&gt; &gt; Anthony\n&gt;\n&gt;\n&gt;To unsubscribe from this group, send an email to:\n&gt;junit-unsubscribe@yahoogroups.com\n&gt;\n&gt;\n&gt;Your use of Yahoo! Groups is subject to http://docs.yahoo.com/info/terms/\n\n\n\nTo unsubscribe from this group, send an email to:\njunit-unsubscribe@yahoogroups.com\n \n\nYour use of Yahoo! Groups is subject to http://docs.yahoo.com/info/terms/ \n\n\n", 
    "profile": "jrun4", 
    "topicId": 2764, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "prevInTime": 2983, 
    "contentTrasformed": false, 
    "postDate": "1003341601", 
    "canDelete": false, 
    "nextInTopic": 2985, 
    "prevInTopic": 2983, 
    "headers": {
        "messageIdInHeader": "PDRGNDdEQ0ZBREM4REQ1MTE4RDJCMDA1MDhCOTUyRDk2MEMzOTg5QHNhbHNhLmFsbGFpcmUuY29tPg=="
    }
}