{
    "numMessagesInTopic": 9, 
    "nextInTime": 3043, 
    "senderId": "0Gedpcu6wL9ChrUf7p-oeEySNOGJnM3EuBpyqcMyVx7PMsL9cTJncZY5msR57dKdbF3tZbcmucmsqadHL0wRr7UUYaXZJMYO2Uz9oQ", 
    "systemMessage": false, 
    "subject": "Open Forum message", 
    "from": "Berin Loritsch &lt;bloritsch@...&gt;", 
    "authorName": "Berin Loritsch", 
    "msgSnippet": "Sam Ruby posted a message on your open forum.  He has been doing some macroscopic integration testing with the latest CVS of a large number of projects", 
    "msgId": 3042, 
    "profile": "bloritsch", 
    "topicId": 3042, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1311646935\">Sam Ruby posted a message on your open forum.  He has been<br/>\ndoing some macroscopic integration testing with the latest<br/>\nCVS of a large number of projects including every Apache<br/>\nproject and quite a few outside Apache.  He has built an<br/>\nautomated notification system when changes to the code base<br/>\naffect other projects.  For instance, JUnit is used in a<br/>\nnumber of Apache projects, and a recent change forces all<br/>\nthe current projects testing to break.  Their test cases<br/>\nwon&#39;t compile.  I highly recommend allowing him to add<br/>\nthis mailing list (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>) to the list of<br/>\nautomatic notifications.<br/>\n<br/>\nBasically what will happen is that if JUnit fails to compile,<br/>\ndue to changes in dependencies of other projects changing,<br/>\nthen GUMP will notify you of that change.  Also, when a change<br/>\nyou committed breaks other projects, you will be notified.<br/>\n<br/>\nThe whole reason for this is so that the preferred method of<br/>\ndeprecating old APIs is enforced, and changes to the API are<br/>\nnot concidered lightly.<br/>\n<br/>\nKeep in mind this is not a full functionality testing, it is<br/>\na build test suite that invokes any unit tests if the project<br/>\nhas them.</div>", 
    "prevInTime": 3041, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1003759072", 
    "canDelete": false, 
    "nextInTopic": 3043, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDNCRDQyNUUwLjJCN0NBMDEzQGFwYWNoZS5vcmc+"
    }
}