{
    "numMessagesInTopic": 9, 
    "nextInTime": 3052, 
    "senderId": "IBjHmNRdA9u0TU3Gz5PIqPgexJ-F7Rp8CskgnavMCuEe_D3ffzjqAlZwui32cMSg7E7ZYh54HTG6Ot7XCnznP_-2T8c", 
    "systemMessage": false, 
    "subject": "Re: Open Forum message", 
    "from": "&quot;Sam Ruby&quot; &lt;rubys@...&gt;", 
    "authorName": "Sam Ruby", 
    "msgSnippet": "... Notification that junit failed to compile can be done, but that is not what happened here.   I m not sure that automatic notification when any other ", 
    "msgId": 3051, 
    "profile": "sa3ruby", 
    "topicId": 3042, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1177514976\">Berin Loritsch wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Sam Ruby posted a message on your open forum.  He has been<br/>\n&gt; doing some macroscopic integration testing with the latest<br/>\n&gt; CVS of a large number of projects including every Apache<br/>\n&gt; project and quite a few outside Apache.  He has built an<br/>\n&gt; automated notification system when changes to the code base<br/>\n&gt; affect other projects.  For instance, JUnit is used in a<br/>\n&gt; number of Apache projects, and a recent change forces all<br/>\n&gt; the current projects testing to break.  Their test cases<br/>\n&gt; won&#39;t compile.  I highly recommend allowing him to add<br/>\n&gt; this mailing list (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>) to the list of<br/>\n&gt; automatic notifications.<br/>\n<br/>\n&gt; Basically what will happen is that if JUnit fails to compile,<br/>\n&gt; due to changes in dependencies of other projects changing,<br/>\n&gt; then GUMP will notify you of that change.  Also, when a change<br/>\n&gt; you committed breaks other projects, you will be notified.<br/>\n<br/>\n </span></blockquote>Notification that junit failed to compile can be done, but that is not what<br/>\nhappened here.   I&#39;m not sure that automatic notification when any other<br/>\nproject fails would be helpful.  If I see a problem in one project that<br/>\nlooks to be caused by somebody else, I try to do some isolation and manual<br/>\nnotification.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The whole reason for this is so that the preferred method of<br/>\n&gt; deprecating old APIs is enforced, and changes to the API are<br/>\n&gt; not concidered lightly.<br/>\n<br/>\n </span></blockquote>In this case, there were two classes of errors introduced in last night&#39;s<br/>\nbuild.  One was that a deprecated API was removed.  That is quite<br/>\nreasonable, and gump is helping to get the word out that if people were<br/>\nignoring this deprecation warning up to this point, they really should plan<br/>\nfor it at this time.  It is remotely possible that a groundswell will form<br/>\nasking that this deprecated API be kept on longer, but more likely in my<br/>\nopinion is that people will simply move up.<br/>\n<br/>\nThe other dealt with class loader issues, and I saw that a related change<br/>\nwas made in junit at the same time.  It is not clear at this time, however,<br/>\nthat that change caused the breakage.<br/>\n<br/>\nI may be in the minority in this mailing list, but discussion on the<br/>\nremoval of APIs that are actively seems like an appropriate topic for this<br/>\nmailing list.<br/>\n<br/>\n=- Sam Ruby</div>", 
    "prevInTime": 3050, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1003766177", 
    "canDelete": false, 
    "nextInTopic": 3052, 
    "prevInTopic": 3050, 
    "headers": {
        "messageIdInHeader": "PE9GMjk0ODQwMzUuNkUwREM2RkEtT044NTI1NkFFRC4wMDU2MDI3RUByYWxlaWdoLmlibS5jb20+"
    }
}