{
    "numMessagesInTopic": 1, 
    "nextInTime": 3054, 
    "senderId": "sAT8PBhGJhF8zxelgxgPeE67jrS9IwFZZV8plDmgfG9IibR43JfugP5h0WjkxAgvDD3-lfqQ_cCYJ-I7xVTjid4ulfoVo5IA98AgAZMTV_6l1tM", 
    "systemMessage": false, 
    "subject": "If a test fails (on an error), is tearDown called anyway?", 
    "from": "Laurent Duperval &lt;lduperval@...&gt;", 
    "authorName": "Laurent Duperval", 
    "msgSnippet": "Hi, In the process of debugging my transaction problem reported last Friday, I decided to recode the offending tests so they are no longer transactional. I ve", 
    "msgId": 3053, 
    "profile": "lduperval", 
    "topicId": 3053, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1406887205\">Hi,<br/>\n<br/>\nIn the process of debugging my transaction problem reported last Friday, I<br/>\ndecided to recode the offending tests so they are no longer transactional.<br/>\nI&#39;ve found that if the test is run alone, it passes, but if it is run within<br/>\na slew of test suites (AllTests), it fails. If we take the test suite for<br/>\nthe offending class and put it first in AllTests, it passes.<br/>\n<br/>\nIn our transactional tests, the tearDown method ends the transaction. If a<br/>\ntest fails because of an error, is tearDown called nevertheless? Has anyone<br/>\nseen weird side effects where a test run standAlone passes but fails when<br/>\nrun with others?<br/>\n<br/>\nNo, at this point, I can&#39;t say that it&#39;s due to data cleanup. All our tests<br/>\nrecreate data when they are run. Furthermore, most of our data uses database<br/>\nsequence numbers as the primary key so every test run uses a new set of<br/>\ndata. Even if previous data was still in the DB, it can&#39;t be mapped to the<br/>\nnew data.<br/>\n<br/>\nL<br/>\n<br/>\n-- <br/>\nLaurent Duperval &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lduperval@...\">lduperval@...</a>&gt;<br/>\n<br/>\nD&#39;obscures manoeuvres ont eu lieu dans l&#39;ombre et je ferai toute la lumière<br/>\nsur ces ténébreux agissements! C&#39;est du marché noir!<br/>\n                                             -Achille Talon</div>", 
    "prevInTime": 3052, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1003774207", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDIwMDExMDIyMTgxNDM0LkU5NjIxNDY4OEFAbGVuYXJkLm1pY3JvY2VsbGk1LmNvbT4="
    }
}