{
    "numMessagesInTopic": 12, 
    "nextInTime": 3088, 
    "senderId": "bXoXN5Enm1HkfiTtQho9VbZRR6tJEK8qvuxZP6fBpUoMd-d70dGNKgfk0m_g28TWseL4Sn_g9eJft3gl09wgxZ26w_euk4l7", 
    "systemMessage": false, 
    "subject": "Re: [junit] Running JUnit Test Cases from Web Browser", 
    "from": "Jason Rogers &lt;jacaetev@...&gt;", 
    "authorName": "Jason Rogers", 
    "msgSnippet": "... Sri, Sure this is possible.  But you are limited here by things extraneous to JUnit. For instance, the success of the dynamic updating (i.e. the client", 
    "msgId": 3087, 
    "profile": "jacaetev", 
    "topicId": 3086, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-391809189\">--- <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sramaswa007@...\">sramaswa007@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi All,<br/>\n&gt; <br/>\n&gt;   I am designing a project to run junit test cases from the browser.  <br/>\n&gt; Basically the user is given a form where in he types in the test <br/>\n&gt; class he wants to run and clicks the submit button. <br/>\n&gt; <br/>\n&gt; The test case class is called and the results are returned back to <br/>\n&gt; the browser.  I am fine till that part as I am able to call the <br/>\n&gt; appropriate test case entered by the user and am able to display the <br/>\n&gt; results on the browser.  <br/>\n&gt; <br/>\n&gt; What I also need is that, is there a way to determine and print what <br/>\n&gt; test case methods are being run.  As in case of the swingui <br/>\n&gt; (junit.swingui.TestRunner) we have the progress bar indicator that <br/>\n&gt; tells us how many test cases are run, the failures and errors and the <br/>\n&gt; stack trace.  Right now I am able to get all the results but once all <br/>\n&gt; the test cases have finished running, till then the page displayed to <br/>\n&gt; the user is blank.  Is there anyway to dynamically show which method <br/>\n&gt; in the test case is running and whether its a failure or error or <br/>\n&gt; success.  Please let me know.<br/>\n&gt; <br/>\n&gt; Thanks,<br/>\n&gt; Sri<br/>\n<br/>\n </span></blockquote>Sri,<br/>\n<br/>\nSure this is possible.  But you are limited here by things extraneous to JUnit.<br/>\n For instance, the success of the dynamic updating (i.e. the client seeing it<br/>\nin realtime) is going to depend on the speed of both the webserver and the<br/>\nbrowser.  So, you may never really reach a realtime effect in the browser. <br/>\nHowever, I suspect that this will generally be run in a business environment,<br/>\nso the speeds of the machines should be sufficient enough to _simulate_<br/>\nrealtime.<br/>\n<br/>\nTo dynamically update a page requires that you have a little more magic than<br/>\nnormal going on.  There will of necessity be some software on the client side<br/>\nthat will cause the client&#39;s browser to &quot;continuously&quot; reload.  You can feed<br/>\npages up to the server until your heart is content, but if the client never<br/>\nrequests them, it does no good.  I am not sure whether you can accomplish this<br/>\nthrough an applet, having never used them.  It seems to me that you could write<br/>\nsome script or a servlet to update every 5 seconds or so, or you could just do<br/>\nthis in the HTML (which is not so clean).<br/>\n<br/>\nAll of that being said, is it really necessary to to have this kind of<br/>\ninterface?  What&#39;s the motive?  Are the tests running on a server that you want<br/>\nall clients to be able to see?<br/>\n<br/>\n-jason<br/>\n<br/>\n=====<br/>\nJason Rogers<br/>\n[mailto: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jacaetev@...\">jacaetev@...</a>]<br/>\n------------------------------<br/>\nKeep it simple...<br/>\n(1 Corinthians 2:2, Galatians 2:20, 6:14)<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nMake a great connection at Yahoo! Personals.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://personals.yahoo.com\">http://personals.yahoo.com</a></div>", 
    "prevInTime": 3086, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1003885848", 
    "canDelete": false, 
    "nextInTopic": 3088, 
    "prevInTopic": 3086, 
    "headers": {
        "inReplyToHeader": "PDlyNTBvZStpbzVmQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDIwMDExMDI0MDExMDQ4LjE2MzEyLnFtYWlsQHdlYjE0ODA0Lm1haWwueWFob28uY29tPg=="
    }
}