{
    "numMessagesInTopic": 4, 
    "nextInTime": 3122, 
    "senderId": "1BBJWzissjeTWzh1VkO8HIWBVADeNJ1ule0pLJk-ShM-I9xLfN8qbXi3KG8VeV2fbC8D50Ri3SFfec4", 
    "systemMessage": false, 
    "subject": "junit and servlet applications", 
    "from": "jack_dimas@...", 
    "authorName": "jack_dimas@yahoo.com", 
    "msgSnippet": "I m new with JUnit and I m considering the possibility to use it in my applications. However I m puzzled how this can be done because all the classes that are", 
    "msgId": 3121, 
    "profile": "jack_dimas", 
    "topicId": 3121, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-864324877\">I &#39;m new with JUnit and I&#39;m considering the possibility to use it in <br/>\nmy applications. However I&#39;m puzzled how this can be done because all <br/>\nthe classes that are used in my applications depend heavily on a <br/>\nframework. To explain:<br/>\n<br/>\nI &#39;m using this framework to write my servlet applications. The <br/>\nframework consists of a main servlet that calls utility classes. This <br/>\nframework manages database connections and other resources via an <br/>\nenvironment object which is initialized every time I run my <br/>\napplication and I request the first web page. This enviroment object <br/>\nis passed to every utility class I use in my application. Each class <br/>\nuses the environment object to make for example database queries, for <br/>\nsession management, to get a handle to HttpRequest, HttpResponse and <br/>\nservlet objects and other useful things.<br/>\n<br/>\nIn a case like this how could I use JUnit? How can I initialize the <br/>\nenvironment object from the setUp method of a TestCase? I thought of <br/>\ncreating HttpServletRequest, HttpServletResponse objects to pass to <br/>\nmy utility classes but I cannot figure out a way to pass a servlet <br/>\nobject.</div>", 
    "prevInTime": 3120, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1004365858", 
    "canDelete": false, 
    "nextInTopic": 3122, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDlyanA3MitpN2pzQGVHcm91cHMuY29tPg=="
    }
}