{
    "numMessagesInTopic": 23, 
    "nextInTime": 319, 
    "senderId": "rugPP_A_4VQlYvgED93_-QXEzof7kaIVhnkfk83-cm6HKVrVtgu7iwmVt_OihSJ87q8lATa24_OzLb0Q3OMdUWJiYlCaa114", 
    "systemMessage": false, 
    "subject": "Re: Programming By Contract", 
    "from": "&quot;Steve Freeman&quot; &lt;steve@...&gt;", 
    "authorName": "Steve Freeman", 
    "msgSnippet": "... Hmmm, so if the code is self-describing, how do I know whether it might throw an unchecked exception? Comments will go out of sync, and the more components", 
    "msgId": 318, 
    "topicId": 292, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-996329541\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@egroups.com\">junit@egroups.com</a>, &quot;Kent Beck&quot; &lt;kentbeck@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Declared exceptions are a work of the devil. Seemed like a <br/>\n&gt; good idea at while Old Nick was explaining them, but now <br/>\n&gt; the bill is coming due and the benefits are not worth the <br/>\n&gt; cost. That&#39;s just our opinion, but there you have it.<br/>\n&gt; <br/>\n </span></blockquote>Hmmm, so if the code is self-describing, how do I know whether it <br/>\nmight throw an unchecked exception? Comments will go out of sync, and <br/>\nthe more components I bolt together, the more I have to chase through <br/>\nthe details of the logic to see if I&#39;ve covered everything. <br/>\nIntegrating other people&#39;s libraries that use a different exception <br/>\nconvention can be a pig.<br/>\n<br/>\nAs always with Java, they took a useful idea and didn&#39;t quite finish <br/>\nit. In the Modula world, they had a much easier syntax for catching <br/>\nmultiple possible exceptions and a FATAL pragma for ignoring a given <br/>\nexception type within a compilation scope. Small change, but it made <br/>\na difference. They also had well-organised libraries so you didn&#39;t <br/>\nhave to specify all the exceptions in the world.<br/>\n<br/>\nIf we must have static typing, then let the compiler do the work -- <br/>\nand let&#39;s have the tools take advantage of it. Static typing may be a <br/>\npain, but it does give you code completion. Similarly, there&#39;s no <br/>\nreason that an IDE cannot assist with the management of declared <br/>\nexceptions.<br/>\n<br/>\nSteve</div>", 
    "prevInTime": 317, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "980415577", 
    "canDelete": false, 
    "nextInTopic": 319, 
    "prevInTopic": 317, 
    "headers": {
        "inReplyToHeader": "PDk0a2JwMCt1NDRyQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDk0b3M4cCtzcG1kQGVHcm91cHMuY29tPg=="
    }
}