{
    "numMessagesInTopic": 9, 
    "nextInTime": 3230, 
    "senderId": "ikk2asRSvpnjB5mrcodIfFBgsDugksy6H2syQiZM4nfTYsn4ML-Lb-5e4ediAX_EnaT2NVpcFYAsdI_jP28kfvzAZOxP", 
    "systemMessage": false, 
    "subject": "Re: [junit] Inner Class, Even Driven Classes", 
    "from": "Eric Vought &lt;evought@...&gt;", 
    "authorName": "Eric Vought", 
    "msgSnippet": "The short answer is that they are usually tested in the same testcase as the enclosing class. Where the testcase are complex enough for a sepearte testcase", 
    "msgId": 3229, 
    "rawEmail": "Return-Path: &lt;evought@...&gt;\r\nX-Sender: evought@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_0_0_1); 9 Nov 2001 17:14:48 -0000\r\nReceived: (qmail 41566 invoked from network); 9 Nov 2001 17:14:47 -0000\r\nReceived: from unknown (216.115.97.172)\n  by m6.grp.snv.yahoo.com with QMQP; 9 Nov 2001 17:14:47 -0000\r\nReceived: from unknown (HELO ral.qlue.com) (65.201.137.7)\n  by mta2.grp.snv.yahoo.com with SMTP; 9 Nov 2001 17:14:47 -0000\r\nReceived: from brain.qlue-lan (brain.qlue-lan [192.168.1.55])\n\tby ral.qlue.com (Postfix) with ESMTP id 5D4D21CA0D\n\tfor &lt;junit@yahoogroups.com&gt;; Fri,  9 Nov 2001 12:14:45 -0500 (EST)\r\nDate: Fri, 9 Nov 2001 12:14:43 -0500 (EST)\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nSubject: Re: [junit] Inner Class, Even Driven Classes\r\nIn-Reply-To: &lt;48815AF3CA5FD511A25A00508BE16EFF01EC4357@...&gt;\r\nMessage-ID: &lt;Pine.LNX.4.30.0111091125210.25717-100000@...-lan&gt;\r\nMIME-Version: 1.0\r\nContent-Type: TEXT/PLAIN; charset=US-ASCII\r\nFrom: Eric Vought &lt;evought@...&gt;\r\nX-Yahoo-Profile: eric_vought\r\n\r\nThe short answer is that they are usually tested in the same testcase as\nthe enclosing class. Where the testcase are complex enough for a\nsepearte testcase class to make sense, refactoring the inner class to\nthe top level will also typically make sense. For the long answer, I&#39;ll\nlay out a few cases for you and how they are handled in my experience.\n\nIf the class is a tightly coupled private utility, like an iterator or an\nevent adapter, these are typically tested in the test case for the class.\nIn the case of an event listener, whether the listener is implemented by\nan adapter or the class itself is a minor organizational detail. The\nimportant question is whether the event is dispatched correctly. With\niterators, they tend to be very minor in functionality and extremely\ntightly coupled. Iterators are therefore more of a special reference or\npsuedopod of the class-under-test than a separate entity and are also\ntested in the same testcase.\n\nSometimes, you use an inner class to define an interface that goes along\nwith it, such as defining static inner  classes to represent listeners for\nevents which only that class will generate. The example I have in front of\nme right now is a class called LogListener.MaskChangeListener. LogListener\naccepts logging events from a Logger for dispatch. A particular\nLogListener, however, only accepts events of a particular set of\npriorities (e.g. WARNING or above). A Logger wishes to avoid instantiating\nmessages that will never be processed, so it monitors the priority masks\nof its Listeners. It should be obvious that MaskChangeListener is very\nspecific to LogListener and therefore may as well be a part of it.\n\nIn these cases, you have a base class or interface which will be\nimplemented or extended by some other class. The general practice here is\nto create a testcase for that base class (using a stub implementation) and\nthen the testcases for actual implementations can inherit your abstract\ntestcase to ensure that invariants are maintained. With the inner class\nsituation, however, most of the eventual implementations will themselves\nbe inner classes (adapters) and therefore will not be tested as separate\nentities. Further, there really aren&#39;t any invariants to be maintained\nbeyond what the compiler will verify for you- namely, that a method exists\nwith that signature in the implementing class. So, in this case, too,\nthere isn&#39;t any special testing to be done.\n\nAs your inner class gets more complex- perhaps it is an abstract class\nwith some fields or concrete code- the case for doing a seperate testcase\ngets stronger, but so does the case for refactoring. Even if the inner\nclass needs access to private state which you don&#39;t wish to expose, the\ndependency can probably be reduced through refactoring to the point where\nyou can use simple listeners and adapters to connect two top-level\nclasses.\n\nThe borderline case I sometimes run into is an inner class representing a\nsouped up type-safe enumeration. The enumeration has methods to produce or\nparse a human-readable representation of a value and has some special code\nto handle serialization safely. If the enumeration is conceptually coupled\nto the enclosing class, it makes sense to leave it as an inner class.\nThere is *some* significant functionality to test (mostly looking for\nsimple typing errors), which is conceptually different from the\nfunctionality of the top-level class and tends to clutter the testcase a\nlittle if included. I could see a case for breaking this out into multiple\ntestcase if there were a number of similar inner classes in the top-level\nclass. Otherwise, I still tend to keep all the tests in one container.\n\nOn Fri, 9 Nov 2001 sowmya.srinivasan@... wrote:\n\n&gt; Hello\n&gt; I have just started using JUnit.\n&gt; I have a few queries.\n&gt;\n&gt; 1. How do I handle inner classes ?\n&gt; \tIf I have a class A and this has three inner classes A1, A2, A3 ;\n&gt; \t\tShould I write separate test classes for each of these inner\n&gt; classes ? (Atest, A1test, A2test, A3test)\n&gt; \t\tOR should I write just write one test class( TestA) that\n&gt; will handle the functions in the inner classes also ?\n&gt;\n&gt; 2. I am trying to write test classes for an event driven program. How\n&gt; feasible is this ?\n&gt;\n&gt; Thanks\n&gt;\n&gt; Sowmya\n&gt;\n&gt; To unsubscribe from this group, send an email to:\n&gt; junit-unsubscribe@yahoogroups.com\n&gt;\n&gt;\n&gt; Your use of Yahoo! Groups is subject to http://docs.yahoo.com/info/terms/\n&gt;\n&gt;\n&gt;\n\n-- \nEric Vought\nChief Technical Officer - QLUE Consulting, Inc.\n\nevought@... toll-free: 888-771-3538  RTP area: 919-816-9901\n\n\n", 
    "profile": "eric_vought", 
    "topicId": 3227, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "prevInTime": 3228, 
    "contentTrasformed": false, 
    "postDate": "1005326083", 
    "canDelete": false, 
    "nextInTopic": 3274, 
    "prevInTopic": 3227, 
    "headers": {
        "inReplyToHeader": "PDQ4ODE1QUYzQ0E1RkQ1MTFBMjVBMDA1MDhCRTE2RUZGMDFFQzQzNTdAZm1nLW9wLmlmbGV4c29sdXRpb25zLmNvbT4=", 
        "messageIdInHeader": "PFBpbmUuTE5YLjQuMzAuMDExMTA5MTEyNTIxMC4yNTcxNy0xMDAwMDBAYnJhaW4ucWx1ZS1sYW4+"
    }
}