{
    "numMessagesInTopic": 16, 
    "nextInTime": 3247, 
    "senderId": "uch3GM6gJd-WS2sE1PE2zr9qKjttgaJICao4fe3gINktauphRHVVYRKAktftd85_OAhtlTOW9ySpj9ns6Pg85IMdksIf", 
    "systemMessage": false, 
    "subject": "Re: [junit] RE: Separate Package for Test Cases or not ?", 
    "from": "Eric Vought &lt;evought@...&gt;", 
    "authorName": "Eric Vought", 
    "msgSnippet": "Also, even if the unit tests are not complete or perfect, they provide an example of how the programmer thought the API was supposed to work- beyond what is", 
    "msgId": 3246, 
    "profile": "eric_vought", 
    "topicId": 3211, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-655992292\">Also, even if the unit tests are not complete or perfect, they provide an<br/>\nexample of how the programmer thought the API was supposed to work- beyond<br/>\nwhat is covered in the documentation. By looking at their test code and<br/>\ncomparing it to your code (which maybe isn&#39;t working), you can get an idea<br/>\nwhere you or the vendor are making unwarranted assumptions.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, 12 Nov 2001, David Stagner wrote:<br/>\n<br/>\n&gt; &quot;Rogers, Jason&quot; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; &quot;David Stagner&quot; wrote:<br/>\n&gt; &gt;   &gt; Unit tests document API usage very well, for starters.  And they<br/>\n&gt; &gt; suggest<br/>\n&gt; &gt;   &gt; where any bugs encountered might be, even by their absence (a<br/>\n&gt; &gt;   &gt; problematic condition may not be tested, and a set of tests could<br/>\n&gt; &gt; rule<br/>\n&gt; &gt;   &gt; out a bunch of possible causes for a bug).<br/>\n&gt; &gt;   &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; This seems like a pretty weak argument to me.  They only document the<br/>\n&gt; &gt; set of<br/>\n&gt; &gt; the API that the authors chose to test, and they only test to the<br/>\n&gt; &gt; authors&#39;<br/>\n&gt; &gt; degrees of comfortability.  Truth be known, just because JUnit is in use<br/>\n&gt; &gt; does<br/>\n&gt; &gt; not mean that the code is being tested thoroughly.  Right?  You may be<br/>\n&gt; &gt; right<br/>\n&gt; &gt; that it could show you what isn&#39;t tested, but not necessarily why.  And<br/>\n&gt; &gt; it only<br/>\n&gt; &gt; gives you a clue as to what is not tested and what is.  There may not be<br/>\n&gt; &gt; a one<br/>\n&gt; &gt; to one mapping of the public API to the tests.<br/>\n&gt;<br/>\n&gt; Granted.  I was assuming that the set of unit tests theoretically<br/>\n&gt; provided by our imaginary vendor (has anyone ever seen a non-open source<br/>\n&gt; vendor do this?) would be reasonably thorough, complete, and<br/>\n&gt; representative.  If the unit tests don&#39;t exercise all the documented<br/>\n&gt; methods and boundaries of the API, they&#39;re incomplete anyway.  The hard<br/>\n&gt; part comes with testing coupling, interaction, and state changes between<br/>\n&gt; components, where the non-trivial bugs often lurk.<br/>\n&gt;<br/>\n&gt; On a more philosophical level, i&#39;d suggest that most unit testing is<br/>\n&gt; either very useful, or mostly useless, depending on the confidence of<br/>\n&gt; the programmer in the testing process.  Cowardly testing is a sign of a<br/>\n&gt; lack of confidence in the code.  Once a programmer gets in the habit of<br/>\n&gt; serious unit testing, the programmer will almost always be more<br/>\n&gt; confident in the code - and thus more likely to test thoroughly.  Good<br/>\n&gt; unit testing is a self-reinforcing feedback loop.  And if i were given a<br/>\n&gt; set of unit tests from a vendor that clearly did not thoroughly test the<br/>\n&gt; public interface of the software, i would immediately distrust the<br/>\n&gt; software in question.<br/>\n&gt;<br/>\n<br/>\n-- <br/>\nEric Vought<br/>\nChief Technical Officer - QLUE Consulting, Inc.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:evought@...\">evought@...</a> toll-free: 888-771-3538  RTP area: 919-816-9901 </span></blockquote></div>", 
    "prevInTime": 3245, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1005620145", 
    "canDelete": false, 
    "nextInTopic": 3249, 
    "prevInTopic": 3241, 
    "headers": {
        "inReplyToHeader": "PDNCRjA0MTY2LjVERTdGNzM1QG5tZHAub3JnPg==", 
        "messageIdInHeader": "PFBpbmUuTE5YLjQuMzAuMDExMTEyMjE1MzU4MC40NzYwLTEwMDAwMEBicmFpbi5xbHVlLWxhbj4="
    }
}