{
    "numMessagesInTopic": 1, 
    "nextInTime": 3254, 
    "senderId": "5k-IMbXy979kGD8UyVcAxg8fDNtkS1GYSJ9OJwSWtu5n1thxQ2AOYvRXjR_pe0ucjUlm55Awkm7LET_Htcoq0djjfSY", 
    "systemMessage": false, 
    "subject": "RE: Separate Package for Test Cases or not", 
    "from": "Keith Ray &lt;keith.ray@...&gt;", 
    "authorName": "Keith Ray", 
    "msgSnippet": "... Yes, I have had real-world experiences that convinced me of the value of unit tests for documentation. It sounds like the only way for you to be convinced", 
    "msgId": 3253, 
    "profile": "xpkeith", 
    "topicId": 3253, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1420451931\">\n<html>\n<head>\n \n \n<title>RE: Separate Package for Test Cases or not </title>\n</head>\n \n\n<p><font SIZE=\"2\">&gt;&nbsp;&nbsp; Date: Tue, 13 Nov 2001 08:10:51 -0500</font>\n<br><font SIZE=\"2\">&gt;&nbsp;&nbsp; From: &quot;Rogers, Jason&quot; &lt;jrogers@...&gt;</font>\n<br><font SIZE=\"2\">&gt;Subject: RE: RE: Separate Package for Test Cases or not ?</font>\n<br><font SIZE=\"2\">&gt;</font>\n<br><font SIZE=\"2\">&gt;perhaps... but I some how think it is overrated.&nbsp; These are all</font>\n<br><font SIZE=\"2\">&gt;assumptions (good ones, most likely).&nbsp; Has anyone had real-world</font>\n<br><font SIZE=\"2\">&gt;experience with this?&nbsp; I am not trying to be a skeptic just for</font>\n<br><font SIZE=\"2\">&gt;skepticism&#39;s sake.&nbsp; I want to be convinced.</font>\n</p>\n\n<p><font SIZE=\"2\">Yes, I have had real-world experiences that convinced me of the value of unit tests for documentation. It sounds like the only way for you to be convinced is for you to also have similar real-world experiences.</font></p>\n\n<p><font SIZE=\"2\">1. Unit tests can be run on MY machine, revealing undocumented problems (&quot;oh yes, you need NT 4 patch-level 5 for this, patch-level 4 is missing the blah blah DLL.&quot;) Much nicer to find this out by running the supplied tests, rather than code away and then wonder why your code isn&#39;t working.</font></p>\n\n<p><font SIZE=\"2\">2. Unit tests sources are examples of how the code-under-test is expected to be used.&nbsp; I&#39;ve been burned too often by Documentation that is out of date or inaccurate or incomplete. Very often, the documentation doesn&#39;t have full examples of calling every public API. Executable unit tests HAVE to be up to date.... or reveal that the vendor is not running its own unit tests.</font></p>\n\n<p><font SIZE=\"2\">3. Unit test sources can also be examples of how the code-under-test behaves in failure situations. &quot;hmm... this test shows that the file it opens has to have write-access. That&#39;s why my code, which is trying to open a file on a CD-ROM, is failing.&quot; MUCH nicer to have a supplied unit test</font></p>\n\n<p><font SIZE=\"2\">4. Poor unit tests are better than no unit tests at all.</font>\n</p>\n\n<p><font SIZE=\"2\">The Booch Components (C++) were a really good class framework available in the early days of C++ that came with sources (of necessity, since they were template classes) and with unit tests. The unit tests gave you confidence that whatever C++ compiler you were using was able to properly compile and run the Booch components. Rogue Wave bought and buried the Booch Components, so you can&#39;t get them any more. They were a lot nicer than STL, IMO.</font></p>\n\n<p><font SIZE=\"2\">Today, getting jar files (with no sources) from third-parties, it is VERY nice to have unit tests which will demonstrate to me that MY Java environments (MacOS 9 and X, Windows, JDK 1.1.8, JDK 1.3.1, CodeWarrior, VisualCafe, etc.) can run those the in those jars. Often, undocumented dependencies on JDK 1.3.1 show up, or assumptions were made about the operating system that would be revealed when running on MacOS 9.</font></p>\n\n \n</html></div>", 
    "prevInTime": 3252, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1005673249", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PEQ5RjZCOURBQkE0Q0FFNEI5Mjg1MDI1MkM1MjM4M0FCMDEwMUZCNTJAZXgtZW5nLWNvcnA+"
    }
}