{
    "numMessagesInTopic": 1, 
    "nextInTime": 3255, 
    "senderId": "xrevCnkJEOWLIkZ26-lYnXRVBiMveHW_5JbiI42ZeMk6L3yM_lgG-XLxVqUeVpn44Ftm7AqMKKaj_Kx99b9FqCZzMfuExfY1Mw", 
    "systemMessage": false, 
    "subject": "RE: [junit] RE: Separate Package for Test Cases or not", 
    "from": "&quot;Rogers, Jason&quot; &lt;jrogers@...&gt;", 
    "authorName": "Rogers, Jason", 
    "msgSnippet": "Thanks Keith.  I don t need to really experience it to be convinced though.  What I wanted to hear was that someone has received UTs for a codebase for which", 
    "msgId": 3254, 
    "profile": "jacaetev", 
    "topicId": 3254, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-266104766\">Thanks Keith.  I don&#39;t need to really experience it to be convinced<br/>\nthough.  What I wanted to hear was that someone has received UTs for a<br/>\ncodebase for which they had only class files and were able to gain<br/>\nanything from them (besides how to reverse engineer them :).  It sounds<br/>\nlike you and Eric Vought both have.<br/>\n<br/>\nI think that&#39;s wonderful.  I just didn&#39;t want to hear a lot of<br/>\nspeculation about &quot;what could be&quot; -- I wanted to hear &quot;what is&quot; and<br/>\n&quot;what has been&quot;.<br/>\n<br/>\nThanks.<br/>\n-jason<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Keith Ray [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:keith.ray@...\">keith.ray@...</a>]<br/>\nSent: Tuesday, November 13, 2001 12:41 PM<br/>\nTo: &#39;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>&#39;<br/>\nSubject: [junit] RE: Separate Package for Test Cases or not<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   Date: Tue, 13 Nov 2001 08:10:51 -0500 <br/>\n&gt;   From: &quot;Rogers, Jason&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jrogers@...\">jrogers@...</a>&gt; <br/>\n&gt;Subject: RE: RE: Separate Package for Test Cases or not ? <br/>\n&gt; <br/>\n&gt;perhaps... but I some how think it is overrated.  These are all <br/>\n&gt;assumptions (good ones, most likely).  Has anyone had real-world <br/>\n&gt;experience with this?  I am not trying to be a skeptic just for <br/>\n&gt;skepticism&#39;s sake.  I want to be convinced. <br/>\n </span></blockquote>Yes, I have had real-world experiences that convinced me of the value of<br/>\nunit tests for documentation. It sounds like the only way for you to be<br/>\nconvinced is for you to also have similar real-world experiences.<br/>\n1. Unit tests can be run on MY machine, revealing undocumented problems<br/>\n(&quot;oh yes, you need NT 4 patch-level 5 for this, patch-level 4 is missing<br/>\nthe blah blah DLL.&quot;) Much nicer to find this out by running the supplied<br/>\ntests, rather than code away and then wonder why your code isn&#39;t<br/>\nworking.<br/>\n2. Unit tests sources are examples of how the code-under-test is<br/>\nexpected to be used.  I&#39;ve been burned too often by Documentation that<br/>\nis out of date or inaccurate or incomplete. Very often, the<br/>\ndocumentation doesn&#39;t have full examples of calling every public API.<br/>\nExecutable unit tests HAVE to be up to date.... or reveal that the<br/>\nvendor is not running its own unit tests.<br/>\n3. Unit test sources can also be examples of how the code-under-test<br/>\nbehaves in failure situations. &quot;hmm... this test shows that the file it<br/>\nopens has to have write-access. That&#39;s why my code, which is trying to<br/>\nopen a file on a CD-ROM, is failing.&quot; MUCH nicer to have a supplied unit<br/>\ntest<br/>\n4. Poor unit tests are better than no unit tests at all. <br/>\nThe Booch Components (C++) were a really good class framework available<br/>\nin the early days of C++ that came with sources (of necessity, since<br/>\nthey were template classes) and with unit tests. The unit tests gave you<br/>\nconfidence that whatever C++ compiler you were using was able to<br/>\nproperly compile and run the Booch components. Rogue Wave bought and<br/>\nburied the Booch Components, so you can&#39;t get them any more. They were a<br/>\nlot nicer than STL, IMO.<br/>\nToday, getting jar files (with no sources) from third-parties, it is<br/>\nVERY nice to have unit tests which will demonstrate to me that MY Java<br/>\nenvironments (MacOS 9 and X, Windows, JDK 1.1.8, JDK 1.3.1, CodeWarrior,<br/>\nVisualCafe, etc.) can run those the in those jars. Often, undocumented<br/>\ndependencies on JDK 1.3.1 show up, or assumptions were made about the<br/>\noperating system that would be revealed when running on MacOS 9.<br/>\n<br/>\nYahoo! Groups Sponsor<br/>\n<br/>\n<br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service.</div>", 
    "prevInTime": 3253, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1005678979", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDQ4ODAzMkJCNjBFMjkxNEY4ODZFNDUxNzI4QUI4QTZEODI5OTc5QGV4Y2hhbmdlLmdsdGcuY29tPg=="
    }
}