{
    "numMessagesInTopic": 31, 
    "nextInTime": 3283, 
    "senderId": "tV3B6w4CBSPdC03pmpWPVg2hISccAhDXesufudn2pAcxzhENIGZGonBbjqiC4-8SG7g4rsflu-JT", 
    "systemMessage": false, 
    "subject": "Re: Anyone know of a decent debugger?", 
    "from": "mamago@...", 
    "authorName": "mamago@bigfoot.com", 
    "msgSnippet": "... Debuggers, output/log statements, all these are tools that the developer has at his disposal to perform his job (as another poster suggests). Which one you", 
    "msgId": 3282, 
    "profile": "mamagouk", 
    "topicId": 3259, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-923666358\">--- In junit@y..., Mike Clark &lt;mike@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; This form of debugging requires visual inspection of the debug <br/>\n&gt; statements.<br/>\n<br/>\n </span></blockquote>Debuggers, output/log statements, all these are tools that the <br/>\ndeveloper has at his disposal to perform his job (as another poster <br/>\nsuggests). Which one you chose will probably depend on which one you <br/>\nfeel most comfortable with.<br/>\n<br/>\nI find that I understand the code much better using System.out <br/>\nstatements rather than trying to find my way round existing Java <br/>\ndebuggers, which IME have found lacking. (Maybe the suggestions in <br/>\nthis thread will help me change that.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Moreover, logging debug messages at this granularity tends to <br/>\n&gt; reduce the<br/>\n&gt; readability of the code, in my experience.<br/>\n<br/>\n </span></blockquote>I agree. If you use debug output/log statements, they are there to <br/>\nperform a specific task: find a bug. Once located and exterminated, <br/>\ntheir function is over, take them out.<br/>\n<br/>\nIf you would like to document an aspect of the bug, try with an <br/>\nassertion, where appropriate. Otherwise, document it with a test case <br/>\nwhich exercises the bug. Thus, if modifying the code at a later date <br/>\nyou reinsert the bug, the test will catch this case and alert you.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; If I&#39;m the poor sod who changes the code later, I&#39;d rather have a <br/>\n&gt; set of tests<br/>\n&gt; that automatically check the results.  That&#39;s not to say logging <br/>\n&gt; warning and error<br/>\n&gt; messages aren&#39;t valuable, just that analyzing debug statements <br/>\n&gt; requires more<br/>\n&gt; effort in the long run than writing tests.<br/>\n<br/>\n </span></blockquote>As for logging statements, these are different from debug statements. <br/>\nA debug statement will probably tell you whether you reached a <br/>\ncertain point in the code, the values of certain variables at that <br/>\npoint, in effect, for me, they take the place of the debugger. These <br/>\ndon&#39;t usually add any value later on.<br/>\n<br/>\nLogging statements are different. They are there to add information. <br/>\nYou can still have logging statements at the debug level, but they <br/>\nshould be informative, rather than just: &quot;The JVM woz &#39;ere!&quot;<br/>\n<br/>\nManuel Amago.<br/>\nmailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamago@...\">mamago@...</a></div>", 
    "prevInTime": 3281, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1005910628", 
    "canDelete": false, 
    "nextInTopic": 3283, 
    "prevInTopic": 3279, 
    "headers": {
        "inReplyToHeader": "PDNCRjQ1OEQxLkQzM0I3ODZEQGNsYXJrd2FyZS5jb20+", 
        "messageIdInHeader": "PDl0MnRwNCtqZ2tqQGVHcm91cHMuY29tPg=="
    }
}