{
    "numMessagesInTopic": 8, 
    "nextInTime": 3312, 
    "senderId": "ozOzhUcGcIpgI1wZJn-BdFPg9ifUs2YejQ98vgUHjB2uyGNSj-FSv21lSGk7ccXoPscDHK8IpH3IcdFwIGZl5rE8O7_l", 
    "systemMessage": false, 
    "subject": "RE: [junit] Integration between JUnit and bug tracker?", 
    "from": "Eric Vought &lt;evought@...&gt;", 
    "authorName": "Eric Vought", 
    "msgSnippet": "If you are bringing unit testing into an existing dev/QA structure, you want the tests written by the two groups to start to diverge, you want a clear", 
    "msgId": 3311, 
    "rawEmail": "Return-Path: &lt;evought@...&gt;\r\nX-Sender: evought@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_0_0_1); 19 Nov 2001 16:21:29 -0000\r\nReceived: (qmail 46166 invoked from network); 19 Nov 2001 16:21:29 -0000\r\nReceived: from unknown (216.115.97.171)\n  by m8.grp.snv.yahoo.com with QMQP; 19 Nov 2001 16:21:29 -0000\r\nReceived: from unknown (HELO ral.qlue.com) (65.201.137.7)\n  by mta3.grp.snv.yahoo.com with SMTP; 19 Nov 2001 16:21:30 -0000\r\nReceived: from brain.qlue-lan (brain.qlue-lan [192.168.1.55])\n\tby ral.qlue.com (Postfix) with ESMTP id 9962E1B8DE\n\tfor &lt;junit@yahoogroups.com&gt;; Mon, 19 Nov 2001 11:21:27 -0500 (EST)\r\nDate: Mon, 19 Nov 2001 11:21:26 -0500 (EST)\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nSubject: RE: [junit] Integration between JUnit and bug tracker?\r\nIn-Reply-To: &lt;D9BC812593BC2E44A803E6765FFA5E2D18B75B@...&gt;\r\nMessage-ID: &lt;Pine.LNX.4.30.0111191027190.1892-100000@...-lan&gt;\r\nMIME-Version: 1.0\r\nContent-Type: TEXT/PLAIN; charset=US-ASCII\r\nFrom: Eric Vought &lt;evought@...&gt;\r\nX-Yahoo-Profile: eric_vought\r\n\r\nIf you are bringing unit testing into an existing dev/QA structure, you\nwant the tests written by the two groups to start to diverge, you want a\nclear demarcation point between the two roles, and you want good\ncommunication across that boundary.\n\nThe developers write their unit tests. The unit tests are designed to be\nas simple as possible and have the widest coverage possible. The\ndevelopers run these tests in their own sandbox. It doesn&#39;t make much\nsense to automate the reporting of bugs here, since the failures are in\ncode in the sandbox, not in the repository. When the tests pass in the\nsandbox, the next step is to update the sandbox from the repository to\nintegrate any recent changes made by other developers (easy to do using\nCVS or BitKeeper). Then, if the tests still pass, the changes are\ncomitted back to the repository.\n\nIn most XP groups, there is a periodic integration test on an integration\nworkstation. This workstation is supposed to have a clean configuration at\nall times (It may be reimaged frequently). Someone does a clean checkout\nto this machine and runs the tests to verify that everything is integrating\ncorrectly in that environment. This is done one or two times a day.\n\nIn a group with a slightly heavier weight process, the integration may be\nrun by QA folks. The QA folks use the unit tests to verify a clean build\nbefore taking the snapshot to their side for further (functional) testing.\nThis is where it may make sense to enter failures into bug tracking, but\nfailures should be rare and will always require some immediate\ninvestigation. I&#39;m not sure that automation will buy one much over just\nentering the bug report by hand.\n\nThis is also a good place to run any coverage analysis tools and look for\ntrouble spots. If the QA group does this, it will probably satisfy their\ndesire for oversite of the developers&#39; process. Be careful with coverage\nanalysis, though- use it to identify serious weakpoints but don&#39;t become a\nslave to metrics. Even the best analysis tools will miss branches which\nhave been taken in tests but whose results were never verified or will\nidentify assertions or roadblocks as &quot;uncovered code&quot;. It&#39;s also OK to not\nhave 100% (branch/statement/expression) coverage all the time. Coverage\nshould steadily approach 100% over the life of the project as refactoring\noccurs and tests are added to reproduce reported bugs.\n\nThe QA folks then perform their testing, concentrating on the functional\nside. In some cases, particularly with public APIs, JUnit can be useful to\nthem as well, but higher level scripting tools tend to be more useful.\nSomething like Jython or NetRexx can be mixed with JUnit to give\nthe best of both. I have found that it is best if most of the QA group\nhas basic scripting skills. There should be one QA toolsmith per group (or\nshared with at most three small QA groups) who can do the heavyweight\nprogramming needed to create specialized test tools for the rest of the\ngroup. Again, though, I&#39;m not sure I see where integration with JUnit will\nbuy you much. In large projects, I&#39;ve sometimes wanted an analysis tool\nwhich would check a database and verify that the test suite only reported\nexpected failures (i.e. those for known, active defects) and all of the\nexpected failures, but I&#39;ve never wanted anything to report defects for\nme. There is too much value in a well-written defect report. Check Brian\nMarrick&#39;s site (http://www.testing.com/) for good articles on how to\nimprove defect reports. You would also have to figure out how to avoid the\nphenomenon of cascading failures- one defect at a sufficiently low level\ncan cause hundreds of testcase failures. One doesn&#39;t want to bury the\ndevelopers in hundreds of automated defects. This can be attenuated if\nyour bug tracking system  is aware of test or component interdependencies,\nbut it takes a lot of extra work for the small automation gain.\n\nOn Mon, 19 Nov 2001, Alan Pearlman Spencer wrote:\n\n&gt; Thanks,\n&gt; I agree with the idea about &quot;if you are doing it properly you don&#39;t\n&gt; need this&quot;...\n&gt; I&#39;m trying to migrate a dev/QA team over to the &quot;right&quot; way and I\n&gt; suppose\n&gt; the QA team are scared about loosing visibility into the tests (that are\n&gt; written by the developers).\n&gt;\n&gt; We will have nightly builds and they will run the tests and I suppose\n&gt; they want to be able to get some visibility into the fixing of these\n&gt; problems. There is a fair argument that they don&#39;t need to know, that\n&gt; is the beauty...\n&gt; Thanks for the long response!\n&gt; Alan.\n&gt;\n&gt; -----Original Message-----\n&gt; From: Andrew Clarke [mailto:andrew.clarke@...]\n&gt; Sent: 19 November 2001 14:12\n&gt; To: &#39;junit@yahoogroups.com&#39;\n&gt; Subject: RE: [junit] Integration between JUnit and bug tracker?\n&gt;\n&gt;\n&gt; Forgive me, but isn&#39;t this rather contrary to the spirit of JUnit and\n&gt; its\n&gt; TestInfected/XP approach?  Kent says we&#39;re supposed to cycle through the\n&gt; testing and coding stages a few times until our code has no bugs.  So\n&gt; what\n&gt; is there to track?  same goes for integration: providing we&#39;re\n&gt; developing in\n&gt; small enough chunks, of course.\n&gt;\n&gt; Or look at it another way: our failed tests are their own bug\n&gt; trackingdevice.\n&gt;\n&gt; Automatically populating a bug track database from failed tests would\n&gt; only\n&gt; make sense when the people running the tests aren&#39;t the same people who\n&gt; are\n&gt; developing the code, for instance users in UAT or a &quot;black box&quot; testing\n&gt; cell.  I don&#39;t think JUnit is sufficiently abstract for the former but I\n&gt; can\n&gt; see that the latter could be writing their own JUnit suites (if they\n&gt; know\n&gt; Java).  In which case your question is simply a variant on the &quot;How do I\n&gt; log\n&gt; output from JUnit?&quot; question, only instead of writing to a logfile you\n&gt; want\n&gt; to insert the results into an error tracking database.  How difficult\n&gt; that\n&gt; is depends on the database in question: if it&#39;s something proprietary\n&gt; like\n&gt; Merant Tracker I imagine there&#39;ll be a few more problems than if (like\n&gt; us)\n&gt; you&#39;re using a homebrew system based on tables sitting in your\n&gt; development\n&gt; Oracle DB.  The Bugzilla FAQ does say we write to the database using the\n&gt; Mozilla XML API so it would be possible to do, but I think you&#39;ll be\n&gt; lucky\n&gt; to find anyone who&#39;s actually done it :P\n&gt;\n&gt; rgds, APC\n&gt;\n&gt; A P Clarke\n&gt; Consultant\n&gt; CMG Admiral UK - Radio Spectrum International\n&gt; Wyndham House\n&gt; 189 Marsh Wall\n&gt; London\n&gt; E14 9SH\n&gt; Tel: +44 (0)20 7211 0603\n&gt; Fax: +44 (0)20 7211 0364\n&gt; Mobile:-----------------------\n&gt; Internet communications are not secure and therefore CMG UK Ltd does not\n&gt; accept legal responsibility for the contents of this message. Any views\n&gt; or\n&gt; opinions presented are solely those of the author and do not necessarily\n&gt; represent those of CMG UK Ltd, unless otherwise specifically stated. If\n&gt; the\n&gt; content of this e mail is to become contractually binding, it must be\n&gt; made\n&gt; in writing and signed by a duly authorised representative of CMG UK Ltd\n&gt;\n&gt;\n&gt;\n&gt; -----Original Message-----\n&gt; From: Alan Pearlman Spencer [mailto:aspencer@...]\n&gt; Sent: 19 November 2001 12:39\n&gt; To: junit@yahoogroups.com\n&gt; Subject: RE: [junit] Integration between JUnit and bug tracker?\n&gt;\n&gt;\n&gt; I meant having the results (from an automated build/unit test)\n&gt; entered in as bugs in, say, bugzilla??\n&gt; Thanks,\n&gt; Alan.\n&gt;\n&gt; -----Original Message-----\n&gt; From: Rogers, Jason [mailto:jrogers@...]\n&gt; Sent: 19 November 2001 12:13\n&gt; To: junit@yahoogroups.com\n&gt; Subject: RE: [junit] Integration between JUnit and bug tracker?\n&gt;\n&gt;\n&gt; No.  What is your idea for integration?\n&gt;\n&gt; ------------------------------------------------------------------------\n&gt; ------\n&gt; Jason Rogers                                          Email:\n&gt; jrogers@...\n&gt; Software Consultant                                   Direct:\n&gt; 248-204-7180\n&gt; Great Lakes Technologies Group                        Main:\n&gt; 248-352-6740\n&gt; -----Original Message-----\n&gt; From: Alan Spencer [mailto:aspencer@...]\n&gt; Sent: Monday, November 19, 2001 5:27 AM\n&gt; To: junit@yahoogroups.com\n&gt; Subject: [junit] Integration between JUnit and bug tracker?\n&gt;\n&gt;\n&gt;\n&gt; Anyone know of any bug tracking software that integrates with JUnit\n&gt; or one where the integration may be easy to build...?\n&gt;\n&gt; Thanks,\n&gt; Alan.\n&gt;\n&gt;\n&gt;\n&gt; Yahoo! Groups Sponsor\n&gt;\n&gt;\n&gt;\n&gt; To unsubscribe from this group, send an email to:\n&gt; junit-unsubscribe@yahoogroups.com\n&gt;\n&gt;\n&gt; Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.\n&gt;\n&gt;\n&gt; To unsubscribe from this group, send an email to:\n&gt; junit-unsubscribe@yahoogroups.com\n&gt;\n&gt;\n&gt; Your use of Yahoo! Groups is subject to\n&gt; http://docs.yahoo.com/info/terms/\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To unsubscribe from this group, send an email to:\n&gt; junit-unsubscribe@yahoogroups.com\n&gt;\n&gt;\n&gt; Your use of Yahoo! Groups is subject to\n&gt; http://docs.yahoo.com/info/terms/\n&gt;\n&gt;\n&gt;\n&gt; To unsubscribe from this group, send an email to:\n&gt; junit-unsubscribe@yahoogroups.com\n&gt;\n&gt;\n&gt; Your use of Yahoo! Groups is subject to\n&gt; http://docs.yahoo.com/info/terms/\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To unsubscribe from this group, send an email to:\n&gt; junit-unsubscribe@yahoogroups.com\n&gt;\n&gt;\n&gt; Your use of Yahoo! Groups is subject to http://docs.yahoo.com/info/terms/\n&gt;\n&gt;\n&gt;\n\n-- \nEric Vought\nChief Technical Officer - QLUE Consulting, Inc.\n\nevought@... toll-free: 888-771-3538  RTP area: 919-816-9901\n\n\n", 
    "profile": "eric_vought", 
    "topicId": 3305, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "prevInTime": 3310, 
    "contentTrasformed": false, 
    "postDate": "1006186886", 
    "canDelete": false, 
    "nextInTopic": 3312, 
    "prevInTopic": 3310, 
    "headers": {
        "inReplyToHeader": "PEQ5QkM4MTI1OTNCQzJFNDRBODAzRTY3NjVGRkE1RTJEMThCNzVCQGdwby5tb2JpbGVhd2FyZS5jb20+", 
        "messageIdInHeader": "PFBpbmUuTE5YLjQuMzAuMDExMTE5MTAyNzE5MC4xODkyLTEwMDAwMEBicmFpbi5xbHVlLWxhbj4="
    }
}