{
    "numMessagesInTopic": 2, 
    "nextInTime": 3328, 
    "senderId": "yVVaqvLwRDqQzc78jLXMIWxCE8rj6AhLYAMELD01PTgV32FI1jOShVva-V5fG9_CiXJG-6uI7lQ3EwOISSCqGDdazfkfSzg", 
    "systemMessage": false, 
    "subject": "assertTrue(string, boolean)", 
    "from": "&quot;Kannan&quot; &lt;kannan_4063@...&gt;", 
    "authorName": "Kannan", 
    "msgSnippet": "background --- i use junit with ant, and my build and unit testing is automated. for testing i have the testcases in an xml file and the class that extends the", 
    "msgId": 3327, 
    "profile": "kannan_4063", 
    "topicId": 3327, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-2065887305\">background --- i use junit with ant, and my build and unit testing is <br/>\nautomated. for testing i have the testcases in an xml file and the <br/>\nclass that extends the TestCase class reads the xml file and compares <br/>\nthe output of the test case against the expected values (again <br/>\nspecifed along with the input in the xml file)<br/>\n<br/>\nfor each testcase to succeed, the code may have to pass many assert <br/>\nstatements. What i have done is the message parameter of assertTrue <br/>\nhas a sting something like this (expected value=X , actual value=Y) <br/>\nso that i know which assert failed. so far evrything is fine.<br/>\n<br/>\nnow the problem --- unless and until assertTrue fails, the message <br/>\nnever gets logged. if assert fails i can get the message in the junit <br/>\nreport. is there anyway to log the message even if the asserttrue is <br/>\na success so that the junit report has these additional data.<br/>\n<br/>\nhas anyone ever done this? is it possible in the current <br/>\nimplementation of junit. any help is greatly appreciated.</div>", 
    "prevInTime": 3326, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1006375944", 
    "canDelete": false, 
    "nextInTopic": 3328, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDl0aDQ2OCtnYW9oQGVHcm91cHMuY29tPg=="
    }
}