{
    "numMessagesInTopic": 8, 
    "nextInTime": 3441, 
    "senderId": "DWTykwx_a_Q1pA8R_rLE_QHmjf5jlpkogBJRyWkk3zBIj-FnlN2nlvUgT680lwIzI88BG_VPdMj1iCWavd2j0nalN8pe", 
    "systemMessage": false, 
    "subject": "Re: [junit] User interface issue", 
    "from": "Robert Sartin &lt;sartin@...&gt;", 
    "authorName": "Robert Sartin", 
    "msgSnippet": "... There are often situations where it is possible to automatically generate useful tests. For example, I have a domain-specific language that configures our", 
    "msgId": 3440, 
    "profile": "robert_sartin", 
    "topicId": 3432, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 812331, 
    "messageBody": "<div id=\"ygrps-yiv-1778997961\">--- Vladimir Bossicard &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:vladimir@...\">vladimir@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You would like to have a TestSuite that generates tests for all<br/>\n&gt; possible <br/>\n&gt; values (and you pass this value to the test via a Property object,<br/>\n&gt; for <br/>\n&gt; example).  It&#39;s fine but may I ask: do you really need to test your <br/>\n&gt; class with every possibilities?  I don&#39;t think so.  You cannot test <br/>\n&gt; everything (imagine if you want to test a drawing program with<br/>\n&gt; endless possibilities).<br/>\n<br/>\n </span></blockquote>There are often situations where it is possible to automatically<br/>\ngenerate useful tests. For example, I have a domain-specific language<br/>\nthat configures our product. Statements in the language are allowed in<br/>\nfairly unconstrained order. There are dependencies between the<br/>\nstatements. Nonetheless, the order of the statements should not affect<br/>\nthe resulting configuration. We found it valuable to write tests that<br/>\nwould permute valid code and verify it compiled to the same result. Of<br/>\ncourse, we decided to do it all in one testMethod() because that&#39;s the<br/>\neasier way to configure it. This argument assumes there is only one way<br/>\nto write tests and that any way that write either more or fewer tests<br/>\nis wrong. That&#39;s simply not the case. JUnit, despite its name, is quite<br/>\nusable for writing larger scale tests and even for automating tests.<br/>\nWhy not help it be a more complete framework rather than argue it<br/>\nshould not grow because &quot;real&quot; unit tests wouldn&#39;t need a proposed<br/>\nenhancement?<br/>\n<br/>\nI have another example of automated tests, but I can&#39;t remember the<br/>\ndetails. In this instance, we actually wrote a setUp() method that<br/>\ncreated multiple instance of the TestCase with different<br/>\nconfigurations, and ran into the naming problem. Our workaround to the<br/>\nJUnit confounding of test name with method name was to make sure all of<br/>\nour assertions include a message that indicates which test<br/>\nconfiguration is being used.<br/>\n<br/>\nRegards,<br/>\n<br/>\nRob<br/>\n<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nBuy the perfect holiday gifts at Yahoo! Shopping.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://shopping.yahoo.com\">http://shopping.yahoo.com</a></div>", 
    "prevInTime": 3439, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1007442872", 
    "canDelete": false, 
    "nextInTopic": 3442, 
    "prevInTopic": 3437, 
    "headers": {
        "inReplyToHeader": "PDNDMEMxRjE3LjcwODAwMDhAYm9zc2ljYXJkLmNvbT4=", 
        "messageIdInHeader": "PDIwMDExMjA0MDUxNDMyLjQ4MzcwLnFtYWlsQHdlYjExNjAyLm1haWwueWFob28uY29tPg=="
    }
}