{
    "numMessagesInTopic": 8, 
    "nextInTime": 3446, 
    "senderId": "bUg9pSkaIybifyHYN5F57RVHd98mPL3q1CD25HOrczVr7N0rVK-dLAPa-F843xXKzjOTMWW2uQTM", 
    "systemMessage": false, 
    "subject": "Re: [junit] User interface issue", 
    "from": "&lt;evought@...&gt;", 
    "authorName": "evought@qlue.com", 
    "msgSnippet": "In past situations, I ve addressed the computational problem by having a decent random number library available that can generate good quality psuedo-random", 
    "msgId": 3445, 
    "rawEmail": "Return-Path: &lt;evought@...&gt;\r\nX-Sender: evought@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_0_1_2); 4 Dec 2001 17:51:48 -0000\r\nReceived: (qmail 96800 invoked from network); 4 Dec 2001 17:05:07 -0000\r\nReceived: from unknown (216.115.97.171)\n  by m4.grp.snv.yahoo.com with QMQP; 4 Dec 2001 17:05:07 -0000\r\nReceived: from unknown (HELO ral.qlue.com) (65.201.137.7)\n  by mta3.grp.snv.yahoo.com with SMTP; 4 Dec 2001 17:05:07 -0000\r\nReceived: from brain.qlue-lan (brain.qlue-lan [192.168.1.55])\n\tby ral.qlue.com (Postfix) with ESMTP id C97611C6C9\n\tfor &lt;junit@yahoogroups.com&gt;; Tue,  4 Dec 2001 12:05:04 -0500 (EST)\r\nDate: Tue, 4 Dec 2001 12:05:03 -0500 (EST)\r\nX-Sender:  &lt;adfh@...-lan&gt;\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nSubject: Re: [junit] User interface issue\r\nIn-Reply-To: &lt;3C0C6DD8.7070303@...&gt;\r\nMessage-ID: &lt;Pine.LNX.4.30.0112041149190.3704-100000@...-lan&gt;\r\nMIME-Version: 1.0\r\nContent-Type: TEXT/PLAIN; charset=US-ASCII\r\nFrom: &lt;evought@...&gt;\r\nX-Yahoo-Group-Post: member; u=77258944\r\nX-Yahoo-Profile: eric_vought\r\n\r\n\nIn past situations, I&#39;ve addressed the computational problem by having a\ndecent random number library available that can generate good quality\npsuedo-random numbers from a couple of distributions. In something like\nthe permutations case, I would have static test cases that always ran in\none particular order, then I would have a testcase which would select,\nsay, one hundred additional randomly selected permutations for each test\nrun. Over the course of the project, a large portion of the problem space\nwould be tested.\n\nFor the naming problem, I used log files. I wasn&#39;t using JUnit back then\n(or Java), but the framework I was using had the same problem. I logged\nthe starting seed at the beginning of the test and logged the\ninputs at the beginning of each iteration. If it failed, I could reproduce\nthe entire run in a debugger, or just copy the inputs (vectors\nrepresenting cartographic data in my case) from an iteration out of the\nlog file into a new input file to examine the failure. I also got to\ngenerating completely random data sets at some point.\n\nNow, with JUnit, I have a LoggingTestCase base class that allows me to\ncollect logging information fairly easily from my testcases. I don&#39;t\nnormally rerun the same testcase with different parameters; rather, I just\nhave a loop inside the testcase. This makes a single testcase &quot;heavier&quot; in\nsome sense, but, in another sense, it doesn&#39;t. Because I have a separate\nstatic test case which verifies that the logic works in some order or\nwith the boundary cases, the  iterating testcase is only testing one\ndiscrete thing- that permutations of the same process also work.\nTypically, the iterating testcase is no more likely to fail.\n\nOn Mon, 3 Dec 2001, Vladimir Bossicard wrote:\n\n&gt; &gt; This argument assumes there is only one way\n&gt; &gt; to write tests and that any way that write either more or fewer tests\n&gt; &gt; is wrong.\n&gt;\n&gt;\n&gt; That was absolutely not my point (I added &quot;IMHO&quot; on purpose).  Sometimes\n&gt; writing one test is enough, sometimes writing 10,000 tests is not\n&gt; enough.  It depends on the complexity of the method you test and your\n&gt; confidence in that method.\n&gt;\n&gt; In your case, if you have 20 statements, you have 2.43e18 possible\n&gt; permutations (let&#39;s take the simpliest case where you only permute 20\n&gt; different statements).  Maybe you will find useful to test all\n&gt; permutations (I have nothing against it), if you have 40 rules and want\n&gt; to all 8.15e47 permuations it&#39;s also fine with me.  But I don&#39;t think\n&gt; that that it&#39;s realistic to test all and every permutation, but that&#39;s\n&gt; only _my_ point of view.  If you think that you need total confidence\n&gt; and your computer is fast enough, go ahead and test every case.  I\n&gt; really don&#39;t have anything against that.\n&gt;\n&gt; &gt; That&#39;s simply not the case. JUnit, despite its name, is quite\n&gt; &gt; usable for writing larger scale tests and even for automating tests.\n&gt;\n&gt;\n&gt; And that&#39;s what I proposed in my answer.  I simply pointed out that\n&gt; sometimes testing _all_ possibilities doesn&#39;t make (much) sense and that\n&gt; you can be reasonably confident by writing only a few tests (how many is\n&gt; *a few* is up to you).\n&gt;\n&gt;\n&gt; &gt; Why not help it be a more complete framework rather than argue it\n&gt; &gt; should not grow because &quot;real&quot; unit tests wouldn&#39;t need a proposed\n&gt; &gt; enhancement?\n&gt;\n&gt;\n&gt; Have I said that JUnit should not grow???  Surely not!!!  What I\n&gt; strongly think is that &quot;if there is a need, it should be addressed,\n&gt; either directly or indirectly&quot;.  &quot;Real&quot; unit tests often need more than\n&gt; the standard JUnit, and I would like to hear the problems of those users\n&gt; users more often on this newsgroup.\n&gt;\n&gt; &gt; Our workaround to the JUnit confounding of test name with method name\n&gt;\n&gt; &gt; was to make sure all of\n&gt; &gt; our assertions include a message that indicates which test\n&gt; &gt; configuration is being used.\n&gt;\n&gt;\n&gt; That was my point in another message, explaining the mean of the &quot;name&quot;\n&gt; attribute in the TestCase class.  It was simply an explanation nothing\n&gt; more.  I think that sometimes explaining the framework can be helpful,\n&gt; but it&#39;s once again my point of view :-)\n&gt;\n&gt;\n&gt; -Vladimir\n&gt;\n&gt;\n\n-- \nEric Vought\nChief Technical Officer - QLUE Consulting, Inc.\n\nevought@... toll-free: 888-771-3538  RTP area: 919-816-9901\n\n\n", 
    "profile": "eric_vought", 
    "topicId": 3432, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 77258944, 
    "prevInTime": 3444, 
    "contentTrasformed": false, 
    "postDate": "1007485503", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 3442, 
    "headers": {
        "inReplyToHeader": "PDNDMEM2REQ4LjcwNzAzMDNAYm9zc2ljYXJkLmNvbT4=", 
        "messageIdInHeader": "PFBpbmUuTE5YLjQuMzAuMDExMjA0MTE0OTE5MC4zNzA0LTEwMDAwMEBicmFpbi5xbHVlLWxhbj4="
    }
}