{
    "numMessagesInTopic": 3, 
    "nextInTime": 3509, 
    "senderId": "k392cXxEZDNw5VTZRSFzJIgJWTof3EdAVDdMd6eUaaKQ05897jOZD_-zBO5ssw6tKjxtCchCUkMqwiJhUx3txTPyYsFHCRxkUVnSRA", 
    "systemMessage": false, 
    "subject": ".equals() and distributed objects...", 
    "from": "&quot;_pt1000_&quot; &lt;jjameson@...&gt;", 
    "authorName": "_pt1000_", 
    "msgSnippet": "I have recently taken on a project to setup a unit testing framework for my development team, but I have run into several technical issues. Our application is", 
    "msgId": 3508, 
    "profile": "_pt1000_", 
    "topicId": 3508, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 90899287, 
    "messageBody": "<div id=\"ygrps-yiv-173532586\">I have recently taken on a project to setup a unit testing framework <br/>\nfor my development team, but I have run into several technical <br/>\nissues.  <br/>\n<br/>\nOur application is a multi-tier application that uses EJBs <br/>\nextensively.  Because of its distributed nature, objects are <br/>\nconstantly passed around between tiers.  Since these object are <br/>\ndistributed, we use a unique identifier (a primary key in a database) <br/>\nto distinguish between objects.<br/>\n<br/>\nThe business objects used in our applications all derive from one <br/>\nhigh-level business object, called BaseBusinessObject.  In order to <br/>\nallow for the correct comparison of objects in the distributed <br/>\nenvironment, the decision was made to override the .equals() method <br/>\nin BaseBusinessObject to compare the primary keys of two objects.  <br/>\nThis allows us, for example, to remove a business object from a <br/>\nVector because the Vector&#39;s remove() method internally calls <br/>\nthe .equals() method.  We obviously can&#39;t compare the objects in the <br/>\nVector by reference, the default .equals() behavior, because they may <br/>\nbe distributed objects and thus wouldn&#39;t have the same reference.<br/>\n<br/>\nThe problem lies in the fact that we want to be able to <br/>\noverride .equals() in derived business objects to compare their <br/>\nattributes by value.  This is of course the way that assertEquals() <br/>\nworks in the junit framework.  If we override the .equals() method, <br/>\nthen there are implications for methods on collections, such as remove<br/>\n() on a Vector.  <br/>\n<br/>\nThere are many articles that explain how to write unit tests with the <br/>\nassumption that the .equals() method can be overridden, but there <br/>\ndoesn&#39;t seem to be any documentation on how to test an application <br/>\nthat uses distributed objects in which you can&#39;t override .equals().  <br/>\nIt seems that this would be a very common problem, but I can&#39;t seem <br/>\nto find anything on it.<br/>\n<br/>\nWe have a few ideas on how to get around this problem, but I was <br/>\nhoping that someone may be able to shine some light on the issue <br/>\nbefore we implement an unnecessarily crude solution.</div>", 
    "prevInTime": 3507, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1008002593", 
    "canDelete": false, 
    "nextInTopic": 3509, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDl2Mm9uMStuZGw3QGVHcm91cHMuY29tPg=="
    }
}