{
    "topicId": 361, 
    "postDate": "980894104", 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "from": "simon@...", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "p-kiVfyiT7s9MwZbPMV_RBvyyXM3d9hzMKQCb7UFKeg4A4THhGJoBiDSg1Z4rSW9oD8AcbW0CFiOZw4c", 
    "nextInTime": 362, 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-948015261\">NOTE I have also posted this to the SourceForge site (I don&#39;t know <br/>\nwhich is the &#39;official&#39; discussion board, but this one seems more <br/>\nactive).<br/>\n<br/>\n<br/>\nWe hacked up an earlier version of JUnit to scan through all jar <br/>\nfiles in the classpath and run all found tests. Our solution required <br/>\nJDK 1.2, even though (for now) most of our developers are stuck on <br/>\nJDK 1.1 (we&#39;re hoping to move from MS J++ soon). <br/>\n<br/>\nObviously this is not good -- having our developers run against a <br/>\ndifferent JDK version than our tests. <br/>\n<br/>\nI&#39;m trying to clean things up, so I&#39;m ripping out our custom hacks <br/>\nand upgrading to JUnit 3.5. I notice the new classpath scanning code <br/>\n(in ClassPathTestCollector et al), but also notice that the comments <br/>\nstate that JAR scanning is not implemented. <br/>\n<br/>\nI tried Duncan McGregor&#39;s ZipAwareLoadingTestRunner and haven&#39;t had <br/>\nany luck -- various class loading and null pointer problems (not in <br/>\nhis code). <br/>\n<br/>\nSo my question is: Has anyone managed to get JUnit to scan the <br/>\nclasspath and execute tests in all jar files using JDK 1.1? <br/>\n<br/>\nthanks in advance, <br/>\nSimon</div>", 
    "prevInTime": 360, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDk1N2ZpbytzZTQwQGVHcm91cHMuY29tPg=="
    }, 
    "authorName": "simon@mail.idrive.com", 
    "numMessagesInTopic": 1, 
    "msgSnippet": "NOTE I have also posted this to the SourceForge site (I don t know which is the official discussion board, but this one seems more active). We hacked up an", 
    "contentTrasformed": false, 
    "msgId": 361, 
    "specialLinks": [], 
    "nextInTopic": 0, 
    "systemMessage": false
}