{
    "numMessagesInTopic": 7, 
    "nextInTime": 3667, 
    "senderId": "LFESQhKwZubdDTN6CvwOE4HHp0cGjDC9ngm81R4D1qj7_Gi_PzZ0D2fp1r7OZAoZxkVXVx79CfFWOJx4U7-vxEHxtN4iQLFM1E7EAg", 
    "systemMessage": false, 
    "subject": "Re: [junit] Repost:  Am I headed in the right direction?", 
    "from": "Berin Loritsch &lt;bloritsch@...&gt;", 
    "authorName": "Berin Loritsch", 
    "msgSnippet": "... I personally work mostly on server side code where GUIs are not used.  This is easy to test. ... The question is what are you testing? JUnit is designed to", 
    "msgId": 3666, 
    "rawEmail": "Return-Path: &lt;bloritsch@...&gt;\r\nX-Sender: bloritsch@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_0_1_3); 27 Dec 2001 19:57:38 -0000\r\nReceived: (qmail 29792 invoked from network); 27 Dec 2001 19:57:38 -0000\r\nReceived: from unknown (216.115.97.167)\n  by m10.grp.snv.yahoo.com with QMQP; 27 Dec 2001 19:57:38 -0000\r\nReceived: from unknown (HELO scodev.infoplanning.com) (209.8.58.131)\n  by mta1.grp.snv.yahoo.com with SMTP; 27 Dec 2001 19:57:39 -0000\r\nReceived: from apache.org ([192.168.0.189]) by scodev.infoplanning.com (8.8.5/SCO5) with ESMTP id OAA12051 for &lt;junit@yahoogroups.com&gt;; Thu, 27 Dec 2001 14:48:34 -0500 (EST)\r\nMessage-ID: &lt;3C2B7DB1.1050604@...&gt;\r\nDate: Thu, 27 Dec 2001 14:59:45 -0500\r\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 5.0; en-US; rv:0.9.7) Gecko/20011221\r\nX-Accept-Language: en-us\r\nMIME-Version: 1.0\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] Repost:  Am I headed in the right direction?\r\nReferences: &lt;200112271943.fBRJhGP19005@...&gt;\r\nContent-Type: text/plain; charset=us-ascii; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nFrom: Berin Loritsch &lt;bloritsch@...&gt;\r\nX-Yahoo-Group-Post: member; u=64910131\r\nX-Yahoo-Profile: bloritsch\r\n\r\nLee Chalupa wrote:\n\n&gt; Thanks for your time Berin.  I do appreciate it.\n&gt; \n&gt; My first assumption is that most programmers use jOptionPane frequently in the GUIs they write.\n&gt; \n&gt; My second assumption is that these programmers use Junit to test their GUIs including jOptionPane.\n&gt; \n&gt; Before I go deeper into the details of jOptionPane, I wonder if these are valid assumptions?  \n\n\nI personally work mostly on server side code where GUIs are not used.  This is easy\nto test.\n\n\n\n&gt; If they are valid assumptions, I am curious.  Why are my questions about this common approach unanswered or at least \n&gt; off the beaten trail?  The response I have received leads me to believe that this path is less traveled which leads me to \n&gt; believe that I should be using another coding technique/approach that is more common.\n&gt; \n&gt; Can you help me understand this broader issue?\n\n\nThe question is what are you testing?\n\nJUnit is designed to test functionality and making sure that your classes operate as\nexpected.  It is not designed to be an automated GUI testing framework.  It is better\nsuited for applications where you are enforcing that an algorithm gives expected results\nor that no exceptions are thrown for correct input or that the proper exceptions are\nthrown for incorrect input.\n\nPersonally, I find that GUIs are best tested by humans.  This is because writing the\ntest code for GUIs will take about as much time (or more) as actually writing the\nGUI.\n\nWhat I find effective is the MVC approach (Model, View, Controller).  The Model and\nController code should not have any GUI elements in it.  All that is handled by the\nView.  Let&#39;s say that there does need to be some sort of conversational state that\nmust be taken if the user has to answer a popup dialog.\n\nLet&#39;s say we have a delete option in your GUI app.  It is a View responsibility to\npop up the &quot;Are you sure?&quot; dialog box.  If the user is sure, View calls the Controller\nand performs the actual delete function.\n\nNow Let&#39;s say we have a more complex example.  Perhaps your system has a function\nthat needs information the first time it is called, but subsequent times no dialog\nis needed.  The perfect example is the &quot;Save&quot; option.  The first time a user clicks\non &quot;Save&quot; for a new document, there is no filename associated with the document.\nAfter that, it is safe to assume that the documents filename is ok.  In this case,\nthe Controller will return an error condition (either a flag in the return value\nor an Exception to be thrown) and the View will know that it needs to ask the\nuser for a filename.\n\nIf you properly separate your concerns like this, your Controller code can be\neasily tested with JUnit--which is what it is designed for.  The same can be\nsaid of the Model.\n\n\n\n-- \n\n&quot;They that give up essential liberty to obtain a little temporary safety\n  deserve neither liberty nor safety.&quot;\n                 - Benjamin Franklin\n\n\n", 
    "profile": "bloritsch", 
    "topicId": 3659, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 64910131, 
    "prevInTime": 3665, 
    "contentTrasformed": false, 
    "postDate": "1009483185", 
    "canDelete": false, 
    "nextInTopic": 3674, 
    "prevInTopic": 3665, 
    "headers": {
        "messageIdInHeader": "PDNDMkI3REIxLjEwNTA2MDRAYXBhY2hlLm9yZz4=", 
        "referencesHeader": "PDIwMDExMjI3MTk0My5mQlJKaEdQMTkwMDVAanhtbHMwMi5zZS5tZWRpYW9uZS5uZXQ+"
    }
}