{
    "numMessagesInTopic": 7, 
    "nextInTime": 368, 
    "senderId": "0rz9A4OruYteYdcF_jAyHZs2JG4LVN-7VOEi_KbQ_8O_tFDtn_ffB5S6RX9JRSJng6eEqlvh", 
    "systemMessage": false, 
    "subject": "Re: Confused about J2EEUnit, JunitEE and JUnitServlet", 
    "from": "vmassol@...", 
    "authorName": "vmassol@octo.fr", 
    "msgSnippet": "Hi, I am the writer of J2EEUnit and I feel that I have to answer to this thread ... which of course pains me when I hear that J2EEUnit has a stiff learning", 
    "msgId": 367, 
    "topicId": 243, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-747751687\">Hi,<br/>\n<br/>\nI am the writer of J2EEUnit and I feel that I have to answer to this <br/>\nthread ... which of course pains me when I hear that J2EEUnit has a <br/>\nstiff learning curve and that it&#39;s not that easy to use.<br/>\n<br/>\nOne thing that needs to be clear is that I am dedicated to making <br/>\nJ2EEUnit the simplest tool to use ! Also, it is open source and <br/>\nanyone can participate in making it a better tool !<br/>\n<br/>\nThat said, let me explain a bit the philsophy behing J2EEUnit because <br/>\nit seems it is not that clear. Let&#39;s see the assumptions that are <br/>\nbehing it :<br/>\n<br/>\n- assumption 1 : the test classes need to run on the server side (in <br/>\nthe servlet engine),<br/>\n- assumption 2 : we need to be able to start these tests. So there <br/>\nare 2 solutions : make a servlet to start these tests or use an EJB. <br/>\nI have chosen a servlet because it is easier to use and some servlet <br/>\nengine do not support EJBs.<br/>\n- assumption 3 : we have to be able to call this servlet. Several <br/>\npossibilities : (1) call it manually by typing it&#39;s URL ore (2) write <br/>\nsome code that use the URLConnection class to call it. This is the <br/>\npart that I call the client side. Of course, the option (2) seem to <br/>\nbe the best because tests can be automated and the result can be <br/>\nverified (this is the endXXX() method). So we can verify if a cookie <br/>\nwas returned, if a header was set, ...<br/>\n- assumption 4 : in order to make option (2) above more sexy to use, <br/>\nI could have developed a GUI .... or integrate with an existing test <br/>\nframework. I have chosen to use the well renowned JUnit framework <br/>\nbecause everyone use it. So, the tests are started by JUnit.<br/>\n<br/>\nAnd as far as I have seen, JunitEE and JUnitServlet work on the same <br/>\nprinciple. Tell me if I am wrong here ?<br/>\n<br/>\nIf you have any idea to make it simpler please tell me. If I <br/>\nunderstand you correctly, you would like that the current J2EEUnit <br/>\nServlet actually returns HTML code with the test results ? Is that <br/>\nright ? This will free J2EEUnit from JUnit. It seems ok to me to also <br/>\nprovide this feature. What I could do, is provide another Servlet <br/>\nthat will display the result of the tests as HTML. The J2EEUnit user <br/>\nwill have the choice or using JUnit or calling directly the URL of <br/>\nthis other servlet in his browser. Would that make sense to you ?<br/>\n<br/>\nThanks a lot.<br/>\nVincent.</div>", 
    "prevInTime": 366, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "981015634", 
    "canDelete": false, 
    "nextInTopic": 368, 
    "prevInTopic": 360, 
    "headers": {
        "inReplyToHeader": "PDgxOEMxQ0JCMTYzRUQ0MTE5OEZGMDBEMEI3NDdCMUZEMDMxRDhENTNAY3VyaWUuZ3Jlbm9ibGUuaHAuY29tPg==", 
        "messageIdInHeader": "PDk1YjY4aStkdG84QGVHcm91cHMuY29tPg=="
    }
}