{
    "numMessagesInTopic": 7, 
    "nextInTime": 3676, 
    "senderId": "U6lj0fGK0gSkpyanRO99BIsx9bpjTDj81uiYRV-k0MKZNMdADrtKNiGxL5SJMhNSOnVhIhFAT5-4D6LdTrwak6UbmeM-BcwN5W7x2g", 
    "systemMessage": false, 
    "subject": "Re: [junit] Repost:  Am I headed in the right direction?", 
    "from": "Berin Loritsch &lt;bloritsch@...&gt;", 
    "authorName": "Berin Loritsch", 
    "msgSnippet": "... Perhaps there might be an offshoot of JUnit that can automate GUI testing, but in that case, you need a simple scripting language--with the real work done", 
    "msgId": 3675, 
    "rawEmail": "Return-Path: &lt;bloritsch@...&gt;\r\nX-Sender: bloritsch@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_0_1_3); 28 Dec 2001 15:03:32 -0000\r\nReceived: (qmail 31652 invoked from network); 28 Dec 2001 15:03:31 -0000\r\nReceived: from unknown (216.115.97.167)\n  by m12.grp.snv.yahoo.com with QMQP; 28 Dec 2001 15:03:31 -0000\r\nReceived: from unknown (HELO scodev.infoplanning.com) (209.8.58.131)\n  by mta1.grp.snv.yahoo.com with SMTP; 28 Dec 2001 15:03:31 -0000\r\nReceived: from apache.org ([192.168.0.189]) by scodev.infoplanning.com (8.8.5/SCO5) with ESMTP id JAA12762 for &lt;junit@yahoogroups.com&gt;; Fri, 28 Dec 2001 09:54:26 -0500 (EST)\r\nMessage-ID: &lt;3C2C8A43.2030103@...&gt;\r\nDate: Fri, 28 Dec 2001 10:05:39 -0500\r\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 5.0; en-US; rv:0.9.7) Gecko/20011221\r\nX-Accept-Language: en-us\r\nMIME-Version: 1.0\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] Repost:  Am I headed in the right direction?\r\nReferences: &lt;Pine.LNX.4.30.0112280105160.31984-100000@...-lan&gt;\r\nContent-Type: text/plain; charset=us-ascii; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nFrom: Berin Loritsch &lt;bloritsch@...&gt;\r\nX-Yahoo-Group-Post: member; u=64910131\r\nX-Yahoo-Profile: bloritsch\r\n\r\nevought@... wrote:\n\n&gt; I think the real reason it&#39;s off the beaten trail is because this code is\n&gt; undertested since it usually ends up being a pain. I know that&#39;s been the\n&gt; case with me. I tend to spend test effort where I am likely to find the\n&gt; most bugs with the least work. The common practice seems to be to refactor\n&gt; as much of the logic out of the GUI as possible, automate just enough of\n&gt; the GUI test for sanity checking, then manually walk through it as part of\n&gt; a functional test process. It&#39;s *not* entirely satisfactory, but does\n&gt; (mostly) work.\n\n\nPerhaps there might be an offshoot of JUnit that can automate GUI testing,\nbut in that case, you need a simple scripting language--with the real work\ndone under the hood.  It&#39;s kind of like testing a webapp, you have to have\nan external program test the critical sections by script--it is inneficient\nto do it with direct Java code.\n\nI find that JUnit style testing works best for tests in the microcosm of\nindividual classes or components.  Scripting language based testing works\nbest for tests in the macrocosm of a running system.\n\nSo, again we have to differentiate between *unit* tests and *integration*\ntests.  Anything with a GUI (webapp or swing app) should be considered\nintegration testing.  JUnit is not suited for integration testing--although\nit can be extended in some ways to allow for a certain level of integration\ntesting (I did this with Avalon component testing framework).\n\nThat solution does not necessarily scale well, because sometimes you have\nto test what happens when there is interaction between optional components\nand if the tested component fails gracefully if a required component is\nnot available.\n\nMy advice: JUnit for unit tests, and some other tool for integration tests.\n\nBoth are necessary, and they catch different classes of bugs.  While JUnit\nworks well for a one size fits all unit test, it is rare to find an integration\ntest framework that fits all situations.  That is because the environment\nis different for each type of system.  For example, Webapps have a very different\nenvironment than Swing based apps, and both environments are very different\nfrom testing a server.\n\n\n&gt; \n&gt; On Thu, 27 Dec 2001, Lee Chalupa wrote:\n&gt; \n&gt; \n&gt;&gt;Thanks for your time Berin.  I do appreciate it.\n&gt;&gt;\n&gt;&gt;My first assumption is that most programmers use jOptionPane frequently in the GUIs they write.\n&gt;&gt;\n&gt;&gt;My second assumption is that these programmers use Junit to test their GUIs including jOptionPane.\n&gt;&gt;\n&gt;&gt;Before I go deeper into the details of jOptionPane, I wonder if these are valid assumptions?\n&gt;&gt;\n&gt;&gt;If they are valid assumptions, I am curious.  Why are my questions about this common approach unanswered or at least\n&gt;&gt;off the beaten trail?  The response I have received leads me to believe that this path is less traveled which leads me to\n&gt;&gt;believe that I should be using another coding technique/approach that is more common.\n&gt;&gt;\n&gt;&gt;Can you help me understand this broader issue?\n\n\n\n-- \n\n&quot;They that give up essential liberty to obtain a little temporary safety\n  deserve neither liberty nor safety.&quot;\n                 - Benjamin Franklin\n\n\n", 
    "profile": "bloritsch", 
    "topicId": 3659, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 64910131, 
    "prevInTime": 3674, 
    "contentTrasformed": false, 
    "postDate": "1009551939", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 3674, 
    "headers": {
        "messageIdInHeader": "PDNDMkM4QTQzLjIwMzAxMDNAYXBhY2hlLm9yZz4=", 
        "referencesHeader": "PFBpbmUuTE5YLjQuMzAuMDExMjI4MDEwNTE2MC4zMTk4NC0xMDAwMDBAYnJhaW4ucWx1ZS1sYW4+"
    }
}