{
    "numMessagesInTopic": 7, 
    "nextInTime": 369, 
    "senderId": "7Ioirmp1Y8WWSVRnp1QwbKsa8BRdq3Vkh_McksqQcKQJGJz55D5LY2nsYQg3UYEd3JYQhPbqIejHz01KDzELqXc-Hko9b63PnhVPC_lK2WSneqNwRzVyGWZekQ", 
    "systemMessage": false, 
    "subject": "RE: [junit] Re: Confused about J2EEUnit, JunitEE and JUnitServlet", 
    "from": "&quot;MARZIOU,GAEL (HP-France,ex1)&quot; &lt;gael_marziou@...&gt;", 
    "authorName": "MARZIOU,GAEL (HP-France,ex1)", 
    "msgSnippet": "Vincent, I did not mean to offend you or complain about J2EEUnit versus other implementations, I think you made a great tool and I am grateful to you for this.", 
    "msgId": 368, 
    "topicId": 243, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1062172212\">Vincent,<br/>\n<br/>\nI did not mean to offend you or complain about J2EEUnit versus other<br/>\nimplementations, I think you made a great tool and I am grateful to you for<br/>\nthis.<br/>\nWhether someone find a tool easy to learn depends on lot of things including<br/>\nuser&#39;s own skills.<br/>\nI would say that it may depend also on how you work, when running unit tests<br/>\nthat fail I like to use the debugger.<br/>\nMost of the time I debug servlets using Tomcat from JBuilder 4 and in this<br/>\nspecific environment I found it easier to debug the server side directly<br/>\nthan debugging on top of an extra client side.<br/>\nThis said, our application server in production is not Tomcat and so your<br/>\nclient/server approach is very valuable to run the tests automatically in<br/>\nour production environment.<br/>\n<br/>\nYour idea of combining both approaches by providing 2 servlets is a good one<br/>\nfor me, I already started writing something like that by starting from<br/>\nJunitEE servlet code.<br/>\nWhat is currently missing is support for the extra methods beginXXX() and<br/>\nendXXX() that are required by J2EEUnit and that are really useful. With<br/>\nthis, test cases could be run in both ways.<br/>\n<br/>\nI like your explanation about the assumptions you made, to me it is<br/>\nsomething that I did not really catch when reading the documentation, maybe<br/>\nit should be even part of the introduction.<br/>\n<br/>\nThanks,<br/>\n<br/>\nGael</div>", 
    "prevInTime": 367, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "981050406", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 367, 
    "headers": {
        "messageIdInHeader": "PDgxOEMxQ0JCMTYzRUQ0MTE5OEZGMDBEMEI3NDdCMUZEMDMzMkIyRDlAY3VyaWUuZ3Jlbm9ibGUuaHAuY29tPg=="
    }
}