{
    "numMessagesInTopic": 3, 
    "nextInTime": 3719, 
    "senderId": "n37qwkAnAdOMy9oICEdj8lSbMIFra3Q1miGscqdZrlKaXoBctaknqSwKjav6qKgHENWKrfNaKABXGTiXrnmBizYZKWOKeGv0jCfhP2VeF1SAr4RJ", 
    "systemMessage": false, 
    "subject": "", 
    "from": "&quot;David V. Olivier&quot; &lt;dolivier@...&gt;", 
    "authorName": "David V. Olivier", 
    "msgSnippet": "I use JUnit for about 90% of my code.  I would like to use it for 100% but I consistently find automated testing of certain types of functionality particular", 
    "msgId": 3718, 
    "profile": "slimbola", 
    "topicId": 3718, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 84380000, 
    "messageBody": "<div id=\"ygrps-yiv-815736012\">I use JUnit for about 90% of my code.  I would like to use it for 100% but <br/>\nI consistently find automated testing of certain types of functionality <br/>\nparticular difficult to accomplish.  My work is in digital mapping, and I <br/>\nfind complex operations on large data sets problematic.<br/>\n<br/>\nLet me give a specific example:<br/>\n<br/>\nI am currently implementing functionality to warp satellite images from one <br/>\nmapping projection to another.  The image is distorted according to a <br/>\ncomplex formula.  On a low level, I can test that for a given input my <br/>\nimplementation of the formula provides the result I expect, but on a higher <br/>\nlevel I haven&#39;t been able to automate verification of that the final image <br/>\nis correct.  I have only been able to superimpose the result on a <br/>\nbackground map I know is correct and eyeball the results.<br/>\n<br/>\nI would be curious to hear feedback from more experienced JUnit users on <br/>\napproaches to testing this type necessarily complex behavior.   I know that <br/>\nMock Objects are used to simplify the testing of certain types of otherwise <br/>\nproblematic scenarios, but I have no first hand experience with them and <br/>\ndon&#39;t clearly see their applicability in a case like this.  Have others <br/>\nfound that there are certain areas where, in practice, they simply don&#39;t <br/>\napply JUnit as the ratio of effort to develop the test compared to benefit <br/>\ngained by the test is too high (certainly the issue of testing GUIs has <br/>\nreceived plenty of attention on this list)?<br/>\n<br/>\nI dislike leaving gaps in my tests, particularly in coverage for the most <br/>\ndifficult functionality, as these are the areas most likely to contain bugs.<br/>\n<br/>\n<br/>\nDavid Olivier<br/>\nNaval Research Laboratory<br/>\nDigital Mapping, Charting & Geodesy Analysis Program<br/>\nCode 7440.2</div>", 
    "prevInTime": 3717, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1010590752", 
    "canDelete": false, 
    "nextInTopic": 3728, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDUuMS4wLjE0LjIuMjAwMjAxMDkwOTE2MTcuMDBhZjFkMDhAY3lwcmVzcy5ucmxzc2MubmF2eS5taWw+"
    }
}