{
    "numMessagesInTopic": 1, 
    "nextInTime": 3743, 
    "senderId": "LaOgTTjCtINlmL0ag6B7pjPRjwdoNz1W5eAV2t2bv6yPVbAyrg1v3OEUwjIbSf38zeq4zQAc6P1b2aU1FlyUPo9L9DxHOmxOGel7Oxml7w", 
    "systemMessage": false, 
    "subject": "Re: Simple conceptual question when changing accessors of a metho\td ...", 
    "from": "Emily Bache &lt;emily.bache@...&gt;", 
    "authorName": "Emily Bache", 
    "msgSnippet": "... This would solve the problem in some ways, in that you could access the private and friendly methods, but but in other ways it s not optimal. Including the", 
    "msgId": 3742, 
    "profile": "emilybache", 
    "topicId": 3742, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 53044859, 
    "messageBody": "<div id=\"ygrps-yiv-639564482\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt;    Date: Wed, 9 Jan 2002 11:48:30 +0100<br/>\n&gt;    From: &quot;Thomas SMETS&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tsmets@...\">tsmets@...</a>&gt;<br/>\n&gt; Subject: Simple conceptual question when changing accessors <br/>\n&gt; of a method ...<br/>\n&gt; [...] <br/>\n&gt; <br/>\n&gt; I&#39;d like now to change the accessor of some methods from public to<br/>\n&gt; &quot;friendly&quot; or protected for some methods as they are not <br/>\n&gt; needed for the<br/>\n&gt; caller anymore.<br/>\n&gt; My question is twofold :<br/>\n&gt;     1°. What are the possibilities ?<br/>\n&gt;         Would simply moving the TestCase as inner<br/>\n&gt;         class suite the matter.<br/>\n<br/>\n </span></blockquote>This would solve the problem in some ways, in that you could access the<br/>\nprivate and friendly methods, but but in other ways it&#39;s not optimal.<br/>\nIncluding the testing code in the same class as the production code both<br/>\nbloats your production code and creates a direct dependancy on JUnit,<br/>\nmeaning that when you ship the code you have to either creatively strip out<br/>\nthe unit test class files with Ant when you ship, or ship JUnit with it. <br/>\n<br/>\nIn the case of this certification, (which I recently passed myself, btw), I<br/>\nthink it would mean that you would have to submit JUnit with your code in<br/>\norder that the examiner would be able to compile it. I don&#39;t think the rules<br/>\nof the exam allow you to submit code that you havn&#39;t written, or introduce<br/>\ndependancies on 3rd party products. I got round it myself by submitting the<br/>\ntest code as &quot;developer documentation&quot; and not including the JUnit jar, just<br/>\na note to download it if the examiner wanted to compile or run the tests.<br/>\nNeedless to say I got 20/20 for documentation :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;     2°. Am I&#39;m better to make all the TestCases member<br/>\n&gt;         of the package of the class to test & make the accessor<br/>\n&gt;         protected ?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I personally think this is a better approach - put the tests in the same<br/>\npackage but in a different source tree, and make the methods package or<br/>\nprotected level. I think someone else mentioned that Ant makes that easier<br/>\nto handle. Of course probably the best approach of all has already been<br/>\noutlined - make the methods public on another class that you can test. I&#39;ve<br/>\npersonally found though that it&#39;s not always obvious how to do that, and it<br/>\nis useful to be able to test package and protected methods.<br/>\n<br/>\nhope that helps,<br/>\n<br/>\nEmily</div>", 
    "prevInTime": 3741, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1010652107", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDcwMEVBMTdBMTQyQUQzMTE4QTFFMDAwOEM3MjRCQ0I0RUI3QzM2QGFnYmdudHMwMy5hZ2JnLmludHJhbmV0Pg=="
    }
}