{
    "numMessagesInTopic": 10, 
    "nextInTime": 384, 
    "senderId": "_LTCgx8lVO6g109nwO7E00YZf0UoVHva_zxoY4uvTWJV-nAJooITxNuZVL0p8eVjSYBZ2nC-lJ91IBs", 
    "systemMessage": false, 
    "subject": "Test Suites Useless?", 
    "from": "mrettig@...", 
    "authorName": "mrettig@homemail.com", 
    "msgSnippet": "I ve found that I never need to construct test suites. My package structure combined with my test cases naturally dictate my suite structure. In order to run", 
    "msgId": 383, 
    "topicId": 383, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1760991431\">I&#39;ve found that I never need to construct test suites. My package <br/>\nstructure combined with my test cases naturally dictate my suite <br/>\nstructure. In order to run my tests I simply use a utility that I <br/>\nwrote to discover the tests in the packages. <br/>\n<br/>\nHas anyone else found the construction of test suites to be largely a <br/>\nwaste of time? IMO, if you use packages properly, then you should <br/>\nnever need to construct a test suite. <br/>\n<br/>\nFor instance, to find and run all the tests on my current project I <br/>\njust need to type the following at the command line.<br/>\n<br/>\njava MyTestFinder com<br/>\n<br/>\n&quot;com&quot; is the root package for the system. My utility then recursively <br/>\ngoes through the packages and runs all the test cases it can find. <br/>\n<br/>\nSo I can selectively test a particular package<br/>\n<br/>\njava MyTestFinder com.dotcomfailure.mycode<br/>\n<br/>\nOr... if you need to run a single test...<br/>\n<br/>\njava MyTestFinder com.dotcomfailure.mycode.SimpleTestCase<br/>\n<br/>\nRunning tests this way, I never have to worry about adding a main <br/>\nmethod to any of my test cases to run them. Also, I don&#39;t have to <br/>\nworry about maintaining TestSuites. The greatest benefit that I see <br/>\nis that when I run all the tests, I know without a doubt that every <br/>\nsingle test case in the entire system was run. I don&#39;t have to worry <br/>\nabout a test case not getting run b/c someone forgot to add it to a <br/>\ntest suite. <br/>\n<br/>\nI know Ant has the ability to find all tests, so anyone can take this <br/>\naproach. However, Ant finds test based on pattern matching, which can <br/>\nlead to problems b/c then a naming standard has to be enforced.<br/>\n<br/>\nI&#39;m new to this group, so let me know if this has already been <br/>\ndiscussed.<br/>\n<br/>\nRegards,<br/>\n<br/>\nMike</div>", 
    "prevInTime": 382, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "981322516", 
    "canDelete": false, 
    "nextInTopic": 384, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDk1a2h1aytmN2NiQGVHcm91cHMuY29tPg=="
    }
}