{
    "numMessagesInTopic": 10, 
    "nextInTime": 386, 
    "senderId": "aDa7PjHtUbC0Jebws6RCnWRq3OgmQ0nOwKIGRIu4x2bsjlOQqLR22z08r9eJROI_qdMhDm3X95f9KyQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Test Suites Useless?", 
    "from": "mrettig@...", 
    "authorName": "mrettig@homemail.com", 
    "msgSnippet": "... intervention ... For selectivity on tests, I would use a subclass of TestCase that identifies the test as requiring user intervention. This way you could ", 
    "msgId": 385, 
    "topicId": 383, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1958589617\"><font size=\"2\" face=\"Courier New\">On Sun, 4 Feb 2001 mrettig@... wrote:<br>\n<blockquote><span title=\"ireply\"> &gt;&gt; Has anyone else found the construction of test suites to be largely a <br>\n&gt;&gt; waste of time? IMO, if you use packages properly, then you should <br>\n&gt;&gt; never need to construct a test suite. <br>\n&gt;Joi Ellis wrote:<br>\n&gt;No, not really. &nbsp;I like having suite() because it allows me to trim out<br>\n&gt;tests I don&#39;t need to run without having to delete the sources for them.<br>\n&gt;I have a number of tests which, unfortunately, require manual intervention<br>\n&gt;to click buttons on swing dialogs, and I leave these commented out in<br>\n&gt;the suite() method most of the time so that nightly automated tests run<br>\n&gt;unattended.<br>\n </span></blockquote></font>\n<br><font size=\"2\" face=\"Courier New\">For selectivity on tests, I would use a subclass of TestCase that identifies the test as requiring user intervention. This way you could have different types of runs, such as your nightly run or a simple debug run that requires a user to click the buttons. Or if you use Ant, you can use a patternset to exclude certain tests on the nightly build.</font>\n<br>\n<br><font size=\"2\" face=\"Courier New\">The process of removing/adding tests to the suite is the very process that I try to avoid. What happens if you forget to readd an excluded test method to the suite? You&#39;re tests will probably run and give you a false positive. &nbsp;Since I never use suites, I&#39;ve never, ever had a false positive due to a coder failing to properly update a suite. </font>\n<br><font size=\"2\" face=\"Courier New\"><br>\n<blockquote><span title=\"ireply\"> &gt;Suite() methods also allow me to control the runtime order without<br>\n&gt;playing games like manually rearranging source code or changing method<br>\n&gt;names so that a reflection-based runtime can be coerced into running the<br>\n&gt;tests in the order I want them run.<br>\n </span></blockquote></font>\n<br><font size=\"2\" face=\"Courier New\">The ordering of methods is one area where suites may be convenience, but this is a rare case. &nbsp;If the runtime order is worth the extra maintenance and risk, then go for it.</font>\n<br>\n<br><font size=\"2\" face=\"Courier New\">Regards,</font>\n<br><font size=\"2\" face=\"Courier New\">Mike</font></div>", 
    "prevInTime": 384, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "981331151", 
    "canDelete": false, 
    "nextInTopic": 386, 
    "prevInTopic": 384, 
    "headers": {
        "messageIdInHeader": "PE9GMEZDRDQyOUYuNjE5MDM0NDMtT044NjI1NjlFOS4wMDgxNUQ3MUB0aG91Z2h0d29ya3MuY29tPg=="
    }
}