{
    "numMessagesInTopic": 6, 
    "nextInTime": 4053, 
    "senderId": "N7jd13IrJMACH4C8-LlUS3HJSliz80C1VsX6t0RadSK82H040yNufGrsNVnAneWFK4pUDHPcEWy1NawZKbonYVZVC-PcC6d-7fRWMg", 
    "systemMessage": false, 
    "subject": "clarification - reading from XML file", 
    "from": "&quot;pisharath_k&quot; &lt;pisharath_k@...&gt;", 
    "authorName": "pisharath_k", 
    "msgSnippet": "Thanks for your suggestions everyone (please see my original mail attached below). But the problem I am having is this - the classes are complex, hence ", 
    "msgId": 4052, 
    "profile": "pisharath_k", 
    "topicId": 4052, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 85044460, 
    "messageBody": "<div id=\"ygrps-yiv-131960164\">Thanks for your suggestions everyone (please see my original mail <br/>\nattached below).<br/>\n<br/>\nBut the problem I am having is this - the classes are complex, hence <br/>\nconstructing classes with test data (so I can check against the data <br/>\nread from file) is very cumbersome. Also, with equals() method I <br/>\ncannot know which data member in the class actually caused a mis-<br/>\nmatch, since I assert only at the class level.<br/>\n<br/>\nThis is why I am thinking what to do... hope this clarifies the <br/>\nproblem. Any suggestions would be appreciated. Thanks again for your <br/>\nhelp so far.<br/>\n<br/>\n- krishnan<br/>\n<br/>\npisharath_k wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have a basic question. I have a set of classes whose values are <br/>\n </span></blockquote>set<br/>\n<blockquote><span title=\"ireply\"> &gt; from a file by a Reader object. Now I want to test whether these<br/>\n&gt; values are set correctly. I can use preset values for testing<br/>\n&gt; purpose. But due to the large number and complexity of these classes<br/>\n&gt; it would be very difficult and cumbersome to create objects with<br/>\n&gt; these preset values manually for testing against the ones created by<br/>\n&gt; the Reader.<br/>\n&gt;<br/>\n&gt; I am thinking of creating a helper class for each of the above<br/>\n&gt; classes. I will pass it the object to compare, and it will compare<br/>\n&gt; the object&#39;s data against pre-defined values that will be stored in<br/>\n&gt; the helper classes. I will need to extend junit&#39;s Assert class for<br/>\n&gt; these helper class, since they will assert if there is a data<br/>\n&gt; mismatch. So my question is, is it okay to extend Assert in my own<br/>\n&gt; classes ? Has anyone faced this problem before, and if so how did <br/>\n </span></blockquote>you<br/>\n<blockquote><span title=\"qreply\"> &gt; solve this ? Any help will be appreciated.<br/>\n&gt;<br/>\n&gt; Thanks,<br/>\n&gt; - krishnan </span></blockquote></div>", 
    "prevInTime": 4051, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1013610694", 
    "canDelete": false, 
    "nextInTopic": 4053, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGE0ZHRjNitvcGtyQGVHcm91cHMuY29tPg=="
    }
}