{
    "numMessagesInTopic": 36, 
    "nextInTime": 4151, 
    "senderId": "i7omdHkI_ez-W5Jz79uKjFbmTm6XJFdC43CvCNzNtvYwEdKi0FJFT2l5tspI6q_Ae5bv2nr6NGSxfkyIdH9hnUOiJ2Tp", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: JavaDocs", 
    "from": "Shane Duan &lt;sduan@...&gt;", 
    "authorName": "Shane Duan", 
    "msgSnippet": "First, let s get to the initial topic of this thread. As posted previousely by several other fellow developers, you can always have two source paths, one for", 
    "msgId": 4150, 
    "profile": "wolfdancer_dodo", 
    "topicId": 4069, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 73579768, 
    "messageBody": "<div id=\"ygrps-yiv-1870477114\">First, let&#39;s get to the initial topic of this thread.<br/>\n<br/>\nAs posted previousely by several other fellow developers, you can always <br/>\nhave two source paths, one for the source and one for the test cases. <br/>\n In this way, JavaDoc will not have any problems any more.  This setup <br/>\nalso has some good side-effects: In this way, you can write a class that <br/>\ncan scan the test source path and create a TestSuite that contains all <br/>\nthe test cases simply by matching the file names; it will always be easy <br/>\nto deliver binary without the testcases in it, if that is desired.<br/>\n<br/>\nSecond, I do find it a lot more pleasant to clicking through the html <br/>\nfiles rather than open up the source files to understand certain things. <br/>\n I do agree that making the code and document in sync. is a hassle, though.<br/>\n<br/>\nShane<br/>\n<br/>\n-- <br/>\nDisclaimer:  I join all the news groups out of my own interest.  All opinions expressed here are my own and not necessarily those of my employer.</div>", 
    "prevInTime": 4149, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1014314007", 
    "canDelete": false, 
    "nextInTopic": 4151, 
    "prevInTopic": 4112, 
    "headers": {
        "messageIdInHeader": "PDNDNzUzNDE3LjIwMzA1MDRAYm9ybGFuZC5jb20+", 
        "referencesHeader": "PGE0bTAyMithMGRkQGVHcm91cHMuY29tPg=="
    }
}