{
    "numMessagesInTopic": 36, 
    "nextInTime": 4176, 
    "senderId": "KTMLC9LXJak5D2Pogg3Ct42PdivexVjHomLLqN6XuWBcpTfVGGXK7zKAc3qbpQ7fpMKq42nIPAyyZAecLTx5BDwvdXqe-51kHG4", 
    "systemMessage": false, 
    "subject": "RE: [junit] Re: JavaDocs", 
    "from": "&quot;Heath, Joseph&quot; &lt;HeathJ@...&gt;", 
    "authorName": "Heath, Joseph", 
    "msgSnippet": "... But this assumes that our tests cover all possibilities of use, which can result in large test suites. I am not against this (in fact I prefer it), but", 
    "msgId": 4175, 
    "profile": "mbcx4jrh", 
    "topicId": 4069, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 71348971, 
    "messageBody": "<div id=\"ygrps-yiv-801985307\"><blockquote><span title=\"ireply\">&gt; Then I&#39;ll leave you with this final thought:  If we design <br/>\n&gt; software by writing tests first, do the tests document the <br/>\n&gt; intention of the software, or its implementation?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>But this assumes that our tests cover all possibilities of use, which can<br/>\nresult in large test suites. I am not against this (in fact I prefer it),<br/>\nbut often a few words of English (or whatever language you read) is<br/>\npreferrable (IMHO) to a large test suite.<br/>\nI still have the test suite, however, for refactoring and code proof.<br/>\n<br/>\nI would still say that that the tests document examples of the intention,<br/>\nrather than the intention itself. These examples may be a complete set or<br/>\nmay not be, often just the critical subset.<br/>\n<br/>\ncheers<br/>\njoe<br/>\n<br/>\nThis e-mail and any attachment is for authorised use by the intended recipient(s) only.  It may contain proprietary material, confidential information and/or be subject to legal privilege.  It should not be copied, disclosed to, retained or used by, any other party.  If you are not an intended recipient then please promptly delete this e-mail and any attachment and all copies and inform the sender.  Thank you.</div>", 
    "prevInTime": 4174, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1014390905", 
    "canDelete": false, 
    "nextInTopic": 4176, 
    "prevInTopic": 4174, 
    "headers": {
        "messageIdInHeader": "PDI5Nzc2QzFGNDIyQkQ0MTFCODY4MDA5MDI3RTJBOUU1MDExRjkyOEFAYmFja3VzLmxvZ2ljYS5jby51az4="
    }
}