{
    "numMessagesInTopic": 3, 
    "nextInTime": 419, 
    "senderId": "yFRY7x45aAauHdscyF4vrxdfl17jg9P9ZDWac1Np5s63_gCePmdVll-UeOxLFSmARyzkySdJc-ja_LhVHDRwww9ISMC6KsW-KZw", 
    "systemMessage": false, 
    "subject": "Unit testing system type failures", 
    "from": "Robert Leftwich &lt;digital@...&gt;", 
    "authorName": "Robert Leftwich", 
    "msgSnippet": "I am wanting to implement the classical write to temp file, rename existing file to old, rename new file to existing file, delete old file if all is well and I", 
    "msgId": 418, 
    "topicId": 418, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-607077005\">I am wanting to implement the classical write to temp file, rename existing <br/>\nfile to old, rename new file to existing file, delete old file if all is <br/>\nwell and I am looking for ways to unit test a system failure, i.e. the jvm <br/>\nor file system dying in the middle of it.<br/>\n<br/>\nA couple of possibilities spring to mind :<br/>\n<br/>\n1. Start the file manipulation in a separate thread and randomly destroy <br/>\nthe thread, checking to make sure that either the old file is still in tact <br/>\nor the new file is present and correct. This feels a little too random for <br/>\nmy taste and doesn&#39;t give me the warm, fuzzy feeling that unit tests <br/>\nusually do. It also only tests one aspect - the jvm style failure, not the <br/>\nfile system failure.<br/>\n<br/>\n2. Write a mock (or stub) File class that can be setup to simulate system <br/>\nfailures. This one sounds like too much effort, especially since File is <br/>\nnot an interface. Also this approach only tests the system style failure <br/>\nand not the jvm failure.<br/>\n<br/>\nHmmm ... I may have answered my own question here, but I&#39;ll throw it out <br/>\nfor comment. I am sure someone else has experience in this area they would <br/>\nlike to share.<br/>\n<br/>\nRobert</div>", 
    "prevInTime": 417, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "981667076", 
    "canDelete": false, 
    "nextInTopic": 421, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDUuMC4yLjEuMC4yMDAxMDIwOTA3NDMzNy4wMjk1NTRmMEBkdWFsPg=="
    }
}