{
    "numMessagesInTopic": 6, 
    "nextInTime": 4182, 
    "senderId": "PAaTIjkfD5cf_rhj8VVJTZqiECT6ubmhjTlnrPune5EP4q91JMxwT8ZJZfYPeQDdevdTx_7vVEjdyACkQzj0b9ElzqH87Q", 
    "systemMessage": false, 
    "subject": "Please Help, Need Guidance", 
    "from": "&quot;mschnayd&quot; &lt;mschnayd@...&gt;", 
    "authorName": "mschnayd", 
    "msgSnippet": "Hello Guys, I am an architect for a small software company.  We have been developing our product for about two years now, and have been trying to be pretty", 
    "msgId": 4181, 
    "profile": "mschnayd", 
    "topicId": 4181, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 65933074, 
    "messageBody": "<div id=\"ygrps-yiv-527823104\">Hello Guys,<br/>\n<br/>\nI am an architect for a small software company.  We have been <br/>\ndeveloping our product for about two years now, and have been trying <br/>\nto be pretty good about the developmental practices.  We have coding <br/>\nstandards, good architecture and frameworks in place, and allot of <br/>\ntallented developers. What we don&#39;t have is a solid suite of unit <br/>\ntests.<br/>\n<br/>\nWhat happened is at the beginning of the project management was <br/>\nonboard with the schedule that we demanded that included time for <br/>\nbuilding the unit tests.  For about 6 month now that is no longer a <br/>\ncase.  We have not written unit tests for the past 6 month.  The <br/>\ntests that have been written are long out of sync. with the codebase, <br/>\nto the point where everyone has them excluded from compilation.<br/>\n<br/>\nI really would like us to get back on track and developer a better <br/>\nquality product; alos, god knows our QA need some help.<br/>\n<br/>\nAnyway, to keep a long story short, what I am looking for is for best <br/>\npractices and guidlines on developintg unit tests for various types <br/>\nof classes (Regular classes, Servlets, EJBs, MDBs, XML processing).  <br/>\nIs there a framework that somebody has developed on top of the JUnit.<br/>\nIf not, I would be glad to build one, assuming it will not require <br/>\ntoo much time.  Being a great fan of reuse, I would rather use an <br/>\nalready created testing framework.  JUnit is great, but it is very <br/>\nsimple and does not have guidance on testing Data Access code, ...<br/>\n<br/>\nIf any of you can give me a list of books, articles, code samples, <br/>\nreferences to other web-sites; I will greatly appreciate it.<br/>\nI am realy glad that people like Erich Gamma and Kent Beck are out <br/>\nthere to help the rest of us get our acts together; however, there is <br/>\nstill some much more that could be done to make life easier for <br/>\nfast-pased development teams like the one I am working for.<br/>\n<br/>\nRegards, Mikhail Shnayderman.</div>", 
    "prevInTime": 4180, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1014410135", 
    "canDelete": false, 
    "nextInTopic": 4182, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGE1NmEybitycXEzQGVHcm91cHMuY29tPg=="
    }
}