{
    "numMessagesInTopic": 17, 
    "nextInTime": 4216, 
    "senderId": "3GRZfV9xwTYgd7fj_2jPcOFSGkgVJEIxnPAxqtRDe7w2QdyZnDAkYY5aoEy1yZPAU9QMUM9Z7uL4", 
    "systemMessage": false, 
    "subject": "Re: [junit] Database Select query checks!! newbie", 
    "from": "&lt;evought@...&gt;", 
    "authorName": "evought@qlue.com", 
    "msgSnippet": "Sorry this reply is late in coming- I ve been swamped for the last few weeks. In our projects we use PostgreSQL for development and do have a test database per", 
    "msgId": 4215, 
    "profile": "eric_vought", 
    "topicId": 4008, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 77258944, 
    "messageBody": "<div id=\"ygrps-yiv-185193290\">Sorry this reply is late in coming- I&#39;ve been swamped for the last few<br/>\nweeks.<br/>\n<br/>\nIn our projects we use PostgreSQL for development and do have a<br/>\ntest database per developer (or, actually, one per workstation, though it<br/>\nis easy enough to create more). The database is lightweight and rebuilds<br/>\nquickly. We have Ant tasks which drop, recreate, and reload the DB with an<br/>\nempty scheme before each test run. This is fully automated and only adds a<br/>\nfew seconds to a run. If someone is interested, I can send some sample<br/>\nscripts.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, 11 Feb 2002, Mathieu Gervais wrote:<br/>\n<br/>\n&gt; Hi,<br/>\n&gt;<br/>\n&gt; &gt;There is a line of thought that all you need to do is make sure your SQL<br/>\n&gt; &gt;is valid. beyond that you&#39;re testing your database, not your method...<br/>\n&gt;<br/>\n&gt;  I never got that one. It&#39;s like saying SQL code doesn&#39;t need testing as<br/>\n&gt; mush as java code.<br/>\n&gt;<br/>\n&gt; Programmer A:<br/>\n&gt; When I do unit testing, I just run my code in a couple of conditions and<br/>\n&gt; look if it&#39;s ok.<br/>\n&gt;<br/>\n&gt; XPer:<br/>\n&gt; You should really program those tests so they are repeatable, fast to run<br/>\n&gt; and don&#39;t need any human interaction to verify if they pass. Do automated<br/>\n&gt; unit testing! Use  JUnit!<br/>\n&gt;<br/>\n&gt; Why doesn&#39;t the same applies to SQL queries? In reality the programmer DOES<br/>\n&gt; test his SQL queries by trying them and looking at results. (&quot;make sure your<br/>\n&gt; SQL is valid&quot;) so why not automate it like the rest?<br/>\n&gt;<br/>\n&gt; I&#39;ve seen queries way more complex than some Java code. I&#39;m pretty sure<br/>\n&gt; everybody did. Don&#39;t you want that when somebody will need to modifiy the<br/>\n&gt; query (to add a filtering condition for example) they can press the button<br/>\n&gt; and run the tests to ensure the query is still ok?<br/>\n&gt;<br/>\n&gt; What I do is I connect to a special DB (with a replica of the schema of the<br/>\n&gt; real DB) populated with test data. I also dynamically add data (in setup)<br/>\n&gt; and delete it (in teardown) for some tests. Or check that my code really<br/>\n&gt; inserted a row, etc. Of course, if a query is like selectAll(), you might be<br/>\n&gt; influenced by other programmers using the same test DB at the same time, so<br/>\n&gt; you will want something like a test db per programmer. And then you start to<br/>\n&gt; find it hard to deal with this increasingly complex solution so you drop all<br/>\n&gt; of this and return to &quot;make sure your SQL is valid&quot; testing, no more<br/>\n&gt; automated tests for SQL.<br/>\n&gt;<br/>\n&gt; I would really like to have a tool that helped me test my SQL code and setup<br/>\n&gt; testcases as easily as the JUnit testcase for Java. I can&#39;t use a sql only<br/>\n&gt; test tool: I don&#39;t want to test the SQL outside the java code and then have<br/>\n&gt; the java code use those statements. Why? Because often what I want to test<br/>\n&gt; is if the transaction is correctly rolledback in a special case, stuff like<br/>\n&gt; that that needs java code and SQL. But really 10 lines of code and 3 lines<br/>\n&gt; of sql, so it is a &quot;unit&quot; difficult to break down further without loosing a<br/>\n&gt; lot of test cases. And what about testing failure of a DB connection at a<br/>\n&gt; critical point? Mock objects seem to be usefull for this. Really, there is a<br/>\n&gt; need for somebody to build a tool or documentatin explaining the best way to<br/>\n&gt; do all of this.<br/>\n&gt;<br/>\n&gt; I&#39;ve already tought about solutions for DB-interacting code testing  (see<br/>\n&gt; posts in archive) but all my ideas are going into direction where the<br/>\n&gt; infrastructure needed is heavy and difficult to maintain. Any brillant tool<br/>\n&gt; or ideas out there for all of this?<br/>\n&gt;<br/>\n&gt; mathieu<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; PS: The original poster should also look at MockObjects to mock the results<br/>\n&gt; of the DB. They might help depending on what you want to do. But then you<br/>\n&gt; aren&#39;t testing the SQL since you are mocking the execution engine.<br/>\n&gt;<br/>\n&gt; ----- Original Message -----<br/>\n&gt; From: Nilesh Thali<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\n&gt; Sent: Monday, February 11, 2002 5:01 PM<br/>\n&gt; Subject: Re: [junit] Database Select query checks!! newbie<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; (2) Your tests are simple: populate the database with data, write News<br/>\n&gt; beans<br/>\n&gt; &gt; that represent that data, assert that getAllNews() answers the same Set<br/>\n&gt; (or<br/>\n&gt; &gt; List, if you care about order within the collection) of News beans. Do<br/>\n&gt; this<br/>\n&gt; &gt; with as many different datasets as you need to be confident that your<br/>\n&gt; method<br/>\n&gt; &gt; works.<br/>\n&gt;<br/>\n&gt;     only problem with testing queries like this is that your test will be<br/>\n&gt; time and<br/>\n&gt;     database dependent, because data (in this case the number of news beans)<br/>\n&gt;     may change over time, and you will see the red bar even though your<br/>\n&gt; method<br/>\n&gt;     works fine.<br/>\n&gt;     There is a line of thought that all you need to do is make sure your SQL<br/>\n&gt;     is valid. beyond that you&#39;re testing your database, not your method...<br/>\n&gt;<br/>\n&gt; regards,<br/>\n&gt; Nilesh<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Sponsor<br/>\n&gt; ADVERTISEMENT<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n-- <br/>\nEric Vought<br/>\nChief Technical Officer - QLUE Consulting, Inc.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:evought@...\">evought@...</a> toll-free: 888-771-3538  RTP area: 919-816-9901 </span></blockquote></div>", 
    "prevInTime": 4214, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1014824980", 
    "canDelete": false, 
    "nextInTopic": 4216, 
    "prevInTopic": 4030, 
    "headers": {
        "inReplyToHeader": "PE9FNjJjcndQQmhmZ000ZkdJQzcwMDAwMzVmY0Bob3RtYWlsLmNvbT4=", 
        "messageIdInHeader": "PFBpbmUuTE5YLjQuMzMuMDIwMjI3MTA0NTM0MC4yNzg0LTEwMDAwMEBraWxpLnFsdWUtbGFuPg=="
    }
}