{
    "numMessagesInTopic": 9, 
    "nextInTime": 4235, 
    "senderId": "use3P9dYfWSFa9dLRnQ4KyXE-xsabSvOf8ZreoDRHvdpLPVTJrn_-3ibyWraFBGHqzYEFaPP3SPxZhwUxPOciNDmxjHdybJ9DPbVCI7M6f-wMfE8AaSa", 
    "systemMessage": false, 
    "subject": "Re: What&#39;s the best way to enhance Assert?", 
    "from": "&quot;noneofyer42businessbub&quot; &lt;a.adachi@...&gt;", 
    "authorName": "noneofyer42businessbub", 
    "msgSnippet": "... That sounds like a good plan for a first step as I m not sure whether or not I ll need these custom assertions in future test cases. Nor do I know if my", 
    "msgId": 4234, 
    "profile": "noneofyer42businessbub", 
    "topicId": 4227, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 29554361, 
    "messageBody": "<div id=\"ygrps-yiv-933026916\">--- In junit@y..., Mike Clark &lt;mike@c...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If the custom assertions are used in only one test case, I&#39;ll just defined<br/>\n&gt; those assertions within the specialized test case itself.  This gives me to<br/>\n&gt; option to refactor them into a base test case later if necessary.<br/>\n<br/>\n<br/>\n </span></blockquote>That sounds like a good plan for a first step as I&#39;m not sure whether or not I&#39;ll <br/>\nneed these custom assertions in future test cases. Nor do I know if my initial <br/>\nassumptions on how to write these custom assertions will be correct the first <br/>\ntime around and applicable for future versions of test cases.<br/>\n<br/>\nWith regards to possible second steps (future refactorings)....<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;If the custom assertions are used by many test cases, I&#39;ll typically use this<br/>\n&gt;approach:<br/>\n<br/>\n&gt;public class BaseTestCase extends TestCase {<br/>\n&gt;//...<br/>\n<br/>\n--- In junit@y...,  Vladimir Bossicard &lt;vladimir@b...&gt; wrote:<br/>\n&gt;Unlike the &quot;new TestCase&quot; option, you can :<br/>\n&gt;- have multiple assertEqual(Object, Object) methods<br/>\n&gt;- use several user-defined Assert classes in one TestCase object<br/>\n&gt;- easily share your assertions, users don&#39;t have to redefine one <br/>\n&gt;TestCase class to use your assertions (2 classes instead of one)<br/>\n<br/>\n...Which of these two ways would you consider, in the context of Extreme <br/>\nProgramming, to be the &quot;Simplest Thing Which Could Possibly Work&quot;?<br/>\n<br/>\nAt first glance it seems that making a new specialized TestCase (i.e.- <br/>\ninheritance) to contain the custom assertion methods would be the quickest way <br/>\nto add these on. Just push them up into a new base class.<br/>\n<br/>\nHowever, the specialized Assert class (i.e.-delegation) appears to be more <br/>\nflexible and easier to change in the future. It also seems to better communicate <br/>\nthe purpose of the new class.<br/>\n<br/>\nIn other words, if I went with the new TestCase extension route, I&#39;m not sure <br/>\nwhether I&#39;ll remember 6 months down the road that I created the new TestCase <br/>\nclass to hold the custom assertions. Where as making calls to an specialized <br/>\nAssert class route would likely to be more understandable.<br/>\n<br/>\nWhat are your thoughts on the matter of simplicity and readability vs. ease of <br/>\ninitial implementation with regards to these choices? I&#39;m trying to stick to the <br/>\nExtreme Programming way of doing things.<br/>\n<br/>\nThanks,<br/>\n<br/>\nAnthony </span></blockquote></div>", 
    "prevInTime": 4233, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1014929344", 
    "canDelete": false, 
    "nextInTopic": 4237, 
    "prevInTopic": 4229, 
    "headers": {
        "inReplyToHeader": "PDNDN0U2NEY3LjlBRjQ3MzUyQGNsYXJrd2FyZS5jb20+", 
        "messageIdInHeader": "PGE1bTU0MCsyc2ozQGVHcm91cHMuY29tPg=="
    }
}