{
    "numMessagesInTopic": 2, 
    "nextInTime": 4275, 
    "senderId": "uKhYWShElf94rMStrYNHBRYj5PCCn8a9eAboM8bCvmuzTjTm5FhSi7kvQuJVRenR3GYNx_G3oOgVQ88PZ8EmU9Kh39Gg3hM", 
    "systemMessage": false, 
    "subject": "CFP: Workshop on Testing in XP (WTiXP 2002)", 
    "from": "Leon Moonen &lt;Leon.Moonen@...&gt;", 
    "authorName": "Leon Moonen", 
    "msgSnippet": "[We apologize if you receive multiple copies of this message.] CALL FOR POSITION PAPERS / PARTICIPATION Workshop on Testing in Extreme Programming (WTiXP 2002)", 
    "msgId": 4274, 
    "rawEmail": "Return-Path: &lt;Leon.Moonen@...&gt;\r\nX-Sender: Leon.Moonen@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: unknown); 6 Mar 2002 11:11:14 -0000\r\nReceived: (qmail 88718 invoked from network); 6 Mar 2002 11:10:55 -0000\r\nReceived: from unknown (216.115.97.172)\n  by m10.grp.snv.yahoo.com with QMQP; 6 Mar 2002 11:10:55 -0000\r\nReceived: from unknown (HELO hera.cwi.nl) (192.16.191.8)\n  by mta2.grp.snv.yahoo.com with SMTP; 6 Mar 2002 11:10:54 -0000\r\nReceived: from cwi.nl (zwaard.sen.cwi.nl [192.16.201.166]) by hera.cwi.nl with ESMTP\n\tid MAA00530 for ; Wed, 6 Mar 2002 12:10:50 +0100 (MET)\r\nSender: Leon.Moonen@...\r\nMessage-ID: &lt;3C85F93A.919FB42B@...&gt;\r\nDate: Wed, 06 Mar 2002 12:10:50 +0100\r\nX-Mailer: Mozilla 4.77 [en] (X11; U; Linux 2.4.9-12 i686)\r\nX-Accept-Language: en\r\nMIME-Version: 1.0\r\nTo: Leon.Moonen@...\r\nSubject: CFP: Workshop on Testing in XP (WTiXP 2002)\r\nContent-Type: text/plain; charset=us-ascii\r\nContent-Transfer-Encoding: 7bit\r\nFrom: Leon Moonen &lt;Leon.Moonen@...&gt;\r\nX-Yahoo-Group-Post: member; u=95937294\r\nX-Yahoo-Profile: leonmoonen\r\n\r\n[We apologize if you receive multiple copies of this message.]\n\n                                      \n                  CALL FOR POSITION PAPERS / PARTICIPATION\n\n                                      \n          Workshop on Testing in Extreme Programming (WTiXP 2002)\n                                May 27, 2002\n                          Alghero, Sardinia, Italy\n                                      \n                        http://www.cwi.nl/wtixp2002/\n                                                                      \n     Workshop in conjunction with the Third International Conference on\n      eXtreme Programming and Agile Processes in Software Engineering\n                      (XP2002, http://www.xp2002.org)\n                                      \n\nBACKGROUND\n\n``If there is a technique at the heart of extreme programming (XP), it\nis\nunit testing&#39;&#39; [1]. As part of their programming activity, XP developers\nwrite and maintain (white box) unit tests continually. These tests are\nautomated, written in the same programming language as the production\ncode,\nconsidered an explicit part of the code, and put under revision control. \nThe XP process encourages writing a test class for every class in the\nsystem. Methods in these test classes are used to verify complicated\nfunctionality and unusual circumstances. Moreover, they are used to\ndocument\ncode by explicitly indicating what the expected results of a method\nshould\nbe for typical cases. Last but not least, tests are added upon receiving\na\nbug report to check for the bug and to check the bug fix.\n\nAnd there is more than unit testing: Acceptance tests (also known as\nfunctional tests in XP terms) are used to prove that the application\nworks\nas the customer wishes. They help the customers to gain confidence that\nthe\nwhole product is progressing in the right direction.  Acceptance tests\noperate from the customer perspective, they don&#39;t test every possible\npath\nin the code (unit tests take care of that), but demonstrate that the\nbusiness value is present. Furthermore, they allow the programmer to\ntrack\nthe state of implementation in relation to the user written story cards.\n\nOBJECTIVES\n\nThe purpose of this workshop is to bring together practitioners,\nresearchers, academics, and students to discuss the state-of-the-art of\ntesting in extreme software development projects. The goal is to share\nexperience, consolidate successful techniques, collect guidelines, and\nidentify open issues for future work.\n\nWorkshop topics include, but are not limited to: \n - Bad smells in testing          - Testing patterns \n - Refactoring test code          - Test first design \n - Automated acceptance testing   - Dealing with testing conflicts \n - Experience reports \n\nSUBMISSIONS\n\nParticipants are asked to submit a two page position paper detailing\ntheir\nperspective on one or more of the above topics. Detailed technical\ndescriptions of a special testing technique might be longer, if needed.\nPosition papers that focus on acceptance testing should include an\noverview of the attempted solution strategy, whether it was successful\nor\nnot, what level of automation was reached, how test results are\nreported,\nhow tests are implemented and maintained and who is specifying,\nimplementing\nand running the tests (customer, dedicated tester, developer, automated\nbuild).\n\nThe organizers will accept position statements based on originality,\nrelevance, and suitability for triggering discussion.  Please mail your\nsubmission (in PDF or PS) to Leon Moonen (Leon.Moonen@...).\n\nIMPORTANT DATES\n\nDeadline for submission of position papers:   April 22, 2002\nNotification of acceptance:                   May 3, 2002\nWorkshop date:                                May 27, 2002\n\nWORKSHOP FORMAT \n\nThe workshop will be lively and entertaining. It aims at discussion and\ninteraction rather than presentations. However, all participants will be\ngiven a chance to give a short presentation. These presentations will\nserve\nto introduce a case study, provoke discussion by presenting a\ncontroversial\npoint of view, or introduce new points of view. Live presentations of\ntesting techniques are also highly welcome (in addition to a position\npaper). This would open the possibility to take a look at the\nimplementation, if needed, and discuss the nuts & bolts in more detail.\n\nThe workshop opens with an introduction session where participants can\nraise\nthe questions they would like to get addressed in the workshop; in the\nconcluding wrap up we&#39;ll evaluate how far we got in answering these\nquestions.\n\nAll accepted position papers will be published on the workshop page\nprior to\nthe workshop and the participants will be asked to read the papers\nbefore\nthe workshop.\n\nWORKSHOP ORGANIZERS\n\nLeon Moonen\nCWI, the Netherlands\nLeon.Moonen@...\n\nMartin Lippert\nUniversity of Hamburg & Apcon WPS, Germany\nlippert@...\n\nPROGRAM COMMITTEE\n\nThere is a small program committee to review the position papers, \ngive feedback and support the workshop at XP2002\n\nArie van Deursen (CWI, the Netherlands)\nSteve Freeman (M3P, United Kingdom)\nTim Mackinnon (Connextra, United Kingdom)\nGerard Meszaros (ClearStream Consulting, Canada)\nJoseph Pelrine (MetaProg, Switzerland)\nStefan Roock (University of Hamburg & Apcon WPS, Germany)\nShaun Smith (ClearStream Consulting, Canada)\n\n\nReferences\n[1]  K. Beck. Embracing change with extreme programming. \n     IEEE Computer, 32(10):70-77, October 1999.\n\n", 
    "profile": "leonmoonen", 
    "topicId": 4274, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 95937294, 
    "prevInTime": 4273, 
    "contentTrasformed": false, 
    "postDate": "1015413050", 
    "canDelete": false, 
    "nextInTopic": 4618, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDNDODVGOTNBLjkxOUZCNDJCQGN3aS5ubD4="
    }
}