{
    "numMessagesInTopic": 3, 
    "nextInTime": 4279, 
    "senderId": "RwYyLTxkPLsgm0gUKyrnG-Iz-gkfZLltYpR7ezVrcpjpTm0bUhqIjT8Q_qXzyTwbfXjmcdOEnxRFxUFzx1fu9JT3tMY", 
    "systemMessage": false, 
    "subject": "", 
    "from": "scott.marshall@...", 
    "authorName": "scott.marshall@wherever.co.uk", 
    "msgSnippet": "We ve started using JunitEE to unit test our J2EE current development, and are looking at doing an automated overnight build and test. I have a TestAll  test", 
    "msgId": 4278, 
    "profile": "rovingblond", 
    "topicId": 4278, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 85853747, 
    "messageBody": "<div id=\"ygrps-yiv-1427608429\">We&#39;ve started using JunitEE to unit test our J2EE current development, and are looking at doing an automated overnight build and test.<br/>\n<br/>\nI have a TestAll  test suite, itself built from a series of test suites, each of which is built from  test classes, with the aim of testing the entire application from one class. This works fine when the TestAll suite is manually selected from a menu presented in an HTML screen. <br/>\n<br/>\nWith JUnit, I wrote a short batch file containing an ANT command line to build and test the entire application. With the JUnitEE TestAll suite normally activated from the browser, I&#39;m stuck as to how to automate my TestAll suite to run overnight. <br/>\n<br/>\nHas anyone else come out with a solution to this problem ? Or am I on the wrong track here ?  I am looking at using Cactus, but at present most of our unit testing is testing the home interfaces at CMP level, and I don&#39;t think Cactus is appropriate for this.<br/>\n<br/>\nThanks for your help. <br/>\n<br/>\nScott <br/>\n<br/>\n<br/>\n--<br/>\nPersonalised email by <a rel=\"nofollow\" target=\"_blank\" href=\"http://another.com\">http://another.com</a></div>", 
    "prevInTime": 4277, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1015491990", 
    "canDelete": false, 
    "nextInTopic": 4280, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDY0MzI4NjQuMTAxNTQ5MTk5MDcyOS5KYXZhTWFpbC5yb290QDE3Mi4xNi4xMDAuNTA+"
    }
}