{
    "numMessagesInTopic": 23, 
    "nextInTime": 4382, 
    "senderId": "9camTsQYMs6SqUiqkPcgCjuzKVd7aJJMnPseYXjeGZJ6XpWP-YG0RW45cXdaZqYIXSzQ40PmlxK6btTbOW4aLbmR4uDK1w", 
    "systemMessage": false, 
    "subject": "Re: [junit] Is there a tool which generates JUnit-test stubs?", 
    "from": "Mike Clark &lt;mike@...&gt;", 
    "authorName": "Mike Clark", 
    "msgSnippet": "... Hi Josh, So if I read this correctly, you use the test generator to generate stubbed out JUnit test methods for existing classes.  In other words, the test", 
    "msgId": 4381, 
    "profile": "clarkware", 
    "topicId": 4368, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 33026788, 
    "messageBody": "<div id=\"ygrps-yiv-1298360895\">&quot;Hoepner, Josh (J.M.)&quot; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;quote&gt;<br/>\n&gt; ...let&#39;s not forget that testing is a mindful activity, and not a mindless<br/>\n&gt; activity. Generating test stubs, especially from classes already written,<br/>\n&gt; relieves you of the need to think about what you&#39;re testing. This is a bad<br/>\n&gt; thing, and often a Bad Thing.<br/>\n&gt; &lt;/quote&gt;<br/>\n&gt;<br/>\n&gt; I agree wholeheartedly with what you&#39;re saying.  Unfortunately, I was given the dubious honor of creating JUnit tests for code that was already written.  The test stub generator saves me alot of time creating stubs for methods that have 80+ &lt;ack!&gt; methods.  Then I go through and remove the stubs for methods that don&#39;t need to be tested and add test cases for methods that are more complex and require multiple test cases.  Stub generation is a timesaver IMHO, as long as you make sure you are still covering all your bases.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Hi Josh,<br/>\n<br/>\nSo if I read this correctly, you use the test generator to generate stubbed out JUnit test methods for existing classes.  In other words, the test generator does not attempt to generate assertions of any kind based on the signatures of the methods under test.<br/>\n<br/>\nI&#39;d be curious to know how often you end up removing, or replacing, more stub test methods than you keep from the test generator.  And for the test methods that are kept, given that you must code the assertions for the methods under test, how much time is really saved by the generation of the stub test methods.<br/>\n<br/>\nPlease let us know how it goes, as many have questions on this topic.<br/>\n<br/>\nThanks!<br/>\n<br/>\nMike<br/>\n<br/>\n--<br/>\nMike Clark<br/>\nClarkware Consulting, Inc.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.clarkware.com\">http://www.clarkware.com</a><br/>\n720.851.2014</div>", 
    "prevInTime": 4380, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1016247187", 
    "canDelete": false, 
    "nextInTopic": 4382, 
    "prevInTopic": 4376, 
    "headers": {
        "messageIdInHeader": "PDNDOTJCMzkzLkQwODA5NzAzQGNsYXJrd2FyZS5jb20+", 
        "referencesHeader": "PDIwMDIwMzE1MTgwMC5nMkZJMDFFMDUzNjRAZHltd3NtMTIubWFpbHdhdGNoLmNvbT4="
    }
}