{
    "numMessagesInTopic": 5, 
    "nextInTime": 4421, 
    "senderId": "ca016Kiksza6yM4VSlwh0QzMprsk7qEwJBvI4COOpqXsjNzXSQxL4FDxt2g_SxM9Q1quzbz8nXKry6AfaH8LkRpviA44NA", 
    "systemMessage": false, 
    "subject": "Re: [junit] RE: Is there a tool which generates JUnit-teststubs?", 
    "from": "Mike Clark &lt;mike@...&gt;", 
    "authorName": "Mike Clark", 
    "msgSnippet": "... Yes, that s my experience, as well.  A safety net I don t trust is no safety net at all.  I can let a tool generate tests all day long, but in the end I m ", 
    "msgId": 4420, 
    "profile": "clarkware", 
    "topicId": 4405, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 33026788, 
    "messageBody": "<div id=\"ygrps-yiv-1871416214\">&quot;J. B. Rainsberger&quot; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&quot;J. B. Rainsberger&quot; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt; &quot;If I didn&#39;t spend 80 hours writing these tests, I could spend my time<br/>\n&gt; &gt; &gt; writing each test as I need it and the rest of the time writing new<br/>\n&gt; &gt; &gt; code. Given what I know about the code, I won&#39;t be any faster writing<br/>\n&gt; &gt; &gt; tests whether I write them all at once or as I need them. With that in<br/>\n&gt; &gt; &gt; mind, what would you like me to do? In the worst case, I need all the<br/>\n&gt; &gt; &gt; tests up front and end up writing them now anyway. It looks like you<br/>\n&gt; &gt; &gt; win.&quot; How does that sound, everyone?<br/>\n&gt; &gt;<br/>\n&gt; &gt;I think it&#39;s important to understand the value of test coverage as<br/>\n&gt; &gt;perceived by the person requesting those tests.  In other words, if you<br/>\n&gt; &gt;had automatically-generated tests for all the code, how might that help<br/>\n&gt; &gt;you?<br/>\n&gt;<br/>\n&gt; Me, personally? Not at all. I have worked with generated code long enough<br/>\n&gt; not to trust it. That&#39;s a personal bias that is perhaps unnecessarily<br/>\n&gt; difficult for people to get around.<br/>\n&gt;<br/>\n&gt; One, in general? Automatically-generated tests could help by providing a<br/>\n&gt; refactoring safety net before the programmer was able to understand and<br/>\n&gt; therefore craft by hand the same tests. It also has the downside of<br/>\n&gt; absolving the programmer of the responsibility of understanding what the<br/>\n&gt; tests are doing -- this is because generated code is usually very difficult<br/>\n&gt; to read -- rendering their communication value quite low.<br/>\n&gt;<br/>\n&gt; Even if the autogen tests worked, the programmer would still likely want to<br/>\n&gt; replace those tests with ones he can understand, over time. Then they would<br/>\n&gt; be great. The problem is simple: I can&#39;t trust them enough. :)<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Yes, that&#39;s my experience, as well.  A safety net I don&#39;t trust is no safety<br/>\nnet at all.  I can let a tool generate tests all day long, but in the end I&#39;m<br/>\nno more confident to move forward then I was to begin with.  And,<br/>\nunfortunately, I&#39;m still ignorant of how the code actually works.<br/>\n<br/>\nMike<br/>\n<br/>\n--<br/>\nMike Clark<br/>\nClarkware Consulting, Inc.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.clarkware.com\">http://www.clarkware.com</a><br/>\n720.851.2014</div>", 
    "prevInTime": 4419, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1016571360", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 4416, 
    "headers": {
        "messageIdInHeader": "PDNDOTdBNUUwLkU1OTg3QUQyQGNsYXJrd2FyZS5jb20+", 
        "referencesHeader": "PEYxNjJRZFVLejM5TDcxcGJjdTgwMDAwNGZjNkBob3RtYWlsLmNvbT4="
    }
}