{
    "numMessagesInTopic": 52, 
    "nextInTime": 4524, 
    "senderId": "Obe8mW1HYzYhP0HGG67ytI42BC3g7wOF4xgwWtomgErU5ljHQyJBIl2spc0fe9N0fiSFNi9IwxUunsO2_j5Em0kQDbNI3F2s", 
    "systemMessage": false, 
    "subject": "Re: [junit] testing private methods", 
    "from": "David Stagner &lt;dstagner@...&gt;", 
    "authorName": "David Stagner", 
    "msgSnippet": "... Or you could write your code in a language like Python that doesn t have private methods. :} Seriously, there may be other solutions (there are ALWAYS", 
    "msgId": 4523, 
    "profile": "d_stagner", 
    "topicId": 3179, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 75470680, 
    "messageBody": "<div id=\"ygrps-yiv-470105429\">Dale E Martin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Choose your poison, then. If you want to keep your test classes <br/>\n&gt;&gt;completely separate from the classes tested, then you&#39;ll only be testing <br/>\n&gt;&gt;the public interface (and you need to feel certain all your private <br/>\n&gt;&gt;methods work when they can only be tested indirectly via the public <br/>\n&gt;&gt;interface). If you want to test private methods directly, you must run <br/>\n&gt;&gt;your tests as inner classes.<br/>\n&gt;&gt;<br/>\n&gt; <br/>\n&gt; It is possible to rewrite the class files being tested at test-time to have<br/>\n&gt; all public methods.  Using Jakarta BCEL it wouldn&#39;t be that hard to due.<br/>\n&gt; Or you could run a special JVM that allows access to public methods.<br/>\n&gt; <br/>\n&gt; I do realize then you&#39;d be testing something other than the real code, but<br/>\n&gt; it&#39;s a way to get around the problem you mentioned.<br/>\n<br/>\n </span></blockquote>Or you could write your code in a language like Python that doesn&#39;t have <br/>\nprivate methods. :}<br/>\n<br/>\nSeriously, there may be other solutions (there are ALWAYS other <br/>\nsolutions!), but not necessarily rational, sensible ones - or a better <br/>\nway to say it would be that they don&#39;t meet the &quot;implicit requirements&quot;. <br/>\nI assume as a requirement that i am running in a JVM that conforms to <br/>\nJava specs - that excludes the custom JVM that ignores private. I don&#39;t <br/>\nfeel i need to explicitly state such a requirement! (Then again, on the <br/>\nother hand, there are often requirements which should be explicit rather <br/>\nthan implicit. I&#39;m starting to feel like a Talmudic scholar).  Another <br/>\nimplicit requirement is that the code i test be the same as the code i <br/>\nrun. Frankly, i have enough problems getting the *same* code to behave <br/>\nrepeatably in multiple environments! I don&#39;t want to deal with the code <br/>\nitself changing from what i tested.<br/>\n<br/>\nSuch abstract alternatives are far away from the original question, <br/>\nanyway. The problem at hand isn&#39;t even technical, but merely aesthetic - <br/>\nthe poster wants to be able to keep tests in a separate package for <br/>\naesthetic reasons, but wants to be able to test private methods from <br/>\noutside the package. That&#39;s not what private *is*!!! The very essence of <br/>\nthe private method is that nothing, NOTHING outside the original class <br/>\ncan access it (except for inner classes, a strange but clever hack that <br/>\nmakes the outside inside). There is no way to change JUnit in order to <br/>\naccomplish this impossibility - and no need for it, since JUnit classes <br/>\ncan be used as inner classes.<br/>\n<br/>\nConflict of technical versus technical is a problem that may or may not <br/>\nbe solvable. But conflict of technical versus aesthetic is a *smell*. <br/>\nThat smell says something is wrong - either not so much should be <br/>\nprivate, or the test harness needs to be more intimate with the code. In <br/>\nthis case, aesthetics are a luxury for programmers, much like morality <br/>\nis a luxury for politicians. Sometimes we need to cast aside aesthetics <br/>\nin order to do the job correctly. Ugly but right is always better than <br/>\npretty but wrong.<br/>\n<br/>\n-- <br/>\n<br/>\nDavid Stagner<br/>\n<br/>\nNational Marrow Donor Program<br/>\n3001 Broadway Street NE<br/>\nBroadway Ridge Suite 500<br/>\nMinneapolis, MN  55413<br/>\n<br/>\nEmail: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dstagner@...\">dstagner@...</a></div>", 
    "prevInTime": 4522, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1017436138", 
    "canDelete": false, 
    "nextInTopic": 4524, 
    "prevInTopic": 4522, 
    "headers": {
        "messageIdInHeader": "PDNDQTREN0VBLjYwMDA5MDJAbm1kcC5vcmc+", 
        "referencesHeader": "PDNDQTRCRERGLkYxMEY4RTJFQHNhYnJlLmNvbT4gPDNDQTRCQzYxLjMwMzA3MDVAbm1kcC5vcmc+IDwzQ0E0QzEwNy40NUZBN0FGM0BzYWJyZS5jb20+IDwzQ0E0QzI4NS43MDYwNjAyQG5tZHAub3JnPiA8MjAwMjAzMjkyMDQ0NDAuR0E0MzE1QGNsaWZ0b25sYWJzLmNvbT4="
    }
}