{
    "numMessagesInTopic": 52, 
    "nextInTime": 4559, 
    "senderId": "nxmKtmC3IVivAeVr2MXYBBV8v9pKrgG0eWARGNZaGX5QjZUGXfFaT_-G-qHnpsoqxo-slthdD-UhHILUKLWM01UOOb0bGnyotrQ", 
    "systemMessage": false, 
    "subject": "RE: [junit] testing private methods", 
    "from": "&quot;Manuel Amago&quot; &lt;mamago@...&gt;", 
    "authorName": "Manuel Amago", 
    "msgSnippet": "The way I see the problem of testing private methods is: for those of you who would like to see this feature in JUnit, try developing a nice working solution", 
    "msgId": 4558, 
    "profile": "mamagouk", 
    "topicId": 3179, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 86516083, 
    "messageBody": "<div id=\"ygrps-yiv-1229514301\">The way I see the problem of testing private methods is:<br/>\nfor those of you who would like to see this feature in JUnit, try<br/>\ndeveloping a nice working solution that fits well into the existing<br/>\nJUnit codebase.  I&#39;m sure that, if well presented, the JUnit team would<br/>\nbe willing to evaluate your solution and add it to a future release (is<br/>\nthis true guys?).<br/>\n<br/>\nI believe that, if people want to test private methods (and this is an<br/>\nissue that crops up frequently), they should be allowed to do so (if<br/>\nsuch functionality is readilly available).<br/>\n<br/>\nMany people on this list believe that unit testing the public API helps<br/>\nthe overall design of the system (low coupling, high cohesion, ...), and<br/>\nhelps decouple solutions from their different implementations.  Many<br/>\ninteresting points and suggestions have been raised over this issue,<br/>\nhowever, they belong to a Testing&Design discussion, not a Unit Testing<br/>\ndiscussion.<br/>\n<br/>\nIn the light of Unit Testing, if people want to unit test private<br/>\nmethods, so be it.  The JUnit documentation could point out some of the<br/>\nissues and uses of Unit Tests and how they help with the overall design<br/>\nof a system (they may already do so, but its been a while since I last<br/>\nlooked), but the tool is for Unit Testing, and as such, should allow<br/>\npeople to use it as they will, so long as they know what they are up to.<br/>\n<br/>\nManuel Amago.<br/>\nmailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamago@...\">mamago@...</a></div>", 
    "prevInTime": 4557, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1017774697", 
    "canDelete": false, 
    "nextInTopic": 4560, 
    "prevInTopic": 4556, 
    "headers": {
        "inReplyToHeader": "PDNDQTlFNjNFLjMwNTAxMDhAbm1kcC5vcmc+", 
        "messageIdInHeader": "PDAwMDQwMWMxZGE3YSQzZWVmNGNlMCQxNTEyYThjMEBtYW1hZ28+"
    }
}