{
    "numMessagesInTopic": 52, 
    "nextInTime": 4561, 
    "senderId": "8KobjlKNI9RqWcuI_oT0yMgJdLGEWeYW_7sncVkjn5rETu8tCFe5uOcbAMXacroGFkLS5i4pw35I9pefgEkL-QtGfM2SyVQK", 
    "systemMessage": false, 
    "subject": "Re: [junit] testing private methods", 
    "from": "David Stagner &lt;dstagner@...&gt;", 
    "authorName": "David Stagner", 
    "msgSnippet": "... But as i pointed out way back when this began, JUnit can *already* test private methods using existing features of Java access control. Just code your", 
    "msgId": 4560, 
    "profile": "d_stagner", 
    "topicId": 3179, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 75470680, 
    "messageBody": "<div id=\"ygrps-yiv-478986485\">Manuel Amago wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The way I see the problem of testing private methods is:<br/>\n&gt; for those of you who would like to see this feature in JUnit, try<br/>\n&gt; developing a nice working solution that fits well into the existing<br/>\n&gt; JUnit codebase.  I&#39;m sure that, if well presented, the JUnit team would<br/>\n&gt; be willing to evaluate your solution and add it to a future release (is<br/>\n&gt; this true guys?).<br/>\n&gt; <br/>\n&gt; I believe that, if people want to test private methods (and this is an<br/>\n&gt; issue that crops up frequently), they should be allowed to do so (if<br/>\n&gt; such functionality is readilly available).<br/>\n<br/>\n </span></blockquote>But as i pointed out way back when this began, JUnit can *already* test <br/>\nprivate methods using existing features of Java access control. Just <br/>\ncode your JUnit test class as an inner class of the class being tested. <br/>\nBut some programmers object to this method, because it embeds the unit <br/>\ntests in the code when they want the unit tests in a separate package <br/>\naltogether. That&#39;s not a JUnit problem, that&#39;s a configuration <br/>\nmanagement problem, imho. The smell is in the tension between the <br/>\ndesired source code layout and the access rules of the language. I don&#39;t <br/>\nsee how JUnit is responsible for this smell, or a JUnit-based solution <br/>\n(like, say, hacking it to use reflection in order to break access <br/>\ncontrol) that doesn&#39;t bring along serious code smells of its own.<br/>\n<br/>\nI think we all agree that there&#39;s a smell here. We&#39;re just disagreeing <br/>\nabout how to handle the smell.  I&#39;ll admit, using inner classes for unit <br/>\ntesting smells, too. I don&#39;t think it smells nearly as bad as breaking <br/>\naccess control, but that&#39;s just my opinion.<br/>\n<br/>\nI rather liked JB Rainsberger&#39;s idea that the need to test a private <br/>\nmethod directly suggests refactoring it into a collaborating class. I&#39;m <br/>\nnot sure it&#39;s universally applicable, but i do prefer looking for smells <br/>\nin my code rather than my tools.<br/>\n-- <br/>\n<br/>\nDavid Stagner<br/>\n<br/>\nNational Marrow Donor Program<br/>\n3001 Broadway Street NE<br/>\nBroadway Ridge Suite 500<br/>\nMinneapolis, MN  55413<br/>\n<br/>\nEmail: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dstagner@...\">dstagner@...</a></div>", 
    "prevInTime": 4559, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1017777073", 
    "canDelete": false, 
    "nextInTopic": 4561, 
    "prevInTopic": 4558, 
    "headers": {
        "messageIdInHeader": "PDNDQUEwQkIxLjQwMTAzMDBAbm1kcC5vcmc+", 
        "referencesHeader": "PDAwMDQwMWMxZGE3YSQzZWVmNGNlMCQxNTEyYThjMEBtYW1hZ28+"
    }
}