{
    "numMessagesInTopic": 52, 
    "nextInTime": 4562, 
    "senderId": "7DW4QoHgQu3sDmX6Yq0x-YOvfFrsvNrjRBmSQCJMpoDPBp_KQLxzQUGqk3gXfAjFPKsRS9ZeiIG-R02UJ_b-Lf9NSz8XMiACtMU", 
    "systemMessage": false, 
    "subject": "RE: [junit] testing private methods", 
    "from": "&quot;Manuel Amago&quot; &lt;mamago@...&gt;", 
    "authorName": "Manuel Amago", 
    "msgSnippet": "... This problem is definitely not a JUnit problem.  It is just that it would be nice if JUnit could handle this problem (Works Out of The Box[1]). Another", 
    "msgId": 4561, 
    "profile": "mamagouk", 
    "topicId": 3179, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 86516083, 
    "messageBody": "<div id=\"ygrps-yiv-811197657\"><blockquote><span title=\"ireply\">&gt; [...] The smell is in the tension between the <br/>\n&gt; desired source code layout and the access rules of the <br/>\n&gt; language. I don&#39;t see how JUnit is responsible for this smell,<br/>\n&gt; or a JUnit-based solution <br/>\n&gt; (like, say, hacking it to use reflection in order to break access <br/>\n&gt; control) that doesn&#39;t bring along serious code smells of its own.<br/>\n<br/>\n </span></blockquote>This problem is definitely not a JUnit problem.  It is just that it<br/>\nwould be nice if JUnit could handle this problem (Works Out of The<br/>\nBox[1]).<br/>\n<br/>\nAnother tension is that of consistency: if you code ALL your test<br/>\nclasses as Inner classes, you may well use them to test private access<br/>\nmethods also.  If you don&#39;t, however, you add an extra smell and<br/>\ninconsistent use of Inner/Test classes.  This could become a maintenance<br/>\nproblem.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I rather liked JB Rainsberger&#39;s idea that the need to test a private <br/>\n&gt; method directly suggests refactoring it into a collaborating <br/>\n&gt; class. I&#39;m not sure it&#39;s universally applicable, but i do prefer <br/>\n&gt; looking for smells in my code rather than my tools.<br/>\n<br/>\n </span></blockquote>I also think that extracting some private behaviour into its own class<br/>\nis a good idea, and a good design decision (at times).  It helps in<br/>\nmaintaining coherence: if a method doesn&#39;t quite fit, move it to another<br/>\nclass.<br/>\n<br/>\nAnd although I also prefer taking the time going through my code, not<br/>\nthrough my tools, sometimes I would like to extend my tools with some<br/>\nfeatures that would help me work even quicker (the reason I have tools<br/>\nin the first place).  This is why we share our thoughts with others, to<br/>\nsee if it does seem like a useful feature (depending on votes in<br/>\nfavour).<br/>\n<br/>\n[May I add:  I actually practice testing public (i.e. non-private)<br/>\nmethods, and do not require the private testing functionality.  But I<br/>\nbelieve that it should be considered for those who may prefer to code<br/>\nthat way.  <br/>\n<br/>\nOT-- On this note: another topic that props up frequently is that of<br/>\nparallel source trees.  Some readers seem to have difficulties<br/>\nunderstanding this concept.  Is this mentioned in any of the existing<br/>\ndocumentation, and could a link be added on the welcome letter?  ]<br/>\n<br/>\n---<br/>\n[1] The Selfish Class (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.laputan.org/selfish/selfish.html)\">http://www.laputan.org/selfish/selfish.html)</a> or<br/>\nsearch Google for the PDF.<br/>\n<br/>\n<br/>\nManuel Amago.<br/>\nmailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamago@...\">mamago@...</a></div>", 
    "prevInTime": 4560, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1017779304", 
    "canDelete": false, 
    "nextInTopic": 4562, 
    "prevInTopic": 4560, 
    "headers": {
        "inReplyToHeader": "PDNDQUEwQkIxLjQwMTAzMDBAbm1kcC5vcmc+", 
        "messageIdInHeader": "PDAwMDYwMWMxZGE4NCRmMTM2MjQwMCQxNTEyYThjMEBtYW1hZ28+"
    }
}