{
    "numMessagesInTopic": 52, 
    "nextInTime": 4563, 
    "senderId": "l8RJuFQSSe9Eyti0V8oQ1zBjpm9cyRfwRpBq1IVSey2igGdG1_MI_PHsO2JkkCDd2cFeMKnukVmfsHX3HlYov-R1CVbJ6XhgYyhiZGj0rN6HTrtG", 
    "systemMessage": false, 
    "subject": "RE: [junit] testing private methods", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbr@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "...  ... I m not sure how you can separate the two discussions. Could you tell me how Unit Testing can be discussed without discussing its impact on", 
    "msgId": 4562, 
    "profile": "nails762", 
    "topicId": 3179, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 89240252, 
    "messageBody": "<div id=\"ygrps-yiv-1442266374\"><blockquote><span title=\"ireply\">&gt;Subject: RE: [junit] testing private methods<br/>\n&gt;<br/>\n </span></blockquote>&lt;snip /&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;Many people on this list believe that unit testing the public API helps<br/>\n&gt;the overall design of the system (low coupling, high cohesion, ...), and<br/>\n&gt;helps decouple solutions from their different implementations.  Many<br/>\n&gt;interesting points and suggestions have been raised over this issue,<br/>\n&gt;however, they belong to a Testing&Design discussion, not a Unit Testing<br/>\n&gt;discussion.<br/>\n<br/>\n </span></blockquote>I&#39;m not sure how you can separate the two discussions. Could you tell me how <br/>\nUnit Testing can be discussed without discussing its impact on design?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;In the light of Unit Testing, if people want to unit test private<br/>\n&gt;methods, so be it.<br/>\n </span></blockquote>&lt;snip /&gt;<br/>\n<br/>\nNobody is saying, &quot;Thou shalt not test private methods.&quot; But bear in mind <br/>\nthat JUnit was not built for that purpose. Not only that, its creators feel <br/>\n(well Kent, anyway; I don&#39;t know how Erich feels) that one of the strengths <br/>\nof JUnit is that when the tests become painful to write, there is a tendency <br/>\nfor the design to have an organic weakness that prevents the testing. As <br/>\nKent says in this case, it&#39;s an opportunity to learn about your design.<br/>\n<br/>\nIf you are going to say, &quot;Take your testing/design discussions elsewhere,&quot; I <br/>\ncould easily reply with, &quot;Take your testing-private-methods discussion <br/>\nelsewhere -- JUnit doesn&#39;t do it.&quot; Of course, that is NOT what I am doing. I <br/>\nwould prefer to have both discussions than neither.<br/>\n<br/>\nThere are other test frameworks that provide support, or will provide <br/>\nsupport, for testing private methods. JUnit does not. I hope it never does. <br/>\nThat&#39;s a personal opinion. If it did, then I would be tempted to use it and <br/>\nall of a sudden design is tougher than it needs to be, because one of my <br/>\nfavorite tools no longer forces me to think.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;The JUnit documentation could point out some of the<br/>\n&gt;issues and uses of Unit Tests and how they help with the overall design<br/>\n&gt;of a system (they may already do so, but its been a while since I last<br/>\n&gt;looked), but the tool is for Unit Testing, and as such, should allow<br/>\n&gt;people to use it as they will, so long as they know what they are up to.<br/>\n<br/>\n </span></blockquote>It&#39;s all in how you define &quot;unit&quot;. To me, it&#39;s the exported methods of a <br/>\nclass or interface. Kent and Erich may define it differently. Clearly, you <br/>\ndefine it differently. Over the last few years the emphasis appears always <br/>\nto have been on testing observable behavior -- you can look it up. By <br/>\ndefinition, private methods do not provide directly observable behavior, and <br/>\nare therefore out of JUnit&#39;s scope.<br/>\n<br/>\nYou folks can test private methods until your brain pops out, but just don&#39;t <br/>\nexpect JUnit to do it out of the box. It was never designed for that. It was <br/>\nnever designed for that *on purpose*. I don&#39;t know why that is such a big <br/>\ndeal. You don&#39;t like it, that&#39;s cool. Use something else, but don&#39;t mess up <br/>\nJUnit.<br/>\n<br/>\nJ. B. Rainsberger<br/>\nPresident, Diaspar Software Services<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com\">http://www.diasparsoftware.com</a><br/>\nLet&#39;s build software that people understand<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nMSN Photos is the easiest way to share and print your photos: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://photos.msn.com/support/worldwide.aspx\">http://photos.msn.com/support/worldwide.aspx</a></div>", 
    "prevInTime": 4561, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1017782704", 
    "canDelete": false, 
    "nextInTopic": 4563, 
    "prevInTopic": 4561, 
    "headers": {
        "messageIdInHeader": "PEY4OU9BbmpMR1hZQjFKNU5QQWswMDAwNGM2ZUBob3RtYWlsLmNvbT4="
    }
}