{
    "numMessagesInTopic": 52, 
    "nextInTime": 4568, 
    "senderId": "fbbmIJ3WMnT_RM6ZBMwFhGhI5PQ0rADbY1PwFVI-u7kQ0JXiln_NN1vwT8Xc2rDangc5HxkZrFGBBtjUzttP32wIbPsWqZk_", 
    "systemMessage": false, 
    "subject": "Re: [junit] testing private methods", 
    "from": "David Stagner &lt;dstagner@...&gt;", 
    "authorName": "David Stagner", 
    "msgSnippet": "... It would be nice. I just don t see any way to do it without making JUnit tremendously stinky and ugly and dangerous. :( Of course, if you take my position", 
    "msgId": 4567, 
    "profile": "d_stagner", 
    "topicId": 3179, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 75470680, 
    "messageBody": "<div id=\"ygrps-yiv-449275299\">Manuel Amago wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;[...] The smell is in the tension between the <br/>\n&gt;&gt;desired source code layout and the access rules of the <br/>\n&gt;&gt;language. I don&#39;t see how JUnit is responsible for this smell,<br/>\n&gt;&gt;or a JUnit-based solution <br/>\n&gt;&gt;(like, say, hacking it to use reflection in order to break access <br/>\n&gt;&gt;control) that doesn&#39;t bring along serious code smells of its own.<br/>\n&gt;&gt;<br/>\n&gt; <br/>\n&gt; This problem is definitely not a JUnit problem.  It is just that it<br/>\n&gt; would be nice if JUnit could handle this problem (Works Out of The<br/>\n&gt; Box[1]).<br/>\n<br/>\n<br/>\n </span></blockquote>It would be nice. I just don&#39;t see any way to do it without making JUnit <br/>\ntremendously stinky and ugly and dangerous. :(<br/>\n<br/>\nOf course, if you take my position that wanting to test private methods <br/>\nfrom a separate package altogether is a bad smell, then it does Work Out <br/>\nof the Box. :}  It&#39;s doing *exactly* what i would want it to do - making <br/>\nme think about Why as well as How, and preventing shortcuts.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Another tension is that of consistency: if you code ALL your test<br/>\n&gt; classes as Inner classes, you may well use them to test private access<br/>\n&gt; methods also.  If you don&#39;t, however, you add an extra smell and<br/>\n&gt; inconsistent use of Inner/Test classes.  This could become a maintenance<br/>\n&gt; problem.<br/>\n<br/>\n<br/>\n </span></blockquote>I agree, whatever mechanism you use for associating test classes with <br/>\nthe classes tested, it should be applied consistently. Personally, i <br/>\nwrite my test classes as same package, same directory. I don&#39;t find it <br/>\nclutters because i can exclude the test classes from jars via Ant, and i <br/>\nwind up with both the test class and the tested class in open editor <br/>\nsessions all the time anyway. (i would actually argue that the coupling <br/>\nbetween class heirarchy and source code file names in Java is a smell in <br/>\nitself, albiet a minor one. Certainly, this wouldn&#39;t be so much of an <br/>\nissue if we could just stick an inner class in a separate directory).<br/>\n<br/>\nTaken this way, whether or not to unit test private methods becomes a <br/>\nconscious decision that should be made at the beginning of development. <br/>\nIf you&#39;re going to test private methods from the start, then you should <br/>\ndo all your test classes as inner classes (and accept the smell of large <br/>\nclass files). If not, then you should treat the need to test a private <br/>\nmethod as a smell to be treated. I don&#39;t feel either is a terrible <br/>\nsolution, although changing your mind in the middle of a project is painful.<br/>\n<br/>\n-- <br/>\n<br/>\nDavid Stagner<br/>\n<br/>\nNational Marrow Donor Program<br/>\n3001 Broadway Street NE<br/>\nBroadway Ridge Suite 500<br/>\nMinneapolis, MN  55413<br/>\n<br/>\nEmail: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dstagner@...\">dstagner@...</a></div>", 
    "prevInTime": 4566, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1017785025", 
    "canDelete": false, 
    "nextInTopic": 4568, 
    "prevInTopic": 4565, 
    "headers": {
        "messageIdInHeader": "PDNDQUEyQUMxLjgwNTAwMDdAbm1kcC5vcmc+", 
        "referencesHeader": "PDAwMDYwMWMxZGE4NCRmMTM2MjQwMCQxNTEyYThjMEBtYW1hZ28+"
    }
}