{
    "numMessagesInTopic": 4, 
    "nextInTime": 465, 
    "senderId": "GcJbzlzlo9wG2aB32w6qcq2i2ECy1PRiyzqbpI11SPQtQNkeW3G7VSLH3VykgQZctzscxXnbqOPdzeYjApvptM7KkHkOR38JTp4", 
    "systemMessage": false, 
    "subject": "Constructing JUnit tests from test data", 
    "from": "Lyndon Drake &lt;lyndon@...&gt;", 
    "authorName": "Lyndon Drake", 
    "msgSnippet": "Hi, I have a large file of test data pairs, consisting of input and expected output.  I want to use JUnit to test a function which operates on the input, and", 
    "msgId": 464, 
    "topicId": 464, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-2083172704\">Hi,<br/>\n<br/>\nI have a large file of test data pairs, consisting of input and expected<br/>\noutput.  I want to use JUnit to test a function which operates on the<br/>\ninput, and compare the output of the function with the expected output<br/>\nfor each test data pair.<br/>\n<br/>\nI can easily write a test method which will iterate over the test data,<br/>\nbut as soon as one piece of test data causes a test failure the test<br/>\nwill terminate.  I wish to have a separate JUnit test executed for each<br/>\nline of test data, which will generate information on the proportion of<br/>\ntest data instances passed and failed (instead of the current situation,<br/>\nwhere I only know whether the entire test data set has passed or<br/>\nfailed).  In other words, whenever the function fails on a line of test<br/>\ndata, I want to increment the failure count, while continuing on to<br/>\ncheck all the other lines of test data.<br/>\n<br/>\nThe only idea that has occurred to me is to write a small program that<br/>\nwill generate a JUnit test class based on the test data: that is, it<br/>\nwill generate one test function per line of input.  This seems<br/>\ninefficient in terms of code size (I have many thousands of test<br/>\ninstances already, and may have several million in the longer term).<br/>\n<br/>\nJUnit is being used throughout the project, so I want to use JUnit for<br/>\nthis testing if possible.<br/>\n<br/>\nCan anyone suggest a way to get this working?<br/>\n<br/>\nThanks,<br/>\nLyndon</div>", 
    "prevInTime": 463, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "982242176", 
    "canDelete": false, 
    "nextInTopic": 466, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDIwMDEwMjE1MTMwMi5OQUExMDY3NEBwYzI2OC5jcy55b3JrLmFjLnVrPg=="
    }
}