{
    "numMessagesInTopic": 36, 
    "nextInTime": 4786, 
    "senderId": "BxNLJRAEnrLHpGaXogqgQUiKyHVymJ-DPuGGfwaeOyw09duwJgkD2VsvSGBaxaMOqz_hrGr5zAs0BDoFWsyvRkOn15-d8A", 
    "systemMessage": false, 
    "subject": "Re: [junit] fundamental questions on JUnit", 
    "from": "Mike Clark &lt;mike@...&gt;", 
    "authorName": "Mike Clark", 
    "msgSnippet": "... Test the side-effect of the work.  This may involve querying an instance variable or passing in a mock object somewhere to collect the results of the work.", 
    "msgId": 4785, 
    "profile": "clarkware", 
    "topicId": 4781, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 33026788, 
    "messageBody": "<div id=\"ygrps-yiv-877171164\">juwo77 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; 1) JUnit seems to test &quot;functions&quot; that return a value. How will you<br/>\n&gt; test &quot;procedures&quot; that do work instead?<br/>\n<br/>\n </span></blockquote>Test the side-effect of the work.  This may involve querying an instance<br/>\nvariable or passing in a mock object somewhere to collect the results of the<br/>\nwork.  The latter is sometimes useful to avoid breaking encapsulation.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; (It is &#39;against the rules&#39; to change the design of them to return<br/>\n&gt; values - a testing tool should not force code changes.)<br/>\n<br/>\n </span></blockquote>(I&#39;ll assume you are the designer in this case.)<br/>\n<br/>\nJUnit is as much a design tool as it is a testing tool.  Your tests are<br/>\neffectively asking the code questions, the expected answers to which are<br/>\nasserted.  If it&#39;s difficult to ask a question such that the right answer can<br/>\neasily be asserted, then the code is communicating something very important<br/>\nabout the design.  Writing tests first, I&#39;m constantly changing the design of<br/>\nthe code, in very small steps.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 2) How will you test procedures that are composed of several<br/>\n&gt; functions?<br/>\n<br/>\n </span></blockquote>I generally have a test for each method, and then a test for the composite<br/>\nmethod.  Sometimes not.  It&#39;s a judgment call.  For me, it really depends on<br/>\nthe test-first path I&#39;m on when those methods are born.<br/>\n<br/>\nI recommend trying both ways and see what works best for you.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; 3) Can JUnit ever replace stepping thru with a debugger?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I can&#39;t remember the last time I used a debugger.  I used to use a debugger<br/>\nquite often to step through the code and manually inspect that the variables<br/>\nalong the way contained the values I expected.  Once in a while I&#39;d even get<br/>\nlazy and dump a System.out.println() somewhere in the call stack to list all<br/>\nthe variables and their values.  Worse yet, I&#39;d go through this sanity check<br/>\nevery time something changed.  Then I recognized this as nothing more than<br/>\nmanually comparing expected vs. actual values.<br/>\n<br/>\nSo I started to resist the urge to fire up the debugger and instead try to<br/>\nwrite an automated test.  Sometimes I just put the assertion directly in the<br/>\ncode as a way to start thinking about what I would need to write a unit<br/>\ntest.  Often times the design changes to make the code more testable. Short<br/>\nand cohesive methods were one immediate improvement.  In return the design<br/>\nseems to exhibit some desirable properties.<br/>\n<br/>\nWriting the tests first really speeds up this feedback loop.  It distills<br/>\ntestable code and better designs from the beginning.  I write all new code<br/>\nthis way these days.  If I&#39;m debugging existing code, I&#39;ll try my best to<br/>\nfind a way to write automated tests to retain the value of the debugging<br/>\nsession over time.<br/>\n<br/>\nMike<br/>\n<br/>\n--<br/>\nMike Clark<br/>\nClarkware Consulting, Inc.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.clarkware.com\">http://www.clarkware.com</a><br/>\n720.851.2014</div>", 
    "prevInTime": 4784, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1020179716", 
    "canDelete": false, 
    "nextInTopic": 4788, 
    "prevInTopic": 4784, 
    "headers": {
        "messageIdInHeader": "PDNDQ0VCNTA0LjQ0NzEwQkY3QGNsYXJrd2FyZS5jb20+", 
        "referencesHeader": "PGFhazVwaStkMm4zQGVHcm91cHMuY29tPg=="
    }
}