{
    "numMessagesInTopic": 13, 
    "nextInTime": 4798, 
    "senderId": "oGU7LcEblMISStLeNmZp37YA-tLOPfOIoxZr3gEqKDGakVXZP9P-4Rs2h5cfUcyvB0fOhs6IJk4PnwQRLMi0ZdFFIw3To8Eg5DBSYqlxxW263LWX", 
    "systemMessage": false, 
    "subject": "Where the code meets the file", 
    "from": "&quot;David V. Olivier&quot; &lt;dolivier@...&gt;", 
    "authorName": "David V. Olivier", 
    "msgSnippet": "The rule of thumb is that unit tests should be as standalone as possible, and dependencies on external resources such as databases or files should be minimized", 
    "msgId": 4797, 
    "profile": "slimbola", 
    "topicId": 4797, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 84380000, 
    "messageBody": "<div id=\"ygrps-yiv-1627265360\">The rule of thumb is that unit tests should be as standalone as possible, <br/>\nand dependencies on external resources such as databases or files should be <br/>\nminimized or eliminated.  This makes perfect sense.  Tests which rely on <br/>\nexternal resources are  not self-contained, are harder to read, and can be <br/>\nbroken even if the code is functioning correctly.  However, code does touch <br/>\nexternal resources at some point.  Shouldn&#39;t this be tested, and how?<br/>\n<br/>\nSpecifically, I have code that parses a xml catalog file and builds a <br/>\ncatalog object structure.  I want to verify that the parsing works <br/>\ncorrectly.  In particular, I want to make sure that it robustly handles <br/>\nunusual conditions such as catalogs with certain branches missing.  It <br/>\nseems to me that the simplest way to do this is to have a test which uses <br/>\nthe parsing code to parse a very simple catalog and verifies that it builds <br/>\nwhat I expect it to.<br/>\n<br/>\nBut to do this test I do need some external resource, a simple catalog <br/>\nfile.  Ok.  Now I can&#39;t simply look at the test to see what it does.  I <br/>\nalso have to look at the file.  Are there cleaner alternatives?  Must I <br/>\nsimply accept that there will occasionally be external resources required <br/>\nto test functionality at the boundaries of the system?  If so, are there <br/>\nbest practices for this scenario?  Am I missing something?  I&#39;d love to <br/>\nhear peoples thoughts.<br/>\n<br/>\n<br/>\n<br/>\nDavid Olivier<br/>\nNaval Research Laboratory<br/>\nDigital Mapping, Charting & Geodesy Analysis Program<br/>\nCode 7440.2</div>", 
    "prevInTime": 4796, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1020288601", 
    "canDelete": false, 
    "nextInTopic": 4799, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDUuMS4wLjE0LjIuMjAwMjA1MDExNjExMDEuMDBhOGYyNzBAY3lwcmVzcy5ucmxzc2MubmF2eS5taWw+"
    }
}