{
    "numMessagesInTopic": 46, 
    "nextInTime": 4852, 
    "senderId": "O1Y7XnZ2PX1UY9RzqLf5HEVaa9_VgsgMPlr5rxG9mRhud2tmeNktTGNq-1jNm_WBazkGbCtXJJRv-F4gKsJihU5NbwVQAJmQ-4HSkA", 
    "systemMessage": false, 
    "subject": "Re: [junit] black box or white box?", 
    "from": "Berin Loritsch &lt;bloritsch@...&gt;", 
    "authorName": "Berin Loritsch", 
    "msgSnippet": "... Yes, that is part of the difference.  Like I said it was a _quick_ summary. ... Yes.  That is an example of whitebox testing. ... My viewpoint: I focus on", 
    "msgId": 4851, 
    "profile": "bloritsch", 
    "topicId": 4836, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 64910131, 
    "messageBody": "<div id=\"ygrps-yiv-1606967738\">Daniel Barclay wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Isn&#39;t part of the difference that for black box testing, you don&#39;t know<br/>\n&gt; how it works, just what it does, so you can only test based on interesting<br/>\n&gt; case and boundary conditions on the inputs.  In white box testing, you<br/>\n&gt; know how it works, so you can test based on knowing that different inputs<br/>\n&gt; get processing differently.<br/>\n<br/>\n </span></blockquote>Yes, that is part of the difference.  Like I said it was a _quick_<br/>\nsummary.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; For example, for some index class, if you know it uses a linear list up<br/>\n&gt; to 5 items and then a hash table, choosing to test with 4 items to test<br/>\n&gt; the list case and also test with 5 items to test the hash table case is<br/>\n&gt; white box testing.<br/>\n<br/>\n </span></blockquote>Yes.  That is an example of whitebox testing.<br/>\n<br/>\n------------------------------<br/>\n<br/>\nMy viewpoint:<br/>\n<br/>\nI focus on component development.  Components differ from objects in two<br/>\nkey areas: they live in a container, and all their contracts are<br/>\nspecified by an interface.  The container controls how they live and<br/>\ndie, and which implementation of the component is used.  Quick<br/>\nanalogy:<br/>\n<br/>\nImagine buying a radio.  We all know how a radio works.  It&#39;s interface<br/>\nis the same no matter where you go--you have a control to change the<br/>\nstation and a control to change the volume.  There are several models<br/>\nof the radio, and in a store, there are many instances of each model.<br/>\n<br/>\nThe Component is the radio.  It is composed of an interface (separate<br/>\nfrom the actual implementation of the component), and its implementation<br/>\n(the model of radio).  A container picks which model to give you,<br/>\ncreates the instance, and lets you use it.<br/>\n<br/>\nYou can only really do black box testing in this type of environment.<br/>\nYou have the advantage of knowing what the component does.  You don&#39;t<br/>\nknow how it does it--and from the perspective of using the component<br/>\nyou don&#39;t care.<br/>\n<br/>\nI have created a test harness using JUnit for my components, so that I<br/>\ncan test several component types with one TestCase.  It&#39;s a beautiful<br/>\nthing.<br/>\n<br/>\nNow, If I tried to write a white-box test on my component, I run into<br/>\nsome serious setbacks.  That white-box (or micro test) is tied to the<br/>\ncomponent implementation.  I cannot reuse that test on another<br/>\nimplementation of the same component interface.  That is a serious<br/>\ndrawback to me.<br/>\n<br/>\n--------------------------------<br/>\n<br/>\nDifferent tools for different fools:<br/>\n<br/>\nJUnit is designed for blackbox testing.  That is how it should be used.<br/>\nThe new JDK 1.4 assertion facilities are for whitebox testing.  That is<br/>\nhow they should be used.<br/>\n<br/>\n<br/>\n-- <br/>\n<br/>\n&quot;They that give up essential liberty to obtain a little temporary safety<br/>\n  deserve neither liberty nor safety.&quot;<br/>\n                 - Benjamin Franklin</div>", 
    "prevInTime": 4850, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1020399320", 
    "canDelete": false, 
    "nextInTopic": 4852, 
    "prevInTopic": 4849, 
    "headers": {
        "messageIdInHeader": "PDNDRDIwRUQ4LjQwOTA1MDFAYXBhY2hlLm9yZz4=", 
        "referencesHeader": "PEQ1Nzc2RDA5RDA4NEE3NDBCNUQ3RjI5MjY2ODBGQ0YzRkRGQjU0QG11czAwMW11bGxldC5tZXJjYXRvci5jb20+"
    }
}