{
    "numMessagesInTopic": 46, 
    "nextInTime": 4885, 
    "senderId": "zNY9JR0txxVH9smcRiTGANZlAv3iAeztp50d6sQgoUlnV40oW_w4vL01HhKFZeN0I3l-SnxSTwNQXXCjTznR3bl0Vf_yjlQyvqmjpPh3", 
    "systemMessage": false, 
    "subject": "RE: [junit] black box or white box?", 
    "from": "&quot;Berin Loritsch&quot; &lt;bloritsch@...&gt;", 
    "authorName": "Berin Loritsch", 
    "msgSnippet": "... They can be made solid enough.  I myself also do iterative development.  I work toward the usage of the component before I focus on 100% functionality. ...", 
    "msgId": 4884, 
    "profile": "bloritsch", 
    "topicId": 4836, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 64910131, 
    "messageBody": "<div id=\"ygrps-yiv-1056231303\"><blockquote><span title=\"ireply\">&gt; From: Johannes Link [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:john.link@...\">john.link@...</a>] <br/>\n&gt; <br/>\n&gt; Sometimes the (public) contract cannot be made sufficiently <br/>\n&gt; strong beforehand. Especially when the objects and interfaces <br/>\n&gt; are in the midst of evolving.<br/>\n<br/>\n </span></blockquote>They can be made solid enough.  I myself also do iterative<br/>\ndevelopment.  I work toward the usage of the component before<br/>\nI focus on 100% functionality.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Well, maybe the difference of our views lies in the fact that <br/>\n&gt; I personally do as much test-driven, i.e. test-first <br/>\n&gt; development as possible where the design and thus the <br/>\n&gt; contracts come slowly into being (and often disappear <br/>\n&gt; quickly). Martin Fowler calls that evolutionary design and I <br/>\n&gt; guess that I often don&#39;t take the time to get the contracts <br/>\n&gt; straight and tight enough.<br/>\n<br/>\n </span></blockquote>That is a slight difference in approach.  I look at the interface<br/>\nfirst, then the testing, and finally the implementation.  I tend<br/>\nto look at my system somewhat like a play.  Each component has<br/>\na &quot;role&quot; to play in the system.  Each role interacts with other<br/>\nroles in a predefined manner (aka script or contract).  I also<br/>\ntend to have several small components or interfaces, and have<br/>\nthem delegate to other components as need be.  That makes it<br/>\neasier to understand/design.<br/>\n<br/>\nTo me, the interface is the criteria I have for making the tests.<br/>\nNow, until the component is ready, the interface is marked as<br/>\na developmental interface.  That means that the test and the<br/>\ninterface can change.  I work torwards stablizing the interface<br/>\nASAP.  I also use the Java &quot;interface&quot; keyword to define my<br/>\ninterfaces.<br/>\n<br/>\ninterface Store<br/>\n{<br/>\n    void store(String key, Object val);<br/>\n    Object retrieve(String key);<br/>\n    void remove(String key);<br/>\n}<br/>\n<br/>\nThat interface is enough to know how to use the object store.<br/>\nIf I need a guarantee that an object store keeps the object<br/>\nreferences persistently, I use another interface to represent<br/>\nthat additional contract:<br/>\n<br/>\ninterface PersistentStore extends Store {}<br/>\n<br/>\nThat way I have the option of using a memory bound storage,<br/>\na cache like storage, or a more permanent storage.<br/>\n<br/>\nIf I need the guarantee of permanance, I use a component that<br/>\nimplements the PersistentStore interface.<br/>\n<br/>\nIt just helps me get there quicker.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Since your examples are taken from Excalibur I suppose that <br/>\n&gt; you, Berin, are following a component-oriented and more <br/>\n&gt; &quot;design-up-front&quot; development strategy. It could be that this <br/>\n&gt; difference results in different testing strategies as well.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Yes I am.  The two examples I gave though are not components<br/>\nin the classic sense.  They are utility classes that other<br/>\ncomponents can use.<br/>\n<br/>\nThere are different needs with component testing than with<br/>\nregular class testing.  I believe I posted a very quick<br/>\nsummary of the difference between components and objects<br/>\nin another post to the list.</div>", 
    "prevInTime": 4883, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1020719399", 
    "canDelete": false, 
    "nextInTopic": 4885, 
    "prevInTopic": 4883, 
    "headers": {
        "inReplyToHeader": "PDAwMTMwMWMxZjUzYiRiNDRjNzYzMCRlOTA4YWNkNEBoYWliYWNoPg==", 
        "messageIdInHeader": "PDAwNTgwMWMxZjU0MiQ2MWViMWVkMCRhYzAwYThjMEBHYWJyaWVsPg=="
    }
}