{
    "numMessagesInTopic": 7, 
    "nextInTime": 4904, 
    "senderId": "qqMYZOeECIVR5Z73uBGqlS4wQEd3iN67c-YRbavxD3ltI-nftWV4MeJ_i8sFjw4iwClw9eKuHktjYNIldb8tHqF76gMYUdvs", 
    "systemMessage": false, 
    "subject": "Re: [junit] Test cases size and design", 
    "from": "Robert Wenner &lt;robert@...&gt;", 
    "authorName": "Robert Wenner", 
    "msgSnippet": "... Hm, the tiles don differ in behaviour or responsibility. In fact the only difference is hidden in the static makeXyzTile methods which add roads or city", 
    "msgId": 4903, 
    "topicId": 4889, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 106175661, 
    "messageBody": "<div id=\"ygrps-yiv-2134162516\">On Tuesday 07 May 2002 10:45, Frank Gerhardt wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Without having thougt too much about it, but maybe it would make<br/>\n&gt; sense to have different classes for the different *kinds of*<br/>\n&gt; tiles. Polymorphism could be used nicely for summing up the<br/>\n&gt; different points at the end. Just a thought.<br/>\n<br/>\n </span></blockquote>Hm, the tiles don differ in behaviour or responsibility. In fact<br/>\nthe only difference is hidden in the static makeXyzTile methods<br/>\nwhich add roads or city parts to the cards.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you have different levels of abstraction in one test I would<br/>\n&gt; suggest to extract the lower level stuff to a separate method.<br/>\n<br/>\n </span></blockquote>I split the test cases in two classes. The first one tests the creation <br/>\nof tiles and makes sure a left turning road really turns left and the <br/>\nlike.<br/>\nThe other class subclasses the tiloe class and tests its protected<br/>\nmethods trying to create illegal cards (e.g. road and city part in the <br/>\nsame direction).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess you will need this anyway in your application. Just put<br/>\n&gt; it into the test class and if necessary refactor it to the tile<br/>\n&gt; class.<br/>\n </span></blockquote>I think you are right.<br/>\nI made a method returning the number of roads and cities on a tile. <br/>\nThis reduced test cases by 7 lines each. Looks better now.<br/>\nIn fact this method is likely to be needed for determinating whether a <br/>\ntile can be placed in a position. If the number of roads required does <br/>\nnot even match the program does not have to turn the card to see it <br/>\nfits in no direction.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Would you rely on some orientation of created tiles, e.g. assume<br/>\n&gt; &gt; the left turning road is always constructed as from east turning to<br/>\n&gt; &gt; south (maybe this is like the Blackbox / Whitebox discussion)?<br/>\n&gt;<br/>\n&gt; What about keeping the orientation in the board? I think the<br/>\n&gt; orientation is not so much an attribute of a tile but of the<br/>\n&gt; placement of the tile on the board.<br/>\n </span></blockquote>Yes. I meant: if a makeXyz method creates a tile with a left turning <br/>\nroad and a city part, do you have a look at the source code creating <br/>\nthe tile and rely on the knowledge that the city will always be in <br/>\nnorth and the road will always be south - west or dou you allow every <br/>\ncity locaction as long as the road still turns left below the city?<br/>\n<br/>\nRobert</div>", 
    "prevInTime": 4902, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1020842892", 
    "canDelete": false, 
    "nextInTopic": 4908, 
    "prevInTopic": 4898, 
    "headers": {
        "inReplyToHeader": "PGlkNGZkdTg5Ym05aWU5aW83MnI3dWxwa2V0a2JrYzk5cjFANGF4LmNvbT4=", 
        "messageIdInHeader": "PDIwMDIwNTA4MDcyOC5nNDg3U0RMMjI1ODFAdGlhbWF0LnBvcnQyNS5jb20+", 
        "referencesHeader": "PDIwMDIwNTA3MDczNS5nNDc3WlVLMTcxMTdAdGlhbWF0LnBvcnQyNS5jb20+IDxpZDRmZHU4OWJtOWllOWlvNzJyN3VscGtldGtia2M5OXIxQDRheC5jb20+"
    }
}