{
    "numMessagesInTopic": 2, 
    "nextInTime": 4992, 
    "senderId": "2EuD5dQoUOJml4cDLmDsNTppZfHm_RdRW2TMnbpUx_SJMImkE69Ppf_3fkmRHKMjfoIzcGzhUQP5QXgzh7Uk71soq23hm5if2mes-sLrzSM", 
    "systemMessage": false, 
    "subject": "Test EJB 2.0 entity Beans with JUnit and ServerTestCase extension", 
    "from": "&quot;Chesterxgchen&quot; &lt;chesterxgchen@...&gt;", 
    "authorName": "Chesterxgchen", 
    "msgSnippet": "Hi, I was able to test Entity bean local interface (CMP) in EJB 2.0 with Junit interface. This does not require web, jsp or servlet as most of the framework", 
    "msgId": 4991, 
    "profile": "Chesterxgchen", 
    "topicId": 4991, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 64831815, 
    "messageBody": "<div id=\"ygrps-yiv-586318048\">Hi, <br/>\n    I was able to test Entity bean local interface (CMP) in EJB 2.0 <br/>\nwith Junit interface. <br/>\n<br/>\n    This does not require web, jsp or servlet as most of the <br/>\nframework proposed. Hence no war file etc.<br/>\n<br/>\n    This can be down easily with ServerTestCase framwork extension, <br/>\neven the original ServerTestCase extension post did not indicate this <br/>\ncan be down. <br/>\n<br/>\n    Testing regular java class with Junit is easy; Testing EJB <br/>\nsession can be down easily as well. But testing EJB entity bean with <br/>\nlocal interface is not as easy, simply because there is no remote <br/>\ninterface to be invoked. <br/>\n<br/>\n    There are several approaches to test EJB local interfaces: <br/>\n<br/>\n   1. Write an session bean as EJB entity bean&#39;s proxy and test <br/>\nagainst the session bean proxy. This approach is not good, as every <br/>\nchange in entity bean interfaces, one has to change session bean as <br/>\nwell as test cases. <br/>\n<br/>\n   2. Another one is to dyanmically invoked the test cases inside the <br/>\nserver. <br/>\n<br/>\n   The ServerTestCase extension using an EJB session bean to allow <br/>\ntest cases be involked inside the application container, through the <br/>\nthis particular session Bean. This fit perfectly for the second <br/>\napproach. <br/>\n<br/>\n    I tried it out and it works for me. <br/>\n<br/>\n   The only things need to watch out are: <br/>\n<br/>\n   1. Test case needs extends ServerTestCase not TestCase<br/>\n   2. Test case are intended to be called inside server, so <br/>\n       Context ctx = new InitialContext() should have no arguments<br/>\n   3. TestCase needs to be deployed to application server<br/>\n   4. According EJB 2.0 spec (correct me if i miss understand it)<br/>\n         The session bean should declare ejb-ref or ejb-local-ref<br/>\n      for all the EJB entity beans used. <br/>\n<br/>\n       This is going to be a drag if we constant need to change <br/>\ndeployment descriptor for the ServerTestCase&#39;s session bean when we <br/>\nadd new entity beans.  But the good news is some application server<br/>\nsuch as Weblogic 6.1 SP2 does not seem to reply on this to find the <br/>\nejb beans. So One can uses one type of application server to test and <br/>\ndevelop. <br/>\n<br/>\n       I am using weblogic 6.1, and I did not declare ejb-ref or ejb-<br/>\nlocal-ref. It works fine for me. <br/>\n<br/>\n<br/>\n    Hope this helpful for someone out there. <br/>\n<br/>\n<br/>\nChester</div>", 
    "prevInTime": 4990, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1021852133", 
    "canDelete": false, 
    "nextInTopic": 5637, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGFjOWRsNSthYnZsQGVHcm91cHMuY29tPg=="
    }
}