{
    "numMessagesInTopic": 2, 
    "nextInTime": 503, 
    "senderId": "5WDKhk75Z_KjL4Y-6Xxle_zD5U1D9aqG1_cIqQn7bJfP4y-nf7-2MZV9rjekZc6JcDXqcO7mYLKyHS0", 
    "systemMessage": false, 
    "subject": "Re: [junit] Test selection (Are TestSuites Useless?)", 
    "from": "mrettig@...", 
    "authorName": "mrettig@homemail.com", 
    "msgSnippet": "... Sounds like a very interesting idea. Is it possible to use something other than a property string? The same type of functionality could be achieved using", 
    "msgId": 502, 
    "topicId": 497, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-57988353\"><font size=\"2\" face=\"sans-serif\">kconner wrote:</font>\n<br><font size=\"2\" face=\"Courier New\">&gt;The basic idea is you invoke junit with a property string (for example <br>\n<blockquote><span title=\"ireply\"> &gt;-Dfilter=inProgress) and your test class and it would run all the <br>\n&gt;tests that pass the filter. &nbsp;Properties are associated with tests <br>\n&gt;using the same &quot;pluggable&quot; pattern currently used to create TestCases. <br>\n&gt; That is, the run method is found dynamically based on the name of the <br>\n&gt;TestCase and so are the properties meant to be used as a filter. &nbsp;<br>\n&gt;Properties can be associated with all the tests in the TestCase and/or <br>\n&gt;the individual test methods. &nbsp;These are combined and then checked <br>\n&gt;against the filter. &nbsp;</span></blockquote></font>\n<br>\n<br> <font size=\"2\" face=\"Courier New\">Sounds like a very interesting idea. Is it possible to use something other than a property string? The same type of functionality could be achieved using interfaces, though not at a method level. Typos make Strings a liability. An obscure bug like typing &quot;Wimdows&quot; instead of &quot;Windows&quot; could easily be overlooked and thus lead to failed filters. One of my objections to suites is that they require maintenance and can introduce testing bugs if they are not properly maintained. I see that same type of liability here.</font>\n<br>\n<br><font size=\"2\" face=\"Courier New\">I&#39;ve learned to trust the compiler, so I use it whenever I can to tell me when I&#39;m wrong (and that is often).</font>\n<br>\n<br><font size=\"2\" face=\"Courier New\">Mike</font></div>", 
    "prevInTime": 501, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "982724706", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 497, 
    "headers": {
        "messageIdInHeader": "PE9GOTkyMUI2NDQuNURCQkMwRUQtT044NjI1NjlGQS4wMDBGQ0YwN0B0aG91Z2h0d29ya3MuY29tPg=="
    }
}