{
    "numMessagesInTopic": 3, 
    "nextInTime": 5142, 
    "senderId": "GGXTZZXagx0K83jE_cI7Io9CJC2e8atcuJQeZAPwxzmuggchWtL4dlSw-L7_i0az7pmoyuey30jozYYlsxpI-Q9hS9CwhfOGFXSx87dkjIU", 
    "systemMessage": false, 
    "subject": "Having trouble with junit architecture", 
    "from": "&quot;thenoodle1974&quot; &lt;thenoodle1974@...&gt;", 
    "authorName": "thenoodle1974", 
    "msgSnippet": "I m using junit to test a swing program. I have written a bunch of helper functions: click this, enter this, find that, etc. I d like those functions to be", 
    "msgId": 5141, 
    "profile": "thenoodle1974", 
    "topicId": 5141, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 115622976, 
    "messageBody": "<div id=\"ygrps-yiv-1157269558\">I&#39;m using junit to test a swing program. <br/>\n<br/>\nI have written a bunch of helper functions: click this, enter this, <br/>\nfind that, etc. I&#39;d like those functions to be available in every <br/>\ntest case. Along with that I&#39;d like to only start the application <br/>\nonce and run a suite. Then close the application.<br/>\n<br/>\nI&#39;ve made a subclass of JFCTestCase which has those helper functions. <br/>\nOne helper function is startApplication. If I run each test <br/>\nindividually, there is no problem. A testcase is created, I start the <br/>\napplication, it runs. I close the application done.<br/>\n<br/>\nBut if I try to separete starting the application I have threading <br/>\nissues. What I&#39;ve tried to do is startApplication, run the suite, <br/>\nthen close the application. But each time my sublcass of JFCTestCase <br/>\nis created, a new thread is created by JFCTestCase. This thread is <br/>\nthen run separately of the startApplication thread (not good). Does <br/>\nthis make sense?<br/>\n<br/>\nMy workaround was to create a class that passes in the reference to <br/>\nan object on this thread. Which works fine.<br/>\n<br/>\nSo I now:<br/>\n<br/>\nCreate MyTestCase (which does not extend JUnit in anyway.) It has <br/>\nit&#39;s own setUpo() and tearDown(). I then pass in a reference to XCase <br/>\n(which extends JUnit), and run the test. But now I&#39;m not really using <br/>\nJUnit at all. It&#39;s like I&#39;m creating my own suite object.<br/>\n<br/>\nAny ideas/help would be greatly appreciated.</div>", 
    "prevInTime": 5140, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1023725165", 
    "canDelete": false, 
    "nextInTopic": 5147, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGFlMmlwZCsyMjB1QGVHcm91cHMuY29tPg=="
    }
}