{
    "numMessagesInTopic": 27, 
    "nextInTime": 5170, 
    "senderId": "CowFt3hgJB3EktcgehGIe7JXDQphjtzJ8QK0TJSbtD05Dhx8nmQkPI-G42rI2fjesThTOBql6cFQNd_RSvQB1M1Oud-3In8", 
    "systemMessage": false, 
    "subject": "Re: R: [junit] gui testing", 
    "from": "Bob Koss &lt;koss@...&gt;", 
    "authorName": "Bob Koss", 
    "msgSnippet": "Back from work... let s continue the thread..... ... I pushed on Mediator a little too hard this morning. The purpose of a Mediator is to decouple individual", 
    "msgId": 5169, 
    "topicId": 5148, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 30216622, 
    "messageBody": "<div id=\"ygrps-yiv-1259375435\">Back from work... let&#39;s continue the thread.....<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 6/11/02 7:59 AM, &quot;Luca Sfarzo&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:luca.sfarzo@...\">luca.sfarzo@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Hi think that using a mediator could guarantee you from separating the<br/>\n&gt; mechanism for handling data that lies deep in the &quot;core&quot; of your application<br/>\n&gt; from the GUI details, but sometimes the behavior of a single form can be<br/>\n&gt; driven by a many-state state machine (so being very complex) and some<br/>\n&gt; transitions should rely on some other data liyng somewhere else in the depth<br/>\n&gt; of the application.<br/>\n<br/>\n<br/>\nI pushed on Mediator a little too hard this morning. The purpose of a<br/>\nMediator is to decouple individual controls from each other. We&#39;re talking<br/>\nabout a class that does more than that, we&#39;re talking about a class that<br/>\nsits between the domain knowledge and the gui. I call such a class a<br/>\nPresenter, after the Model-View-Presenter architecture. Martin Fowler calls<br/>\nthis an Application Façade. Whatever you call it, it knows how to get what<br/>\nit needs from the Model and it knows how to drive the gui. With that out of<br/>\nthe way, let&#39;s get specific.<br/>\n<br/>\n<br/>\n&gt; Here the problem arises.<br/>\n&gt; <br/>\n&gt; One example should be if I would test my GUI behavior when something<br/>\n&gt; somewhere else changes.<br/>\n&gt; <br/>\n&gt; I.e. I&#39;m editing some fields to be sent later to a server and the connection<br/>\n&gt; goes down. Ok the mediator can do the great part of the job but what if my<br/>\n&gt; current form should let me save the data into a file in order to retrieve<br/>\n&gt; them later? That kind of knowledge lies inside the form (it&#39;s its own<br/>\n&gt; responsibility, above all!) while the constraints come from the outer world.<br/>\n&gt; <br/>\n<br/>\nWell, you certainly COULD put the knowledge in the gui, but now we&#39;re back<br/>\nto having to test it and worrying about how to test it and maintain it - a<br/>\njob that you&#39;re probably finding out is very difficult.<br/>\n<br/>\nWhat if the Form gathers the information like it always does and sends it in<br/>\nthe form of a message to the Presenter, which checks for a good db<br/>\nconnection and decides what to do? I&#39;m back to a Presenter which is easy to<br/>\nunit test and a gui that&#39;s dumber than dirt.<br/>\n<br/>\n<br/>\n-- <br/>\nRobert Koss, Ph.D.     | Training, Mentoring, Contract Development<br/>\nSenior Consultant      | Object Oriented Design, C++, Java<br/>\nwww.objectmentor.com   | Extreme Programming </span></blockquote></div>", 
    "prevInTime": 5168, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1023838871", 
    "canDelete": false, 
    "nextInTopic": 5170, 
    "prevInTopic": 5166, 
    "headers": {
        "inReplyToHeader": "PE5CRU5MUE5CUFBLSkxLRENGSkRQTUVET0NBQUEubHVjYS5zZmFyem9AdHJzbmVhcG9saXMuaXQ+", 
        "messageIdInHeader": "PEI5MkJFNkI3LkU0OTcla29zc0BvYmplY3RtZW50b3IuY29tPg=="
    }
}