{
    "numMessagesInTopic": 67, 
    "nextInTime": 5261, 
    "senderId": "fAsxo4VN0GslWQCmKHCS0-DvBQkb3ImhU5Txh8K0oVGwc1k-sYxQR8H1PyohuWZ1CJ7_wXwjL-ek8y5z47azRMlErXkdscONuVZ-GCkCHzzi6qHW", 
    "systemMessage": false, 
    "subject": "Re: [junit] Are tests code or comment (was: distinguishing between failures and errors)", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbr@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... Tests *are* the superset of all proven usage. Anything not tested is undefined and should not be trusted. :) ... You re assuming that the writer writes", 
    "msgId": 5260, 
    "profile": "nails762", 
    "topicId": 5186, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 89240252, 
    "messageBody": "<div id=\"ygrps-yiv-1864175823\"><blockquote><span title=\"ireply\">&gt; &gt;From my point of view comments and documentation is the manual (the <br/>\n&gt; book), explaining how it should work and how it should be used.<br/>\n&gt; <br/>\n&gt; Tests may be examples on usage.<br/>\n<br/>\n </span></blockquote>Tests *are* the superset of all proven usage. Anything not tested is <br/>\nundefined and should not be trusted. :)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I always prefer plain text documentation, its often easier to <br/>\n&gt; explain in plain text how to use a class than with some hundred <br/>\n&gt; lines of test cases. (And it is often easier to read.)<br/>\n<br/>\n </span></blockquote>You&#39;re assuming that the writer writes well in the language you want to read. <br/>\nI just saw a notice for a job posting containing the following specification <br/>\nfor a problem to solve, submitted along with the resume:<br/>\n<br/>\n    Making use of JSP create an interface that would allow a user <br/>\n    to create, edit, and then display a set of nested tags without <br/>\n    the use of HTML in the forms. <br/>\n<br/>\nDo they think that&#39;s English they&#39;re writing? I asked an extremely capable <br/>\ncolleague of mine for his interpretation of this and it was entirely <br/>\ndifferent from mine. I&#39;m willing to bet that yours would fall somewhere in <br/>\nbetween. I still don&#39;t have a clear enough idea what it&#39;s asking me for to be <br/>\nable to write it. Test cases would have made this clearer!<br/>\n<br/>\nI admit that a product roadmap is essential to understanding a system when <br/>\nyou don&#39;t have the benefit of asking the authors. I am not trying to say that <br/>\nwritten documentation is entirely useless. I *am* disputing the claim that <br/>\nwritten documentation is *clearer* than code. Even poorly-written code can <br/>\nonly do one thing at a time; sufficiently-poorly-written documentation can <br/>\nmean almost anything.<br/>\n<br/>\nSadly, much of the documentation I read in my professional life is <br/>\nsufficiently-poorly-written. Much of the open source documentation I read, <br/>\nhowever, is quite good. Some of it is excellent.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; JB: You assume someone doing the tests careful but assume on the <br/>\n&gt; other hand JavaDoc to be (usually) crap? <br/>\n<br/>\n </span></blockquote>Yes, and for a simple reason: good code works even with bad documentation. <br/>\nGood documentation doesn&#39;t make bad code work. In times of crisis, <br/>\ndocumentation is not updated. Even if it is initially written well, it <br/>\nerodes. Tests cannot so easily erode if they are to be the definitive <br/>\ndemonstration of the presence of correctly-implemented features.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I would not trust in the <br/>\n&gt; tests if the JavaDoc was bad in the first case.<br/>\n<br/>\n </span></blockquote>Why not? Maybe the Javadoc was written in the author&#39;s fourth language, but <br/>\nhe is brilliant and articulates himself beautifully in Java! I have seen it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And even if both <br/>\n&gt; were ok I would not conclude from the absence of a test case that <br/>\n&gt; what would be tested is undefined behaviour -- it is way too easy to <br/>\n&gt; miss a test case / special condition / parameter combination.<br/>\n<br/>\n </span></blockquote>What else can you conclude? It seems to me that concluding otherwise only <br/>\nleads to pain. If the test is missing, then how do you know what the code <br/>\ndoes in that situation? Do you guess?<br/>\n<br/>\nI would just write the test; then at least *I* would have it. If the author <br/>\nalso wants it, I would probably provide it -- maybe for a fee.<br/>\n<br/>\n--<br/>\nJ. B. Rainsberger,<br/>\nPresident, Diaspar Software Services<br/>\nLet&#39;s write software that people understand.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com/\">http://www.diasparsoftware.com/</a><br/>\ntelephone: +1 416 791-8603</div>", 
    "prevInTime": 5259, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1025102289", 
    "canDelete": false, 
    "nextInTopic": 5261, 
    "prevInTopic": 5259, 
    "headers": {
        "inReplyToHeader": "PDIwMDIwNjI2MDc0OC5nNVE3bTZHMjU0NDdAdGlhbWF0LnBvcnQyNS5jb20+", 
        "messageIdInHeader": "PDIwMDIwNjI2MDgzODA5Lk05MzkwM0BkaWFzcGFyc29mdHdhcmUuY29tPg==", 
        "referencesHeader": "PEQ1Nzc2RDA5RDA4NEE3NDBCNUQ3RjI5MjY2ODBGQ0YzMDExRkUyMjhAbXVzMDAxbXVsbGV0Lm1lcmNhdG9yLmNvbT4gPDIwMDIwNjI1MTE0NjIxLk02MTcxNkBkaWFzcGFyc29mdHdhcmUuY29tPiA8MjAwMjA2MjYwNzQ4Lmc1UTdtNkcyNTQ0N0B0aWFtYXQucG9ydDI1LmNvbT4="
    }
}