{
    "numMessagesInTopic": 8, 
    "nextInTime": 5399, 
    "senderId": "A-u2o3RMPAV3cx8-fKl-aWq2B6OkVx3901cs-Ay6ow9lhPQhR6StaN9LfG-HBbTkTod5dKcIVKbCCr6NY-qm9-YPov5DM1XkbFsgPatb", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Quick trawl", 
    "from": "Jason Rogers &lt;jacaetevha@...&gt;", 
    "authorName": "Jason Rogers", 
    "msgSnippet": "Applauds for wanting to teach students the right way from the beginning!! (BTW: If you want to really teach OO, why not use Smalltalk?  Squeak is free and", 
    "msgId": 5398, 
    "profile": "jacaetev", 
    "topicId": 5391, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 109352929, 
    "messageBody": "<div id=\"ygrps-yiv-1709096485\">Applauds for wanting to teach students the right way from the<br/>\nbeginning!! (BTW: If you want to really teach OO, why not use<br/>\nSmalltalk?  Squeak is free and fantastic! -- Sorry for the shameless<br/>\nplug.)<br/>\n<br/>\nI just did a quick &quot;trawl&quot; through blueJ (not very impressed I must<br/>\nsay!).  If it&#39;s open source, it shouldn&#39;t be hard to integrate JUnit. <br/>\nAll you would need to do is implement a sub-menu to the Tools menu or<br/>\nsomething that would allow you to execute a TestRunner (most likely in<br/>\nanother VM).  The real key is whether or not you can get the source.<br/>\n<br/>\nActually, I think that Eric&#39;s suggestion is a valid one for this &quot;IDE&quot;<br/>\n(if it can be called that).  If you are really concerned about<br/>\nclasspaths and other issues that happen to be inherit in Java (and while<br/>\nyou are teaching Java, why not teach about its &#39;issues&#39;), you could<br/>\neasily write a script that would run tests for them, setting up the<br/>\nclasspath auto-magically.  Heck, you could even write a little app or<br/>\nscript that will download it for them, install it to the directory of<br/>\nthe students choice, set the environment variables, and then generate<br/>\nthe build.xml for them.  That would at most take a day to do something<br/>\nso simple (unless you are running on Mac or Windows, then it&#39;s easily<br/>\n1.5 days). :)  There are many solutions to your problem, choose the one<br/>\nwith which you are most comfortable.<br/>\n<br/>\n=jason<br/>\n<br/>\nOn Tue, 2002-07-16 at 09:26, daviddench wrote: --- In junit@y..., Eric<br/>\nHeikkila &lt;ericheikkila@y...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Regardless of whether it&#39;s built in or not, it&#39;s<br/>\n&gt; fairly easy to use JUnit.  Just import the files, set<br/>\n&gt; up the classpath, etc., and start writing tests.<br/>\n&gt; <br/>\n&gt; If you need any specific help or examples, drop me an<br/>\n&gt; email at:<br/>\n&gt; <br/>\n&gt; ericheikkila@y...<br/>\n&gt; <br/>\n&gt; -Eric<br/>\n&gt; <br/>\n </span></blockquote>Thanks for the offer Eric. I am familiar with JUnit, but the criteria<br/>\nhere is not to overload this particular group of students too quickly.<br/>\nI want to use the very simple BlueJ environment to nanny the students<br/>\n( for a variety of reasons ) but also introduce unit testing very<br/>\nquickly via TDD. It would be nicer if UT was relatively seamless at <br/>\nfirst. <br/>\n<br/>\n      David<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor<br/>\nADVERTISEMENT<br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service.</div>", 
    "prevInTime": 5397, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1026814517", 
    "canDelete": false, 
    "nextInTopic": 5399, 
    "prevInTopic": 5396, 
    "headers": {
        "inReplyToHeader": "PGFoMTZ2MytxMTc0QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDEwMjY4MTQ1MjcuMTI2OC4xMC5jYW1lbEByaGlubz4=", 
        "referencesHeader": "PGFoMTZ2MytxMTc0QGVHcm91cHMuY29tPg=="
    }
}