{
    "numMessagesInTopic": 5, 
    "nextInTime": 5483, 
    "senderId": "AOnpo53aypuOvwfvEz__J6TkvMC5oHRII1oCp5QJIX7IXmY_sw1j6_wyC0uUYCTkCy-ZV808zY03I2PmNgwoNZ3MmvJj", 
    "systemMessage": false, 
    "subject": "Re: [junit] *Runner documentation", 
    "from": "Shane Duan &lt;sduan@...&gt;", 
    "authorName": "Shane Duan", 
    "msgSnippet": "... Actually, I think this is exaclty how it works.  What did you get when you tried this? ... -- Disclaimer:  I join all the news groups out of my own", 
    "msgId": 5482, 
    "profile": "wolfdancer_dodo", 
    "topicId": 5474, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 73579768, 
    "messageBody": "<div id=\"ygrps-yiv-65921319\">Toby Ferguson wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Thanks for offering your help.<br/>\n&gt;<br/>\n&gt;Firstly, a man page - these things have a main() so should have a decent man<br/>\n&gt;page - not just a few mentions here and there in various differnt documents.<br/>\n&gt;IN particular the man page should explain in sufficient detail about the<br/>\n&gt;auto-loading and any other funky stuff.<br/>\n&gt;<br/>\n&gt;Secondly, because at least one of these runners (the TextRunner) tends to<br/>\n&gt;get run within ones own code, I would suggest that the public methods shold<br/>\n&gt;be javadoc&#39;d, including a precise description of any reflective magice that<br/>\n&gt;is going on.<br/>\n&gt;<br/>\n&gt;As an example of an issue I had I was trying to write a test suite that I<br/>\n&gt;could run with a *Runner - I was under the impression that just having a<br/>\n&gt;class MyTestSuite with a static method  TestSuite suite() and executing java<br/>\n&gt;*Runner MyTestSuite would run the tests - but to no avail. Of course I can<br/>\n&gt;put a main() in MyTestSuite with code similar to *Runner.run(new<br/>\n&gt;MyTestSuite()) and that will work! I started looking through the source code<br/>\n&gt;of the TextRunner to try to work it out but decided it wasn&#39;t important<br/>\n&gt;enough to me at the time. So that&#39;s an exaple of where documentation would<br/>\n&gt;have helped.<br/>\n&gt;<br/>\n </span></blockquote>Actually, I think this is exaclty how it works.  What did you get when <br/>\nyou tried this?  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;Toby<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>-- <br/>\nDisclaimer:  I join all the news groups out of my own interest.  All opinions expressed here are my own and not necessarily those of my employer.<br/>\n<br/>\nBorland -- Enabling the digital world where our customers have the freedom of choice to develop, deploy, and integrate applications across the enterprise and  the Internet. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.borland.com\">http://www.borland.com</a><br/>\n<br/>\nThis e-mail, and any attachments thereto, is intended only for use by the addressee(s) named herein and may contain legally privileged and/or confidential information.  If you are not the intended recipient of this e-mail, you are hereby notified that any dissemination, distribution or copying of this e-mail, and any attachments thereto, is strictly prohibited.  If you have received this e-mail in error, please immediately and permanently delete the original and any copy of any e-mail and any printout thereof.</div>", 
    "prevInTime": 5481, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1027704630", 
    "canDelete": false, 
    "nextInTopic": 5487, 
    "prevInTopic": 5481, 
    "headers": {
        "messageIdInHeader": "PDNENDE4NzM2LjcwNjA1QGJvcmxhbmQuY29tPg==", 
        "referencesHeader": "PDNEM0YzREM3LjQ5QzQyODY2QHN1bi5jb20+IDwzRDQwOTdDQi4xMDEwMTA1QGJvc3NpY2FyZC5jb20+IDwzRDQxNzgyNi4yRDg3OTQwOUBzdW4uY29tPg=="
    }
}