{
    "numMessagesInTopic": 4, 
    "nextInTime": 5579, 
    "senderId": "dQDZiUxPu2pXjNu27Iz93uDrj7vIxWInzgxdP33dTYsaVs0r-My21kDxNAQ7SZbbAYD_8psk3FNPJ_4KfUbYKTOXgswW8f3LGrDJT2ktWlDqtmCcrrX8QA", 
    "systemMessage": false, 
    "subject": "EJB Testing Strategies", 
    "from": "Steven Webster &lt;steven.webster@...&gt;", 
    "authorName": "Steven Webster", 
    "msgSnippet": "I wonder if list members might wish to share current strategies for unit testing of EJB, particularly CMP Entity Beans. I m aware of Cactus, and have tested", 
    "msgId": 5578, 
    "profile": "sw_edinburgh", 
    "topicId": 5578, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 5701924, 
    "messageBody": "<div id=\"ygrps-yiv-2125922778\">I wonder if list members might wish to share current strategies for <br/>\nunit testing of EJB, particularly CMP Entity Beans.<br/>\n<br/>\nI&#39;m aware of Cactus, and have tested EJB in the past (Session Beans)<br/>\nusing Cactus.  Also, I&#39;m aware of junitejb, which again seems geared<br/>\ntowards testing through a session bean interface.  <br/>\n<br/>\nIn many ways, I think the issues i&#39;m facing are those discussed often<br/>\non this list regarding testing of database code.<br/>\n<br/>\nI have a set of entity beans (CMP2.0) with a Stateless Session Bean<br/>\nfacade, and a business delegate (plain old java object) fronting the<br/>\nstateless session bean.  I&#39;d like to call all my tests through my<br/>\nbusiness delegate, as the Entity Bean is largely code-generated by<br/>\nthe container anyway, and the functionality I&#39;m really interested<br/>\nin testing is my invoking of the methods with value objects.<br/>\n<br/>\nHowever, since i have no guarantee of the order my tests are run in,<br/>\nI need to cleardown the persisted entities between each test; I&#39;ve<br/>\nwritten a DBTestCase in the past that performs a cleardown of tables<br/>\nin the setUp() method, and allows each test to insert rows, modify<br/>\nrows, delete rows, etc, and assert on entries existing in the<br/>\ndatabase.<br/>\n<br/>\nWhat strategies have people successfully employed for testing<br/>\nbusiness/workflow methods of a stateless session bean that has<br/>\nCMP entity beans at the back-end ?<br/>\n<br/>\nThanks,<br/>\n<br/>\nSteven</div>", 
    "prevInTime": 5577, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1029194561", 
    "canDelete": false, 
    "nextInTopic": 5579, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDIwMDIwODEzMDAyMjQxLjQ5MjE2YzRjLnN0ZXZlbi53ZWJzdGVyQGFvLWRlbmtvdS1rYWkub3JnPg=="
    }
}