{
    "numMessagesInTopic": 4, 
    "nextInTime": 5580, 
    "senderId": "1K74br4AsGPQw_z-zOTgjJZ9uFinBB-cHU7r9D0C7KonI3h87F6Ivmk0DxVfK5U2F_EAN0VW616oVvLf2edfD4Bk0MXyftLWcJcnjao", 
    "systemMessage": false, 
    "subject": "RE: [junit] EJB Testing Strategies", 
    "from": "&quot;Craig Demyanovich&quot; &lt;demmer12@...&gt;", 
    "authorName": "Craig Demyanovich", 
    "msgSnippet": "...  If you face difficulty in testing your application, J2EE or otherwise, consider refactoring to a design more suitable to testing.  (Of", 
    "msgId": 5579, 
    "profile": "demmer12", 
    "topicId": 5578, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 108584068, 
    "messageBody": "<div id=\"ygrps-yiv-1827146880\"><blockquote><span title=\"ireply\">&gt; What strategies have people successfully employed for testing <br/>\n&gt; business/workflow methods of a stateless session bean that <br/>\n&gt; has CMP entity beans at the back-end ?<br/>\n<br/>\n </span></blockquote>&lt;broken-record&gt;<br/>\nIf you face difficulty in testing your application, J2EE or otherwise,<br/>\nconsider refactoring to a design more suitable to testing.  (Of course,<br/>\nit&#39;s advisable to have some tests to support your refactoring).<br/>\n&lt;/borken-record&gt;<br/>\n<br/>\nThus, I design EJBs such that they almost exclusively rely on one or<br/>\nmore non-EJB classes to do work.  For example, my latest component<br/>\nincludes a message-driven bean (MDB).  The MDB instantiates a few<br/>\nobjects that together parse the message (XMLReader, ContentHandler,<br/>\netc.).  A Map of parsed values is then obtained from the ContentHandler.<br/>\nThis Map is passed to an object that interprets the contents of the Map<br/>\nand performs some work.  The results of the work are captured in a<br/>\nresult object that acts as a Collecting Parameter (a design pattern from<br/>\n_Smalltalk Best Practices_ by Kent Beck, I believe).  The result object<br/>\nis passed to a communicator object whose job it is to create a response<br/>\nmessage and send it.  Thus, I have, for example, ResultTestCase,<br/>\nCommunicatorTestCase, etc.  Finally, I&#39;m confident that these classes<br/>\nwill perform as expected when the MDB uses them.<br/>\n<br/>\nGood luck,<br/>\nCraig</div>", 
    "prevInTime": 5578, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1029198295", 
    "canDelete": false, 
    "nextInTopic": 5582, 
    "prevInTopic": 5578, 
    "headers": {
        "inReplyToHeader": "PDlFRTk5ODI2OTYzMDBDNDdCMjhCQjdCNkM5NDIwNTI2MDMyMEE1NURAdXNtaTAwMjJrMDYuYXBvZ2VudC5jb20+", 
        "messageIdInHeader": "PDlFRTk5ODI2OTYzMDBDNDdCMjhCQjdCNkM5NDIwNTI2MDI3RkU3NzZAdXNtaTAwMjJrMDYuYXBvZ2VudC5jb20+"
    }
}