{
    "numMessagesInTopic": 2, 
    "nextInTime": 5591, 
    "senderId": "-Rq6JH5V5A0rrldZbWVRwo6IY5m59EgLOCrIAy3_RRFHGEHUS-EZCjQQyRIWPorvPgYRveigRJEw-7oSf8ivAhGg", 
    "systemMessage": false, 
    "subject": "Using a custom classloader to facilitate testing", 
    "from": "&quot;Shez&quot; &lt;shez@...&gt;", 
    "authorName": "Shez", 
    "msgSnippet": "Hi guys. I was wondering if anyone has ever investigated the possibility of using a custom classloader to transparantly (to the tested code) provide non", 
    "msgId": 5590, 
    "topicId": 5590, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 86391835, 
    "messageBody": "<div id=\"ygrps-yiv-1978777267\">Hi guys.<br/>\n\tI was wondering if anyone has ever investigated the possibility of using a <br/>\ncustom classloader to transparantly (to the tested code) provide non standard <br/>\nimplementations of collaberating classes without having to provide <br/>\nconstructors or setters to specify an implementation of every type used in a <br/>\nclass.<br/>\n<br/>\nA simple example of this would be to test a class which uses the a Date or <br/>\nCalander class to get the current time, for testing purposes it would be nice <br/>\nto be able to mock up a class that returned a constant time.  This could be <br/>\ndone by passing in an instance of the date class in the constructor, or by <br/>\nusing setters, but may be neater (especially if you don&#39;t have the luxury of <br/>\ndoing TDD) to be able to this external to the tested code.<br/>\n<br/>\nI&#39;ve not investigated or experimented with the plausibility of this yet, just <br/>\nwondering if anybody else has already tried and discounted the idea :-)<br/>\n<br/>\nCheers<br/>\nShez</div>", 
    "prevInTime": 5589, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1029255227", 
    "canDelete": false, 
    "nextInTopic": 5601, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDIwMDIwODEzMTcxMy40NzMxMy5zaGV6QHRleG9uZXQuY28udWs+"
    }
}