{
    "numMessagesInTopic": 25, 
    "nextInTime": 5618, 
    "senderId": "vcjcWYPG6IJIocSOxCDO8J162VIDPjypC-28tgytBrcqUTNHSkh31zgoyhXS3qXmjaLTzTkgYloUbHGDNN0sCXFNFuc", 
    "systemMessage": false, 
    "subject": "Re: [junit] A Growing Problem", 
    "from": "Dave Astels &lt;dave@...&gt;", 
    "authorName": "Dave Astels", 
    "msgSnippet": "On Tue, 2001-08-21 at 02:03, Parag Shetye wrote: A Growing Problem The typical way of handling test cases in JUnit is to create a class with methods beginning", 
    "msgId": 5617, 
    "profile": "astelsd", 
    "topicId": 5610, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 116713278, 
    "messageBody": "<div id=\"ygrps-yiv-1634903160\"><blockquote><span title=\"qreply\">On Tue, 2001-08-21 at 02:03, Parag Shetye wrote:<br/>\n<br/>\n    A Growing Problem<br/>\n    <br/>\n    The typical way of handling test cases in JUnit is to create a class<br/>\n    with methods beginning with &quot;test&quot;. For example, we could create the<br/>\n    methods testNullAccount() and testEmptyAccount() to handle cases where<br/>\n    the account object is null and empty, respectively. <br/>\n<br/>\nThat is THE way to do it.<br/>\n<br/>\n    This approach is<br/>\n    satisfactory for a few test cases, but what if the number of test cases<br/>\n    grows to 50 or even 500?<br/>\n<br/>\nYou shouldn&#39;t have this many tests in a single TestCase.  You should<br/>\nhave many TestCases.  As a guide, I create a new TestCase whenever: a) I<br/>\nam going to be driving the development of a new class, or b) I need a<br/>\ndifferent fixture (case &quot;a&quot; generally is a specialy case of this<br/>\nanyway).<br/>\n<br/>\n    You might work around this limitation by placing all test cases and<br/>\n    assert statements sequentially inside a single method.<br/>\n<br/>\nBad idea.  You loose a lot of the intent.  The method names should<br/>\ncommunicate exactly what is being tested.  Further, the idea to strive<br/>\nfor (in theory anyway) is to have a single assert in each method.  That<br/>\nkeeps the tests small, focused, and (as a result) understandable.<br/>\n<br/>\nFurthermore, when you are writing a test, start with the assert (what is<br/>\nbeing tested) then build up the structure needed to get to the point<br/>\nthat that can be tested (what has to be in place for that to be<br/>\ntested).  Refactor into a fixture as require/appropriate.<br/>\n<br/>\nFinally, read Kent&#39;s book which will be on shelves shortly (drafts are<br/>\nin the file area of the TDD yahoo group).  Then read my book which<br/>\nshould be on shelves early next year.  If you read German, get Frank<br/>\nWestphal&#39;s book on TDD which will be out about then as well (English<br/>\ntranslation to follow).  I also encourage you to subscribe (free) to the<br/>\nTDD edition of The Coad Letter which I edit/write<br/>\n(www.thecoadletter.com)<br/>\n<br/>\nYou can also take a course on TDD.  I believe Industrial Logic offers a<br/>\nTDD workshop (their site seems to be down as I write, so I can&#39;t<br/>\nconfirm) and we will be as well.<br/>\n<br/>\n    This approach<br/>\n    suffers from two limitations. The first limitation is the need to<br/>\n    replicate the test code for every test case. Even if you have only two<br/>\n    or three lines of code per test case, the size of the method will<br/>\n    mushroom and become hard to maintain (and read). <br/>\n<br/>\nThis is a very bad approach.  You loose most of the utility of the<br/>\npractice.  All that you are left with are tests.<br/>\n<br/>\n    See example below (Taken from JavaPro ) -<br/>\n<br/>\nAn observation.  Whoever wrote this code doesn&#39;t have much experience<br/>\nwriting tests (see archive for the code, I&#39;ve snipped it)<br/>\n<br/>\nHope this helps.<br/>\n<br/>\nDave<br/>\n<br/>\n________________________________________________________________________<br/>\nDave Astels<br/>\n  Coauthor of &quot;A Practical Guide to XP&quot; <br/>\n  Editor of the Test-Driven Development Edition of The Coad Letter<br/>\n  Presenter at XP2002 of: <br/>\n    the &quot;XP For One&quot; tutorial & &quot;Refactoring with UML&quot; paper <br/>\nCEO & Master Software Craftsman <br/>\n<br/>\nAn Agile Software Studio<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>", 
    "prevInTime": 5616, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1029937662", 
    "canDelete": false, 
    "nextInTopic": 5618, 
    "prevInTopic": 5616, 
    "headers": {
        "inReplyToHeader": "PDNCODFFQkFGLjJDOUVFMzFEQHNhdnZpb24uY29tPg==", 
        "messageIdInHeader": "PDEwMjk5Mzc2NjMuMzIxODguMTE5Ny5jYW1lbEBtZXJsaW4uc2FvcnNhLmNvbT4=", 
        "referencesHeader": "PDNCODFFQkFGLjJDOUVFMzFEQHNhdnZpb24uY29tPg=="
    }
}