{
    "numMessagesInTopic": 4, 
    "nextInTime": 5692, 
    "senderId": "Tskp_MqaiX0aeFtVVKtaLiGrotdAkajXg7v-P73x2w8X0aOerfG2cmB3WhooXjy27iRMcqC7GyYuHHYb70fknUJNdA7jlzBHeMpEn7A", 
    "systemMessage": false, 
    "subject": "Re: [junit] Unit testing multithreaded network code", 
    "from": "&quot;Matthew Cooke&quot; &lt;mpcooke3@...&gt;", 
    "authorName": "Matthew Cooke", 
    "msgSnippet": "Hi. I have spent some time thinking about the problems involved with testing multithreaded code. As we have had similar problems at work in the past. The", 
    "msgId": 5691, 
    "topicId": 5689, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 78040954, 
    "messageBody": "<div id=\"ygrps-yiv-1058446051\">Hi.<br/>\n<br/>\nI have spent some time thinking about the problems involved with testing <br/>\nmultithreaded code. As we have had similar problems at work in the past.<br/>\n<br/>\nThe problem is that the monitor-threads model in Java is fairly easy to <br/>\nunderstand to start with, but becomes difficult to apply safely in large <br/>\nscale systems. This problem is futher compounded by the fact that unit <br/>\ntesting becomes difficult/impossible, either you test the threaded behaviour <br/>\nand have horrible join() sleep() code or you ignore the threading aspects. <br/>\nEven if you unit test everything the threading behaviour of a system is <br/>\nstill not captured because the &#39;Unit Tests&#39; test Objects and parellelism is <br/>\nnot contained within objects in the threading model.<br/>\n<br/>\nI am sure if java used the more modern CSP (Communicating Sequential <br/>\nProcesses) model then writing junit tests would be much simpler as each bit <br/>\nof code could be tested outside of a parrallel system. Eg, The parallelism <br/>\nwould not be hidden inside an object or spread across multiple objects. <br/>\nHence Unit testing and Mock CSP Objects could easily be used.<br/>\n<br/>\nAnyway - I digress.<br/>\n<br/>\nI think how I would address the problems you are having by testing <br/>\nseparately the socket connection code and the behavoiur you want the <br/>\nConnectionService to have.<br/>\n<br/>\nThis could be achieved by creating a wrapper on a socket in the real code. <br/>\nthis wrapper simply has the responsibility to make connect() calls to the <br/>\nConnectionService whenever a real socket connection is made.<br/>\n<br/>\nNow the tests on connectionService become non-threaded and non-network <br/>\nrelated. calls made to connect should cause the mockFactory to create an <br/>\nobject. A call to stopListening should cause the mockSocketWrapper to be <br/>\nasked to close.<br/>\n<br/>\nYou could still test the &#39;real&#39; behaviour of the socket itself by testing <br/>\nthe socketWrapper although I wouldn&#39;t bother. I accept that some simple <br/>\nwrappers on java libraries don&#39;t need testing becauase hopefully they are <br/>\nnot buggy ;)<br/>\n<br/>\nMatt.<br/>\n<br/>\nFrom: &quot;weitzman_d&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:weitzman_d@...\">weitzman_d@...</a>&gt;<br/>\nReply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSubject: [junit] Unit testing multithreaded network code<br/>\nDate: Thu, 29 Aug 2002 21:05:59 -0000<br/>\n<br/>\nI&#39;ve asked this question at javaranch.com, so I&#39;ll just provide an<br/>\nbrief description here and point to the original question for anyone<br/>\nwho wants to give it a shot (just reply on this list though).<br/>\n<br/>\nI&#39;m writing the beginnings of a multithreaded server, and I had to<br/>\ninsert a lot of calls to Thread.sleep() in my unit testing code for<br/>\nit to pass.  Is there some good way to test multithreaded code that<br/>\ndoesn&#39;t invole just waiting a few milliseconds and hoping that a task<br/>\nfinished?  I imagine that a better solution might involve calls to<br/>\njoin() but tie the unit test closely to the particular implementation.<br/>\n<br/>\nAnyway, here&#39;s the original question with my current, unsatisfactory<br/>\ntest (although it doesn&#39;t have much of the code being tested - I<br/>\ndidn&#39;t want to clutter the post.  I should add some.):<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://saloon.javaranch.com/cgi-bin/ubb/ultimatebb.cgi?\">http://saloon.javaranch.com/cgi-bin/ubb/ultimatebb.cgi?</a><br/>\nubb=get_topic&f=9&t=001390<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nChat with friends online, try MSN Messenger: <a rel=\"nofollow\" target=\"_blank\" href=\"http://messenger.msn.com\">http://messenger.msn.com</a></div>", 
    "prevInTime": 5690, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1030830561", 
    "canDelete": false, 
    "nextInTopic": 5693, 
    "prevInTopic": 5689, 
    "headers": {
        "messageIdInHeader": "PEY2MGF2anJSWjFVYkRCUkFyVmMwMDAwMDJlNUBob3RtYWlsLmNvbT4="
    }
}