{
    "numMessagesInTopic": 37, 
    "nextInTime": 5740, 
    "senderId": "Qx8Fux0v4Pz2T7n5FHRjXGMKUyBO3DMCk52hpUfV4CeYcPS9o-Op8r7Kpm8SE0Nb7NX-9XRlaNbtScwXMG0GQAmP3V5UA36sIGsQVQItKMuVNfZZmA-f0Q", 
    "systemMessage": false, 
    "subject": "RE: [junit] [TEST] JTest v4.5 and what is says about JUnit", 
    "from": "&quot;Chappell, Simon P&quot; &lt;simon.chappell@...&gt;", 
    "authorName": "Chappell, Simon P", 
    "msgSnippet": "Hello. I am a happy and satisfied user of ParaSoft s Jtest and the JUnit framework and I would like to comment on some of your statements.  ... Which", 
    "msgId": 5739, 
    "topicId": 5736, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 88072055, 
    "messageBody": "<div id=\"ygrps-yiv-151072084\">Hello.<br/>\n<br/>\nI am a happy and satisfied user of ParaSoft&#39;s Jtest and the JUnit framework and I would like to comment on some of your statements.<br/>\n<br/>\n&lt;snip&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I have evaluated JTest version 4.5 and here are some JUnit related<br/>\n&gt;results:<br/>\n<br/>\n </span></blockquote>Which version? I am using 4.5i and it is very good. Contact your ParaSoft representative to ensure that you have the latest and greatest version. ParaSoft is very fast at fixing bugs and customer problem reports. (Well, they fix mine quickly! :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;1) JTest allows you to incorporate existing JUnit test with the JTest<br/>\n&gt;analysis<br/>\n<br/>\n </span></blockquote>Correct. Isn&#39;t this wonderful! A commercial company that recognises quality open-source software when they see it and they made a decision to embrace it. I find this refreshing. Stay tuned for further Junit related news. I am in regular communication with some of the folks at ParaSoft and they are VERY forward thinking in regards of Junit and open-source in general.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;2) JTest can generate a JUnit template for particular classes, it<br/>\n&gt;doesn&#39;t go any further than this<br/>\n<br/>\n </span></blockquote>This statement is technically correct but only tells half of the story. A unit test is supposed to be written by a programmer/tester/human being. Jtest is an automated testing tool. It cannot write business logic/customer requirement testing unit tests! How is it supposed to know what your customers wanted? It generates an initial Junit outline upon request, but they haven&#39;t built in the necessary ESP to read your customers minds yet.<br/>\n<br/>\nFor basic value objects (i.e. only getters and setters) it will actually generate very reasonable junit tests. This is possible because it IS possible to test that a value is stored correctly and returned correctly without reading a customer&#39;s mind.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;3) Running JTest on junit.jar version 3.7 reports 24 runtime<br/>\n&gt;exceptions (see below)<br/>\n<br/>\n </span></blockquote>This may be true. I&#39;ve never tried it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;4) Running JTest on Ant produces 255 runtime exceptions<br/>\n<br/>\n </span></blockquote>This may also be true. I&#39;ve never tried this either.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;5) You can&#39;t analyze JTest using JTest, it refuses to analyze<br/>\n&gt;&quot;com.parasoft&quot; packages (probably because you would find &gt;&gt;&gt; 255<br/>\n&gt;errors)<br/>\n<br/>\n </span></blockquote>Again, I&#39;ve never tried this. I can&#39;t say that I blame them though. It&#39;s a rough old business world out there and you&#39;ve got to take some precautions. Besides, they get enough &quot;issue reports&quot; from me to keep the bug count pretty low! :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;All in all JUnit wise the support is somewhat disappointing to me and<br/>\n<br/>\n </span></blockquote>I&#39;m very sorry that you don&#39;t like the facilities provided. I find them quite useful and acceptable. It&#39;s a free world. You are free to uninstall Jtest and take a chance on shipping untested, sub-optimal code and you are free to keep Jtest installed and have some of the squeakiest clean code on the planet. I know which I&#39;m gonna do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;the &#39;Runtime Exception generator&#39; facility is annoying.<br/>\n<br/>\n </span></blockquote>Then don&#39;t run those tests. Jtest is configurable and you can turn off tests that you deem inappropriate for you and your situation. Our site does not use DbC, so we turn off all of the DbC tests. Someday, we may get our developers using it, but until then it makes no sense to test for compliance.<br/>\n<br/>\nI have found that Jtest&#39;s attempts to call my code with strange and unusual runtime parameters has actually caused me to write better guard conditions, which makes my code much more robust. I appreciate this behaviour from Jtest and have benefited greatly from it.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Greetings,<br/>\n&gt;A. Roy<br/>\n&gt;Java QA tester<br/>\n<br/>\n </span></blockquote>And greetings to you, my fellow Jtest and Junit using developer.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;--- Junit 3.7 report -----<br/>\n&gt;All Errors Found - done - 94 Errors Found<br/>\n&gt;        [ 24 ] Uncaught Runtime Exceptions<br/>\n&gt;<br/>\n&gt;               [ 18 ] java.lang.NullPointerException<br/>\n&gt;<br/>\n&gt;               [ 1 ] java.lang.StackOverflowError<br/>\n&gt;<br/>\n&gt;               [ 1 ] junit.framework.AssertionFailedError<br/>\n&gt;<br/>\n&gt;               [ 1 ] java.lang.StringIndexOutOfBoundsException<br/>\n&gt;<br/>\n&gt;               [ 1 ] java.lang.ClassFormatError<br/>\n&gt;<br/>\n&gt;               [ 1 ] java.lang.ArrayIndexOutOfBoundsException<br/>\n&gt;<br/>\n&gt;               [ 1 ] java.lang.IllegalArgumentException<br/>\n<br/>\n </span></blockquote>I would actually interpret these exceptions as an indication of some extra guard conditions and more defensive programming needed within the tested code. If a piece of called code cannot handle unexpected inputs, then the fault lies with the code and not the inputs. :-)<br/>\n<br/>\nJust my $0.02<br/>\n<br/>\nSimon<br/>\n<br/>\n-----------------------------------------------------------------<br/>\nSimon P. Chappell                     <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:simon.chappell@...\">simon.chappell@...</a><br/>\nJava Programming Specialist                      www.landsend.com<br/>\nLands&#39; End, Inc.                                   (608) 935-4526</div>", 
    "prevInTime": 5738, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1031750900", 
    "canDelete": false, 
    "nextInTopic": 5740, 
    "prevInTopic": 5736, 
    "headers": {
        "messageIdInHeader": "PDFBQTY5NzFGOTZGQURCNEE5NkNGNzNFNDcyOUIwNUYxMDNGMURFQFVTRVZTMDEyLmxlaW50ZXJuYWwuY29tPg=="
    }
}