{
    "numMessagesInTopic": 37, 
    "nextInTime": 5749, 
    "senderId": "uMkWlAnCanz6kZqGUXt5jXBkcR1joTihY0Bl8lFGaFjMmW4g_JdErLRsRIFrfaU0KMqTE99of_4PRu6sTnOVRpj91EorwDaC0KZp", 
    "systemMessage": false, 
    "subject": "Re: [junit] [TEST] JTest v4.5 and what is says about JUnit", 
    "from": "&quot;arieroy2002&quot; &lt;arieroy@...&gt;", 
    "authorName": "arieroy2002", 
    "msgSnippet": "... contract is between a piece of software and it s callers, if the software doesn t check it s own inputs then it is at fault. ... guard conditions upon,", 
    "msgId": 5748, 
    "profile": "arieroy2002", 
    "topicId": 5736, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124235646, 
    "messageBody": "<div id=\"ygrps-yiv-1851530046\"><blockquote><span title=\"ireply\">&gt; &gt;I disagree. If the input violates a precondition, the fault <br/>\n&gt; &gt;lies with the input, by definition.<br/>\n&gt; <br/>\n&gt; I wholeheartedly disagree with you. It makes no difference what your<br/>\n </span></blockquote>&quot;contract&quot; is between a piece of software and it&#39;s callers, if the<br/>\nsoftware doesn&#39;t check it&#39;s own inputs then it is at fault.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Now, some pieces of functionality may not be critical enough to code<br/>\n </span></blockquote>guard conditions upon, an example might be getters and setters, or<br/>\nsome simple string or mathematics functions. But there are going to be<br/>\nsome where the functionality is going to be be of a life-threatening<br/>\nlevel and I know that I&#39;d want a VERY robust guard condition on that<br/>\ncode. An example of such a critical piece of code might be for<br/>\nRadiation Treatment units. I don&#39;t care how many documents you have<br/>\nthat say that the output requested will never be above n units of<br/>\nradiation, I&#39;m gonna build a guard condition into my code to make<br/>\ncertain that it could never happen.<br/>\n<br/>\nMy complaint is that you can have valid, thoroughly tested software<br/>\nthat complies to all your tests (JUnit-, integration- and acceptance<br/>\ntests) and still have JTest complain about it.<br/>\nHere is another way of putting it:<br/>\nPersonally I think that the &#39;exposure&#39; of (mainly) NullPointers by<br/>\napplying generated tests that put nonsense parameter values in methods<br/>\ndoes improve the quality of the product.<br/>\nThe motto &#39;Garbage in Garbage out&#39; still applies in this case. As an<br/>\nanalogy you might say that the software application is like a car<br/>\nexposing certain interfaces that must be handled in a specific way.<br/>\nIf you bypass these interfaces you can get unexpected results, no<br/>\nsensible car testing authority would put a burning piece of cloth into<br/>\nthe gastank and would report the following explosing a &#39;serious<br/>\ndefect&#39; found through a dynamic test.<br/>\n<br/>\nI do not want to resolve all &#39;dubious&#39; runtime exceptions reported by<br/>\nJTest ! <br/>\nIf you are working in life threatening devices using Java such as<br/>\nSimon you might need this JTest behaviour but I think 99% of all Java<br/>\ndevelopers work on non life threatening applications<br/>\n(except when you are running behind schedule and your boss want&#39;s your<br/>\nhead on a silver plate :))<br/>\n<br/>\ngreetings<br/>\nArie Roy (my boss just came in and gave me a smile and an apple ?)</div>", 
    "prevInTime": 5747, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1031756689", 
    "canDelete": false, 
    "nextInTopic": 5749, 
    "prevInTopic": 5747, 
    "headers": {
        "inReplyToHeader": "PDFBQTY5NzFGOTZGQURCNEE5NkNGNzNFNDcyOUIwNUYxMDNGMURGQFVTRVZTMDEyLmxlaW50ZXJuYWwuY29tPg==", 
        "messageIdInHeader": "PGFsbm0yaCtrYnFtQGVHcm91cHMuY29tPg=="
    }
}