{
    "numMessagesInTopic": 37, 
    "nextInTime": 5751, 
    "senderId": "V_lFwoU_nQo5agf4mvwxBwOJ3cz24hrnPSYs1wFWxCfRByzde3EXjpq9NUT-LfKUUHZZ2uSG6TugshXXC5cRBPyn1dUm2LUKH3yBml6etmKeJYAo8nmaYQ", 
    "systemMessage": false, 
    "subject": "RE: [junit] [TEST] JTest v4.5 and what is says about JUnit", 
    "from": "&quot;Chappell, Simon P&quot; &lt;simon.chappell@...&gt;", 
    "authorName": "Chappell, Simon P", 
    "msgSnippet": " ... If Jtest is complaining, then is it REALLY valid and thoroughly tested code? I m not trying to bait you, but if you have a automated code testing", 
    "msgId": 5750, 
    "topicId": 5736, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 88072055, 
    "messageBody": "<div id=\"ygrps-yiv-1184314255\">&lt;snip&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;My complaint is that you can have valid, thoroughly tested software<br/>\n&gt;that complies to all your tests (JUnit-, integration- and acceptance<br/>\n&gt;tests) and still have JTest complain about it.<br/>\n<br/>\n </span></blockquote>If Jtest is complaining, then is it REALLY valid and thoroughly tested code? I&#39;m not trying to bait you, but if you have a automated code testing tool (let&#39;s be generic here, so no-one thinks that I&#39;m on the ParaSoft payroll :-) and it complains about your code then either the tool is defective or your code is sub-optimal.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Here is another way of putting it:<br/>\n&gt;Personally I think that the &#39;exposure&#39; of (mainly) NullPointers by<br/>\n&gt;applying generated tests that put nonsense parameter values in methods<br/>\n&gt;does improve the quality of the product.<br/>\n<br/>\n </span></blockquote>Agreed. :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;The motto &#39;Garbage in Garbage out&#39; still applies in this case. As an<br/>\n<br/>\n </span></blockquote>Not agreed. GIGO is only for non-robust code. I think that &quot;Garbage In&quot; should cause appropriate guard conditions to be triggered and an appropriate response to be generated NPE or IAE (your choice). For anything other than the most trivial of code, I do not want to ever contribute to &quot;Garbage Out&quot;. As developers we usually have no control over the many potential ways that our code could be used, but we do have control over how it responds.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;analogy you might say that the software application is like a car<br/>\n&gt;exposing certain interfaces that must be handled in a specific way.<br/>\n&gt;If you bypass these interfaces you can get unexpected results, no<br/>\n&gt;sensible car testing authority would put a burning piece of cloth into<br/>\n&gt;the gastank and would report the following explosing a &#39;serious<br/>\n&gt;defect&#39; found through a dynamic test.<br/>\n<br/>\n </span></blockquote>Actually, I&#39;m sure that contingency is addressed by the automotive industry. Now bringing fire near any body of petrol is bad, but there are ways to reduce the likelihood of a bad thing. Baffles in the tube leading to the petrol tank are an example of trying to provide hardware guard conditions.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I do not want to resolve all &#39;dubious&#39; runtime exceptions reported by<br/>\n&gt;JTest ! <br/>\n<br/>\n </span></blockquote>Any decent tool should allow you to turn off inappropriate tests.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If you are working in life threatening devices using Java such as<br/>\n&gt;Simon you might need this JTest behaviour but I think 99% of all Java<br/>\n&gt;developers work on non life threatening applications<br/>\n&gt;(except when you are running behind schedule and your boss want&#39;s your<br/>\n&gt;head on a silver plate :))<br/>\n<br/>\n </span></blockquote>Fortunately, I don&#39;t work with anything too dangerous these days. I used to work in a Radiography department, so I am aware of the issues there. The project that I am winding up now is not life threatening, but because of volume, it does need to be very fast and very accurate or the CEO will be asking why it is failing to process about 2000 shipments an hour! (Not a conversation that I ever want to have!) I still think that it&#39;s appropriate to &quot;harden&quot; our code to handle the unexpected.<br/>\n<br/>\nThis is the concept of &quot;graceful degredation&quot;. A web browser is a very good example of this .... a lot of web pages have awful HTML and yet most of them display acceptably, because the browser takes what it&#39;s given and does the best it can with it. A browser cannot throw an exception, but it can try to render what it&#39;s given. All software should do the best it can with what it&#39;s given or when possible reject unacceptable inputs.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;greetings<br/>\n&gt;Arie Roy (my boss just came in and gave me a smile and an apple ?)<br/>\n<br/>\n </span></blockquote>Simon<br/>\n<br/>\n-----------------------------------------------------------------<br/>\nSimon P. Chappell                     <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:simon.chappell@...\">simon.chappell@...</a><br/>\nJava Programming Specialist                      www.landsend.com<br/>\nLands&#39; End, Inc.                                   (608) 935-4526</div>", 
    "prevInTime": 5749, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1031762449", 
    "canDelete": false, 
    "nextInTopic": 5752, 
    "prevInTopic": 5749, 
    "headers": {
        "messageIdInHeader": "PDFBQTY5NzFGOTZGQURCNEE5NkNGNzNFNDcyOUIwNUYxMDNGMUUyQFVTRVZTMDEyLmxlaW50ZXJuYWwuY29tPg=="
    }
}