{
    "numMessagesInTopic": 37, 
    "nextInTime": 5770, 
    "senderId": "2pgfj_5PvNJAQBt6QEuzK0u3KD7uwxWGiebHWPdQEdvCJ0aXFtgDy_RwTzPKJ6ODml3JA91JpLg0HqcKOXMFeBXF0rLGLuaVSWxtzQb4VRpEiwSOBnzb2g", 
    "systemMessage": false, 
    "subject": "RE: RE: [junit] [TEST] JTest v4.5 and what is says about JUnit", 
    "from": "&quot;Chappell, Simon P&quot; &lt;simon.chappell@...&gt;", 
    "authorName": "Chappell, Simon P", 
    "msgSnippet": "... There is no error recovery strategy, but the reporting is going to be different. I think that, for me, it s partly a matter of rightness and the rest is", 
    "msgId": 5769, 
    "topicId": 5736, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 88072055, 
    "messageBody": "<div id=\"ygrps-yiv-1433056433\"><blockquote><span title=\"ireply\">&gt;-----Original Message-----<br/>\n&gt;From: Steven Taschuk [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:staschuk@...\">staschuk@...</a>]<br/>\n&gt;Sent: Thursday, September 12, 2002 2:32 PM<br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\n&gt;Subject: Re: RE: [junit] [TEST] JTest v4.5 and what is says about JUnit<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;Quoth Chappell, Simon P:<br/>\n&gt;&gt; &gt;-----Original Message-----<br/>\n&gt;&gt; &gt;From: Steven Taschuk [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:staschuk@...\">staschuk@...</a>]<br/>\n&gt;[...]<br/>\n&gt;&gt; &gt;But why would the calling code care?  For example, why would it<br/>\n&gt;&gt; &gt;react differently to an IllegalArgExc than to any random<br/>\n&gt;&gt; &gt;RuntimeException?<br/>\n&gt;&gt; <br/>\n&gt;&gt; Good question. I hope that I can provide a good answer. The reason<br/>\n&gt;&gt; why my code would care about the type of exception raised by the<br/>\n&gt;&gt; code that I have called is that there are some exceptions that are<br/>\n&gt;&gt; non-terminal and that when received, my code will try to do<br/>\n&gt;&gt; something about it. Let&#39;s try an example:<br/>\n&gt;[...snip examples...]<br/>\n&gt;<br/>\n&gt;Yes, certainly.  I understand your example of JDBC exceptions, for<br/>\n&gt;which the strategy of retrying a few times may be appropriate.<br/>\n&gt;<br/>\n&gt;But what error-recovery strategy, if any, is appropriate for<br/>\n&gt;IllegalArgExc but inappropriate for other RuntimeExcs? In other<br/>\n&gt;words:<br/>\n&gt;    try {<br/>\n&gt;            // Some code.<br/>\n&gt;    } catch (IllegalArgumentException e) {<br/>\n&gt;            // What might be done here ...<br/>\n&gt;    } catch (RuntimeException e) {<br/>\n&gt;            // ... that wouldn&#39;t be equally sensible here?<br/>\n&gt;    }<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>There is no error recovery strategy, but the reporting is going to be different.<br/>\n<br/>\nI think that, for me, it&#39;s partly a matter of &quot;rightness&quot; and the rest is reporting. The &quot;rightness&quot; is that it is the Right Thing To Do(tm) to throw a IAE when receiving junk parameters. In your code fragment, the different things that I might do would be to issue different errors to the user or log file. An IAE means that the programmer goofed, while other errors might be for less negligent reasons.<br/>\n<br/>\nFor example, if my code is reading a file from a CD and someone ejects the CD during the process then I expect an error to be thrown, but it&#39;s not the fault of the programmer, so let&#39;s put up a nice friendly end-user message that explains how difficult it is to read data from a CD that isn&#39;t in the drive anymore.<br/>\n<br/>\nAs I type this response, I realise that my whole programming perspective is driving my answer. That is, that I very deliberately write what I call &quot;2 a.m. code&quot;. This is code that someone else can debug at 2 a.m. without talking to me. I write VERY BORING and VERY STRAIGHTFORWARD code and I do it deliberately. I find two advantages to this: the first is that other people can support the code more easily and the second is that boring, straightforward code breaks less often (my perception, no scientific proof).<br/>\n<br/>\nI gained this worldview from trying to support other people&#39;s RPG code. There was one particular job that ran at 2 a.m. on Friday night/Saturday morning and by the time it failed and the operators paged me it would be 2:15 (almost exactly ... everytime). The code was awful and that was when I started trying to write code (and encourage others to also write their code that way) that any support programmer could read and understand and patch if necessary at 2 a.m.<br/>\n<br/>\nI hope this explains why I&#39;m being so rigid about this. If I pass a junk value as a parameter then I want an IllegalArgumentException. Don&#39;t give me a NullPointerException ... that tells me nothing at 2 a.m.!!! You can give me all the theory that you want about how an NPE is fine if it&#39;s documented in the JavaDoc or some Big Book Of Documentation, but once you&#39;ve supported some idiot&#39;s spagetti code at 2 a.m. (without the BBOD to hand), then theory doesn&#39;t appeal like it used to.<br/>\n<br/>\nMore than two cents, but less than a dollar. :-)<br/>\n<br/>\nSimon<br/>\n<br/>\n-----------------------------------------------------------------<br/>\nSimon P. Chappell                     <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:simon.chappell@...\">simon.chappell@...</a><br/>\nJava Programming Specialist                      www.landsend.com<br/>\nLands&#39; End, Inc.                                   (608) 935-4526</div>", 
    "prevInTime": 5768, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1031867449", 
    "canDelete": false, 
    "nextInTopic": 5770, 
    "prevInTopic": 5768, 
    "headers": {
        "messageIdInHeader": "PDFBQTY5NzFGOTZGQURCNEE5NkNGNzNFNDcyOUIwNUYxMDNGMUU4QFVTRVZTMDEyLmxlaW50ZXJuYWwuY29tPg=="
    }
}