{
    "numMessagesInTopic": 9, 
    "nextInTime": 5836, 
    "senderId": "kBIqbvwH8lsWnFs_ELwXdqPsr0IXgbXaiYvUt3Qouao3yxZxz509b3-DMN32zsZ1-ZkZosw_xZk4gu6gaJQtsBzJbL8", 
    "systemMessage": false, 
    "subject": "Running tests in some specified sequence", 
    "from": "Taras Tielkes &lt;taras@...&gt;", 
    "authorName": "Taras Tielkes", 
    "msgSnippet": "Hi, I have a layered API class model that I d like to unit test. The API is layered in the sense that some high level APIs depend on lower level APIs. Other", 
    "msgId": 5835, 
    "profile": "infopakkapakka", 
    "topicId": 5826, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 78821570, 
    "messageBody": "<div id=\"ygrps-yiv-1508929786\">Hi,<br/>\n<br/>\nI have a layered API class model that I&#39;d like to unit test.<br/>\n<br/>\nThe API is layered in the sense that some high level APIs depend on lower<br/>\nlevel APIs. Other higher level APIs are built on the high level APIs.<br/>\n<br/>\nI have written unit tests for each of these APIs.<br/>\n<br/>\nThese unit tests can be run in any sequence, however: I&#39;d like to specify<br/>\nthat the unit tests for the lower level APIs should be run first.<br/>\nWhen these tests pass, the higher level APIs can be tested, having some<br/>\nconfidence that the lower level works.<br/>\n<br/>\nThe reason is that when an error occurs in a low level API, it&#39;s easier to<br/>\ndiagnose when it occurs in the unit test for the lower level API, rather<br/>\nthan as a result of the higher level API calling the low level API.<br/>\n<br/>\nWhen I add tests to a TestSuite using one of the addXXX() methods, is the<br/>\nsequence of adding the tests the same sequence if which the tests are run?<br/>\n<br/>\nIf not, how can specify that a subset of all tests &#39;should&#39; be run in some<br/>\nsequence? (Note: not *must*, the unit tests can still be run in *any*<br/>\nsequence, but I&#39;d like the stuff that tests the low level parts of the code<br/>\nto run first)<br/>\n<br/>\nIf TestSuite does not respect the sequence of the addXXX() calls for the<br/>\nrunning of the tests, can I implements this by extending TestSuite?<br/>\n<br/>\nThanks in advance for any comments on this! (I&#39;m pretty new to unit testing<br/>\nin general)<br/>\n<br/>\ntt</div>", 
    "prevInTime": 5834, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1032508216", 
    "canDelete": false, 
    "nextInTopic": 5840, 
    "prevInTopic": 5832, 
    "headers": {
        "messageIdInHeader": "PERFQTU5MzU0ODk5MzkyNEFBRUExNzNGRTM0MjE3QzE3MEYwQUQ2QGxzNC5idXJvLmluZm8ubmw+"
    }
}