{
    "numMessagesInTopic": 3, 
    "nextInTime": 5842, 
    "senderId": "yKrr1Muos9hpQaciqRI3ZZyFzV5QBtmA0n5wB-tTOmpxZvYDUJktZobCW_Eu6BODHmOPuMQF_VED4N-dL69uBxcANyzAp9Wt08jGmg", 
    "systemMessage": false, 
    "subject": "Dynamically creating a test case for an XML document", 
    "from": "&quot;adamrabung&quot; &lt;adamrabung@...&gt;", 
    "authorName": "adamrabung", 
    "msgSnippet": "Hello, I have several files on disk which each represent an XML request to our system.  I d like to test that our system is processing each of these correctly", 
    "msgId": 5841, 
    "profile": "adamrabung", 
    "topicId": 5841, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 101612486, 
    "messageBody": "<div id=\"ygrps-yiv-696348511\">Hello,<br/>\nI have several files on disk which each represent an XML request to <br/>\nour system.  I&#39;d like to test that our system is processing each of <br/>\nthese correctly (and hopefully dilineate each test seperately in the <br/>\nresults).  Each request file also has an expected error code, for <br/>\nensuring the server processed the request as expected.  So I need to <br/>\nread each of these files in, send them to the server for processing, <br/>\nand then test that their return code is what was expected.  In my <br/>\nelementary understanding of JUnit, I can do this one of two ways:<br/>\n<br/>\n1. Create a &quot;test&quot; method for each file on the filesystem.  Each <br/>\nmethod would call through to a protected which method which actually <br/>\nperforms the test.  Advantage: I get independent results for each <br/>\nfile on the system.  Disadvantage: I&#39;d need to add a new &quot;test&quot; <br/>\nmethod each time a new request file is added.<br/>\n<br/>\n2. Create a single &quot;test&quot; method which iterates through the set of <br/>\nfiles, processing each. Advantage: we could have a variable amount of <br/>\ntest requests without changing code.  Disadvantage: the set of <br/>\nrequests is treated as one unit(one fails, they all show up as a <br/>\nfailure).<br/>\n<br/>\nIs there a way to &quot;parameterize&quot; this process?  Perhaps by allowing <br/>\nmultiple successes/failures in a single &quot;test&quot; method, or somehow <br/>\nallowing &quot;test&quot; methods that take paramters, that are somehow <br/>\ndilineated in the results?<br/>\n<br/>\nNo good recommendations, just naive questions... sorry.<br/>\n<br/>\nThanks for any help,<br/>\nAdam</div>", 
    "prevInTime": 5840, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1032819578", 
    "canDelete": false, 
    "nextInTopic": 5845, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGFtbzQxcStjMmtoQGVHcm91cHMuY29tPg=="
    }
}