{
    "numMessagesInTopic": 11, 
    "nextInTime": 5873, 
    "senderId": "5nTYcvIQ-Wx6WTOVGLOb-k2XFI0wF5uFOlpBz8DpWxQKjdJ-ZaD5qOSlrrKz06hNh963m38WqZHagGIyo_lWoJQwRtE", 
    "systemMessage": false, 
    "subject": "Reporting,trace messages, etc", 
    "from": "&quot;vrntech&quot; &lt;vrntech@...&gt;", 
    "authorName": "vrntech", 
    "msgSnippet": "Hello Netters, I am starting to use JUnit and am relatively new to it. After searching thru documentation, this news group and other sources, some issues still", 
    "msgId": 5872, 
    "profile": "vrntech", 
    "topicId": 5872, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 125734997, 
    "messageBody": "<div id=\"ygrps-yiv-1785723031\">Hello Netters,<br/>\n<br/>\n     I am starting to use JUnit and am relatively new to it. After <br/>\nsearching thru documentation, this news group and other sources, some <br/>\nissues still remain that I hope some of you can help answer.<br/>\n<br/>\n    1. We have a need to put some trace messages in the tests so as <br/>\nto know the progress of the test itself because each test can be <br/>\nfairly timeconsuming. Is there a way to have these capture this <br/>\noutput for an individual test in the GUI-based TestRunner? I see only <br/>\nthing that is captured for each test on the UI are the assertion <br/>\nfailures. <br/>\n <br/>\n    2. I see that JUnitReport is used quite extensively with Ant. <br/>\nFrom what I learnt reading, it helps output TestResult in XML format <br/>\nand then one can translate it using XSLT. Know how one can use that <br/>\nwithout having to use Ant? Any resources on Net would be helpful.<br/>\n<br/>\n   3. I see JUnit is great for nesting sub-suites within a suite and <br/>\nthereby creating a tree of suites. But when it comes to test results, <br/>\nis there a way to get a breakup of which sub-suite had how many <br/>\nfailures from TestResult?<br/>\n<br/>\n<br/>\nThanks in advance,<br/>\nVern</div>", 
    "prevInTime": 5871, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1033178135", 
    "canDelete": false, 
    "nextInTopic": 5883, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGFuMzI2biszdXNiQGVHcm91cHMuY29tPg=="
    }
}