{
    "numMessagesInTopic": 38, 
    "nextInTime": 5878, 
    "senderId": "tVu5h2hAcLyvrgrdx_stXOcXSqPeUiWyXe15B5Cj5_-ASsBs5hyxm9bF1LDFaC-RWqmDdnOhz1h-gA47VzzQOzo0ci5tXEolYyylpQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Do JUnit internals suck?!?", 
    "from": "Berin Loritsch &lt;bloritsch@...&gt;", 
    "authorName": "Berin Loritsch", 
    "msgSnippet": "... While I wouldn t put it the way that DS put it, I do agree with some of his assertions. I am constantly trying to figure out what is meant by the", 
    "msgId": 5877, 
    "rawEmail": "Return-Path: &lt;bloritsch@...&gt;\r\nX-Sender: bloritsch@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_1_1_4); 30 Sep 2002 14:57:02 -0000\r\nReceived: (qmail 64581 invoked from network); 30 Sep 2002 14:57:02 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m11.grp.scd.yahoo.com with QMQP; 30 Sep 2002 14:57:02 -0000\r\nReceived: from unknown (HELO www1.kc.aoindustries.com) (209.15.201.70)\n  by mta2.grp.scd.yahoo.com with SMTP; 30 Sep 2002 14:57:02 -0000\r\nReceived: from apache.org ([65.105.132.131])\n\tby www1.kc.aoindustries.com (8.11.6/8.11.0) with ESMTP id g8UEv1R26577\n\tfor &lt;junit@yahoogroups.com&gt;; Mon, 30 Sep 2002 09:57:01 -0500\r\nMessage-ID: &lt;3D9867C9.1060201@...&gt;\r\nDate: Mon, 30 Sep 2002 11:03:37 -0400\r\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 5.0; en-US; rv:1.1) Gecko/20020826\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] Do JUnit internals suck?!?\r\nReferences: &lt;9EE9982696300C47B28BB7B6C942052603016EC4@...&gt;\r\nContent-Type: text/plain; charset=us-ascii; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nFrom: Berin Loritsch &lt;bloritsch@...&gt;\r\nX-Yahoo-Group-Post: member; u=64910131\r\nX-Yahoo-Profile: bloritsch\r\n\r\nDemyanovich, Craig - Apogent wrote:\n&gt; Below is a brief conversation that took place on another mailing list.  The\n&gt; original comment by DS was in response to another person&#39;s question\n&gt; regarding problems using JUnit for testing EJBs.  My text is marked with my\n&gt; initials, CD.  While I will take the advice of DS and have a look at the\n&gt; source, I wanted the group to have access to his opinion, to have feedback\n&gt; that could be used to make JUnit better for the next release.\n&gt; \n&gt; DS &gt; Junit internals suck. I would love to rewrite it, but don&#39;t\n&gt; DS &gt; have the time.\n&gt; \n&gt; CD &gt; I&#39;ve been told before that the JUnit source code serves as a great \n&gt; CD &gt; example for writing good code.  Hence, your statement surprised me.  \n&gt; CD &gt; Since you&#39;re a respected developer of a great application server, I \n&gt; CD &gt; ask that you cite a few examples to support your statement.  I&#39;d \n&gt; CD &gt; really like to hear your side of the story.\n&gt; \n&gt; DS &gt; Read the source, and you will see what I am talking about.  I believe \n&gt; DS &gt; you misunderstood the comments from other people.  JUnit is a good \n&gt; DS &gt; example of successful software development and it is also a good\n&gt; example \n&gt; DS &gt; of XP development.  The problem with XP is that it is not designed for \n&gt; DS &gt; Library software (see the last chapter of the xp book), so it works\n&gt; good \n&gt; DS &gt; at what it was designed for, but it is difficult to expand.  They also \n&gt; DS &gt; use way too much inheritance and not enough interfaces.  Anyway, just \n&gt; DS &gt; read the code and be the judge for yourself.\n\n\nWhile I wouldn&#39;t put it the way that &quot;DS&quot; put it, I do agree with some\nof his assertions.\n\nI am constantly trying to figure out what is meant by the difference\nbetween &quot;Test&quot; and &quot;TestSuite&quot;.  Essentially, the way that the\ntestrunners work really confuses the issue.\n\nA TestCase is a collection of tests.  Each test is run by creating a new\ninstance of a class and passing in the method name of the &quot;test&quot; being\nrun.  However, in the process the TestCase is then treated like a\nTestSuite.  Unless a class implements the suite() method, there is no\nway to change how test runners will work.\n\nI had to perform such a hack for the Avalon testsuite software.  In\nthat scenario, I had the extended TestCase load the container that the\ncomponents run inside of, as well as the support classes and\nconfiguration information.  Unfortunately it is not terribly clean as\nmuch reflection based code suffers from that affliction.  I would like\nto alter the test framework for Avalon to basically have a *tester*\ncomponent that would look up the components in question from an existing\ncontainer and then run its suite of tests.  Unfortunately it doesn&#39;t fit\nthe JUnit framework way of doing things.\n\nTo further complicate the matters, there are extension classes in JUnit\nthat I do not use because I do not really understand what they are for.\nI know that JUnit works--which is really cool.  However, trying to\nfigure out *how* it works is a real PITA.  It becomes an obstacle when\ntrying to extend JUnit to work outside the simple case it was designed\nfor.\n\nWhile in principle, I am against C#, there are some language constructs\nthat I find would be really nice in Java--most notably the concept of\nDelegates and Attributes.  I read an article how it would be easy to\nthrough a more powerful and flexible testing framework together using\nthose two features.  The test runner would collect all the testable\nclasses by their attributes, and then find out which test to runn on\nthe methods using delegates:  something like the following:\n\n[TestWith(SubtractionTester)]\nint subtract( int i1, int i2 )\n{\n     return i1 - i2;\n}\n\nThat way we can build a library of similar functionality--encouraging\na consistent naming scheme for methods so that you can reuse pre-written\ntests.  That reduces the amount of similar rework necessary for\ndifferent tests.\n\n(in order to get it to happen with JUnit, you would have to use XDoclet\nto create your own JavaDoc tags and manufacture your own Delegate style\nframework making a more powerful &quot;Method&quot; object).\n\n-- \n\n&quot;They that give up essential liberty to obtain a little temporary safety\n  deserve neither liberty nor safety.&quot;\n                 - Benjamin Franklin\n\n\n", 
    "profile": "bloritsch", 
    "topicId": 5875, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 64910131, 
    "prevInTime": 5876, 
    "contentTrasformed": false, 
    "postDate": "1033398217", 
    "canDelete": false, 
    "nextInTopic": 5878, 
    "prevInTopic": 5875, 
    "headers": {
        "messageIdInHeader": "PDNEOTg2N0M5LjEwNjAyMDFAYXBhY2hlLm9yZz4=", 
        "referencesHeader": "PDlFRTk5ODI2OTYzMDBDNDdCMjhCQjdCNkM5NDIwNTI2MDMwMTZFQzRAdXNtaTAwMjJrMDYuYXBvZ2VudC5jb20+"
    }
}