{
    "numMessagesInTopic": 11, 
    "nextInTime": 5896, 
    "senderId": "ScqGqpE4ilik-akOT05BXN8N0u7wvlHYXFCc2FX-cX9FwBHZsXQfbmd0lxDRtvg5xlXnDOXhv_ve2_aSksXA6D902oJe", 
    "systemMessage": false, 
    "subject": "Re: Reporting,trace messages, etc", 
    "from": "&quot;kentlbeck&quot; &lt;kentbeck@...&gt;", 
    "authorName": "kentlbeck", 
    "msgSnippet": "... and ... results, ... My philosophy has always been that all the tests should run. For a while I had percentages of tests running in my GUIs, but then it", 
    "msgId": 5895, 
    "profile": "kentlbeck", 
    "topicId": 5872, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 22239111, 
    "messageBody": "<div id=\"ygrps-yiv-1186404941\">--- In junit@y..., &quot;vrntech&quot; &lt;vrntech@y...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;    3. I see JUnit is great for nesting sub-suites within a suite <br/>\n </span></blockquote>and <br/>\n<blockquote><span title=\"ireply\"> &gt; thereby creating a tree of suites. But when it comes to test <br/>\n </span></blockquote>results, <br/>\n<blockquote><span title=\"ireply\"> &gt; is there a way to get a breakup of which sub-suite had how many <br/>\n&gt; failures from TestResult?<br/>\n<br/>\n </span></blockquote>My philosophy has always been that all the tests should run. For a <br/>\nwhile I had percentages of tests running in my GUIs, but then it hit <br/>\nme. It&#39;s a *BINARY* computer. Pass means everything runs. Fail means <br/>\nsomething doesn&#39;t run. Sort of a weakest link thing.<br/>\n<br/>\nThis is also why successes aren&#39;t registered in TestResult. The sun <br/>\ncame up this morning. Gravity works. Ho hum. No need to write that <br/>\nin the diary.<br/>\n<br/>\nRe: internal sucking. The TestRunner hierarchy indeed bites. No <br/>\nexcuses. That&#39;s what 4.0 is for, when Erich and I get 3 days <br/>\ntogether. In the meantime, nothing is stopping anyone from creating <br/>\ntheir own (I&#39;ll be studying Michael&#39;s recent test case for ideas we <br/>\ncan steal.) As for testing EJBs, that was out of scope, so I&#39;m not <br/>\nsurprised it is more difficult than necessary. A test case like <br/>\nMichael&#39;s would constitute constructive criticism.<br/>\n<br/>\nRe: MIT course. I sent the instructor of the course a response, and <br/>\nnever heard anything back. Their complaints about JUnit, and their <br/>\nlinking of XP and JUnit, don&#39;t make sense to me. Of course <br/>\nframeworks should come with docs, since I can&#39;t sit their with <br/>\neveryone who has downloaded JUnit. And it does. Whether they are <br/>\ngood or not we can certainly debate, but they&#39;ve been good enough <br/>\nfor a bunch of folks. If someone wishes they had another doc as a <br/>\nbeginner, they are certainly welcome to write it and we&#39;ll put it in <br/>\nthe distribution.<br/>\n<br/>\nBesides, the picture on the home page of their software engineering <br/>\ncourse, software engineering being the quintessential team sport, <br/>\nshows a row of people staring singly at computer screens and not <br/>\ninteracting with each other in any way.<br/>\n<br/>\nKent</div>", 
    "prevInTime": 5894, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1033528714", 
    "canDelete": false, 
    "nextInTopic": 5896, 
    "prevInTopic": 5894, 
    "headers": {
        "inReplyToHeader": "PGFuMzI2biszdXNiQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGFuZG9pYStzZ3VqQGVHcm91cHMuY29tPg=="
    }
}