{
    "numMessagesInTopic": 38, 
    "nextInTime": 5900, 
    "senderId": "p2zndAwuSW0cMHuOkPqklU9pWq3hKXG2frDvNFxnyrnMVNTlmJ1pklQHSbY20xWV4mgLndDnd50HgsZYrpH9nYh3W5Y", 
    "systemMessage": false, 
    "subject": "Re: [junit] Do JUnit internals suck?!?", 
    "from": "Dave Astels &lt;dave@...&gt;", 
    "authorName": "Dave Astels", 
    "msgSnippet": "... I wouldn t say that.  the inappropriate use of patterns , the too-early use of patterns , but overuse?  That s pretty subjective. ... OK, I ll try to", 
    "msgId": 5899, 
    "profile": "astelsd", 
    "topicId": 5875, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 116713278, 
    "messageBody": "<div id=\"ygrps-yiv-1515626277\">On Wed, 2002-10-02 at 10:33, Berin Loritsch wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There are antipatterns you have to beware of as well, one such<br/>\n&gt; antipattern is an overuse of patterns.<br/>\n<br/>\n </span></blockquote>I wouldn&#39;t say that.  the &quot;inappropriate use of patterns&quot;, the<br/>\n&quot;too-early use of patterns&quot;, but overuse?  That&#39;s pretty subjective.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; The TestCase is taken, and by reflection is turned into a TestSuite.  So<br/>\n&gt; is it a TestCase or a TestSuite?  That is an important distinction.<br/>\n&gt; The Model is not readily apparent.  A stable and predictable model is<br/>\n&gt; essential to good design--esp. in this case.  I have no problem with<br/>\n&gt; saying that a TestCollector dynamically creates a TestSuite from a<br/>\n&gt; collection of TestCases.  That is understandable.  I do have a problem<br/>\n&gt; with the TestCase being treated as a TestSuite though.<br/>\n<br/>\n </span></blockquote>OK, I&#39;ll try to address this one.<br/>\n<br/>\nTestCase is a mechanism to allow fixture reuse.  An instance of a<br/>\nTestCase builds a fixture, runs a single test, and tears down the<br/>\nfixture. By allowing TestCase to contain multiple tests (i.e. public<br/>\nvoid testXXX() methods) you can share a fixture definition.<br/>\n<br/>\nPut another way, TestCase is NOT a way to conceptually group tests. <br/>\nEach TestCase subclass represents a fixture, and contains a group of<br/>\ntests that run in the context of that fixture. Once you realize this,<br/>\nyou&#39;ll find yourself switching (as I did some time ago) from having a<br/>\nTestCase for each class you are testing (with a overly generic fixture<br/>\nof which pieces were used by the different tests) to organizing tests<br/>\naround the fixtures, with less regard for the classes being tested by<br/>\neach TestCase.<br/>\n<br/>\nTestSuite is a mechanism for grouping a collection of TestCase instances<br/>\nand running them sequentially.  So, TestCase has the ability to create a<br/>\nTestSuite containing all instances of itself (using reflection to create<br/>\nan instance for each constituent test).  Also, you have the ability to<br/>\ncreate explicit TestSuites by subclassing TestSuite and writing a custom<br/>\nsuite() method.  This is useful for collecting together groups of<br/>\nsmaller TestSuites which can be other custom TestSuites, or TestSuites<br/>\ngenerated by TestCases.<br/>\n<br/>\nBoth TestSuite and TestCase implement the Test interface. The<br/>\nTestRunners work with things that are Tests, hence we can point at any<br/>\nTest (ie TestSuite or TestCase) and recursively run all the contained<br/>\ntests.  The internal nodes are TestSuites and the leaves are TestCases.<br/>\n<br/>\nI hope that makes things clearer.<br/>\n<br/>\nAnyone think this would make a good topic for the TDD Coad Letter?<br/>\n<br/>\nDave<br/>\n-- <br/>\nDave Astels (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dave@...\">dave@...</a>)<br/>\n  Coauthor of &quot;A Practical Guide to XP&quot;<br/>\n  Editor of the Test-Driven Development Edition of The Coad Letter<br/>\n    (subscribe at www.thecoadletter.com)<br/>\nCEO & Master Software Craftsman, Saorsa Development Inc.<br/>\nwww.saorsa.com<br/>\n&quot;An Agile Software Studio&quot;</div>", 
    "prevInTime": 5898, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1033565635", 
    "canDelete": false, 
    "nextInTopic": 5900, 
    "prevInTopic": 5898, 
    "headers": {
        "inReplyToHeader": "PDNEOUFGNUFELjIwNDA0MDNAYXBhY2hlLm9yZz4=", 
        "messageIdInHeader": "PDEwMzM1NjU2MzUuMTY5NzcuOTUuY2FtZWxAbWVybGluLnNhb3JzYS5jb20+", 
        "referencesHeader": "PDAwNGMwMWMyNjg5YSRjYzVmZmMxMCRhMjM4ODZkOUBtYW1hZ28+IAk8M0Q5QUY1QUQuMjA0MDQwM0BhcGFjaGUub3JnPg=="
    }
}