{
    "numMessagesInTopic": 38, 
    "nextInTime": 5905, 
    "senderId": "MG3NiuRzQ14VY5puz5txx5CkW8waWH7zjdB2OfDDVWJPGo2FdfbMD8UsvA--_NiK4_dpBPNttaAbdOz1S_ib44aovzjdZVYD-n6sfQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Do JUnit internals suck?!?", 
    "from": "Berin Loritsch &lt;bloritsch@...&gt;", 
    "authorName": "Berin Loritsch", 
    "msgSnippet": "... Part of this comes from my Component Based Design background.  An interface is a document of contracts.  Your contracts are always with the interface.  The", 
    "msgId": 5904, 
    "profile": "bloritsch", 
    "topicId": 5875, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 64910131, 
    "messageBody": "<div id=\"ygrps-yiv-975456894\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:johannes.akinlaja@...\">johannes.akinlaja@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi Berin,<br/>\n&gt; <br/>\n&gt; if I got you right, you want TestCase to be an interface. One of the<br/>\n&gt; reasons is:<br/>\n&gt; <br/>\n&gt; Berin Loritsch wrote:<br/>\n&gt; <br/>\n&gt;&gt;The reason being that sometimes the semantics and internals of the<br/>\n&gt;&gt;way TestCase is written gets in the way of how I want to make JUnit<br/>\n&gt;&gt;work in my environment.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I never had such problems due to TestCase being a class. Could you give an<br/>\n&gt; example?<br/>\n<br/>\n </span></blockquote>Part of this comes from my Component Based Design background.  An<br/>\ninterface is a document of contracts.  Your contracts are always with<br/>\nthe interface.  The reason for it is so that the implementations can<br/>\nchange wildly without breaking the contracts.  Version 4 of JUnit would<br/>\nbe able to work with Version 1 code if the contracts remain the same.<br/>\nThat is not always the case with an object hierarchy.<br/>\n<br/>\nThe problem with altering behavior based on a class hierarchy in the<br/>\nway that JUnit does it is that it is neither polymorphic, nor interface<br/>\nbased.  It is somewhere in the middle--which is not clear.  Altering the<br/>\nbehavior of a TestCollector based on the TestCase/TestSuite<br/>\nimplementations means that if I had my own implementation of the Test<br/>\ninterface I don&#39;t know how it is going to be handled.  Interfaces do<br/>\nnot require you to have the same base class.  When used properly, that<br/>\nis a definite *strength*.  When used improperly, it causes problems<br/>\nin predictability.<br/>\n<br/>\nMy point is that the contracts with the Test interface are not defined<br/>\nclearly enough.  If I have to write a test harness (which I do BTW) that<br/>\nworks quite differently than the core JUnit TestCase, then I am SOL.  I<br/>\ncan&#39;t take advantage of any of the features that I would otherwise be<br/>\nable to expect with the relationship between TestCase and TestSuite.  I<br/>\nmight be able to have a bunch of individual Test objects--which in some<br/>\ncases might be even better, but my objects would not be treated the same<br/>\nas the TestCase/TestSuite.<br/>\n<br/>\nFor instance, I need to have a setup where I instantiate a component<br/>\ncontainer, and the tests.  I want the tests to automatically collect all<br/>\nthe testXXXX() methods and execute them.  However I can&#39;t do that unless<br/>\nI extend TestCase.  I can&#39;t extend TestCase because of other mitigating<br/>\ncircumstances.<br/>\n<br/>\nLastly, when your contracts are fixated with the *interface* and not the<br/>\nabstract class, you do not depend on the internals of the abstract<br/>\nclass.  There are some of those dependencies.  Logic for running a test<br/>\nshould not be included in the TestCase itself.  The only thing that<br/>\nshould be in a TestCase are the individual testXXX() methods and<br/>\npossibly the setUp()/tearDown() methods.<br/>\n<br/>\n-- <br/>\n<br/>\n&quot;They that give up essential liberty to obtain a little temporary safety<br/>\n  deserve neither liberty nor safety.&quot;<br/>\n                 - Benjamin Franklin</div>", 
    "prevInTime": 5903, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1033570639", 
    "canDelete": false, 
    "nextInTopic": 5905, 
    "prevInTopic": 5903, 
    "headers": {
        "messageIdInHeader": "PDNEOUIwOTRGLjcwNDA2MDNAYXBhY2hlLm9yZz4=", 
        "referencesHeader": "PE9GMURGRTA0RjQuNDczMjAzNTUtT05DMTI1NkM0Ni4wMDREQ0Q4Q0BzdmMtYWcubmV0Pg=="
    }
}