{
    "numMessagesInTopic": 38, 
    "nextInTime": 5906, 
    "senderId": "iRb_8k5kW8IY4jYckFJBzd8pV1epOuwpjKjJNfDdTo2_XtvXo5Bv4rd-4Ky3cgFghmwjpyK6LtslA8QNjJpktqks0gY", 
    "systemMessage": false, 
    "subject": "Re: [junit] Do JUnit internals suck?!?", 
    "from": "Dave Astels &lt;dave@...&gt;", 
    "authorName": "Dave Astels", 
    "msgSnippet": "... I d call that inappropriate.. using patterns for the sake of using patterns.. and likely in the contest of BDUF, right?  Have you read Joshua Kerievsky s", 
    "msgId": 5905, 
    "profile": "astelsd", 
    "topicId": 5875, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 116713278, 
    "messageBody": "<div id=\"ygrps-yiv-245228733\">On Wed, 2002-10-02 at 11:20, Berin Loritsch wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Dave Astels wrote:<br/>\n&gt; &gt; On Wed, 2002-10-02 at 10:33, Berin Loritsch wrote:<br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt;&gt;There are antipatterns you have to beware of as well, one such<br/>\n&gt; &gt;&gt;antipattern is an overuse of patterns.<br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; I wouldn&#39;t say that.  the &quot;inappropriate use of patterns&quot;, the<br/>\n&gt; &gt; &quot;too-early use of patterns&quot;, but overuse?  That&#39;s pretty subjective.<br/>\n&gt; <br/>\n&gt; Ok.  I  can buy that.  Of course I have worked on small to medium<br/>\n&gt; projects that tried to incorporate almost every pattern under the<br/>\n&gt; sun--many times causing more bulk than necessary.  That is why I<br/>\n&gt; termed it &quot;overuse&quot;, although &quot;inappropreate use&quot; applies better.<br/>\n<br/>\n </span></blockquote>I&#39;d call that inappropriate.. using patterns for the sake of using<br/>\npatterns.. and likely in the contest of BDUF, right?  Have you read<br/>\nJoshua Kerievsky&#39;s &quot;Refactoring to Patterns&quot;?  It explores/catalogs<br/>\nrefactorings that move you to/toward patterns.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt;The TestCase is taken, and by reflection is turned into a TestSuite.  So<br/>\n&gt; &gt;&gt;is it a TestCase or a TestSuite?  That is an important distinction.<br/>\n&gt; &gt;&gt;The Model is not readily apparent.  A stable and predictable model is<br/>\n&gt; &gt;&gt;essential to good design--esp. in this case.  I have no problem with<br/>\n&gt; &gt;&gt;saying that a TestCollector dynamically creates a TestSuite from a<br/>\n&gt; &gt;&gt;collection of TestCases.  That is understandable.  I do have a problem<br/>\n&gt; &gt;&gt;with the TestCase being treated as a TestSuite though.<br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; OK, I&#39;ll try to address this one.<br/>\n&gt; &gt; <br/>\n&gt; &gt; TestCase is a mechanism to allow fixture reuse.  An instance of a<br/>\n&gt; &gt; TestCase builds a fixture, runs a single test, and tears down the<br/>\n&gt; &gt; fixture. By allowing TestCase to contain multiple tests (i.e. public<br/>\n&gt; &gt; void testXXX() methods) you can share a fixture definition.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Put another way, TestCase is NOT a way to conceptually group tests. <br/>\n&gt; &gt; Each TestCase subclass represents a fixture, and contains a group of<br/>\n&gt; &gt; tests that run in the context of that fixture. Once you realize this,<br/>\n&gt; &gt; you&#39;ll find yourself switching (as I did some time ago) from having a<br/>\n&gt; &gt; TestCase for each class you are testing (with a overly generic fixture<br/>\n&gt; &gt; of which pieces were used by the different tests) to organizing tests<br/>\n&gt; &gt; around the fixtures, with less regard for the classes being tested by<br/>\n&gt; &gt; each TestCase.<br/>\n&gt; <br/>\n&gt; I tend to test interfaces.  As such, with the current implementation of<br/>\n&gt; JUinit, I have one Abstract testcase to excersize the interface&#39;s<br/>\n&gt; contracts.  I have concrete classes that extend that abstract test case<br/>\n&gt; for the individual classes.  If there are specific issues or features<br/>\n&gt; of an implementation that need to be tested (i.e. consequences that<br/>\n&gt; are outside of the scope of the interface like ensuring temporary files<br/>\n&gt; are in the right place) I add new methods to the concrete test to ensure<br/>\n&gt; that things are done properly.<br/>\n<br/>\n </span></blockquote>That sounds like a reasonable approach reasonable.  It&#39;s a case of<br/>\nextracting commonality to a superclass.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; As to what you are referring to as a Fixture, I am not exactly sure.<br/>\n<br/>\n </span></blockquote>A fixture is the situation in which a test expects to run. <br/>\nSpecifically, it&#39;s what setUp() builds.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; TestSuite is a mechanism for grouping a collection of TestCase instances<br/>\n&gt; &gt; and running them sequentially.  So, TestCase has the ability to create a<br/>\n&gt; &gt; TestSuite containing all instances of itself (using reflection to create<br/>\n&gt; &gt; an instance for each constituent test).  Also, you have the ability to<br/>\n&gt; &gt; create explicit TestSuites by subclassing TestSuite and writing a custom<br/>\n&gt; &gt; suite() method.  This is useful for collecting together groups of<br/>\n&gt; &gt; smaller TestSuites which can be other custom TestSuites, or TestSuites<br/>\n&gt; &gt; generated by TestCases.<br/>\n&gt; <br/>\n&gt; That&#39;s the thing.  The TestSuite, while theorhetically a nice feature,<br/>\n&gt; adds too much.  You also run the risk/temptation to write tests that<br/>\n&gt; require to be run in a specific order to pass.  If the order is changed,<br/>\n&gt; or unpredictable, you have to write more robust tests.<br/>\n<br/>\n </span></blockquote>All tools involve a certain amount of risk and/or temptation.  It&#39;s a<br/>\nmatter of using it properly.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Nine times out of ten, all you really need is a TestCollector.  The<br/>\n&gt; collector finds all your tests, and runs them.<br/>\n<br/>\n </span></blockquote>Very true. And that&#39;s easy enough to write.  In fact there&#39;s<br/>\nRecursiveTestSuite by Mike Bowler (http://gsbase.sourceforge.net) that<br/>\ndoes that.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Both TestSuite and TestCase implement the Test interface. The<br/>\n&gt; &gt; TestRunners work with things that are Tests, hence we can point at any<br/>\n&gt; &gt; Test (ie TestSuite or TestCase) and recursively run all the contained<br/>\n&gt; &gt; tests.  The internal nodes are TestSuites and the leaves are TestCases.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Yes, but what happens if you don&#39;t want to extend either TestCase or<br/>\n&gt; TestSuite?  What happens if you want to access Assert from TestSuite?<br/>\n&gt; The contracts are with the *implementations* of the Test interface,<br/>\n&gt; and not with the Test interface itself.<br/>\n<br/>\n </span></blockquote>You can always just implement Test and use Assert.  <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; I hope that makes things clearer.<br/>\n&gt; <br/>\n&gt; What about the other points I had?<br/>\n<br/>\n </span></blockquote>I only said I&#39;d address that one :-)<br/>\n<br/>\nWhy not rewrite JUnit the way you are envisioning and see how it works &<br/>\nhow people like it?  Nobody said you *HAVE* to use JUnit.<br/>\n<br/>\nDave<br/>\n-- <br/>\nDave Astels (dave@...)<br/>\n  Coauthor of &quot;A Practical Guide to XP&quot;<br/>\n  Editor of the Test-Driven Development Edition of The Coad Letter<br/>\n    (subscribe at www.thecoadletter.com)<br/>\nCEO & Master Software Craftsman, Saorsa Development Inc.<br/>\nwww.saorsa.com<br/>\n&quot;An Agile Software Studio&quot;</div>", 
    "prevInTime": 5904, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1033569658", 
    "canDelete": false, 
    "nextInTopic": 5906, 
    "prevInTopic": 5904, 
    "headers": {
        "inReplyToHeader": "PDNEOUIwMDk5LjgwODAyMDhAYXBhY2hlLm9yZz4=", 
        "messageIdInHeader": "PDEwMzM1Njk2NTkuMTY5NzkuMTIwLmNhbWVsQG1lcmxpbi5zYW9yc2EuY29tPg==", 
        "referencesHeader": "PDAwNGMwMWMyNjg5YSRjYzVmZmMxMCRhMjM4ODZkOUBtYW1hZ28+CTwzRDlBRjVBRC4yMDQwNDAzQGFwYWNoZS5vcmc+IDwxMDMzNTY1NjM1LjE2OTc3Ljk1LmNhbWVsQG1lcmxpbi5zYW9yc2EuY29tPgkgPDNEOUIwMDk5LjgwODAyMDhAYXBhY2hlLm9yZz4="
    }
}