{
    "numMessagesInTopic": 17, 
    "nextInTime": 5925, 
    "senderId": "rUwPJAu2z0MRLnBKVVcXxRUHNex1dBtKRPMJTOPgJVR3-XYvYOjsNl12vUXonZEerlzvYW_I9J3b9i5MXzkD0bnCXAqcOQxOYxsThmF29AB7mxGJVWTcMBtX", 
    "systemMessage": false, 
    "subject": "RE: [junit] How can I get Junit Test to run in parallel threads?", 
    "from": "&quot;Michael Silverstein&quot; &lt;msilverstein@...&gt;", 
    "authorName": "Michael Silverstein", 
    "msgSnippet": "... I m surprised to hear this now Mike, since you and I exchanged a few notes when the product was released in July. Looking back at the emails we exchanged,", 
    "msgId": 5924, 
    "topicId": 5910, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 62742148, 
    "messageBody": "<div id=\"ygrps-yiv-247407246\">Mike Clark wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; As a member of this community, and the open source community in general,<br/>\n&gt; it got me to thinking about the licenses I use for the stuff I build.<br/>\n&gt;  Anything I craft in the future may just be licensed such that<br/>\n&gt; commercial redistribution rights are only available by writing me.<br/>\n&gt;  Non-commercial redistribution, and its use in the development of<br/>\n&gt; non-commercial products, will be freely granted.  In other words, if I<br/>\n&gt; contribute to this community in good faith, commercial vendors have to<br/>\n&gt; ask before leveraging my wares.<br/>\n&gt;<br/>\n&gt; I guess I expected that type of communication would happen naturally<br/>\n&gt; inside of a community.  It won&#39;t be the first time I&#39;ve been naive, nor<br/>\n&gt; the last.  Live and learn.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I&#39;m surprised to hear this now Mike, since you and I exchanged a few notes<br/>\nwhen the product was released in July. Looking back at the emails we<br/>\nexchanged, your only real comment about it then was, &quot;I would be interested<br/>\nto hear anything you hear from your EJU customers about JUnitPerf.&quot; I also<br/>\nmade the comment to you that &quot;I hope it wasn&#39;t too presumptuous of us to<br/>\ninclude it&quot;, which you never responded to.<br/>\n<br/>\nAnyway, I would be happy to remove JUnitPerf from the distribution if it<br/>\nbothers you being there, as it is not at all core to the product. If you<br/>\nread the documentation you will see that it is described in terms of &#39;here&#39;s<br/>\nsomething else you can do with your tests if you add in a few JUnitPerf<br/>\ndecorators&#39;. I haven&#39;t gotten any feedback from any of our customers that<br/>\nthey are actually using JUnitPerf in conjunction with Enhanced JUnit.<br/>\n<br/>\n^^^^^^^^^^^^^^^^^^^^^^^^^<br/>\nMike Silverstein<br/>\nSilverMark, Inc.<br/>\nThe object testing company<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.javatesting.com\">http://www.javatesting.com</a></div>", 
    "prevInTime": 5923, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1033654402", 
    "canDelete": false, 
    "nextInTopic": 5925, 
    "prevInTopic": 5923, 
    "headers": {
        "inReplyToHeader": "PDNEOUM0MjhFLjMwMTA5MDVAY2xhcmt3YXJlLmNvbT4=", 
        "messageIdInHeader": "PE5EQkJKRUZLTURHRklCRUtLRUxFQ0VJTEVEQUEubXNpbHZlcnN0ZWluQHNpbHZlcm1hcmsuY29tPg=="
    }
}