{
    "numMessagesInTopic": 17, 
    "nextInTime": 5928, 
    "senderId": "b-oNyjwlfW_tJJXRVY7T8xOc79sYbbfvlzkIgan1ADM-GQHOgxnN8bKZv0no5YtK8m4Hf5-_BvlLSVIT7PqprQacyLSOWg", 
    "systemMessage": false, 
    "subject": "Re: [junit] How can I get Junit Test to run in parallel threads?", 
    "from": "Mike Clark &lt;mike@...&gt;", 
    "authorName": "Mike Clark", 
    "msgSnippet": "... What surprises you about my response? No doubt, I was disappointed that you didn t contact me prior to distributing JUnitPerf.  It s not that I wouldn t", 
    "msgId": 5927, 
    "profile": "clarkware", 
    "topicId": 5910, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 33026788, 
    "messageBody": "<div id=\"ygrps-yiv-432315266\">Michael Silverstein wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;m surprised to hear this now Mike, since you and I exchanged a few notes<br/>\n&gt;when the product was released in July. Looking back at the emails we<br/>\n&gt;exchanged, your only real comment about it then was, &quot;I would be interested<br/>\n&gt;to hear anything you hear from your EJU customers about JUnitPerf.&quot; I also<br/>\n&gt;made the comment to you that &quot;I hope it wasn&#39;t too presumptuous of us to<br/>\n&gt;include it&quot;, which you never responded to.<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>What surprises you about my response?<br/>\n<br/>\nNo doubt, I was disappointed that you didn&#39;t contact me prior to <br/>\ndistributing JUnitPerf.  It&#39;s not that I wouldn&#39;t have allowed you to do <br/>\nso, just that I expected something a little more collegial.  The <br/>\nafter-action report stating that it was being distributed and that you <br/>\nhoped that was cool didn&#39;t sit well with me.  It didn&#39;t come across as <br/>\ngenuine, but perhaps it was just my interpretation.  Going back to the <br/>\nreason for my response, it didn&#39;t have that community feel.         <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Anyway, I would be happy to remove JUnitPerf from the distribution if it<br/>\n&gt;bothers you being there, as it is not at all core to the product. If you<br/>\n&gt;read the documentation you will see that it is described in terms of &#39;here&#39;s<br/>\n&gt;something else you can do with your tests if you add in a few JUnitPerf<br/>\n&gt;decorators&#39;. I haven&#39;t gotten any feedback from any of our customers that<br/>\n&gt;they are actually using JUnitPerf in conjunction with Enhanced JUnit.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I don&#39;t have a problem with it being distributed.  The license clearly <br/>\ngrants you permission to do so, and I stand by that license.  Whether <br/>\nyou leave it in or not it completely up to you.  Your customers seem to <br/>\nhave already decided that your product stands on its own.<br/>\n<br/>\nI don&#39;t want this thread to become a reflection of your product.  If <br/>\nthere&#39;s follow-up, let&#39;s take it offline.<br/>\n<br/>\nMike<br/>\n<br/>\n-- <br/>\nMike Clark<br/>\nClarkware Consulting Inc.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.clarkware.com\">http://www.clarkware.com</a></div>", 
    "prevInTime": 5926, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1033660694", 
    "canDelete": false, 
    "nextInTopic": 5929, 
    "prevInTopic": 5925, 
    "headers": {
        "messageIdInHeader": "PDNEOUM2OTE2LjMwNjAxMDVAY2xhcmt3YXJlLmNvbT4=", 
        "referencesHeader": "PE5EQkJKRUZLTURHRklCRUtLRUxFQ0VJTEVEQUEubXNpbHZlcnN0ZWluQHNpbHZlcm1hcmsuY29tPg=="
    }
}