{
    "numMessagesInTopic": 17, 
    "nextInTime": 5930, 
    "senderId": "cAQtGn0g4aCCdEs5e0Rpvm9q8c7gjOp0_oik-VirCh5I9czQatrjT-2Qw4EPdDBatT_wlgnYMRbybqmCE2z0tTVHJ4CK7uSQJ30EgC7mj--kqRTQwlPhbGHh", 
    "systemMessage": false, 
    "subject": "RE: [junit] How can I get Junit Test to run in parallel threads?", 
    "from": "&quot;Michael Silverstein&quot; &lt;msilverstein@...&gt;", 
    "authorName": "Michael Silverstein", 
    "msgSnippet": "... Mike: Not to beat a dead horse but since your append questions my intentions in a public forum, I do feel I should respond (just one more time) there as", 
    "msgId": 5929, 
    "topicId": 5910, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 62742148, 
    "messageBody": "<div id=\"ygrps-yiv-409184272\">Mike Clark wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Michael Silverstein wrote:<br/>\n&gt;<br/>\n&gt; &gt;I&#39;m surprised to hear this now Mike, since you and I exchanged a<br/>\n&gt; few notes<br/>\n&gt; &gt;when the product was released in July. Looking back at the emails we<br/>\n&gt; &gt;exchanged, your only real comment about it then was, &quot;I would be<br/>\n&gt; interested<br/>\n&gt; &gt;to hear anything you hear from your EJU customers about<br/>\n&gt; JUnitPerf.&quot; I also<br/>\n&gt; &gt;made the comment to you that &quot;I hope it wasn&#39;t too presumptuous of us to<br/>\n&gt; &gt;include it&quot;, which you never responded to.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; What surprises you about my response?<br/>\n&gt;<br/>\n&gt; No doubt, I was disappointed that you didn&#39;t contact me prior to<br/>\n&gt; distributing JUnitPerf.  It&#39;s not that I wouldn&#39;t have allowed you to do<br/>\n&gt; so, just that I expected something a little more collegial.  The<br/>\n&gt; after-action report stating that it was being distributed and that you<br/>\n&gt; hoped that was cool didn&#39;t sit well with me.  It didn&#39;t come across as<br/>\n&gt; genuine, but perhaps it was just my interpretation.  Going back to the<br/>\n&gt; reason for my response, it didn&#39;t have that community feel.<br/>\n&gt;<br/>\n&gt; I don&#39;t want this thread to become a reflection of your product.  If<br/>\n&gt; there&#39;s follow-up, let&#39;s take it offline.<br/>\n<br/>\n </span></blockquote>Mike:<br/>\n<br/>\nNot to beat a dead horse but since your append questions my intentions in a<br/>\npublic forum, I do feel I should respond (just one more time) there as well.<br/>\nI agree that anything further should go offline.<br/>\n<br/>\nTo be absolutely specific, the integration with JUnitPerf in Enhanced JUnit<br/>\nconsists of a chapter in the manual on how to do additional stuff with<br/>\nJUnitPerf. This was based on some last minute ideas we had and chose to<br/>\ndocument shortly before release. We then had the choice of either providing<br/>\na link to JUnitPerf or providing the distribution itself. It seemed like it<br/>\nwould be more convenient for our customers to actually provide the JUnitPerf<br/>\ndistribution itself, and it was fairly small so we chose to do that.<br/>\n<br/>\nThis decision was made at the last minute when we were putting together our<br/>\nown distribution. Had the thought occurred to us earlier we might have<br/>\ncontacted you first, but it didn&#39;t and we didn&#39;t and for that I apologize.<br/>\nHad I had any inkling that it would have caused you or anyone else the<br/>\nslightest mental distress, I would have done everything in my power to<br/>\nprevent that. Again, I didn&#39;t get any indication that you were at all<br/>\ndisappointed in our correspondence last July but it might have been there<br/>\nand I just didn&#39;t pick up on it.<br/>\n<br/>\nIn the next release, we will take out the JUnitPerf distribution and just<br/>\nprovide a link to your web site. That will also settle the question of<br/>\nwhether our customers have access to the very latest JUnitPerf code, which<br/>\nsolves a problem for me.<br/>\n<br/>\n- Mike<br/>\n<br/>\n^^^^^^^^^^^^^^^^^^^^^^^^^<br/>\nMike Silverstein<br/>\nSilverMark, Inc.<br/>\nThe object testing company<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.javatesting.com\">http://www.javatesting.com</a></div>", 
    "prevInTime": 5928, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1033663054", 
    "canDelete": false, 
    "nextInTopic": 5930, 
    "prevInTopic": 5927, 
    "headers": {
        "inReplyToHeader": "PDNEOUM2OTE2LjMwNjAxMDVAY2xhcmt3YXJlLmNvbT4=", 
        "messageIdInHeader": "PE5EQkJKRUZLTURHRklCRUtLRUxFR0VJUEVEQUEubXNpbHZlcnN0ZWluQHNpbHZlcm1hcmsuY29tPg=="
    }
}