{
    "numMessagesInTopic": 4, 
    "nextInTime": 5950, 
    "senderId": "y5MCn7SMI5MIvdAkArRdha5Lh9gofBFM7SutFfpwRzfbQ3FPl_XkqwKTp9D_S3Qx11Va7H-N4CI5SBem6Saz7LQnnq5hNzuC7Qs", 
    "systemMessage": false, 
    "subject": "Unrelated effects - newbie ignorance", 
    "from": "&quot;cdtmp&quot; &lt;jyahoogroups@...&gt;", 
    "authorName": "cdtmp", 
    "msgSnippet": "I d appreciate some pointers (even pointers to the manual since I can t find this in there). I have an situation where the effect of a method is to send (or", 
    "msgId": 5949, 
    "profile": "cdtmp", 
    "topicId": 5949, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 126413849, 
    "messageBody": "<div id=\"ygrps-yiv-1236602567\">I&#39;d appreciate some pointers (even pointers to the manual since I<br/>\ncan&#39;t find this in there).  <br/>\n<br/>\nI have an situation where the effect of a method is to send (or not to<br/>\nsend) a message through either a serial port, socket or similar.<br/>\n<br/>\nThe behavior is controlled by a (number of) well defined state<br/>\ndiagrams. Summarizing a huge specification, messages are sent through<br/>\nthe ports based on transitions and the exisiting state of hierachical<br/>\nstate diagrams.  The situation seems ideal for unit testing since the<br/>\nwhole environment is complex and unit testing would ensure that the<br/>\nmessages sent, based on the state transitions are correct after<br/>\nmodifications and we could automatically test a huge number of cases.<br/>\n It&#39;s not actually _what_ is sent, since that can be tested, but it&#39;s<br/>\nthat the correct sequence of messages was requested to be sent (based,<br/>\nin this case, on string identifiers).<br/>\n<br/>\nMy problem is that the state of the object after the call is the same<br/>\nas before the call, or at least the sending of the message is not, and<br/>\ncannot easily be indicated in the state of the object without changing<br/>\nthe runtime behavior of the object.<br/>\n<br/>\nI hope all this makes sense.  I&#39;d appreciate any suggestions.  My only<br/>\nthought for checking this is something like a log file, or Log4J<br/>\nlogger.  After the test I could check the logger and make sure that it<br/>\ncontains _exactly_ what I would expect - but this seems somewhat complex.<br/>\n<br/>\nJim</div>", 
    "prevInTime": 5948, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1033865798", 
    "canDelete": false, 
    "nextInTopic": 5950, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGFubzFvNitlbmRxQGVHcm91cHMuY29tPg=="
    }
}