{
    "numMessagesInTopic": 9, 
    "nextInTime": 6006, 
    "senderId": "01X35FzvRENdt5-9tk0Iry_fLqSCU2ViDd2sRX9pC0evDkknCasDzrvrOTuby6lcbFitPc_RhAKVtgmasIOZHReFhuJg", 
    "systemMessage": false, 
    "subject": "Tradeoff btw. right design and performance", 
    "from": "&quot;Rytrom&quot; &lt;roman@...&gt;", 
    "authorName": "Rytrom", 
    "msgSnippet": "Hi all, I m a newcommer of this board so the question I m asking about might have been asked already and if so then sorry:-) Let me start from an example. ", 
    "msgId": 6005, 
    "profile": "rytrom", 
    "topicId": 6005, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 111458649, 
    "messageBody": "<div id=\"ygrps-yiv-1569142524\">Hi all,<br/>\nI&#39;m a newcommer of this board so the question I&#39;m asking about might <br/>\nhave been asked already and if so then sorry:-)<br/>\n<br/>\nLet me start from an example.<br/>\nThere is a class building a XML-based report comprised of data <br/>\ngathered from a DB and other static data (let&#39;s say some <br/>\nreport-scpecific data like header titles, date and so on). Reports <br/>\nmay be very long and here two approaches arise. <br/>\n1. I guess that the classic design would be to separate gathering DB <br/>\ndata from composing XML, but on the other hand, if a gatherer returns <br/>\na collection of value objects from a DB and then a composer really <br/>\nbuilds an XML we waste memory. The example is not so teoretical cause <br/>\nI met users working somehow with MSWord documents of size 200Mb. If <br/>\nan XML report would have a like length then a server building several <br/>\nsuch request will simply die! <br/>\n2. Non classic solution is to return to a composer a recordset object <br/>\nand put on the composer&#39;s shoulders to fetch it, surround by specific <br/>\ninfo and put out. This resolves memory wasting problem but tights two <br/>\ndifferent activities together.<br/>\n<br/>\nWhy I&#39;m asking this question in JUint group is &#39;cause I started <br/>\npracticing JUint recently and one of my badly-designed classes <br/>\nhappened to be untestable (cause of such thought copling).<br/>\nAs buffs of XP approach what do you preffer? Does it mean that every <br/>\ntime a unit test can&#39;t be written for a function the function must be <br/>\nrefactored?</div>", 
    "prevInTime": 6004, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1034871371", 
    "canDelete": false, 
    "nextInTopic": 6006, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGFvbW5vYitlYWVqQGVHcm91cHMuY29tPg=="
    }
}