{
    "numMessagesInTopic": 6, 
    "nextInTime": 6162, 
    "senderId": "Zw3IVpbnurSzYx4zRQAjU8wKeuu77sguAH3CLmFnLonJHRYiCuE3AEnFYUOrXppY6vchNAya2Lycvg", 
    "systemMessage": false, 
    "subject": "Re: [junit] Using the same test but with different parameters", 
    "from": "david.cok@...", 
    "authorName": "david.cok@kodak.com", 
    "msgSnippet": "I accomplished what you are looking for as follows.  In my case it was to reuse some tests (without modification) that were present in a number of external", 
    "msgId": 6161, 
    "profile": "davidrc2003", 
    "topicId": 6150, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 43584333, 
    "messageBody": "<div id=\"ygrps-yiv-1636397502\">I accomplished what you are looking for as follows.  In my case it was to <br/>\nreuse some tests (without modification) that were present in a number of <br/>\nexternal files, so the filename was the parameter.<br/>\n<br/>\nI created a test class that was a derived class of TestSuite.<br/>\n<br/>\nWithin that I declared a static inner class that derives from TestCase <br/>\n(though it could just as well be a separate non-inner public class)<br/>\nThe actual test is in the runTest method of the inner class.<br/>\nThe inner class has a constructor that takes arguments which are the <br/>\nvariable parameters to the test, storing the values in <br/>\n<br/>\nIn the constructor of the TestSuite I construct and add as tests instances <br/>\nof the inner TestCase for each set of parameters I want to run (by <br/>\ncalling, for example, addTest(new InnerTestCase(...)); ).<br/>\n<br/>\nThen I can run the test suite.  Each instance of the inner test case <br/>\ncounts as a single test and is reported as so in the TestRunners - <br/>\nincluding in the test hierarchy display.  The TestSuite&#39;s run and <br/>\ncountTestCases methods work without derivation, if I remember correctly. I <br/>\nthink I did define a static suite() method for the TestSuite.  You can <br/>\nalso add the outer Test Suite as an element of larger Test Suites.<br/>\n<br/>\nWorks great - the more I figured out how to properly use JUnit, the <br/>\nshorter my own code became.<br/>\n<br/>\nI don&#39;t have the code here, but will be glad to send it to you directly if <br/>\nmy approach is not clear from the discussion above.<br/>\n<br/>\n- David<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&quot;mark_x_robinson&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mark_X_robinson@...\">mark_X_robinson@...</a>&gt;<br/>\n11/13/2002 07:53 AM<br/>\nPlease respond to junit<br/>\n<br/>\n <br/>\n        To:     <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\n        cc: <br/>\n        Subject:        [junit] Using the same test but with different parameters<br/>\n<br/>\n<br/>\nI have a standard test with needs to be run for different parameters.<br/>\nI have created an XML file to define all the parameters and was<br/>\nhoping to use JUnit to run the tests.<br/>\n<br/>\nI cannot see how I can run the same method using different parameters.<br/>\ne.g tests hcannot take paramters and methods are only called one.<br/>\n<br/>\nI could have one test method that does the test for each parameter<br/>\nset but JUnit I don&#39;t think allows you to continue after an assert.<br/>\nBasically I want to treat each pass of the test  as a seperate<br/>\nsuccess/fail condition.<br/>\n<br/>\nAny ideas ?<br/>\n<br/>\n<br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 6160, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1037210837", 
    "canDelete": false, 
    "nextInTopic": 6175, 
    "prevInTopic": 6156, 
    "headers": {
        "messageIdInHeader": "PE9GQkVDQTJCQUMuMUVDRUM4QkItT044NTI1NkM3MC4wMDYxQUNDREBrb2Rhay5jb20+"
    }
}