{
    "numMessagesInTopic": 12, 
    "nextInTime": 6163, 
    "senderId": "GiEO_fdUIeBFdjFebWf-Z5QyN3gakZAJlB3kMBmE8ojYUdRJ8xcZfR8bwYQ5WnjTU4SnkwPDd0jkO_7VFmthfk-9GtX6Aw", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Best approach for Unit testing asynch responses?", 
    "from": "Mike Clark &lt;mike@...&gt;", 
    "authorName": "Mike Clark", 
    "msgSnippet": "... The meaning of unit in unit test is ambiguous, at best.  Many of my unit tests actually test a constellation of objects, not a specific object in", 
    "msgId": 6162, 
    "profile": "clarkware", 
    "topicId": 6137, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 33026788, 
    "messageBody": "<div id=\"ygrps-yiv-1872636051\">nsparis wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;You are referring to what I am doing as an &quot;integration&quot; test.  Do <br/>\n&gt;you think this is no longer a unit test when I start making sure that <br/>\n&gt;the messenger is respondeing correctly when something is added?  <br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>The meaning of &quot;unit&quot; in &quot;unit test&quot; is ambiguous, at best.  Many of my <br/>\nunit tests actually test a constellation of objects, not a specific <br/>\nobject in isolation. So in that respect, debating whether it&#39;s a unit <br/>\ntest or an integration test is splitting hairs.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Should the unit test only make sure that the addMessage() method is <br/>\n&gt;working (I.e. it received the message), and the integration test <br/>\n&gt;should then make sure that when a certain message is added it <br/>\n&gt;recieves the correct response message via the listener?<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>My personal style would be to test the guts of addMessage() without <br/>\nhaving to sleep anywhere in the test.  Sleeping takes time and will <br/>\nultimately cause my test suite to run slower than I&#39;d like.  So I&#39;d try <br/>\nto test the behavior synchronously. If that were difficult, I&#39;d take a <br/>\nlesson from the pain and try to rework the design such that it was <br/>\npossible. Then I might write a unit/integration test one layer removed <br/>\nto get confident about the asynchronous aspects, if I feared it might break.<br/>\n<br/>\nDo whatever gives you confidence and simply call it a test.<br/>\n<br/>\nMike</div>", 
    "prevInTime": 6161, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1037212010", 
    "canDelete": false, 
    "nextInTopic": 6172, 
    "prevInTopic": 6158, 
    "headers": {
        "messageIdInHeader": "PDNERDI5OTZBLjIwMDAxMDRAY2xhcmt3YXJlLmNvbT4=", 
        "referencesHeader": "PGFxdHNtNitjZzJiQGVHcm91cHMuY29tPg=="
    }
}