{
    "numMessagesInTopic": 12, 
    "nextInTime": 6188, 
    "senderId": "o6cpPLnCcjKHolfyaWQ7cBioH_SM1k2QeoZmq-pSlMR-CWT8q5FYZqbqeLvPG5rw4eDtXn-tegWoN0ovz49ya_zh0ewfvbfjcUj2ESac", 
    "systemMessage": false, 
    "subject": "RE: [junit] Re: Best approach for Unit testing asynch responses?", 
    "from": "&quot;McCrann, Mike&quot; &lt;mike.mccrann@...&gt;", 
    "authorName": "McCrann, Mike", 
    "msgSnippet": "I too am very interested in where people draw the line between unit testing and integration testing. Humphrey Sheil in his JavaWorld article J2EE project", 
    "msgId": 6187, 
    "topicId": 6137, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 64775977, 
    "messageBody": "<div id=\"ygrps-yiv-1995642775\">I too am very interested in where people draw the line between unit testing and integration testing.<br/>\nHumphrey Sheil in his JavaWorld article &quot;J2EE project dangers!&quot;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.javaworld.com/javaworld/jw-03-2001/jw-0330-ten_p.html\">http://www.javaworld.com/javaworld/jw-03-2001/jw-0330-ten_p.html</a><br/>\n<br/>\nsays that he would like to talk about: &#39;Unit testing versus integration testing (when is testing done?)&#39;<br/>\n<br/>\nHas anyone got any thoughts or references on the differences between unit testing and integration testing. Some questions spring to mind:<br/>\n<br/>\nWhen should each be done?<br/>\nWhat you are trying to achieve with each?<br/>\nWhat asumptions you can make with each?<br/>\n<br/>\nThanks<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: nsparis [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nathan_paris@...\">nathan_paris@...</a>]<br/>\nSent: 13 November 2002 15:56<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSubject: [junit] Re: Best approach for Unit testing asynch responses?<br/>\n<br/>\n<br/>\nYou are referring to what I am doing as an &quot;integration&quot; test.  Do <br/>\nyou think this is no longer a unit test when I start making sure that <br/>\nthe messenger is respondeing correctly when something is added?  <br/>\n<br/>\nShould the unit test only make sure that the addMessage() method is <br/>\nworking (I.e. it received the message), and the integration test <br/>\nshould then make sure that when a certain message is added it <br/>\nrecieves the correct response message via the listener?<br/>\n<br/>\nThanks<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In junit@y..., &quot;Michael Rettig&quot; &lt;mrettig@h...&gt; wrote:<br/>\n&gt; ----- Original Message -----<br/>\n&gt; From: Mike Clark &lt;mike@c...&gt;<br/>\n&gt; &gt; &gt;I have already implemented this with JUnit by making the <br/>\n&gt; &gt; &gt;TestMessenger TestCase a MessengerLister.  After I add a message <br/>\nI <br/>\n&gt; &gt; &gt;sleep until a response is supplied. I then wake up (or time out <br/>\nfor <br/>\n&gt; &gt; &gt;failure) and test if this is the correct response to assert if <br/>\nthe <br/>\n&gt; &gt; &gt;test failed or passed. <br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; <br/>\n&gt; &gt; Sounds like a reasonable integration test.  That&#39;s generally the <br/>\n&gt; &gt; approach I take when faced with testing asynchronous messaging <br/>\nend-to-end.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Mike<br/>\n&gt; <br/>\n&gt; Also, you can look at mocking your messenger layer. Whenever, I&#39;ve <br/>\ndone asynch testing, I found a way to make the testing synchronouse <br/>\nusing a mock layer. This was ideal for simulating odd messaging <br/>\nbehavior that could not be easily replicated asynchronously.  <br/>\n&gt; <br/>\n&gt; Mike Rettig<br/>\n&gt; -- <br/>\n&gt; __________________________________________________________<br/>\n&gt; Sign-up for your own FREE Personalized E-mail at Mail.com<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mail.com/?sr=signup\">http://www.mail.com/?sr=signup</a><br/>\n&gt; <br/>\n&gt; Single & ready to mingle? lavalife.com:  Where singles click. Free <br/>\nto Search!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lavalife.com/wp.epl?a=2716\">http://www.lavalife.com/wp.epl?a=2716</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n <br/>\n<br/>\nYour use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a> <br/>\n<br/>\n<br/>\n<br/>\nThis message is for the named person&#39;s use only. It may contain sensitive and private proprietary or legally privileged information. No confidentiality or privilege is waived or lost by any mistransmission. If you are not the intended recipient, please immediately delete it and all copies of it from your system, destroy any hard copies of it and notify the sender. You must not, directly or indirectly, use, disclose, distribute, print, or copy any part of this message if you are not the intended recipient. CREDIT SUISSE GROUP and each legal entity in the CREDIT SUISSE FIRST BOSTON or CREDIT SUISSE ASSET MANAGEMENT business units of CREDIT SUISSE FIRST BOSTON reserve the right to monitor all e-mail communications through its networks. Any views expressed in this message are those of the individual sender, except where the message states otherwise and the sender is authorized to state them to be the views of any such entity.<br/>\nUnless otherwise stated, any pricing information given in this message is indicative  only, is subject to change and does not constitute an offer to deal at any price quoted. Any reference to the terms of executed transactions should be treated as  preliminary only and subject to our formal written confirmation. </span></blockquote></div>", 
    "prevInTime": 6186, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1037266611", 
    "canDelete": false, 
    "nextInTopic": 6198, 
    "prevInTopic": 6182, 
    "headers": {
        "messageIdInHeader": "PDQxMDY0MzlCMUYyMkQ2MTFBNDEwMDAwMkE1NkIwRjdFNjgxNzNEQHNsb24xMDMwMi5jc2ZwLmNvLnVrPg=="
    }
}