{
    "numMessagesInTopic": 2, 
    "nextInTime": 6222, 
    "senderId": "2B-urSK9-xAV-aueTIrB8E8Vwd0D2OL33IyZW9xqiErlqXC9WAEDXY-8dx-GZoNwmbVX-24nQwpk1TBxaGYBv9ma6kLAyoiTbH1tEouy8T5hjBWLarl2qapRGZwj", 
    "systemMessage": false, 
    "subject": "Server Side EJB application testing", 
    "from": "&quot;Puvanachandran, Gowri&quot; &lt;gowri.puvanachandran@...&gt;", 
    "authorName": "Puvanachandran, Gowri", 
    "msgSnippet": "I need to test a server side EJB application with JUnit.  How would I accomplish this.  Our application follows a J2EE, session façade, architecture with", 
    "msgId": 6221, 
    "profile": "suthangowri", 
    "topicId": 6221, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127912215, 
    "messageBody": "<div id=\"ygrps-yiv-1867002228\">I need to test a server side EJB application with JUnit.  How would I<br/>\naccomplish this.  Our application follows a J2EE, session façade,<br/>\narchitecture with EJB&#39;s that reflect database table rows.  Other classes in<br/>\nthe application support the functionality of the application.  My particular<br/>\nproblem is that I have to ensure that the errors being thrown by my<br/>\napplications are logical.  Are there tests I can write to accomplish this?<br/>\nExamples if any are appreciated.  Thanks in advance for your input.  <br/>\n<br/>\nGowri Puvanachandran<br/>\nProgrammer Analyst<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------------------------------<br/>\nThis e-mail may be privileged and/or confidential, and the sender does not waive any related rights and obligations. Any distribution, use or copying of this e-mail or the information it contains by other than an intended recipient is unauthorized. If you received this e-mail in error, please advise me (by return e-mail or otherwise) immediately. <br/>\n<br/>\nCe courriel est confidentiel et protégé. L&#39;expéditeur ne renonce pas aux droits et obligations qui s&#39;y rapportent. Toute diffusion, utilisation ou copie de ce message ou des renseignements qu&#39;il contient par une personne autre que le (les) destinataire(s) désigné(s) est interdite. Si vous recevez ce courriel par erreur, veuillez m&#39;en aviser immédiatement, par retour de courriel ou par un autre moyen. <br/>\n<br/>\n<br/>\n============================================================<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 6220, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1037646163", 
    "canDelete": false, 
    "nextInTopic": 6223, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PEMxMTE1NUNCRTFCOEQ1MTE5QjI0MDAwMzQ3NkJDNjgyMDRGRTFFNjBAc2UwMDEwNzcucmJjMS5yb3lhbGJhbmsuY29tPg=="
    }
}