{
    "topicId": 6227, 
    "postDate": "1037755596", 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "from": "&quot;Craig Pardey&quot; &lt;pardeyc@...&gt;", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "GfkH6YWnIUMUcfuMk5ZM18ezZ7OVQQDGYgPSdmG0w7OK737NSBa0K9UML_nmSUAVJZehhrg88OBs5ufvDN_coc_Wj5ExU6c3R0Pethtt3w", 
    "nextInTime": 6231, 
    "userId": 126717498, 
    "prevInTime": 6229, 
    "prevInTopic": 6229, 
    "headers": {
        "messageIdInHeader": "PHNkZGI3Zjg5LjAyMkBzdGdlb3JnZS5jb20uYXU+"
    }, 
    "authorName": "Craig Pardey", 
    "numMessagesInTopic": 56, 
    "msgSnippet": "In response to question 2, you have several options You could use ant to run a junit batchtest which will locate and run all your test classes individually.", 
    "contentTrasformed": false, 
    "msgId": 6230, 
    "nextInTopic": 6231, 
    "systemMessage": false, 
    "rawEmail": "Return-Path: &lt;PARDEYC@...&gt;\r\nReceived: (qmail 18888 invoked from network); 20 Nov 2002 02:18:14 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m4.grp.scd.yahoo.com with QMQP; 20 Nov 2002 02:18:14 -0000\r\nReceived: from unknown (HELO n12.grp.scd.yahoo.com) (66.218.66.67)\n  by mta2.grp.scd.yahoo.com with SMTP; 20 Nov 2002 02:18:14 -0000\r\nX-eGroups-Return: PARDEYC@...\r\nReceived: from [66.218.67.158] by n12.grp.scd.yahoo.com with NNFMP; 20 Nov 2002 02:17:57 -0000\r\nX-Sender: PARDEYC@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_3_0); 20 Nov 2002 01:25:53 -0000\r\nReceived: (qmail 95926 invoked from network); 20 Nov 2002 01:25:53 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m8.grp.scd.yahoo.com with QMQP; 20 Nov 2002 01:25:53 -0000\r\nReceived: from unknown (HELO SMTPK2.stgeorge.com.au) (166.120.202.215)\n  by mta2.grp.scd.yahoo.com with SMTP; 20 Nov 2002 01:25:53 -0000\r\nReceived: from stgeorge.com.au (portcullisk.stgeorge.com.au) by SMTPK2.stgeorge.com.au\n (Content Technologies SMTPRS 4.2.10) with SMTP id &lt;T5eadd4af3fc0a87a905f4@...&gt; for &lt;junit@yahoogroups.com&gt;;\n Wed, 20 Nov 2002 12:28:42 +1100\r\nReceived: from GATEWAY3-Message_Server by stgeorge.com.au\n\twith Novell_GroupWise; Wed, 20 Nov 2002 12:26:49 +1100\r\nMessage-Id: &lt;sddb7f89.022@...&gt;\r\nX-Mailer: Novell GroupWise Internet Agent 5.5.4.1\r\nDate: Wed, 20 Nov 2002 12:26:36 +1100\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nSubject: Re: [junit] Looking for some &quot;Best Practices&quot;\r\nMime-Version: 1.0\r\nFrom: &quot;Craig Pardey&quot; &lt;pardeyc@...&gt;\r\nX-Yahoo-Group-Post: member; u=126717498\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Approved-By: geektank &lt;emeade@...&gt; via web; 20 Nov 2002 02:17:55 -0000\r\n\r\n\nIn response to question 2, you have several options\n\nYou could use ant to run a junit batchtest which will locate and run all your test classes individually.  However, this gets slow when you start getting a few test classes together because the testrunner is instantiated for each test, and everyone knows that slow tests discourage the developers running them.\n\nYou could do as you suggested and build a suite for all your tests and add your new test cases manually.\n\nThe approach I use is to have a suite that locates my test cases on the fly.  This has the advantage of being much quicker than using an Ant batchtest without the risk of forgetting to add new test cases.\n\nI&#39;ve attached the two classes needed for this, in case anyone is interested.  You may need to tweak them as required .... \n\nCraig\n\n\n&gt;&gt;&gt; mchermside@... 11/20/02 04:09am &gt;&gt;&gt;\nHi!\n\nI am starting at a new company, and am starting on a new, fairly large\nproject. As such, I&#39;m presented with a fairly unique opportunity to\nestablish some standard practices for unit testing.\n\nA few things are obvious. Yes, writing unit tests for all new code\nshould be STRONGLY ENCOURAGED. Yes, the JUnit framework is what we\nwill use for launching our tests. \n\nSome are less obvious, but I&#39;m still clear on what to do. For instance,\nwriting tests that include the database are often QUITE difficult. Not\neveryone has a copy of Oracle; we can&#39;t just erase tables willy-nilly\nto set up for each test; etc. So I will use mock objects (hopefully\nstarting from those at www.mockobjects.com) to simulate the connection,\nand other &quot;external&quot; data sources/sinks.\n\nAnd there are a few questions on which I&#39;d like to hear input from\nsome with more experience so I can start out using &quot;Best Practices&quot;\ninstead of having to learn from my OWN experience.\n\nQUESTION 1:\n   Where do my JUnit unit tests go?\n   \n   I see 3 likely answers... (a) make each an inner class of the\n   class being tested, (b) for every class &quot;Foo&quot; have a class called \n   &quot;TestFoo&quot; in the same package, or (c) have a separate (but parallel\n   hierarchy of classes... SOURCE/com/pkg/Foo.java is tested by \n   TEST/com/pkg/TestFoo.java.\n\n   I lean towards (c) because it makes it easy to build the &quot;real&quot; code\n   and the &quot;test&quot; code separately, and omit the &quot;test&quot; code from\n   production deployment. Are there other significant issues here?\n\n\nQUESTION 2:\n   How do I automatically build the suite of all tests?\n\n   For each class, I can have several methods called &quot;testXxx()&quot; and\n   can collect them into a suite to run at once. I can collect the\n   suites together into larger suites, eventually coalescing into a\n   suite called &quot;RunAllTests&quot; which does just that. But this requires\n   me to write each of these suites, and to remember to include each\n   and every test class. I&#39;d rather if &quot;RunAllTests&quot; just magically\n   found all of the tests... that way I couldn&#39;t forget to include\n   one and wind up with some tests that never get run just because I\n   forgot a line in a suite. How do I create this &quot;magical&quot; \n   RunAllTests?\n\n   Stray thought... if there&#39;s no simple solution in straight java,\n   I wonder if ant can help me to achieve RunAllTests as an ant\n   target?\n\n\nQUESTION 3:\n   How do I &quot;turn on&quot; my mock objects when tests are running?\n\n   The most straightforward use of mock objects is to pass them\n   directly to the code being tested. However, (despite the fact that\n   this is a bit broader than simply &quot;unit&quot; testing), I plan to have\n   a lot of tests that exercise an entire sub-system at once. For\n   example, I might create the input file, run the command, and then\n   test the output file. But if this &quot;command&quot; opens a connection to\n   a database (or other system), then I&#39;d like to return a mock\n   ResultSet instead of a real one. So the code that obtains a DB\n   connection has to look at some global setting to see if we&#39;re in\n   &quot;test mode&quot; or &quot;real life&quot;. What is a good way to achieve this --\n   is it something I&#39;ll have to write for myself?\n\n\nI&#39;m sure I&#39;ll have more questions also, but this email is QUITE long\nenough as is. Thanks in advance for any feedback, suggestions, or\npointers to other forums/FAQs for this kind of stuff.\n\n-- Michael Chermside\n\n\n\n\nTo unsubscribe from this group, send an email to:\njunit-unsubscribe@yahoogroups.com\n\n\nYour use of Yahoo! Groups is subject to http://docs.yahoo.com/info/terms/ \n\n**********************************************************************\n*****   IMPORTANT INFORMATION    *****\nThis document should be read only by those persons to whom\nit is addressed and its content is not intended for use by\nany other persons. If you have received this message in\nerror, please notify us immediately. Please also destroy and\ndelete the message from your computer. Any unauthorised form\nof reproduction of this message is strictly prohibited.\nSt.George is not liable for the proper and complete transmission\nof the information contained in this communication, nor for any\ndelay in its receipt.\n**********************************************************************\n\n\n\n[Non-text portions of this message have been removed]\n\n\n\n", 
    "subject": "Re: [junit] Looking for some &quot;Best Practices&quot;"
}