{
    "numMessagesInTopic": 56, 
    "nextInTime": 6261, 
    "senderId": "WtC669YT_DGzIGfM86QxXrkJmnEtt3vKwzLst14bravTvWPT4OcMDD2YE5v1wHWrMpQmm8kFUbEw0-Y-zHbypZEnti0vsvw", 
    "systemMessage": false, 
    "subject": "RE: [junit] Looking for some &quot;Best Practices&quot;", 
    "from": "Erik Hanson &lt;ehanson@...&gt;", 
    "authorName": "Erik Hanson", 
    "msgSnippet": "... I wouldn t be able to release the code I wrote for two reasons: it s probably copyrighted by my company, and it uses a lot of utility class code from my", 
    "msgId": 6260, 
    "profile": "hanson_erik", 
    "topicId": 6227, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 22694767, 
    "messageBody": "<div id=\"ygrps-yiv-1539035887\">On Fri, 22 Nov 2002, Chermside, Michael wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; We coded up a TestSuite that finds all the tests in the project (which is<br/>\n&gt; &gt; pretty fast because they all start with &quot;_&quot; so we don&#39;t have to use<br/>\n&gt; &gt; &quot;instanceof&quot; to figure out if they are tests or not) and executes them.<br/>\n&gt; &gt;<br/>\n&gt; &gt; We also threw in some fun options like only running tests in certain<br/>\n&gt; &gt; packages and running the tests in order of their execution speed (we have<br/>\n&gt; &gt; some really slow tests, which I know is bad, but there&#39;s not too much we<br/>\n&gt; &gt; can do about it).<br/>\n&gt; &gt;<br/>\n&gt; &gt; It can also run just those tests that have been compiled in the last 10<br/>\n&gt; &gt; minutes plus tests for any classes that have been compiled in the last 10<br/>\n&gt; &gt; minutes. (So if you modify method A.foo() and class B calls A.foo(), then<br/>\n&gt; &gt; _ATest and _BTest will be executed.) This is to get around the problem of<br/>\n&gt; &gt; our test suite being really slow, which is something that I want to fix<br/>\n&gt; &gt; but cannot (for non-technical reasons).<br/>\n&gt;<br/>\n&gt; WOW!!! That sounds much better than the other utilities I&#39;ve been<br/>\n&gt; able to find for this, and certainly more feature-rich than I&#39;d have<br/>\n&gt; time to write myself. Any chance that the TestSuite you write would<br/>\n&gt; be available?<br/>\n<br/>\n </span></blockquote>I wouldn&#39;t be able to release the code I wrote for two reasons: it&#39;s<br/>\nprobably copyrighted by my company, and it uses a lot of utility class<br/>\ncode from my project (for preferences, files, strings, file lists, etc.).<br/>\n<br/>\nHowever, I&#39;d be happy to make a new project on SourceForge or something<br/>\nand create a version that isn&#39;t dependent on other code, especially if<br/>\nother people are interested in helping out.<br/>\n<br/>\nI have to warn you that my design is probably all wrong because I don&#39;t<br/>\nreally understand the JUnit architecture yet. I probably should have<br/>\ncreated a TestCollector or something, but instead I created a subclass of<br/>\nTestSuite that builds the list of TestCases and returns them by overriding<br/>\nthe testAt() and tests() methods.<br/>\n<br/>\n<br/>\nErik</div>", 
    "prevInTime": 6259, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1038008836", 
    "canDelete": false, 
    "nextInTopic": 6261, 
    "prevInTopic": 6259, 
    "headers": {
        "inReplyToHeader": "PDkwMkExRTcxMEZFQUI3NDA5NjZFQzk5MUMzQTM4QTg5MDNDMjc4RjBASU5HREVYQ0hBTkdFQzEuaW5nZGlyZWN0LmNvbT4=", 
        "messageIdInHeader": "PFBpbmUuTkVCLjQuNDQuMDIxMTIyMTUzNTQ0MC4xODgyLTEwMDAwMEBzbmFyZi5tdW5nZS5jb20+"
    }
}