{
    "numMessagesInTopic": 56, 
    "nextInTime": 6273, 
    "senderId": "xpUgVVSHXbuszDy6P-zZz9Tzeu5z7t6mMIgi5KBWxk2Xyn2aBTDMSekOnoXJhjVhhb_3_mS8xHt7tkjm06G3xbSEDig37xrGTMAgI--zqHklGOqmF5ASutY_1OU", 
    "systemMessage": false, 
    "subject": "Re: [junit] Looking for some &quot;Best Practices&quot;", 
    "from": "=?iso-8859-1?q?Vikas=20Malla?= &lt;malla6um@...&gt;", 
    "authorName": "Vikas Malla", 
    "msgSnippet": "This discussion has been exactly what I have been looking for a while. Continuing this further, I woud like to bring the question of development overheads", 
    "msgId": 6272, 
    "profile": "malla6um", 
    "topicId": 6227, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 75473799, 
    "messageBody": "<div id=\"ygrps-yiv-1446416756\">This discussion has been exactly what I have been looking for a while. Continuing this further, I woud like to bring the question of development overheads involved.<br/>\n1) What efforts have you guys taken in your respective organizations to reduce the programming overhead associated with writing unit tests? <br/>\n2) What are the tools you use for creation of unit tests, if any?<br/>\n3) Do you prefer using tools for unit tests creation?<br/>\n4) We use JBuilder in our development efforst. What would you advise us to go for to reduce our development overheads associated with unit tests?<br/>\n5) What do you guys think of cactus?<br/>\nThanks again for the valuable insight you guys have provided with this discussion.<br/>\n Mike Clark &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mike@...\">mike@...</a>&gt; wrote:J. B. Rainsberger wrote:<br/>\n<br/>\nIf you&#39;re asking me...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I believe that building the tests needs to be performed by a human,<br/>\n&gt;because that&#39;s where the knowledge lies. <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Yeah, I guess I&#39;m saying it works best for me if I get to pick which <br/>\ntests go into which suites.  It&#39;s an organizational exercise that lends <br/>\nitself to the way I run tests.  <br/>\n<br/>\nI know of many ways to search for and run all tests in the system.  When <br/>\nI&#39;ve needed to do that, and for some reason I don&#39;t have an AllTests <br/>\nsuite already built, I use the Ant batchtest.  I can&#39;t say I&#39;ve pulled <br/>\nthat lever as a safeguard against forgetting to add tests to a suite <br/>\nthough.  Alas, it&#39;s not because I have a good memory.  Rather, when <br/>\nbuilding things test-first I generally notice those errors of omission <br/>\nearly.      <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If there were a nice graphical<br/>\n&gt;tool to make it easy, would that help? <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Perhaps.  Eclipse has a wizard for creating a test suite, allowing you <br/>\nto pick which test classes to include from a list of tests it <br/>\nautomagically finds.  I haven&#39;t used it much, but think I might try it <br/>\nfor a while.  I can always fall back to writing the suites by hand.    <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Is it worth your while to build it?<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>I couldn&#39;t justify building it given my current needs.  That&#39;s not to <br/>\nsay if it were built I wouldn&#39;t use it, but it&#39;s not a tool I reach for.<br/>\n<br/>\nMIke<br/>\n<br/>\n-- <br/>\nMike Clark<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://clarkware.com\">http://clarkware.com</a> <br/>\n(720) 851-2014<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\nCatch all the cricket action. Download Yahoo! Score tracker<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 6271, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1038101784", 
    "canDelete": false, 
    "nextInTopic": 6273, 
    "prevInTopic": 6271, 
    "headers": {
        "inReplyToHeader": "PDNEREZFRDBCLjQwNTAxMDdAY2xhcmt3YXJlLmNvbT4=", 
        "messageIdInHeader": "PDIwMDIxMTI0MDEzNjI0LjM2NzQzLnFtYWlsQHdlYjgyMDMubWFpbC5pbi55YWhvby5jb20+"
    }
}