{
    "numMessagesInTopic": 56, 
    "nextInTime": 6279, 
    "senderId": "RSvfSNkXTSsdMj2SiG8kQLwM3YaxTMAfBp3bv1TqEo-lHeeTxdWt5Iq8hnyXzzSnEGDMtkBXNS8qrqnilxVbp4RiSghAyr8fArPQ4_PVYKV89oLWurvQnBlz", 
    "systemMessage": false, 
    "subject": "Re: [junit] Looking for some &quot;Best Practices&quot;", 
    "from": "=?ISO-8859-1?Q?Bill_de_h=D3ra?= &lt;dehora@...&gt;", 
    "authorName": "Bill de hÓra", 
    "msgSnippet": "... Use templates to generate testcases. Typing all that stuff in is a pita. ... One of the main reasons I m loyal to JPad pro is the fact that it will let me", 
    "msgId": 6278, 
    "profile": "bdehora", 
    "topicId": 6227, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 94742758, 
    "messageBody": "<div id=\"ygrps-yiv-765084105\">Vikas Malla wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; This discussion has been exactly what I have been looking for a while. Continuing this further, I woud like to bring the question of development overheads involved.<br/>\n<br/>\n&gt; 1) What efforts have you guys taken in your respective organizations to reduce the programming overhead associated with writing unit tests? <br/>\n<br/>\n </span></blockquote>Use templates to generate testcases. Typing all that stuff in is a pita.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 2) What are the tools you use for creation of unit tests, if any?<br/>\n<br/>\n </span></blockquote>One of the main reasons I&#39;m loyal to JPad pro is the fact that it <br/>\nwill let me create as many class templates as needed (I have well <br/>\nover a dozen for Java alone), including the boilerplate for test <br/>\ncases (if anyone here uses JPad Pro and wants them, let me know).<br/>\n<br/>\nOther tools don&#39;t support this very well and I don&#39;t understand why- <br/>\nI&#39;m mainly thinking about Eclipse and IntelliJ, but often when I say <br/>\nthese IDEs don&#39;t do something, I get corrected ;).<br/>\n<br/>\nOne think I don&#39;t like about the way Junit does test suites, aside <br/>\nfrom the effort of remembering to add a test to a suite, is that it <br/>\ndrives the dependencies downward. AllTests at the top of the tree <br/>\nhas to know about all the tests or testsuites below it. This seems <br/>\nto introduce cycles in Java packages and while it&#39;s not the end of <br/>\nthe world or anything, it seems broken as designed to introduce <br/>\ncycles even if the payoffs for having test are substantial. It&#39;s the <br/>\nmain reason I wrote a tree walker to capture and run tests; I&#39;d <br/>\ndefinitely like to hear some opinions as to why I&#39;m wrongheaded <br/>\nabout this.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 3) Do you prefer using tools for unit tests creation?<br/>\n<br/>\n </span></blockquote>Only for blowing out the test boilerplate. I prefer to run tests <br/>\nthrough bash or cmd - going through an IDE can be very slow.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 4) We use JBuilder in our development efforst. What would you advise us to go for to reduce our development overheads associated with unit tests?<br/>\n<br/>\n </span></blockquote>Access to a bash shell and an ide that will let you generate test <br/>\nclass boilerplate quickly, if JBuilder doesn&#39;t do that already.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 5) What do you guys think of cactus?<br/>\n<br/>\n </span></blockquote>Good project, doesn&#39;t get enough attention. I&#39;m not sure why Jakarta <br/>\nis running all of Jelly/Maven/Cactus/Ant  (although it would be <br/>\ngreat to see CruiseControl/AntHill run within the Jakarta effort).<br/>\n<br/>\nBill de hÓra</div>", 
    "prevInTime": 6277, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1038154465", 
    "canDelete": false, 
    "nextInTopic": 6279, 
    "prevInTopic": 6277, 
    "headers": {
        "messageIdInHeader": "PDNERTBGQUUxLjgwNDA5MDZAZWlyY29tLm5ldD4=", 
        "referencesHeader": "PDIwMDIxMTI0MDEzNjI0LjM2NzQzLnFtYWlsQHdlYjgyMDMubWFpbC5pbi55YWhvby5jb20+"
    }
}