{
    "numMessagesInTopic": 56, 
    "nextInTime": 6284, 
    "senderId": "BrfjljMIs0tVcpab1L2-ZaoyAt2Zq0dt4uLj78PAD0D7vOjMx2s2lLiVspD-aVLl1G2EMCwQqgx7gJEat0icT7kCJvAq5CGPLu8hUI7zXw", 
    "systemMessage": false, 
    "subject": "RE: [junit] Looking for some &quot;Best Practices&quot;", 
    "from": "&quot;Scott Stirling&quot; &lt;scottstirling@...&gt;", 
    "authorName": "Scott Stirling", 
    "msgSnippet": "... [...] ... Cool.  TextEdit has a similar template feature (for any kind of file, I think).  Have you done any comparison there? ... Eclipse has nice support", 
    "msgId": 6283, 
    "profile": "jrun5", 
    "topicId": 6227, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 112036634, 
    "messageBody": "<div id=\"ygrps-yiv-1671482145\"><blockquote><span title=\"ireply\">&gt; -----Original Message-----<br/>\n&gt; From: Bill de hÓra [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dehora@...\">dehora@...</a>]<br/>\n </span></blockquote>[...]<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; 2) What are the tools you use for creation of unit tests, if any?<br/>\n&gt; <br/>\n&gt; One of the main reasons I&#39;m loyal to JPad pro is the fact that it<br/>\n&gt; will let me create as many class templates as needed (I have well <br/>\n&gt; over a dozen for Java alone), including the boilerplate for test <br/>\n&gt; cases (if anyone here uses JPad Pro and wants them, let me know).<br/>\n<br/>\n </span></blockquote>Cool.  TextEdit has a similar template feature (for any kind of file, I<br/>\nthink).  Have you done any comparison there?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Other tools don&#39;t support this very well and I don&#39;t understand why-<br/>\n&gt; I&#39;m mainly thinking about Eclipse and IntelliJ, but often when I say <br/>\n&gt; these IDEs don&#39;t do something, I get corrected ;).<br/>\n<br/>\n </span></blockquote>Eclipse has nice support for right-clicking on a file to create a JUnit<br/>\nTestCase or suite.  And the built-in test runner was provided by Erich<br/>\nGamma, who works for OTI (the IBM subsidiary behind Eclipse).  But<br/>\nthat&#39;s not the same as what you&#39;re talking about.  Eclipse has built-in<br/>\nsupport for customizable and extensible templates for lots of stuff like<br/>\nJavadoc elements, flow control and iteration constructs, etc. but not<br/>\nfile-level templates.  Until you pointed it out, I didn&#39;t realize it,<br/>\nbut it seems like you are correct.  I mean, Eclipse is extremely<br/>\nextensible, so someone could implement this, but I don&#39;t see anything<br/>\nlike it in the default platform or Java Dev Tools.  Closest thing would<br/>\nbe to implement a new wizard for each type of template.<br/>\n<br/>\nNetBeans has a similar &quot;create JUnit TestCase&quot; feature, which is even<br/>\nquicker to use than Eclipse&#39;s.  But NetBeans&#39;, by default, imports a<br/>\nNetBeans package into your TestCase and makes your TestCase extend their<br/>\nown NBTestCase.  But that behavior can be fixed by modifying the<br/>\nTestCase preferences.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; One think I don&#39;t like about the way Junit does test suites, aside<br/>\n&gt; from the effort of remembering to add a test to a suite, is that it <br/>\n&gt; drives the dependencies downward. AllTests at the top of the tree <br/>\n&gt; has to know about all the tests or testsuites below it.<br/>\n<br/>\n </span></blockquote>Yes, this is a pain.  I prefer to use Ant&#39;s &lt;batch/&gt; JUnit test runner,<br/>\nwhich can make nice ASCII/XML/HTML (via &lt;junitreport/&gt; task) reports and<br/>\nhas a test collector that picks up test cases automatically and allows<br/>\nfiltering of test cases by name.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; 3) Do you prefer using tools for unit tests creation?<br/>\n&gt; <br/>\n&gt; Only for blowing out the test boilerplate.<br/>\n<br/>\n </span></blockquote>I agree.  Minimal and preferably customizable tes case generation is<br/>\nmost helpful.<br/>\n<br/>\nScott Stirling</div>", 
    "prevInTime": 6282, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1038185585", 
    "canDelete": false, 
    "nextInTopic": 6284, 
    "prevInTopic": 6282, 
    "headers": {
        "inReplyToHeader": "PDNERTBGQUUxLjgwNDA5MDZAZWlyY29tLm5ldD4=", 
        "messageIdInHeader": "PDAwMDAwMWMyOTQxZCQwNzQ1MjY5MCQwNTAxYThjMEBqYXZhbGFwdG9wPg=="
    }
}