{
    "numMessagesInTopic": 56, 
    "nextInTime": 6294, 
    "senderId": "1zq9jXWmo9Maudpkz1wLdCTFV-oprw6CAMiLTSe37GVCpnq3hTo2gq9EL_hqp5EwytTT5uYLOGzr9b0vHLzPWV5PN7kDeg", 
    "systemMessage": false, 
    "subject": "Re: [junit] Looking for some &quot;Best Practices&quot;", 
    "from": "Mike Clark &lt;mike@...&gt;", 
    "authorName": "Mike Clark", 
    "msgSnippet": "... I reduce the programming overhead associated with writing unit tests by writing more unit tests. OK, that was a bit obtuse.  My experience indicates that", 
    "msgId": 6293, 
    "rawEmail": "Return-Path: &lt;mike@...&gt;\r\nX-Sender: mike@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_3_0); 26 Nov 2002 00:02:17 -0000\r\nReceived: (qmail 5659 invoked from network); 26 Nov 2002 00:02:17 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m7.grp.scd.yahoo.com with QMQP; 26 Nov 2002 00:02:17 -0000\r\nReceived: from unknown (HELO sccrmhc02.attbi.com) (204.127.202.62)\n  by mta1.grp.scd.yahoo.com with SMTP; 26 Nov 2002 00:02:16 -0000\r\nReceived: from clarkware.com (12-254-54-55.client.attbi.com[12.254.54.55])\n          by sccrmhc02.attbi.com (sccrmhc02) with SMTP\n          id &lt;20021125233425002002lc0ne&gt;; Mon, 25 Nov 2002 23:34:25 +0000\r\nMessage-ID: &lt;3DE2B305.2060401@...&gt;\r\nDate: Mon, 25 Nov 2002 16:32:21 -0700\r\nOrganization: Clarkware Consulting, Inc.\r\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 5.0; en-US; rv:1.0.1) Gecko/20020823 Netscape/7.0\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] Looking for some &quot;Best Practices&quot;\r\nReferences: &lt;20021124013624.36743.qmail@...&gt;\r\nContent-Type: text/plain; charset=us-ascii; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nFrom: Mike Clark &lt;mike@...&gt;\r\nX-Yahoo-Group-Post: member; u=33026788\r\nX-Yahoo-Profile: clarkware\r\n\r\nVikas Malla wrote:\n\n&gt;1) What efforts have you guys taken in your respective organizations to reduce the programming overhead associated with writing unit tests? \n&gt;\n\nI reduce the programming overhead associated with writing unit tests by \nwriting more unit tests.\n\nOK, that was a bit obtuse.  My experience indicates that writing \neffective tests first reduces the overall programming overhead.  That \nis, I write less production code because the designs that emerge by \nsatisfying tests tend to be simpler with less code.  It also generally \ntakes less code to make these designs respond to change.  Moreover, I&#39;m \nonly writing code that a customer really needs today.  So, in the big \npot theory of economics, I&#39;ve found writing unit tests to be underhead, \nif there is such a thing.  \n \n\n&gt;2) What are the tools you use for creation of unit tests, if any?\n&gt;\n\nI don&#39;t mean to be flippant, but the tool encased by my cranium has \nproven to be the most valuable.  It&#39;s able to ask and answer questions \nlike: &quot;What is this chunk of code supposed to do?&quot;  Then I just use an \neditor (Eclipse) to reify the question and answer in code.  As a \nconvenience, I have a template in Eclipse that lays down the boilerplate \ncode for a test case.\n  \n\n&gt;3) Do you prefer using tools for unit tests creation?\n&gt;\nTools can be useful and productive to automate things, though I prefer \nto understand how to do those things manually first.  I&#39;m then free from \nthe bondage of a tool, which is often handy when visiting projects that \nuse different tools.  That is, the absence of a tool never stands in my \nway of writing tests.\n\nIf you&#39;re referring to tools that purport to automatically write tests \nby inspecting code, then I have used those as a supplement to unit tests \nI write.   Used as a sole means for testing, I miss the opportunity for \nbetter designs.  I&#39;ve found automatic test generators to be especially \nhelpful when faced with refactoring legacy code for which no tests \nexist.  It&#39;s better than no tests at all.  \n\n&gt;4) We use JBuilder in our development efforst. What would you advise us to go for to reduce our development overheads associated with unit tests?\n&gt;\n\nWhen and how are you writing tests now?  To what extent is that \nincurring an overhead?  \n\n&gt;5) What do you guys think of cactus?\n&gt;\n\nIt&#39;s an excellent tool if you really must test components fronted by a \nweb application in their native environment.  If you start swinging the \nCactus golden hammer too early, then it&#39;s been my experience that soon \neverything indeed must be tested within the container.  I strive to \nnever use it, focusing instead on building modular components that can \nbe tested outside of the container.  Components of this sort then don&#39;t \ndepend on the container, and the technology implied therein.  So, \nalthough Cactus is well-designed and scratches certain itches, using it \nshould be an exception, not the rule.  \n\nHope this helps.  Please ask for clarification on any of these answers \nif they don&#39;t make sense.\n\nMike  \n\n-- \nMike Clark\nhttp://clarkware.com \n(720) 851-2014\n\n\n\n\n", 
    "profile": "clarkware", 
    "topicId": 6227, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 33026788, 
    "prevInTime": 6292, 
    "contentTrasformed": false, 
    "postDate": "1038267141", 
    "canDelete": false, 
    "nextInTopic": 6294, 
    "prevInTopic": 6292, 
    "headers": {
        "messageIdInHeader": "PDNERTJCMzA1LjIwNjA0MDFAY2xhcmt3YXJlLmNvbT4=", 
        "referencesHeader": "PDIwMDIxMTI0MDEzNjI0LjM2NzQzLnFtYWlsQHdlYjgyMDMubWFpbC5pbi55YWhvby5jb20+"
    }
}