{
    "numMessagesInTopic": 56, 
    "nextInTime": 6299, 
    "senderId": "33DkBfWPNu93jO_kKRP78HmiwMJB89MVs0KS7OOu3XTr5aZGL6kQOO7Ftk3l5xHHsvQgahExRbCYGjgEecjjkEFbqifaJg", 
    "systemMessage": false, 
    "subject": "Re: [junit] Looking for some &quot;Best Practices&quot;", 
    "from": "Mike Clark &lt;mike@...&gt;", 
    "authorName": "Mike Clark", 
    "msgSnippet": "... Are you changing things like class/method names or logic? For the former, a good editor (e.g. IntelliJ, Eclipse), will allow you to rename a method and", 
    "msgId": 6298, 
    "profile": "clarkware", 
    "topicId": 6227, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 33026788, 
    "messageBody": "<div id=\"ygrps-yiv-872066399\">Vikas Malla wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Right now, most of the unit test creation is done without any tool using junit+cactus+httpunit. My point of contention is the case in which for every change I make to my class, I need to incorporate that change into the test class, if it is required. How can that be minimized?<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Are you changing things like class/method names or logic?<br/>\n<br/>\nFor the former, a good editor (e.g. IntelliJ, Eclipse), will allow you <br/>\nto rename a method and apply the change globally across the project. <br/>\nExtremely handy, and any IDE worth its salt should do this.<br/>\n<br/>\nIf you&#39;re changing logic and it&#39;s breaking the tests, well, then that&#39;s <br/>\ntelling you something. You want that kind of relationship between the <br/>\ncode and its tests.<br/>\n<br/>\nLet&#39;s do this another (more efficient) way that doesn&#39;t cause me to <br/>\nspeculate. Please give a concrete example that illustrates your point of <br/>\ncontention. Lay it out like a list of steps you take that cause changes <br/>\nto the test, with some code.<br/>\n<br/>\nThat reminds me, have you had someone look over your shoulder when this <br/>\ncontention is high? You might explain the pain you&#39;re experiencing to <br/>\nthem. Don&#39;t underestimate the value of another set of eyes and ears.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;The extent of overhead is what I am trying to gauge through this discussion. Most of the responses were on an individual scale and not on the organizational level. These overheads which might seem minimal on an individual basis, add on to big numbers on a higher level. This is what I am looking at. And what steps can I take to reduce them. If you can list the steps based on your experience, it will be easier for me to implement those steps in the workplace.<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Ah, something like a process improvement exercise. Is the cumulative <br/>\noverhead a fear or a measured reality in your organization?<br/>\n<br/>\nI&#39;m not sure what steps you want us to list. In the words of the <br/>\nguitarist Robert Fripp, &quot;The quality of the question determines the <br/>\nquality of the answer.\u001d<br/>\n<br/>\nMike<br/>\n<br/>\n-- <br/>\nMike Clark<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://clarkware.com\">http://clarkware.com</a> <br/>\n(720) 851-2014</div>", 
    "prevInTime": 6297, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1038325030", 
    "canDelete": false, 
    "nextInTopic": 6307, 
    "prevInTopic": 6295, 
    "headers": {
        "messageIdInHeader": "PDNERTM5NTI2LjYwODA1MDhAY2xhcmt3YXJlLmNvbT4=", 
        "referencesHeader": "PDIwMDIxMTI2MDIzMzIzLjYyNTkwLnFtYWlsQHdlYjgyMDIubWFpbC5pbi55YWhvby5jb20+"
    }
}