{
    "numMessagesInTopic": 8, 
    "nextInTime": 6342, 
    "senderId": "lJwIP_PghydauU4RYni7zB17Ag0Xx1-A_SLzv5zbnDpo-r0x2BL81l26aMYej6GNuEVtEPeaCPOg5w5CTOJCqWakzkGJWgMWTZslDHCoyGy-Ls5egqg", 
    "systemMessage": false, 
    "subject": "RE: [junit] Order of execution", 
    "from": "&quot;Chermside, Michael&quot; &lt;mchermside@...&gt;", 
    "authorName": "Chermside, Michael", 
    "msgSnippet": "... What I do is to make it one big test. I ll still see if the whole thing failed or not, and if it fails then the failure message and the stack trace will", 
    "msgId": 6341, 
    "profile": "mcherm", 
    "topicId": 6319, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 130483429, 
    "messageBody": "<div id=\"ygrps-yiv-20646717\"><blockquote><span title=\"ireply\">&gt; &gt; There is no guarantee that they will run in the order of the test file and<br/>\n&gt; &gt; you should not write your tests in a way that depends on this. You should<br/>\n&gt; &gt; use the setUp and tearDown methods to properly setup each test.<br/>\n<br/>\n&gt; I  know that this is the &quot;pure doctrine&quot;. But what do you do, if you<br/>\n&gt; have a series of dependent test (some interaction between two systems)<br/>\n&gt; that need a defined protocoll and therefor a defined order?<br/>\n<br/>\n </span></blockquote>What I do is to make it one big test. I&#39;ll still see if the whole<br/>\nthing failed or not, and if it fails then the failure message and<br/>\nthe stack trace will help me to tell how far it got. You lose the<br/>\nusual advantage of running ALL the tests because those bits after <br/>\nthe failing test don&#39;t get run, but if we ran those bits they wouldn&#39;t<br/>\nbe valid tests ANYWAY since they depend on the previous test<br/>\nwhich failed!<br/>\n<br/>\nBasically, a single test can be as big as you like, it&#39;s just the<br/>\nunit of testing which is independent of all other tests. USUALLY<br/>\nwe make very short simple unit tests because we try hard to avoid<br/>\nthis kind of dependence, but your need for dependent tests is not <br/>\nunheard of, it&#39;s simply to be avoided when possible.<br/>\n<br/>\n-- Michael Chermside</div>", 
    "prevInTime": 6340, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1038858248", 
    "canDelete": false, 
    "nextInTopic": 6345, 
    "prevInTopic": 6336, 
    "headers": {
        "messageIdInHeader": "PDkwMkExRTcxMEZFQUI3NDA5NjZFQzk5MUMzQTM4QTg5MDNDMjc5MDBASU5HREVYQ0hBTkdFQzEuaW5nZGlyZWN0LmNvbT4="
    }
}