{
    "numMessagesInTopic": 6, 
    "nextInTime": 6385, 
    "senderId": "HtlWAGK7s41HnwCw45XV0uXkyo4-dTMXLZGSi943q54G3v8VWnVAYOhR4s47jmkIJ3E7xZTgejGz7GSgaIZr99rPznfs47_AvSk", 
    "systemMessage": false, 
    "subject": "Dependencies between tests and test ordering", 
    "from": "Maciej Zawadzki &lt;mbz@...&gt;", 
    "authorName": "Maciej Zawadzki", 
    "msgSnippet": "Hello, I m pretty new to the JUnit tool and am not yet completely familiar with its idiosyncrasies.  I have a question about how best to apply JUnit to solve", 
    "msgId": 6384, 
    "profile": "mbz27", 
    "topicId": 6384, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127956327, 
    "messageBody": "<div id=\"ygrps-yiv-782401723\">Hello,<br/>\n<br/>\nI&#39;m pretty new to the JUnit tool and am not yet completely familiar with <br/>\nits idiosyncrasies.  I have a question about how best to apply JUnit to <br/>\nsolve my particular testing need.<br/>\n<br/>\nBasically I have a class (lets say Fruit.class) that is being mapped to <br/>\na database via an O/R  tool.  I would like to test this this mapping. <br/>\nSo I have a TestCase called FruitCRUDTestCase.  In my test case I have <br/>\ntest methods such as testCreate(), testRestore(), testUpdate(), and <br/>\ntestDelete().  Now, when writing these kind of tests before JUnit, I <br/>\ncould make the tests dependent on each other.  For example, if the <br/>\ntestCreate() method created an object, I could store a reference to it <br/>\nin an instance attribute and access again from the other test methods <br/>\n(testRestore() for example).  To my understanding, this does not seem to <br/>\nbe easily doable when using JUnit.  I can create a TestSuite that will <br/>\nexecute each of my test methods, I can even create an OrderedTestSuite <br/>\n(from gsbase) that will execute my test methods in the order that I <br/>\nspecify, but each test method will be executed within its own instance <br/>\nof TestCase so I can not use instance attributes to make data accessible <br/>\nbetween test methods.  Is there something that I am missing?<br/>\n<br/>\nNow I know that I can make the test methods completely independent to <br/>\nget around this problem, but why?  Making the test methods independent <br/>\nwould require duplicating effort since the testRestore() method would <br/>\nhave to create an object first (basically duplicate what is already <br/>\nbeing done in testCreate()).<br/>\n<br/>\nBasically I am looking for input before I write something myself.  Maybe <br/>\nsomeone has dealt with this problem before (I&#39;m sure some has -- it&#39;s <br/>\nnot that unique of a problem).  If so, please let me know how you&#39;ve <br/>\nsolved this.  I am willing to write a simple extension that will support <br/>\nthe type of behavior that I&#39;ve described, but maybe there is a better <br/>\nway of doing things.<br/>\n<br/>\nThanks,<br/>\n<br/>\n--Maciej<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mbz@...\">mbz@...</a></div>", 
    "prevInTime": 6383, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1039461030", 
    "canDelete": false, 
    "nextInTopic": 6386, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDNERjRFQUE2LjcwNjAxMDZAdXJiYW5jb2RlLmNvbT4="
    }
}