{
    "numMessagesInTopic": 1, 
    "nextInTime": 6429, 
    "senderId": "Ok-JJUyB7eFQiuNHOny4998B5fwST3vU-5LiO8Z3vIXVirBa12tUjpho4Y1pb3yuwsH_60iEj572p_AQ2PXLPKTu2Z-4iNlw9z002YkM", 
    "systemMessage": false, 
    "subject": "Re: [junit]: OO for Newcomers", 
    "from": "Eric Armstrong &lt;eric.armstrong@...&gt;", 
    "authorName": "Eric Armstrong", 
    "msgSnippet": "... I m looking forward to seeing the responses you get. This is an area that has intrigued me ever since being defeated by SmallTalk, and eventually entering", 
    "msgId": 6428, 
    "profile": "ericsilverlight", 
    "topicId": 6428, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 78994084, 
    "messageBody": "<div id=\"ygrps-yiv-2099978935\">&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamago@...\">mamago@...</a>&quot; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Bringing a newbie into OO<br/>\n&gt; ========================<br/>\n&gt; I would like to ask the people on this list for recommendations of the<br/>\n&gt; best literature to bring an OO newbie up to speed.<br/>\n<br/>\n </span></blockquote>I&#39;m looking forward to seeing the responses you get. This is an area<br/>\nthat has intrigued me ever since being defeated by SmallTalk, and<br/>\neventually entering the fold with Java.<br/>\n<br/>\nI captured the essence of what I gleaned from interviewing several<br/>\nhelpful<br/>\nO-O folks (Allen Holub and Steve Abell, in particular) in The JBuilder2<br/>\nBible (now out of print). Chapters 2, 12, and 13, in particular were<br/>\nfocused on summarizing O-O thinking, if you can find a copy.<br/>\n<br/>\nThe most eloquent, insightful people I know on the subject (in no<br/>\nparticular order) are:<br/>\n    * Martin Fowler<br/>\n    * Allen Hollub<br/>\n    * Peter Coad<br/>\n<br/>\nAnything you can find by them is well worth a look.<br/>\n<br/>\nHaving read the previous post, I&#39;ve ordered all three of the<br/>\nbooks in the Coad & Yourdon series:<br/>\n   * Object Oriented Analysis<br/>\n   * Object Oriented Design<br/>\n   * Object Oriented Programming<br/>\n<br/>\nThe ratings on Amazon indicate that they would be quite good<br/>\nfor beginners.<br/>\n<br/>\nOnce a basic understanding of O-O concepts is acquired, The<br/>\nPragmatic Programmer is a good treetop view of the territory.<br/>\nIt&#39;s a great guide that points you to things you might want to<br/>\ninvestigate further, so you know they&#39;re there, but without bogging<br/>\ndown in a lot of detail. (Which leaves you begging for more, in most<br/>\ncases.)<br/>\n<br/>\nAlso:<br/>\n  * Fowler&#39;s &quot;Refactoring&quot; book is nothing short of brilliant.<br/>\n  * The Test-Driven Development book looks great, as well,<br/>\n     (but I haven&#39;t gotten to it yet)<br/>\n<br/>\nI&#39;m a big fan of &quot;Document Driven Development&quot;, but I haven&#39;t<br/>\nseen anything on the topic, so far. (Anyone know of anything?)<br/>\n<br/>\nI&#39;ve taken to starting projects with a User Guide, a bullet list<br/>\nof Requirements, a collection of Design Notes, and a development<br/>\ncheck list.<br/>\n<br/>\nI cycle through the user guide and requirements documents, getting<br/>\nfeedback from users, and recording the results of experimentation<br/>\nand investigation in the Design Notes document (which starts as a<br/>\nseries of notes on technologies the app will use).<br/>\n<br/>\nAs the design starts to emerge, I begin developing the implementation<br/>\nchecklist, which keeps getting revised for as long as the implementation<br/>\n<br/>\ngoes on. (For example, refactoring steps go into the checklist first,<br/>\nand they get checked off as the refactoring goes on.)<br/>\n<br/>\nWhen new information and design changes occur, they impact the<br/>\ndocumentation first, and the code second. (When I get TDD down,<br/>\nI suspect they&#39;ll affect the tests second -- or maybe even first.)<br/>\n<br/>\nOf course, all of that depends on understanding objects and classes<br/>\nand how to work with them effectively. Hopefully you&#39;ll find some<br/>\nlinks to online papers among the replies to your query.<br/>\n<br/>\nIn the meantime, I&#39;ll query my publisher and see if we can find away<br/>\nto put those 3 chapters online...</div>", 
    "prevInTime": 6427, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1039827588", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDNERkE4Mjg0LjI4NEZDQkU0QHN1bi5jb20+", 
        "referencesHeader": "PDE0NjA0MC0yMjAwMjEyNTEzMTU1MzA1MjBATTJXMDM3Lm1haWwyd2ViLmNvbT4="
    }
}