{
    "numMessagesInTopic": 108, 
    "nextInTime": 6438, 
    "senderId": "CfG6PWfaRQOfsL4QyZr5STJfvQ93qxIqH8WW6vMrrUU1qt2JGabzlDFHA5cfStEe5kL0nWquk1w7sGSFJa5RANrObZQAlVtARDFSN0o2OIsk", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Testing Private Methods", 
    "from": "&quot;Lauren Bish&quot; &lt;developerdude@...&gt;", 
    "authorName": "Lauren Bish", 
    "msgSnippet": "Excuse me if I weigh in on this subject with a few thoughts: 1) I agree with the sentiment that testing behaviors is the desired methodology for writing tests", 
    "msgId": 6437, 
    "rawEmail": "Return-Path: &lt;developerdude@...&gt;\r\nReceived: (qmail 4645 invoked from network); 14 Dec 2002 18:56:43 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m14.grp.scd.yahoo.com with QMQP; 14 Dec 2002 18:56:43 -0000\r\nReceived: from unknown (HELO n17.grp.scd.yahoo.com) (66.218.66.72)\n  by mta1.grp.scd.yahoo.com with SMTP; 14 Dec 2002 18:56:43 -0000\r\nX-eGroups-Return: developerdude@...\r\nReceived: from [66.218.67.178] by n17.grp.scd.yahoo.com with NNFMP; 14 Dec 2002 18:56:43 -0000\r\nX-Sender: developerdude@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_3_0); 14 Dec 2002 18:13:26 -0000\r\nReceived: (qmail 22263 invoked from network); 14 Dec 2002 18:13:26 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m7.grp.scd.yahoo.com with QMQP; 14 Dec 2002 18:13:26 -0000\r\nReceived: from unknown (HELO hestia.email.starband.net) (148.78.247.23)\n  by mta3.grp.scd.yahoo.com with SMTP; 14 Dec 2002 18:13:26 -0000\r\nReceived: from Gort (vsat-148-64-154-3.c005.g4.mrt.starband.net [148.64.154.3])\n\tby hestia.email.starband.net (8.12.4/8.12.4) with SMTP id gBEIDIIu024617\n\tfor &lt;junit@yahoogroups.com&gt;; Sat, 14 Dec 2002 13:13:21 -0500\r\nMessage-ID: &lt;023101c2a39c$a8726490$039a4094@Gort&gt;\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nReferences: &lt;atecb2+v1m9@...&gt;\r\nSubject: Re: [junit] Re: Testing Private Methods\r\nDate: Sat, 14 Dec 2002 10:13:14 -0800\r\nMIME-Version: 1.0\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Priority: 3\r\nX-MSMail-Priority: Normal\r\nX-Mailer: Microsoft Outlook Express 6.00.2800.1106\r\nX-MimeOLE: Produced By Microsoft MimeOLE V6.00.2800.1106\r\nFrom: &quot;Lauren Bish&quot; &lt;developerdude@...&gt;\r\nX-Yahoo-Group-Post: member; u=117292773\r\nX-Yahoo-Profile: gs_nomad\r\nX-eGroups-Approved-By: clarkware &lt;mike@...&gt; via web; 14 Dec 2002 18:56:42 -0000\r\n\r\nExcuse me if I weigh in on this subject with a few thoughts:\n\n1) I agree with the sentiment that testing behaviors is the desired\nmethodology for writing tests rather than explcitily testing methods\nthemselves. You eventually wind up testing methods, but since the purpose is\nto find bugs, and find them as early as possible, behavioral testing should\nbe the focus. This may seem to conflict with how some people do or view TDD,\nand it does require viewing the Code Under Test in a more abstract manner,\nbut that is generally a &quot;good thing&quot;.\n\nBehavioral testing is good because it helps the code writer/tester keep the\n&quot;big picture&quot; in mind rather than getting lost in the code, and because\nwhile the code itself may go through several iterations, behavior changes\nless often - this results in more flexible tests, test code that needs to\nchange less often, and it keeps a high degree of separation between the code\nexecuting the tests and the CUT. Closely bound code is a bad thing, whether\nit is in testing code or the CUT, or between the two.\n\n2) Behavioral testing results in higher reuse of the test code. It may also\nresult in higher reuse of the CUT since it may help reusable patterns\nemerge.\n\n3) Being both a developer and a SQA engineer, I often write unit tests for\nother people&#39;s code. TDD is relatively new and unused by much of the\nindustry, unit-testing in general having been in use much longer. I usually\ntest at a more abstract level. I don&#39;t use the terms &quot;white-box&quot; and\n&quot;black-box&quot; for testing as much as unit-testing, module testing, sub-system\nand system testing, integration and acceptance testing.\n\nAlmost anything at any level can be thought of as a black box, and to\ninitially test a unit I don&#39;t really need to have a white-box knowledge\nlevel of the code - just the interface, method signatures and preferably the\nJavaDocs. Indeed, I prefer not to look at the internal code of a unit at\nfirst - I find I am more productive, more generalized and less biased in how\nI test if I treat the unit as a black box first, then drill down into the\nactual code later. This way my testing code tends to be less tied to the\nCUT; e.g., I don&#39;t know or at this point care whether the CUT uses a Vector\nor an Array to store items.\n\n4) To make sure that non-visable methods are properly tested, code coverage\ntools should be used in lieu of explicitly writing tests for these\nnon-visible methods or code. This results in making explicitly sure that all\ncode is actually tested (more so than writing tests that access private\nmethods directly) - which is the purpose, it is more productive, and it may\npoint out unused code or logic errors missed by just assuming that because\nthe test passed the code has been completely tested. Testing code is only as\ngood the measured results. Pass/fails are one type of result, code coverage\nmetrics are another - the latter more qualitative than the former - and they\nshould be used together.\n\nGranted the above observations and opinions come more from my viewpoint as a\ntester of other people&#39;s code, but I believe they are valid. I have noticed\nthat much of the test code written during TDD tends to be skimpy in coverage\n(both code and test conditions), and because it is usually highly bound to\nthe CUT it is often not maintained well when the code is changed. Few\ndevelopers write good tests, even fewer can test their own code well. As\nsuch, while I encourage TDD since it is productive in its own right - I also\nmandate that more extensive unit tests be written from a more abstract view\noutside of the code. This usually entails a person, other than the original\ncoder, writing more extensive unit tests. Almost invariably, these tests are\nbest maintained separate from the original code.\n\nFWIW,\nLauren\n\n=====\nLooking for an experienced Java/C++ Software Engineer?\nSee: http://developerdude.mystarband.net/resume.html\n\n\n\n", 
    "profile": "gs_nomad", 
    "topicId": 1696, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 117292773, 
    "prevInTime": 6436, 
    "contentTrasformed": false, 
    "postDate": "1039889594", 
    "canDelete": false, 
    "nextInTopic": 6438, 
    "prevInTopic": 6436, 
    "headers": {
        "messageIdInHeader": "PDAyMzEwMWMyYTM5YyRhODcyNjQ5MCQwMzlhNDA5NEBHb3J0Pg==", 
        "referencesHeader": "PGF0ZWNiMit2MW05QGVHcm91cHMuY29tPg=="
    }
}