{
    "numMessagesInTopic": 108, 
    "nextInTime": 6440, 
    "senderId": "YXlos9YemRDefKyQoVt8qN59rRf6RZr7yBTkKDFlylADp16I4tVDjC1PHDibObIHU8DHpcYOKSTatNbxhoLL7Rq20ohhRX1NXudplQgfrRdOb0y7Wsfja3xNEos2B34oQQ", 
    "systemMessage": false, 
    "subject": "Re: Testing Private Methods", 
    "from": "&quot;Mike Colbert &lt;mbcolbert@...&gt;&quot; &lt;mbcolbert@...&gt;", 
    "authorName": "Mike Colbert &lt;mbcolbert@yahoo.com&gt;", 
    "msgSnippet": "... topic. ... Thanks for posting that, Dave.  What you ve written is very nice.  I may even agree with most of what you ve said, based solely on my faith in", 
    "msgId": 6439, 
    "profile": "mbcolbert", 
    "topicId": 1696, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 103200639, 
    "messageBody": "<div id=\"ygrps-yiv-1747933550\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;Dave Astels &lt;dave@s...&gt;&quot; &lt;dave@s...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;Dave Astels &lt;dave@s...&gt;&quot; &lt;dave@s...&gt; <br/>\n </span></blockquote>wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &gt; I have a section in the JUnit chapter in my TDD book on the <br/>\n </span></blockquote>topic. <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; I&#39;m thinking maybe it should be the next Coad Letter issue.<br/>\n&gt; &gt; <br/>\n&gt; &gt; I&#39;ll try to do justice to the topic once I&#39;m back at the hotel and<br/>\n&gt; &gt; post the first draft of the results here.<br/>\n&gt; <br/>\n&gt; OK.  A quick job here.  Here&#39;s the sectionon all this.<br/>\n&gt; <br/>\n&gt; Hopefully, someone gets somethign out of it :-)<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>Thanks for posting that, Dave.  What you&#39;ve written is very nice.  I <br/>\nmay even agree with most of what you&#39;ve said, based solely on my <br/>\nfaith in you as a bright person and self-described Master Software <br/>\nCraftsman.  But, I was hoping to get more of an answer to my <br/>\nquestion.  I&#39;ll be honest, based on the description you&#39;ve provided <br/>\nof this approach, I find it really hard to determine if what you&#39;re <br/>\ntalking about is either a) Genuine Refinement or b) Needless <br/>\nComplication.  Please don&#39;t take offense to this criticism.  I&#39;ll be <br/>\nthe first to admit that I&#39;m here to learn.  I think we can all say <br/>\nthe same.<br/>\n<br/>\nNow, I like to keep things simple:  I have a Java class.  It lives in <br/>\na file.  The file lives in a source code repository.  It has <br/>\ncorresponding test code that tests anything that could possibly break <br/>\nin the class.  Sometimes I check the Java class out of the repository <br/>\nand add stuff to it.  Since I practice TDD, more than likely I also <br/>\nneed to add something to the corresponding test code.  When I&#39;m done, <br/>\nI check the Java class back in, along with the corresponding test <br/>\ncode.  Cruisecontrol detects this and automatically runs a build on <br/>\nthe build server.  If the code passes all the tests, I go home and <br/>\nlife is good because I know I&#39;ll get a paycheck the next week to pay <br/>\nrent and buy food.<br/>\n<br/>\nNow, based on those very simple real world requirements, just exactly <br/>\nwhat is it that makes your approach so superior that you will <br/>\nimmediately discount all others as inadequate?<br/>\n<br/>\nI know, I know, it&#39;s in the newsletter and the forthcoming book.  <br/>\nThat&#39;s fabulous.  But you&#39;re preaching to the TDD converted here and <br/>\nwe have found our own ways, based first on the information currently <br/>\navailable and second on our own experience.  I beleive TDD has <br/>\ngathered quite a bit of momentum by now and if you have any chance of <br/>\ninfluencing its direction you need to provide a little more than just <br/>\nself-referential justification for your approach.  (Dave Astels: &quot;My <br/>\ntechnique is the best because that&#39;s what it says in my literature.  <br/>\nMy literature proposes a certain technique because it&#39;s the best <br/>\ntechnique.  My technique is the best because that&#39;s what it says in <br/>\nmy literature.  My literature proposes a certain technique because <br/>\nit&#39;s the best technique.  Blah, blah, blah.&quot;)<br/>\n<br/>\nYou say, &quot;This will help us write and organize groups of tests that <br/>\nare simpler, cleaner, more understandable, and more maintainable.&quot;<br/>\n<br/>\nThese are all noble goals for an approach to TDD.  Would you care to <br/>\nelaborate on just why you believe you have achieved these goals?<br/>\n<br/>\nMike</div>", 
    "prevInTime": 6438, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1039878721", 
    "canDelete": false, 
    "nextInTopic": 6440, 
    "prevInTopic": 6438, 
    "headers": {
        "inReplyToHeader": "PGF0ZWNiMit2MW05QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGF0ZmhvMSthaG03QGVHcm91cHMuY29tPg=="
    }
}