{
    "numMessagesInTopic": 108, 
    "nextInTime": 6441, 
    "senderId": "L9Mbhd5odULrdqM8rGC7BLyRExAU77H-s3JCSCAL6a-Y5vuofJyvlgJU6xPHO3n28qgC8b-q_OW1W9CnfVzTMo_EKRg3THemWgMTpDkmsOjze1vLDx8bPaF11WnMHOPlSz-PiY-x99ht00TNRA", 
    "systemMessage": false, 
    "subject": "TestCases per class vs. TestCases per fixture", 
    "from": "&quot;s_gemkow &lt;steffen.gemkow@...&gt;&quot; &lt;steffen.gemkow@...&gt;", 
    "authorName": "s_gemkow &lt;steffen.gemkow@objectfab.de&gt;", 
    "msgSnippet": "... Dave made a very strong statement. I ve seen the quote from his book, but a few things I m missing. As one of the authors of JUnitDoclet I d like to add", 
    "msgId": 6440, 
    "profile": "s_gemkow", 
    "topicId": 1696, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127226929, 
    "messageBody": "<div id=\"ygrps-yiv-307218827\">Eric wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; I only recently became enamored of JUnit, as a result of <br/>\n&gt; &gt; JUnitDoclet&#39;s creating a test framework for me. That shortened<br/>\n&gt; &gt; the JUnit learning curve, which helped a lot.<br/>\n<br/>\n </span></blockquote>Dave replied:<br/>\n<blockquote><span title=\"ireply\"> &gt; As I said above (and will again, watch for a CoadLetter issue on the<br/>\n&gt; topic) there should be no explicit coorelation between classes being<br/>\n&gt; tested and TestCase subclasses.<br/>\n<br/>\n </span></blockquote>Dave made a very strong statement. I&#39;ve seen the quote from <br/>\nhis book, but a few things I&#39;m missing. As one of the authors <br/>\nof JUnitDoclet I&#39;d like to add them here. <br/>\n<br/>\nBefore I continue, I&#39;d like to confirm the additional need <br/>\nfor tests not directly related to one specific unit of the <br/>\ncode. (Even JUnitDoclet itself has TestCases like that.) <br/>\n<br/>\nTo organize tests like the application is one way to do it. <br/>\nA natural one, indeed. From a strict testing perspective <br/>\nthe use of a TestCase for each class may not be the very <br/>\nbest way. (Reuse of fixture is an important point.) <br/>\nBut considering other perspectives I&#39;m not convinced it <br/>\nis as bad as Dave made it sound. <br/>\n<br/>\nI like to have many tests. It was only natural to automate <br/>\nthe repeating part of test writing. So JUnitDoclet generates <br/>\nTest skeletons and merges them with what was generated <br/>\n(and modified) before. <br/>\n<br/>\nIn my experience, beginners to JUnit often find it difficult <br/>\nto create the first TestCases. This is used as an excuse not <br/>\nto test at all. (It&#39;s a lame excuse, I know.) Once they&#39;ve <br/>\ngot started, they discover the power of unit testing. <br/>\nUnfortunately they have to start first. ;-)<br/>\n <br/>\nPlease consider the result of JUnitDoclet as an managed <br/>\nstarting point. It is providing places to fill in tests <br/>\nboth to beginners and to experienced developers. <br/>\n<br/>\nIf someone want&#39;s more then the generated test code, he/she <br/>\ncan add TestCases or even TestSuites that contain TestCases <br/>\nfor different aspects (with different fixtures), ...<br/>\n<br/>\nThe very basic fixture may be the instance to test. In a <br/>\nsignificant number of cases that could be just what is <br/>\nneeded.<br/>\n <br/>\nOne major thing I like about tests related to specific units <br/>\nof code: <br/>\n  The tests are documenting the intention behind the code. <br/>\n<br/>\nWhen I look at my code later, I like to go to the test and <br/>\nsee what the code was ment to do. The underestimated part <br/>\nof that idea is, to keep the test structure in sync as the<br/>\napplication is refactured. Here is one major difference to <br/>\nother tools I know: refactoring support. Only if the test <br/>\nstructure is _following_ the application structure we keep<br/>\nthe &quot;documenting aspect of tests&quot; up to date.  <br/>\n<br/>\nI see the benefits from the structure Dave described and <br/>\nthink about whether or not generating them somehow. But I&#39;m <br/>\nnot sure about the survival of the &quot;documenting aspect of <br/>\ntests&quot;. Wouldn&#39;t separate &quot;methods with long names&quot; be <br/>\nbetter from _that_ point of view? (We still can/should factor <br/>\nout the creation and destruction of a reused fixture.) <br/>\nWhat do you think?<br/>\n<br/>\nKind regards,<br/>\n<br/>\nSteffen</div>", 
    "prevInTime": 6439, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1039892866", 
    "canDelete": false, 
    "nextInTopic": 6441, 
    "prevInTopic": 6439, 
    "headers": {
        "inReplyToHeader": "PGF0ZDg4MisxMGozMUBlR3JvdXBzLmNvbT4=", 
        "messageIdInHeader": "PGF0ZnZpMitjcnUwQGVHcm91cHMuY29tPg=="
    }
}