{
    "numMessagesInTopic": 108, 
    "nextInTime": 6443, 
    "senderId": "1n_XR_SesA1WQSxpDOLCGsO5OOSQKgnaukKPww3xpesa-ZQ0Djp8hO-rBBPAlem3E3slnI6Vm7wlbTVpjkKkD_8M74fEOMABWNL9wejpBXgstrtF", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Testing Private Methods", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbr@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "So said  Mike Colbert   on  2002-12-14 ...  ... Based on the above description, I disagree that you practice TDD. If you practiced", 
    "msgId": 6442, 
    "rawEmail": "Return-Path: &lt;jbr@...&gt;\r\nX-Sender: jbr@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_3_0); 14 Dec 2002 21:56:00 -0000\r\nReceived: (qmail 46052 invoked from network); 14 Dec 2002 21:56:00 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m9.grp.scd.yahoo.com with QMQP; 14 Dec 2002 21:56:00 -0000\r\nReceived: from unknown (HELO fep04-mail.bloor.is.net.cable.rogers.com) (66.185.86.74)\n  by mta3.grp.scd.yahoo.com with SMTP; 14 Dec 2002 21:56:00 -0000\r\nReceived: from quincy ([24.103.233.219])\n          by fep04-mail.bloor.is.net.cable.rogers.com\n          (InterMail vM.5.01.05.06 201-253-122-126-106-20020509) with ESMTP\n          id &lt;20021214215539.UBZP214174.fep04-mail.bloor.is.net.cable.rogers.com@quincy&gt;\n          for &lt;junit@yahoogroups.com&gt;; Sat, 14 Dec 2002 16:55:39 -0500\r\nMessage-ID: &lt;200212141655560119.00A88388@...&gt;\r\nIn-Reply-To: &lt;atfho1+ahm7@...&gt;\r\nReferences: &lt;atfho1+ahm7@...&gt;\r\nX-Mailer: Calypso Version 3.30.00.00 (4)\r\nDate: Sat, 14 Dec 2002 16:55:56 -0500\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] Re: Testing Private Methods\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;\r\nX-Authentication-Info: Submitted using SMTP AUTH LOGIN at fep04-mail.bloor.is.net.cable.rogers.com from [24.103.233.219] using ID &lt;srainsberger5790@...&gt; at Sat, 14 Dec 2002 16:55:38 -0500\r\nFrom: &quot;J. B. Rainsberger&quot; &lt;jbr@...&gt;\r\nReply-To: jbr@...\r\nX-Yahoo-Group-Post: member; u=89240252\r\nX-Yahoo-Profile: nails762\r\n\r\nSo said  Mike Colbert &lt;mbcolbert@...&gt;  on  2002-12-14\n--------------------\n\n&lt;snip /&gt;\n&gt;Now, I like to keep things simple:  I have a Java class.  It lives in \n&gt;a file.  The file lives in a source code repository.  It has \n&gt;corresponding test code that tests anything that could possibly break \n&gt;in the class.  Sometimes I check the Java class out of the repository \n&gt;and add stuff to it.  Since I practice TDD, more than likely I also \n&gt;need to add something to the corresponding test code.  When I&#39;m done, \n&gt;I check the Java class back in, along with the corresponding test \n&gt;code.  Cruisecontrol detects this and automatically runs a build on \n&gt;the build server.  If the code passes all the tests, I go home and \n&gt;life is good because I know I&#39;ll get a paycheck the next week to pay \n&gt;rent and buy food.\n\nBased on the above description, I disagree that you practice TDD. If\nyou practiced TDD, then you would not write, &quot;...likely I also needed\nto add something to the corresponding test code.&quot; If you practiced TDD,\nyou would:\n\n1. Write a test\n2. Watch it fail\n3. Make it pass\n4. Refactor\n\nIt&#39;s the last step that leads you to see that your TestCase is doing\ntoo much is a candidate to be factored into smaller objects.\n\nI have worked on a project where test cases quickly became difficult to\nunderstand because of the massive amount of test setup -- mostly\npriming a database with known data. None of our attempts to solve the\nproblem were entirely satisfying and the team did not agree to let me\ntest the business logic entirely separately from the persistence\nmechanism. The result was this: after not seeing a certain TestCase for\na few days it would take 10 minutes or so to remember or re-understand\nwhat was going on. Also, changes to the test setup had cascading\neffects on the rest of the tests. If I had just created a new TestCase,\nI could have factored the real commonality up and kept the details\nseparate. That would certainly have helped, and this explains why I\nhave adopted that technique as a habit.\n\n&gt;Now, based on those very simple real world requirements, just exactly \n&gt;what is it that makes your approach so superior that you will \n&gt;immediately discount all others as inadequate?\n\nAt this point, I feel that you are being unnecessarily antagonistic.\nRudeness objection. Please tone it down.\n\n&gt;I know, I know, it&#39;s in the newsletter and the forthcoming book.  \n&gt;That&#39;s fabulous.  But you&#39;re preaching to the TDD converted here and \n&gt;we have found our own ways, based first on the information currently \n&gt;available and second on our own experience.\n&lt;snip /&gt;\n\nGiven that your above statement (way up there) indicates that you do\nnot practice TDD, but rather that you do something else that is\nsomewhere similar to TDD, I am not sure that you can directly use your\nexperience to argue either in favor or against TDD. I apologize if that\nis harsh, but I believe it is objectively true. I make no value\njudgement: do what you do if it works, but please do not call it TDD.\n\n&gt;I beleive TDD has \n&gt;gathered quite a bit of momentum by now and if you have any chance of \n&gt;influencing its direction you need to provide a little more than just \n&gt;self-referential justification for your approach.\n\nNow you have turned this into an ad-hominem attack. I do not believe\nthat many of us is interesting in this kind of thing. As a moderator, I\nam asking you to tone it down. Just because we do not write\nnovel-length, in-depth answers to your question does not mean that we\nare evading anything. It means that we are busy.\n\n&gt;You say, &quot;This will help us write and organize groups of tests that \n&gt;are simpler, cleaner, more understandable, and more maintainable.&quot;\n&gt;\n&gt;These are all noble goals for an approach to TDD.  Would you care to \n&gt;elaborate on just why you believe you have achieved these goals?\n\nIf I were Dave -- and I clearly am not -- I would not take much\ninterest in justifying myself to someone who so rudely challenges me.\nCivilly-worded challenges are perfectly acceptable.\n\nThank you.\n\nJ. B. Rainsberger,\nPresident, Diaspar Software Services\nLet&#39;s write software that people understand.\nhttp://www.diasparsoftware.com/\ntelephone: +1 416 791-8603\nAll correspondence (c) 2002 Diaspar Software Services.\nIf you want to use it, just ask; don&#39;t steal.\n\n\n\n", 
    "profile": "nails762", 
    "topicId": 1696, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 89240252, 
    "prevInTime": 6441, 
    "contentTrasformed": false, 
    "postDate": "1039902956", 
    "canDelete": false, 
    "nextInTopic": 6443, 
    "prevInTopic": 6441, 
    "headers": {
        "inReplyToHeader": "PGF0ZmhvMSthaG03QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDIwMDIxMjE0MTY1NTU2MDExOS4wMEE4ODM4OEBzbXRwLnltLnBodWIubmV0LmNhYmxlLnJvZ2Vycy5jb20+", 
        "referencesHeader": "PGF0ZmhvMSthaG03QGVHcm91cHMuY29tPg=="
    }
}