{
    "numMessagesInTopic": 108, 
    "nextInTime": 6446, 
    "senderId": "v3zyx48YrDYkjOgPw3PzTP9XDQlRdG-ZeSXT4KEg4i9mUxJTPOYa0nztW_Ea4Ym6Mw4BboL-vDw8EbCzHgYds9g4WygJlkGEqLRmcoTzYTq0NCMJceOiYBA7cW0IqU9ExA", 
    "systemMessage": false, 
    "subject": "Re: Testing Private Methods", 
    "from": "&quot;Mike Colbert &lt;mbcolbert@...&gt;&quot; &lt;mbcolbert@...&gt;", 
    "authorName": "Mike Colbert &lt;mbcolbert@yahoo.com&gt;", 
    "msgSnippet": "... in ... break ... repository ... also ... done, ... on ... pay ... needed ... TDD, ... Consider it s a value object, and I simply need to add a property, ", 
    "msgId": 6445, 
    "rawEmail": "Return-Path: &lt;mbcolbert@...&gt;\r\nReceived: (qmail 66700 invoked from network); 14 Dec 2002 23:31:58 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m11.grp.scd.yahoo.com with QMQP; 14 Dec 2002 23:31:58 -0000\r\nReceived: from unknown (HELO n5.grp.scd.yahoo.com) (66.218.66.89)\n  by mta1.grp.scd.yahoo.com with SMTP; 14 Dec 2002 23:31:58 -0000\r\nX-eGroups-Return: mbcolbert@...\r\nReceived: from [66.218.66.140] by n5.grp.scd.yahoo.com with NNFMP; 14 Dec 2002 23:31:57 -0000\r\nX-Sender: mbcolbert@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_3_0); 14 Dec 2002 23:31:23 -0000\r\nReceived: (qmail 4070 invoked from network); 14 Dec 2002 23:31:23 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m9.grp.scd.yahoo.com with QMQP; 14 Dec 2002 23:31:23 -0000\r\nReceived: from unknown (HELO n28.grp.scd.yahoo.com) (66.218.66.84)\n  by mta3.grp.scd.yahoo.com with SMTP; 14 Dec 2002 23:31:24 -0000\r\nReceived: from [66.218.67.156] by n28.grp.scd.yahoo.com with NNFMP; 14 Dec 2002 23:31:23 -0000\r\nDate: Sat, 14 Dec 2002 23:31:19 -0000\r\nTo: junit@yahoogroups.com\r\nSubject: Re: Testing Private Methods\r\nMessage-ID: &lt;atgf07+616r@...&gt;\r\nIn-Reply-To: &lt;200212141655560119.00A88388@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 5879\r\nX-Mailer: Yahoo Groups Message Poster\r\nFrom: &quot;Mike Colbert &lt;mbcolbert@...&gt;&quot; &lt;mbcolbert@...&gt;\r\nX-Yahoo-Group-Post: member; u=103200639\r\nX-Yahoo-Profile: mbcolbert\r\nX-eGroups-Approved-By: clarkware &lt;mike@...&gt; via web; 14 Dec 2002 23:31:55 -0000\r\n\r\n--- In junit@yahoogroups.com, &quot;J. B. Rainsberger&quot; &lt;jbr@d...&gt; wrote:\n&gt; So said  Mike Colbert &lt;mbcolbert@y...&gt;  on  2002-12-14\n&gt; --------------------\n&gt; \n&gt; &lt;snip /&gt;\n&gt; &gt;Now, I like to keep things simple:  I have a Java class.  It lives \nin \n&gt; &gt;a file.  The file lives in a source code repository.  It has \n&gt; &gt;corresponding test code that tests anything that could possibly \nbreak \n&gt; &gt;in the class.  Sometimes I check the Java class out of the \nrepository \n&gt; &gt;and add stuff to it.  Since I practice TDD, more than likely I \nalso \n&gt; &gt;need to add something to the corresponding test code.  When I&#39;m \ndone, \n&gt; &gt;I check the Java class back in, along with the corresponding test \n&gt; &gt;code.  Cruisecontrol detects this and automatically runs a build \non \n&gt; &gt;the build server.  If the code passes all the tests, I go home and \n&gt; &gt;life is good because I know I&#39;ll get a paycheck the next week to \npay \n&gt; &gt;rent and buy food.\n&gt; \n&gt; Based on the above description, I disagree that you practice TDD. If\n&gt; you practiced TDD, then you would not write, &quot;...likely I also \nneeded\n&gt; to add something to the corresponding test code.&quot; If you practiced \nTDD,\n&gt; you would:\n&gt; \n&gt; 1. Write a test\n&gt; 2. Watch it fail\n&gt; 3. Make it pass\n&gt; 4. Refactor\n&gt; \n\nConsider it&#39;s a value object, and I simply need to add a property, \nalong with a getter and setter.  I don&#39;t write tests for that \neverytime.  (We have a BaseTestCase with a checkProperties() method \nthat automatically does this for us via introspection.)\n\n\n&gt; It&#39;s the last step that leads you to see that your TestCase is doing\n&gt; too much is a candidate to be factored into smaller objects.\n&gt; \n&gt; I have worked on a project where test cases quickly became \ndifficult to\n&gt; understand because of the massive amount of test setup -- mostly\n&gt; priming a database with known data. None of our attempts to solve \nthe\n&gt; problem were entirely satisfying and the team did not agree to let \nme\n&gt; test the business logic entirely separately from the persistence\n&gt; mechanism. The result was this: after not seeing a certain TestCase \nfor\n&gt; a few days it would take 10 minutes or so to remember or re-\nunderstand\n&gt; what was going on. Also, changes to the test setup had cascading\n&gt; effects on the rest of the tests. If I had just created a new \nTestCase,\n&gt; I could have factored the real commonality up and kept the details\n&gt; separate. That would certainly have helped, and this explains why I\n&gt; have adopted that technique as a habit.\n&gt; \n\nI have a similar problem on my current project.  I&#39;m writing a \npersistence layer.  Loosely speaking, my tests take an object graph, \npersist it, read it from the persistence layer, and validate it&#39;s \nstructure.  The important thing is, and this is where we share a \ncommon problem, there is a lot of setup involved.  In my case, to \nconstruct an object graph everytime a test is run.  My approach was \nto create a seperate class (named DAOTestFixture, of all things) \nwhich constructs and contains the object graph.  I simply create an \ninstance of this class from the setUp() method in all my DAO \nTestCases.  At this point, I have about eight DAOs and corresponding \nTestCases that reuse this test fixture.  Plus, I get to use inner \nclasses, reap all the benefits, and there is nothing to stop me from \nrefactoring those TestCases into seperate inner classes should I want \nto in the future.  If I ever find I need to share a TestCase across \nclasses (would this ever happen?), I suppose I could refactor it into \nit&#39;s own freestanding class.\n\n\n&gt; &gt;Now, based on those very simple real world requirements, just \nexactly \n&gt; &gt;what is it that makes your approach so superior that you will \n&gt; &gt;immediately discount all others as inadequate?\n&gt; \n&gt; At this point, I feel that you are being unnecessarily antagonistic.\n&gt; Rudeness objection. Please tone it down.\n&gt; \n\n\nOh, but it&#39;s my approach that was attacked with a groundless claim.  \nSorry for wondering why.\n\n\n&gt; &gt;I know, I know, it&#39;s in the newsletter and the forthcoming book.  \n&gt; &gt;That&#39;s fabulous.  But you&#39;re preaching to the TDD converted here \nand \n&gt; &gt;we have found our own ways, based first on the information \ncurrently \n&gt; &gt;available and second on our own experience.\n&gt; &lt;snip /&gt;\n&gt; \n&gt; Given that your above statement (way up there) indicates that you do\n&gt; not practice TDD, but rather that you do something else that is\n&gt; somewhere similar to TDD, I am not sure that you can directly use \nyour\n&gt; experience to argue either in favor or against TDD. I apologize if \nthat\n&gt; is harsh, but I believe it is objectively true. I make no value\n&gt; judgement: do what you do if it works, but please do not call it \nTDD.\n&gt; \n\n\nI don&#39;t see how you could have ever concluded that I don&#39;t do TDD \nbased on my statment above.  Definitely a stretch ...\n\n\n\n&gt; &gt;I beleive TDD has \n&gt; &gt;gathered quite a bit of momentum by now and if you have any chance \nof \n&gt; &gt;influencing its direction you need to provide a little more than \njust \n&gt; &gt;self-referential justification for your approach.\n&gt; \n&gt; Now you have turned this into an ad-hominem attack. I do not believe\n&gt; that many of us is interesting in this kind of thing. As a \nmoderator, I\n&gt; am asking you to tone it down. Just because we do not write\n&gt; novel-length, in-depth answers to your question does not mean that \nwe\n&gt; are evading anything. It means that we are busy.\n&gt; \n\n\nHAHAHAHAHAHA!!  You guys are too much ...\n\n\n&gt; &gt;You say, &quot;This will help us write and organize groups of tests \nthat \n&gt; &gt;are simpler, cleaner, more understandable, and more maintainable.&quot;\n&gt; &gt;\n&gt; &gt;These are all noble goals for an approach to TDD.  Would you care \nto \n&gt; &gt;elaborate on just why you believe you have achieved these goals?\n&gt; \n&gt; If I were Dave -- and I clearly am not -- I would not take much\n&gt; interest in justifying myself to someone who so rudely challenges \nme.\n&gt; Civilly-worded challenges are perfectly acceptable.\n&gt; \n\n\nPuh-leeze!!\n\nSincerely,\nMike Colbert\n\n\n\n\n\n\n\n", 
    "profile": "mbcolbert", 
    "topicId": 1696, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 103200639, 
    "prevInTime": 6444, 
    "contentTrasformed": false, 
    "postDate": "1039908679", 
    "canDelete": false, 
    "nextInTopic": 6447, 
    "prevInTopic": 6444, 
    "headers": {
        "inReplyToHeader": "PDIwMDIxMjE0MTY1NTU2MDExOS4wMEE4ODM4OEBzbXRwLnltLnBodWIubmV0LmNhYmxlLnJvZ2Vycy5jb20+", 
        "messageIdInHeader": "PGF0Z2YwNys2MTZyQGVHcm91cHMuY29tPg=="
    }
}