{
    "numMessagesInTopic": 108, 
    "nextInTime": 6450, 
    "senderId": "6JCW-vZYt8smEKAGxwP3TfI5ahpSYfptN5q0UYGqnpxyPygZ0INU46Tq8WCWpwAOiri5-Bawm02VDGFCFrYLsd25RDHHTyXh_OLsiVYPC51HSe7w", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Testing Private Methods", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbr@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "So said  Mike Colbert   on  12/14/2002 ...  ... Certainly not. That s simple enough not to break on its own 99.9% percent of the", 
    "msgId": 6449, 
    "rawEmail": "Return-Path: &lt;jbr@...&gt;\r\nX-Sender: jbr@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_3_0); 15 Dec 2002 12:58:27 -0000\r\nReceived: (qmail 15965 invoked from network); 15 Dec 2002 12:58:27 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m7.grp.scd.yahoo.com with QMQP; 15 Dec 2002 12:58:27 -0000\r\nReceived: from unknown (HELO fep02-mail.bloor.is.net.cable.rogers.com) (66.185.86.72)\n  by mta1.grp.scd.yahoo.com with SMTP; 15 Dec 2002 12:58:27 -0000\r\nReceived: from quincy ([24.42.96.247])\n          by fep02-mail.bloor.is.net.cable.rogers.com\n          (InterMail vM.5.01.05.06 201-253-122-126-106-20020509) with ESMTP\n          id &lt;20021215125811.YKGM513731.fep02-mail.bloor.is.net.cable.rogers.com@quincy&gt;\n          for &lt;junit@yahoogroups.com&gt;; Sun, 15 Dec 2002 07:58:11 -0500\r\nMessage-ID: &lt;200212150758240599.00106412@...&gt;\r\nIn-Reply-To: &lt;atgf07+616r@...&gt;\r\nReferences: &lt;atgf07+616r@...&gt;\r\nX-Mailer: Calypso Version 3.30.00.00 (4)\r\nDate: Sun, 15 Dec 2002 07:58:24 -0500\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] Re: Testing Private Methods\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;\r\nX-Authentication-Info: Submitted using SMTP AUTH LOGIN at fep02-mail.bloor.is.net.cable.rogers.com from [24.42.96.247] using ID &lt;srainsberger5790@...&gt; at Sun, 15 Dec 2002 07:58:10 -0500\r\nFrom: &quot;J. B. Rainsberger&quot; &lt;jbr@...&gt;\r\nReply-To: jbr@...\r\nX-Yahoo-Group-Post: member; u=89240252\r\nX-Yahoo-Profile: nails762\r\n\r\nSo said  Mike Colbert &lt;mbcolbert@...&gt;  on  12/14/2002\n--------------------\n\n&lt;snip /&gt;\n&gt;&gt; Based on the above description, I disagree that you practice TDD. If\n&gt;&gt; you practiced TDD, then you would not write, &quot;...likely I also \n&gt;needed\n&gt;&gt; to add something to the corresponding test code.&quot; If you practiced \n&gt;TDD,\n&gt;&gt; you would:\n&gt;&gt; \n&gt;&gt; 1. Write a test\n&gt;&gt; 2. Watch it fail\n&gt;&gt; 3. Make it pass\n&gt;&gt; 4. Refactor\n&gt;\n&gt;Consider it&#39;s a value object, and I simply need to add a property, \n&gt;along with a getter and setter.  I don&#39;t write tests for that \n&gt;everytime.  (We have a BaseTestCase with a checkProperties() method \n&gt;that automatically does this for us via introspection.)\n\nCertainly not. That&#39;s simple enough not to break on its own 99.9%\npercent of the time... Can we match this back to the question?\n\n&gt;&gt; It&#39;s the last step that leads you to see that your TestCase is doing\n&gt;&gt; too much is a candidate to be factored into smaller objects.\n&gt;&gt; \n&gt;&gt; I have worked on a project where test cases quickly became \n&gt;difficult to\n&gt;&gt; understand because of the massive amount of test setup -- mostly\n&gt;&gt; priming a database with known data. None of our attempts to solve \n&gt;the\n&gt;&gt; problem were entirely satisfying and the team did not agree to let \n&gt;me\n&gt;&gt; test the business logic entirely separately from the persistence\n&gt;&gt; mechanism. The result was this: after not seeing a certain TestCase \n&gt;for\n&gt;&gt; a few days it would take 10 minutes or so to remember or re-\n&gt;understand\n&gt;&gt; what was going on. Also, changes to the test setup had cascading\n&gt;&gt; effects on the rest of the tests. If I had just created a new \n&gt;TestCase,\n&gt;&gt; I could have factored the real commonality up and kept the details\n&gt;&gt; separate. That would certainly have helped, and this explains why I\n&gt;&gt; have adopted that technique as a habit.\n&gt;\n&gt;I have a similar problem on my current project.  I&#39;m writing a \n&gt;persistence layer.  Loosely speaking, my tests take an object graph, \n&gt;persist it, read it from the persistence layer, and validate it&#39;s \n&gt;structure.  The important thing is, and this is where we share a \n&gt;common problem, there is a lot of setup involved.  In my case, to \n&gt;construct an object graph everytime a test is run.  My approach was \n&gt;to create a seperate class (named DAOTestFixture, of all things) \n&gt;which constructs and contains the object graph.  I simply create an \n&gt;instance of this class from the setUp() method in all my DAO \n&gt;TestCases.  At this point, I have about eight DAOs and corresponding \n&gt;TestCases that reuse this test fixture.  Plus, I get to use inner \n&gt;classes, reap all the benefits, and there is nothing to stop me from \n&gt;refactoring those TestCases into seperate inner classes should I want \n&gt;to in the future.  If I ever find I need to share a TestCase across \n&gt;classes (would this ever happen?), I suppose I could refactor it into \n&gt;it&#39;s own freestanding class.\n\nSo you compose text fixtures, rather than extending them. There&#39;s no\nlaw that says a TestCase must descend from a fixture or implement the\nfixture itself, but from an organizational standpoint it is nicer for\nthe reader if each TestCase were a separate fixture, as long as the\nfixture is not tiny.\n\nIt&#39;s like anything else: if you roll up three tiny things into one big\nthing, that may be no problem; but if you roll up three big things into\none even bigger thing, bad things tend to happen.\n\n&gt;&gt; &gt;Now, based on those very simple real world requirements, just \n&gt;exactly \n&gt;&gt; &gt;what is it that makes your approach so superior that you will \n&gt;&gt; &gt;immediately discount all others as inadequate?\n&gt;&gt; \n&gt;&gt; At this point, I feel that you are being unnecessarily antagonistic.\n&gt;&gt; Rudeness objection. Please tone it down.\n&gt;\n&gt;Oh, but it&#39;s my approach that was attacked with a groundless claim.  \n&gt;Sorry for wondering why.\n\nI will not stop you from wondering why, but I can ask you to act less\nlike an ass when you point out that you don&#39;t agree. This might work:\n\n&quot;Now, based on those very simple real-world requirements, it looks like\nmy approach does the job. What is there in your approach that I am\nmissing with mine?&quot;\n\nIt may be that Dave was describing a general-purpose, one-size-fits-all\napproach that could be optimized in your specific case. If you ask him\ncivilly, I&#39;m sure he&#39;ll respond. If you feel he was being uncivil\ntowards you, then be the bigger man and tell him so, civilly. I missed\nhis part of the exchange, so I can&#39;t say.\n\n&gt;&gt; &gt;I know, I know, it&#39;s in the newsletter and the forthcoming book.  \n&gt;&gt; &gt;That&#39;s fabulous.  But you&#39;re preaching to the TDD converted here \n&gt;and \n&gt;&gt; &gt;we have found our own ways, based first on the information \n&gt;currently \n&gt;&gt; &gt;available and second on our own experience.\n&gt;&gt; &lt;snip /&gt;\n&gt;&gt; \n&gt;&gt; Given that your above statement (way up there) indicates that you do\n&gt;&gt; not practice TDD, but rather that you do something else that is\n&gt;&gt; somewhere similar to TDD, I am not sure that you can directly use \n&gt;your\n&gt;&gt; experience to argue either in favor or against TDD. I apologize if \n&gt;that\n&gt;&gt; is harsh, but I believe it is objectively true. I make no value\n&gt;&gt; judgement: do what you do if it works, but please do not call it \n&gt;TDD.\n&gt;\n&gt;I don&#39;t see how you could have ever concluded that I don&#39;t do TDD \n&gt;based on my statment above.  Definitely a stretch ...\n\nWell, you didn&#39;t argue against it in your reply after the part in which\nI wrote it, so I assumed that you at least didn&#39;t violently disagree.\nIf you write code first, then &quot;likely&quot; add tests, why is that TDD? I\ndon&#39;t think it is.\n\nJ. B. Rainsberger,\nPresident, Diaspar Software Services\nLet&#39;s write software that people understand.\nhttp://www.diasparsoftware.com/\ntelephone: +1 416 791-8603\nAll correspondence (c) 2002 Diaspar Software Services.\nIf you want to use it, just ask; don&#39;t steal.\n\n\n\n", 
    "profile": "nails762", 
    "topicId": 1696, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 89240252, 
    "prevInTime": 6448, 
    "contentTrasformed": false, 
    "postDate": "1039957104", 
    "canDelete": false, 
    "nextInTopic": 6450, 
    "prevInTopic": 6448, 
    "headers": {
        "inReplyToHeader": "PGF0Z2YwNys2MTZyQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDIwMDIxMjE1MDc1ODI0MDU5OS4wMDEwNjQxMkBzbXRwLnltLnBodWIubmV0LmNhYmxlLnJvZ2Vycy5jb20+", 
        "referencesHeader": "PGF0Z2YwNys2MTZyQGVHcm91cHMuY29tPg=="
    }
}