{
    "numMessagesInTopic": 108, 
    "nextInTime": 6459, 
    "senderId": "TU0fgY29wcY4xuu2zxXEm6gB8t6-EhpQLtDeDTxkfZAHpAtDmwET7Qha2jxQwrhA-WA3e8L0IhwgOPkcOBHZQjgKMZf-p1Adj5NbuvjT9nZyY6Qi", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Testing Private Methods", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbr@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "So said  Mike Colbert   on  12/15/2002 ... You didn t ask me, but I don t find it particularly rude. I think the joke about Canadians", 
    "msgId": 6458, 
    "profile": "nails762", 
    "topicId": 1696, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 89240252, 
    "messageBody": "<div id=\"ygrps-yiv-1244283729\">So said  Mike Colbert &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mbcolbert@...\">mbcolbert@...</a>&gt;  on  12/15/2002<br/>\n--------------------<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, Bill de hÓra &lt;dehora@e...&gt; wrote:<br/>\n&gt;&gt; To me Mike, you&#39;re coming across as rude.<br/>\n&gt;<br/>\n&gt;I&#39;m curious, do you find this rude?<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/junit/message/6415\">http://groups.yahoo.com/group/junit/message/6415</a><br/>\n<br/>\n </span></blockquote>You didn&#39;t ask me, but I don&#39;t find it particularly rude. I think the<br/>\njoke about Canadians being unusually polite might put some people off,<br/>\nbut being Canadian, I understand.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;To me, it smacks of self-righteousness and shameless self-promotion.<br/>\n<br/>\n </span></blockquote>You know what, that&#39;s not so bad. When I do good work that I think<br/>\nhelps people, I promote it. If they find it good, they also promote it.<br/>\nIf they find it bad, they tell me and I stop promoting it.<br/>\n<br/>\nI wrote &quot;JUnit: A Starter Guide&quot; in response to two solid weeks of<br/>\ncomplaining on this list about how crappy the JUnit documentation is.<br/>\nAbout four people in a row said they wanted a tutorial and I wrote one,<br/>\nthen found some other good ones on the web. Mike Clark put together a<br/>\nFAQ to go along side his excellent tutorial. Among us all, I think we<br/>\nhave the tutorial angle covered. Several thousand people have read that<br/>\ndocument and I haven&#39;t seen a single complaint on this list since that<br/>\ntime. That was about a year ago.<br/>\n<br/>\nLet me ask you, am I wrong to be proud of that and to refer people to<br/>\nit if they ask for a tutorial?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I didn&#39;t come here to have some guy and his buddy disparage the ideas <br/>\n&gt;that I offer without offering anything in exchange other than, &quot;This <br/>\n&gt;is how it is.  Buy my book!&quot;<br/>\n<br/>\n </span></blockquote>See, this is just sad. First, I&#39;m not &quot;his buddy&quot;. Dave and I have<br/>\nexchanged the odd e-mail, but we hardly know each other. We respect<br/>\neach other&#39;s work (at least I hope), but that&#39;s all. I trust that Dave<br/>\nwill tackle your problem in an upcoming Coad letter. I thought it was<br/>\nrude of you to insist he get off his ass and answer your question right<br/>\nnow. That was how I saw your comment. Just because the man didn&#39;t want<br/>\nto type a long answer right that second doesn&#39;t mean that he didn&#39;t<br/>\nhave a good answer and it doesn&#39;t mean that he wasn&#39;t going to share<br/>\nhis answer. And OF COURSE if he has written the answer in a book, I<br/>\ndon&#39;t blame him for wanting you to buy the book, rather than get his<br/>\nadvice free. Be aware that we could be charging hundreds of dollars per<br/>\nday for our advice. We are volunteers here.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I think if a person jumps into a discussion and says, &quot;Your approach <br/>\n&gt;sucks.  Buy my book!&quot; they should at least explain why.  That might <br/>\n&gt;actually be helpful to others.<br/>\n<br/>\n </span></blockquote>I honestly didn&#39;t see &quot;Your approach sucks&quot;. I hope that my other reply<br/>\nmade it clearer what I think Dave was getting at: most people<br/>\nmisunderstand (as I did for two years) why the class TestCase is meant<br/>\nto embody a test fixture. The fact that it&#39;s named TestCase is a source<br/>\nof confusion. Kent admitted that himself!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Yet, I haven&#39;t <br/>\n&gt;&gt; seen any explanation as to what is inferior in your approach - <br/>\n&gt;&gt; asserting it&#39;s inferior does not make it so.<br/>\n&gt;<br/>\n&gt;I couldn&#39;t agree more.<br/>\n<br/>\n </span></blockquote>If I say &quot;you should brush your teeth&quot;, do you attack me? The bottom<br/>\nline is that you *should* brush your teeth, assuming that you want good<br/>\ndental health and your teeth to last a long time. If you don&#39;t care<br/>\nabout dental health, or if your teeth are magical and stay clean all on<br/>\ntheir own, or if not brushing your teeth hasn&#39;t affected your life to<br/>\nthis point, then certainly, continue not brushing your teeth.<br/>\n<br/>\nHOWEVER, if later on your teeth all fall out and you don&#39;t like what<br/>\nthat does to you, then you make look back on my advice and say, &quot;You<br/>\nknow, perhaps I should have brushed my teeth.&quot;<br/>\n<br/>\nSo you can take it as you like. Either assume that we&#39;re Just Trying To<br/>\nHelp or assume that we&#39;re out to disparage you. Your choice. If you<br/>\nchoose to believe that we&#39;re out to disparage you, then please<br/>\nunderstand when we say that we know better than you know what our<br/>\nintentions are.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I also found the waving <br/>\n&gt;&gt; of the moderator stick distasteful; it&#39;s far too early for that.<br/>\n&gt;&gt; <br/>\n&gt;&gt; A suggestion - stop posting for 24 hours on this thread, then come <br/>\n&gt;&gt; back to it.<br/>\n&gt;&gt; <br/>\n&gt;&gt; Bill de hÓra<br/>\n&gt;<br/>\n&gt;Whoops, too late for that!  Heheh.<br/>\n&gt;<br/>\n&gt;For the record, I never said I disagreed with what Dave and J. B. are <br/>\n&gt;advocating.  I never said I didn&#39;t like them personally, either.  <br/>\n&gt;It&#39;s the delivery of their message I find curious.  It seems more <br/>\n&gt;geared toward self-interest than equitable exchange or mutual benefit.<br/>\n<br/>\n </span></blockquote>I would love for you to show me where, in my reply, you felt that my<br/>\nadvice was delivered with self-interest as opposed to YOUR benefit,<br/>\nnevermind MUTUAL benefit. At least one of us will be able to learn from<br/>\nthat exercise, and probably both.<br/>\n<br/>\nI mean messages 6421, 6435 and 6442 up until the point that I objected<br/>\nto what I perceived as your rudeness.<br/>\n<br/>\nJ. B. Rainsberger,<br/>\nPresident, Diaspar Software Services<br/>\nLet&#39;s write software that people understand.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com/\">http://www.diasparsoftware.com/</a><br/>\ntelephone: +1 416 791-8603<br/>\nAll correspondence (c) 2002 Diaspar Software Services.<br/>\nIf you want to use it, just ask; don&#39;t steal.</div>", 
    "prevInTime": 6457, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1039985876", 
    "canDelete": false, 
    "nextInTopic": 6459, 
    "prevInTopic": 6457, 
    "headers": {
        "inReplyToHeader": "PGF0aWxlcitocm0yQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDIwMDIxMjE1MTU1NzU2MDUzMS4wMUM3NkE2RUBzbXRwLnltLnBodWIubmV0LmNhYmxlLnJvZ2Vycy5jb20+", 
        "referencesHeader": "PGF0aWxlcitocm0yQGVHcm91cHMuY29tPg=="
    }
}