{
    "numMessagesInTopic": 108, 
    "nextInTime": 6504, 
    "senderId": "JMNNznBl-1fCYpUHbOVNoHvQrgTaInEDpUDPs5KXr6rezJR9O_PjcSfW-GLEJ7xH2LuejGI2OuBSx58UcAdfCf5eT3YbyZFlWN74aLTmFKk", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Testing Private Methods", 
    "from": "Steven Taschuk &lt;staschuk@...&gt;", 
    "authorName": "Steven Taschuk", 
    "msgSnippet": "Quoth Dave Astels : [...last Friday...] ... I happened to run into something today which made me think about this a bit more.  I d be", 
    "msgId": 6503, 
    "topicId": 1696, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 114327599, 
    "messageBody": "<div id=\"ygrps-yiv-1294604300\">Quoth Dave Astels &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dave@...\">dave@...</a>&gt;:<br/>\n  [...last Friday...]<br/>\n<blockquote><span title=\"ireply\"> &gt; With TDD you define what you need in terms of external behavior, <br/>\n&gt; write a test for it, them implement it.  Finally you clean up by <br/>\n&gt; refactoring.  So as far as your tests are concerned everything that <br/>\n&gt; the class has to do IS public.  When I add a new method in reponse to <br/>\n&gt; a test, it&#39;s public.  When I refactor and extract methods, I make <br/>\n&gt; them private.  That&#39;s the only way I make methods private.<br/>\n<br/>\n </span></blockquote>I happened to run into something today which made me think about<br/>\nthis a bit more.  I&#39;d be interested in comments, especially on<br/>\nthese two questions: (1) Is this situation typical of those in<br/>\nwhich people want to test private methods?  (2) Is there a better<br/>\nsolution in this case than the one I give below?<br/>\n<br/>\nHere&#39;s the situation: A class GregorianDate represents a specific<br/>\nday in the proleptic Gregorian calendar, expressed (from the<br/>\nuser&#39;s point of view at least) as an ordered triple of ints:<br/>\n(year,month,date).  Certain constraints apply to this triple: year<br/>\nzero is forbidden, months must be in [1..12], the valid range of<br/>\ndates depends in familiar ways on the year and month.<br/>\n<br/>\nSo, I decide I want a partwise constructor<br/>\n\tpublic GregorianDate( int year, int month, int date )<br/>\nwhich will throw IllegalArgumentException if any of these<br/>\nconstraints are violated.  I write some tests to express the<br/>\nexpectation of such exceptions, watch them fail, write the<br/>\nconstructor, watch them pass, go for a beer.<br/>\n<br/>\nNow I want a parsing constructor<br/>\n\tpublic GregorianDate( String s ) throws DateParseException<br/>\nwhich will parse strings in ISO 8601 format (such as<br/>\n&quot;2002-12-18&quot;), throwing a DateParseException if the string is<br/>\nmalformed or if the constraints on valid dates are violated.  I<br/>\nfactor the constraint checking out of the partwise constructor and<br/>\ninto private methods so it can be reused by this new constructor,<br/>\nand now the problem arises.<br/>\n<br/>\nOn the one hand, I&#39;d like to test behaviour rather than<br/>\nimplementation, to reduce coupling between the tests and the code<br/>\nunder test; under this principle I might have, e.g., a test to<br/>\ncheck that the partwise constructor rejects month 13, and a test<br/>\nto check that the parsing constructor rejects month 13, and so<br/>\nforth, one pair for each kind of constraint violation that might<br/>\noccur.<br/>\n<br/>\nOn the other hand, these identical lists of tests, one for each<br/>\nconstructor, are inherently fragile.  If I realize there&#39;s some<br/>\nconstraint I didn&#39;t code right (say, I forgot that 2000-02-29 is a<br/>\nvalid date) then I have to remember to update the tests in two<br/>\nplaces.  This smells, and made me think briefly of trying to test<br/>\nthe internal constraint checking methods directly (which is why<br/>\nthis post is on-topic for this thread).<br/>\n<br/>\nSo far the best solution I have for this particular case goes like<br/>\nthis:  Write a utility testing method which takes an invalid<br/>\n(year,month,date) triple and calls both constructors with it,<br/>\nchecking that they both fail in their assigned ways; then, for<br/>\neach type of constraint violation, write a test method which calls<br/>\nthat utility method with a triple exhibiting the violation.<br/>\n<br/>\nThus: If for some reason the constructors are later changed to use<br/>\ndifferent implementations of the constraint checks, the tests<br/>\nremain valid -- so the tests are not tightly coupled to an<br/>\nimplementation detail, as they would be if I tested the private<br/>\nmethods directly.  If a third path to the constraint checks is<br/>\nadded (say, a third constructor of some kind), it can be added in<br/>\none place (the utility method) and immediately gets the benefit of<br/>\nall the constraint checking tests -- so I don&#39;t have to copy all<br/>\nthose tests over again, as I would with the naïve behaviour-<br/>\ntesting plan sketched above.  Conversely, if I add or revise a<br/>\nconstraint test, the change applies to all paths to the constraint<br/>\nchecking code -- so I don&#39;t have to remember all the paths, as I<br/>\nwould with the aforementioned naïve plan.<br/>\n<br/>\nFurthermore, the symmetry suggests this is the Right Thing(tm):<br/>\nfactoring out &quot;check constraints&quot; in the code under test has<br/>\nprovoked factoring out &quot;test that constraint X is checked&quot; in the<br/>\ntesting code.  This reflects the fact that the code under test and<br/>\nthe testing code are operating under the same conceptual model of<br/>\nwhat the code has to do, as they should.<br/>\n<br/>\nComments?<br/>\n<br/>\n-- <br/>\nSteven Taschuk           |   ,&#92;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:staschuk@...\">staschuk@...</a> | }&lt;__`O=<br/>\n                         |  &#39;  &quot;     Pleiosaur</div>", 
    "prevInTime": 6502, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1040283649", 
    "canDelete": false, 
    "nextInTopic": 6504, 
    "prevInTopic": 6462, 
    "headers": {
        "inReplyToHeader": "PGF0Y3RrMyt1MW84QGVHcm91cHMuY29tPjsgZnJvbSBkYXZlQHNhb3JzYS5jb20gb24gRnJpLCBEZWMgMTMsIDIwMDIgYXQgMDM6MTY6MTlQTSAtMDAwMA==", 
        "messageIdInHeader": "PDIwMDIxMjE5MDA0MDQ5LkEyMDkxQHRpYmlhLmFtb3RscGFhLmJvZ3VzPg==", 
        "referencesHeader": "PDY2QzUzQjBDODhEM0Q0MTE4RjRBMDA5MDI3RENFMDY0MDIwMzYzQkJAeWxhY3lidGV4YzAxLnlvdWJldC5jb20+IDxhdGN0azMrdTFvOEBlR3JvdXBzLmNvbT4="
    }
}