{
    "numMessagesInTopic": 108, 
    "nextInTime": 6533, 
    "senderId": "TJxqa97-EevRUosscvYUJ3LOihquV9xMWzILMKNn-4_W16pAOTtycmCMtWBqFEYIOEzmN3F94PExDdJPcl8sOBoQbIclXWIhQrkWCxN23g9BMEbdO85Hcjrr", 
    "systemMessage": false, 
    "subject": "RE: [junit] Re: Testing Private Methods", 
    "from": "&quot;Michael Silverstein&quot; &lt;msilverstein@...&gt;", 
    "authorName": "Michael Silverstein", 
    "msgSnippet": "... Yes and no. It s your job as developer to test everything that can fail, but no more than that. To a large degree, your knowledge of the implementation and", 
    "msgId": 6532, 
    "topicId": 1696, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 62742148, 
    "messageBody": "<div id=\"ygrps-yiv-1070306847\"><blockquote><span title=\"ireply\">&gt; -----Original Message-----<br/>\n&gt; From: Steven Taschuk [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:staschuk@...\">staschuk@...</a>] <br/>\n&gt; Sent: Friday, December 20, 2002 12:15 AM<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\n&gt; Subject: Re: [junit] Re: Testing Private Methods<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Quoth Michael Silverstein:<br/>\n&gt;   [...]<br/>\n&gt; &gt; There&#39;s no need to use private methods to test this. <br/>\n&gt; Assuming the code <br/>\n&gt; &gt; paths for the two constructors converge at some point immediately <br/>\n&gt; &gt; after the input String is parsed, you can test the parsing code and <br/>\n&gt; &gt; the date processing code separately.<br/>\n&gt; <br/>\n&gt; Indeed.  But if I take the view that tests should test <br/>\n&gt; behaviour rather than code, then I have to consider &#39;partwise <br/>\n&gt; constructor fails for (2002,2,29)&#39; and &#39;parsing constructor <br/>\n&gt; fails for &quot;2002-02-29&quot;&#39; to be separate behaviours, both <br/>\n&gt; deserving to be tested.  That they almost certainly use the <br/>\n&gt; same code is an implementation detail with which the tests <br/>\n&gt; ought not to be concerned, and ought not to assume.<br/>\n<br/>\n </span></blockquote>Yes and no. It&#39;s your job as developer to test everything that can fail,<br/>\nbut no more than that. To a large degree, your knowledge of the<br/>\nimplementation and risks involved help drive that. The paragraph above<br/>\nis based on the assumption that you *know* that the code paths converge<br/>\nearly. If that were not the case you would have to proceed differently.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For example, if at some point in the future these <br/>\n&gt; constructors are changed to use separate implementations of <br/>\n&gt; the constraint checks for some reason, I&#39;d like the tests I <br/>\n&gt; write now to remain valid and complete.  If I assume the <br/>\n&gt; parsing constructor uses the same code as the partwise <br/>\n&gt; constructor, such a change silently makes the tests incomplete.<br/>\n<br/>\n </span></blockquote>For what its worth, this runs counter to XP. You are proposing doing<br/>\nextra work now in anticipation of a possible change in requirements or<br/>\nimplementation in the future. I&#39;ll leave suggesting whether this is a<br/>\nbad thing or not to those who like to debate these things. On the one<br/>\nhand there are valid reasons for not doing work in anticipation of<br/>\nrequirements or changes that may never happen. On the other hand, if you<br/>\nlater make a change that invalidates the overriding assumption that the<br/>\ncode paths converge, and don&#39;t correspondingly update the tests, then<br/>\nyou have, as you said, incomplete tests. On the other hand, regular use<br/>\nof a code coverage tool should uncover testing omissions for you<br/>\nautomatically.<br/>\n<br/>\nPersonally, I&#39;d implement it the easy way and put comments in the code<br/>\nto remind me to update the test if I ever went back and refactored the<br/>\nconstructor. On top of that, I&#39;d make it a habit to regularly run the<br/>\ntests under the aegis of a code coverage tool just as a sanity check for<br/>\nthe tests themselves.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   [...]<br/>\n&gt; &gt; I&#39;d also make a bunch of helper methods, such as one that takes a <br/>\n&gt; &gt; partwise date specification and an expected exception, and then <br/>\n&gt; &gt; instantiates using both constructors, asserting that both cause the <br/>\n&gt; &gt; expected exception to be thrown. That way you&#39;re not <br/>\n&gt; replicating a lot <br/>\n&gt; &gt; of code.<br/>\n&gt; <br/>\n&gt; Quite.  Unless I&#39;ve missed something, this is essentially the <br/>\n&gt; same solution as I proposed at the end of my last post.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Yup. I just didn&#39;t read down far enough in your post. What&#39;d they say<br/>\nabout great minds again? :-)</div>", 
    "prevInTime": 6531, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1040401842", 
    "canDelete": false, 
    "nextInTopic": 6533, 
    "prevInTopic": 6524, 
    "headers": {
        "inReplyToHeader": "PDIwMDIxMjE5MjIxNDU2LkEyMTIwQHRpYmlhLmFtb3RscGFhLmJvZ3VzPg==", 
        "messageIdInHeader": "PDAwMDMwMWMyYTg0NSQyM2MzODBhMCQ2NDAxYThjMEBsYXRpdHVkZTAxPg=="
    }
}