{
    "numMessagesInTopic": 1, 
    "nextInTime": 6610, 
    "senderId": "L7bkZ4B-PB6LCGzTYxqlgEW_EVTCi_4F5f9GNwT9XlPfDyzDzwFBHhALDGV67lT7F0qQPFwlDUQuDQWLgRu3U4DD5DVbJX-r0jmu", 
    "systemMessage": false, 
    "subject": "[OFF TOPIC] Urgent Requirements in Software Testing", 
    "from": "&quot;Venkat Reddy&quot; &lt;venkat@...&gt;", 
    "authorName": "Venkat Reddy", 
    "msgSnippet": "Hi All, We have some urgent requirements in Software Testing. Please find the details below. I request the interested people to get back to me or", 
    "msgId": 6609, 
    "profile": "venkatreddyc", 
    "topicId": 6609, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 119630103, 
    "messageBody": "<div id=\"ygrps-yiv-912620470\">Hi All,<br/>\n    We have some urgent requirements in Software Testing. Please find the details below. I request the interested people to get back to me or <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jobs@...\">jobs@...</a> with position applying for in the subject line. please note that all the positions are based at our Hyderabad office in INDIA.<br/>\n<br/>\nThanks and Regards,<br/>\nVenkat.<br/>\n============================<br/>\nVenkat Reddy Ch,<br/>\nYASU Technologies,<br/>\nHyderabad - 500 016.<br/>\n<br/>\nCall me at : +91-40-56535798<br/>\nMail me at : <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:venkat@...\">venkat@...</a><br/>\n==============================<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\nYasu Technologies <br/>\n <br/>\n<br/>\nYASU Technologies is a young, dynamic and fast-growing company that provides component products for J2EE and .Net applications. Our products are based on some of the most efficiently written algorithms and have been widely acclaimed for superior vision and usability. Our flagship product is QuickRules Business Rules Engine for J2EE and .Net applications. QuickRules boasts of 25 large enterprises and ISVs including companies such as Lufthansa, US Central Credit Union, Aon Insurance, largest healthcare cost management companies to name a few. QuickRules.Net is one of the first native .Net products from India. <br/>\n<br/>\n <br/>\n<br/>\nFor more information about our company please visit<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.yasutech.com\">http://www.yasutech.com</a><br/>\n<br/>\n <br/>\n<br/>\nYASU provides a high-growth, fun and fast-paced learning environment.<br/>\n<br/>\n <br/>\n<br/>\nWe are recruiting NOW! The following are the positions we are looking to fill in the immediate future. In case you meet our requirements, contact us at mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jobs@...\">jobs@...</a>. Please mention the post you are applying for in the Subject line.<br/>\n<br/>\n <br/>\n<br/>\nNote: <br/>\n<br/>\n1.    All the positions are based at our Hyderabad office in India<br/>\n<br/>\n2.    Please mention the Position in the subject of your mail<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n      Block Box Testing Engineer <br/>\n     Apply now<br/>\n     <br/>\n<br/>\n <br/>\n<br/>\nResponsibilities: <br/>\nYou will be responsible for Block box Testing of the Product and work closely with members of the development team. <br/>\n<br/>\n <br/>\n<br/>\nKey responsibilities include: <br/>\n<br/>\n  a.. Writing and executing comprehensive Test Plans. <br/>\n  b.. Preparation of testing documentation including Test Plans, Test Cases, automated Test Scripts, Checklists, Test Reports, Bug Reports, Test Strategy and other related documentation <br/>\n  c.. Ensure Block Box Testing of the System <br/>\n  d.. Identifying, Classifying and Reporting Bugs<br/>\n <br/>\n<br/>\nRequirements: <br/>\n<br/>\n  a.. The Profile should have 2+ years of exp. in Software Testing <br/>\n  b.. Prior experience in preparing Test Plans, test cases, Test reports and Test case execution, Bug reports (Must) <br/>\n  c.. Knowledge of testing methodologies including Functional, Regression, Stress, Load, Performance, System, Unit, GUI, etc. (Necessary) <br/>\n  d.. Knowledge of SDLC and Software Testing Life Cycle (Must)<br/>\n  a.. Prior Experience with Bug Tracking Systems (Must)<br/>\n  a.. Working knowledge of HTML (Must) <br/>\n  b.. Working knowledge on XML <br/>\n  c.. Domain Knowledge on Business Rules Engines (Advantage) <br/>\n  d.. Prior experience with Automation tools like WinRunner or Silk (Advantage) <br/>\n  e.. Prior Experience in Multi-tier apps and Product Development (Advantage) <br/>\n  f.. Prior Experience with OSs such as Linux, Sun Solaris (Advantage) <br/>\n  g.. Working knowledge of J2EE Tech or .NET Tech  (Advantage) <br/>\n  h.. Prior Experience with App Servers and Web Servers (Advantage) <br/>\n  i.. Prior Exp with Code Coverage (Advantage) <br/>\n <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n      White Box Testing Engineer - J2EE<br/>\n     Apply now<br/>\n     <br/>\n<br/>\n <br/>\n<br/>\nResponsibilities: <br/>\nYou will be responsible for White box Testing of the Product and work closely with members of the development team. <br/>\n<br/>\n <br/>\n<br/>\nKey responsibilities include: <br/>\n<br/>\n  a.. Writing and executing comprehensive test plans and assisting in code reviews <br/>\n  b.. Preparation of testing documentation including Test Plans, Test Cases, automated Test Scripts, Checklists, Test Reports, Bug Reports, Test Strategy and other related documentation <br/>\n  c.. Ensure Code Coverage of the System <br/>\n  d.. Identifying, Classifying and Reporting Bugs<br/>\n <br/>\n<br/>\nRequirements: <br/>\n<br/>\n  a.. The Profile should have 3+ years of exp in the Industry with at least two years in software development (Using J2EE Tech) and at least an year in white box testing on J2EE Applications <br/>\n  b.. Prior Experience with App Servers and Web Servers (Must) <br/>\n  c.. Knowledge of SDLC and Software Testing Life Cycle (Must) <br/>\n  d.. You must have solid OOP skills. <br/>\n  e.. Working knowledge on XML (Must) <br/>\n  f.. Prior experience in preparing Test Plans, test cases, Test reports and Test case execution, Bug reports (Necessary) <br/>\n  g.. Prior Exp with Code Coverage which includes Statement Coverage, Branch Coverage, Condition Coverage, Condition/Decision Coverage, Multiple Condition Coverage (Necessary) <br/>\n  h.. Knowledge of testing methodologies including Functional, Acceptance, Regression, Stress, System, Unit, GUI, Validation, Verification, etc. (Advantage) <br/>\n  i.. Working knowledge of HTML (Must) <br/>\n  j.. Working knowledge of multi-tier apps and Product Development (Advantage) <br/>\n  k.. Prior Experience with Operating Systems such as Linux, Sun Solaris (Advantage) <br/>\n  l.. Working knowledge of J2EE components like JMS, Web Services (Advantage) <br/>\n  m.. Domain Knowledge on Business Rules Engines (Advantage)<br/>\n  a.. Your exposure to design tools like Rational Rose etc. will be a big plus.<br/>\n <br/>\n<br/>\n  <br/>\n<br/>\n      White Box Testing Engineer (. NET)<br/>\n     Apply now<br/>\n     <br/>\n<br/>\nResponsibilities: <br/>\nYou will be responsible for White box Testing of the Product and work closely with members of the development team. <br/>\n<br/>\n <br/>\n<br/>\nKey responsibilities include: <br/>\n<br/>\n  a.. Writing and executing comprehensive test plans and assisting in code reviews <br/>\n  b.. Preparation of testing documentation including Test Plans, Test Cases, automated Test Scripts, Checklists, Test Reports, Bug Reports, Test Strategy and other related documentation <br/>\n  c.. Ensure Code Coverage of the System <br/>\n  d.. Identifying, Classifying and Reporting Bugs<br/>\n <br/>\n<br/>\nRequirements: <br/>\n<br/>\n  a.. The Profile should have 3+ years of exp in the Industry with at least two years in software development (Using Microsoft Technologies) and at least an year in white box testing on Microsoft Applications <br/>\n  b.. You must have solid OOP skills. <br/>\n  c.. Working knowledge on XML (Must) <br/>\n  d.. Knowledge of SDLC and Software Testing Life Cycle (Necessary) <br/>\n  e.. Prior experience in preparing Test Plans, test cases, Test reports and Test case execution, Bug reports (Necessary) <br/>\n  f.. Prior Exp with Code Coverage which includes Statement Coverage, Branch Coverage, Condition Coverage, Condition/Decision Coverage, Multiple Condition Coverage (Necessary) <br/>\n  g.. Knowledge of testing methodologies including Functional, Acceptance, Regression, Stress, System, Unit, GUI, Validation, Verification, etc. (Advantage) <br/>\n  h.. Working knowledge of HTML (Must) <br/>\n  i.. Working knowledge of webserver/appserver technology. <br/>\n  j.. Working knowledge of RDMBS (Multiple Databases Advantage) <br/>\n  k.. Working knowledge of multi-tier apps and Product Development (Advantage) <br/>\n  l.. Working knowledge of .NET technology (VS.NET, C#, VB.NET, ASP.NET) (Advantage) <br/>\n  m.. Domain Knowledge on Business Rules Engines (Advantage)<br/>\n  a.. Your exposure to design tools like Rational Rose etc. will be a big plus.<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 6608, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1041862869", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDAwOGEwMWMyYjU4ZSRkYzAyN2ZkMCQzYzA5YThjMEBWRU5LQVRSRUREWT4="
    }
}