{
    "numMessagesInTopic": 3, 
    "nextInTime": 6624, 
    "senderId": "QLqh4ZNTSWyjgvn42P_NWtNFQ63uG2b0PUkEc3XGZxq3dZsm9yJ5s_bfqS9gytVl8IX-KNT2RE4jYL1cpzsY3nFgRwwHG602KzL_H_2Yf9KnVI8ThmDokbD9QTsCbbg", 
    "systemMessage": false, 
    "subject": "Separate Test Cases within xml files", 
    "from": "&quot;bengarbers &lt;garbers@...&gt;&quot; &lt;garbers@...&gt;", 
    "authorName": "bengarbers &lt;garbers@charter.net&gt;", 
    "msgSnippet": "Junit Group, This is more of a design question.  I was inherited to take over testing a client / server application.  The test cases were all written in xml (a", 
    "msgId": 6623, 
    "profile": "bengarbers", 
    "topicId": 6623, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 134713568, 
    "messageBody": "<div id=\"ygrps-yiv-1962623506\">Junit Group,<br/>\n<br/>\n   This is more of a design question.  I was inherited to take over <br/>\ntesting a client / server application.  The test cases were all <br/>\nwritten in xml (a bunch of xml defined messages that the client would <br/>\nsend to the server) where a java application would read in each test <br/>\ncase from the xml file.  It would then send the xml message to the <br/>\nserver and the server would then process that xml messages and send <br/>\nthem back another xml message.<br/>\n<br/>\n  I would like to integrate this into Junit&#39;s framework but the <br/>\nproblem I am having is that each test case has 4 xml messages that it <br/>\nsends to the server.  I would like to use JUnits TestCase method and <br/>\nread each xml file one by one.  The problem with this is that it <br/>\nwould be one method that would be reading each xml message in from <br/>\nthe file and then verifying it.  <br/>\n   <br/>\n   After looking at JUnit&#39;s framework they treat each method as a <br/>\ntest case within a class that extends TestCase.  My question is how <br/>\nwould you design this so that I could treat each file as testcase 1 <br/>\nand each message that gets read in as testcase a, b, c, etc....  I <br/>\nwould like to be able to use Junit&#39;s swing TestRunner to run all <br/>\nthese xml file test cases then.  Any help would be greatly <br/>\nappreciated.<br/>\n<br/>\nben</div>", 
    "prevInTime": 6622, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1042058203", 
    "canDelete": false, 
    "nextInTopic": 6625, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGF2aTI0cit2ODJrQGVHcm91cHMuY29tPg=="
    }
}