{
    "numMessagesInTopic": 3, 
    "nextInTime": 6627, 
    "senderId": "1_4_NuNVZJhR7HmXZUahTaKIZoWiMhIpF-PI-IeTXOQBiewzlMmgLTyHukUwUYFGNkYRedmfBXaG5JPAsCRXADZ3dR6s2P-J_Q5OiA", 
    "systemMessage": false, 
    "subject": "Re: [junit] Separate Test Cases within xml files", 
    "from": "&quot;Brian R. Robinson&quot; &lt;br524@...&gt;", 
    "authorName": "Brian R. Robinson", 
    "msgSnippet": "You might consider an extension to the TestCase per file that you need to test.  So for the example you mentioned, you would extend TestCase with your own", 
    "msgId": 6626, 
    "profile": "br524", 
    "topicId": 6623, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 102220977, 
    "messageBody": "<div id=\"ygrps-yiv-1831880198\">You might consider an extension to the TestCase per file that you need<br/>\nto test.  So for the example you mentioned, you would extend TestCase<br/>\nwith your own class, and it would have four test methods in it, each of<br/>\nwhich would assert that the expected response is received.  The<br/>\ndownside here is that you will most likely end of with very many test<br/>\nclasses, and not many actual tests per TestCase.<br/>\n<br/>\nIf you want to have all of your tests within one class that extends<br/>\nTestCase, you have to make a choice.  If one file has four messages,<br/>\nyou can consider the verification of each of the four responses a<br/>\nseperate test method.  Or you could just make one test method per file<br/>\nthat you read in, regardless of how many messages are in it.  If you<br/>\nchoose this approach, you&#39;ll just have several assertions in your test<br/>\nmethod.<br/>\n<br/>\n-Brian<br/>\n<br/>\n--- &quot;bengarbers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:garbers@...\">garbers@...</a>&gt;&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:garbers@...\">garbers@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Junit Group,<br/>\n&gt; <br/>\n&gt;    This is more of a design question.  I was inherited to take over <br/>\n&gt; testing a client / server application.  The test cases were all <br/>\n&gt; written in xml (a bunch of xml defined messages that the client would<br/>\n&gt; <br/>\n&gt; send to the server) where a java application would read in each test <br/>\n&gt; case from the xml file.  It would then send the xml message to the <br/>\n&gt; server and the server would then process that xml messages and send <br/>\n&gt; them back another xml message.<br/>\n&gt; <br/>\n&gt;   I would like to integrate this into Junit&#39;s framework but the <br/>\n&gt; problem I am having is that each test case has 4 xml messages that it<br/>\n&gt; <br/>\n&gt; sends to the server.  I would like to use JUnits TestCase method and <br/>\n&gt; read each xml file one by one.  The problem with this is that it <br/>\n&gt; would be one method that would be reading each xml message in from <br/>\n&gt; the file and then verifying it.  <br/>\n&gt;    <br/>\n&gt;    After looking at JUnit&#39;s framework they treat each method as a <br/>\n&gt; test case within a class that extends TestCase.  My question is how <br/>\n&gt; would you design this so that I could treat each file as testcase 1 <br/>\n&gt; and each message that gets read in as testcase a, b, c, etc....  I <br/>\n&gt; would like to be able to use Junit&#39;s swing TestRunner to run all <br/>\n&gt; these xml file test cases then.  Any help would be greatly <br/>\n&gt; appreciated.<br/>\n&gt; <br/>\n&gt; ben<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>__________________________________________________<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail Plus - Powerful. Affordable. Sign up now.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mailplus.yahoo.com\">http://mailplus.yahoo.com</a></div>", 
    "prevInTime": 6625, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1042062172", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 6625, 
    "headers": {
        "inReplyToHeader": "PGF2aTI0cit2ODJrQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDIwMDMwMTA4MjE0MjUyLjk5OTAzLnFtYWlsQHdlYjExNTA4Lm1haWwueWFob28uY29tPg=="
    }
}