{
    "numMessagesInTopic": 11, 
    "nextInTime": 6706, 
    "senderId": "X34MgFsbniAtDnDy6mZw3EFQqpkhlt65Z4YuBO68o8MOliov_-0f56F-E8qbFL_r1La5yu3ERNnE0W-Z77drM82aFsfRGcjrHCUksh2ASvAZnKHQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Test first? or Stub first?", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbr@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "So said  steffen.gemkow@objectfab.de  on  2003-01-22 ...  If I understand you correctly, you re trying to make the tests better documentation for the", 
    "msgId": 6705, 
    "rawEmail": "Return-Path: &lt;jbr@...&gt;\r\nX-Sender: jbr@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_3_0); 23 Jan 2003 21:48:55 -0000\r\nReceived: (qmail 8988 invoked from network); 23 Jan 2003 21:48:55 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m6.grp.scd.yahoo.com with QMQP; 23 Jan 2003 21:48:55 -0000\r\nReceived: from unknown (HELO fep04-mail.bloor.is.net.cable.rogers.com) (66.185.86.74)\n  by mta3.grp.scd.yahoo.com with SMTP; 23 Jan 2003 21:48:55 -0000\r\nReceived: from quincy ([24.42.96.247])\n          by fep04-mail.bloor.is.net.cable.rogers.com\n          (InterMail vM.5.01.05.06 201-253-122-126-106-20020509) with ESMTP\n          id &lt;20030123214854.HVKE4382.fep04-mail.bloor.is.net.cable.rogers.com@quincy&gt;\n          for &lt;junit@yahoogroups.com&gt;; Thu, 23 Jan 2003 16:48:54 -0500\r\nMessage-ID: &lt;200301231648530003.006B00FB@...&gt;\r\nIn-Reply-To: &lt;3E2E7364.26964.350ADC@localhost&gt;\r\nReferences: &lt;3E2E7364.26964.350ADC@localhost&gt;\r\nX-Mailer: Calypso Version 3.30.00.00 (4)\r\nDate: Thu, 23 Jan 2003 16:48:53 -0500\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] Re: Test first? or Stub first?\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;\r\nX-Authentication-Info: Submitted using SMTP AUTH LOGIN at fep04-mail.bloor.is.net.cable.rogers.com from [24.42.96.247] using ID &lt;srainsberger5790@...&gt; at Thu, 23 Jan 2003 16:48:53 -0500\r\nFrom: &quot;J. B. Rainsberger&quot; &lt;jbr@...&gt;\r\nReply-To: jbr@...\r\nX-Yahoo-Group-Post: member; u=89240252\r\nX-Yahoo-Profile: nails762\r\n\r\nSo said  steffen.gemkow@...  on  2003-01-22\n--------------------\n\n&gt;JBR,\n&gt;\n&gt;&gt;    From: &quot;J. B. Rainsberger&quot; &lt;jbr@...&gt;\n&gt;\n&gt;&gt; I&#39;m not sure why writing the test before the stub provides more\n&gt;&gt; documentation than writing the stub before the test.\n&gt;\n&gt;All this is about &quot;tests documenting the intentions behind the code&quot;.\n&gt;What I ment by &quot;documenting aspect&quot; does not depend on which \n&gt;comes first, but if tests and app are in sync. To keep them in sync\n&gt;is much more easy, if one is the base for generating the other.\n&lt;snip /&gt;\n\nIf I understand you correctly, you&#39;re trying to make the tests better\ndocumentation for the behavior of the system. Your concern appears to\nbe that as we refactor the system, the tests become less of an\nindicator of the structure of the application, so that finding the\ntests for class X becomes difficult.\n\nImmediately, I react by saying, &quot;Don&#39;t look for the tests for class X;\nlook for the tests for behavior Y. Those tests should remain easy to\nfind, since the name of the behavior doesn&#39;t necessarily change when\nthe structure of the code changes.&quot; Without a specific example, I can&#39;t\nsay more.\n\nWhen we refactor the code, we often need to change the corresponding\ntests. We should take as much care in refactoring the tests as the\ncode, so that it remains easy to find the tests.\n\n&gt;Imagine you want to add some new feature to an application \n&gt;with this kind of tests in three years from now. You need to \n&gt;modify some code and maybe you need to use some \n&gt;existing code too. Then you want to understand, what the \n&gt;intention behind those portions of code was. You want to \n&gt;understand the methods you are about to modify/use.\n&gt;Yes, you can search the tests for uses of those method.\n&gt;\n&gt;When I want to get an idea, what the method &quot;xyz&quot; is \n&gt;supposed to do, I prefer to look at &quot;testXyz&quot;. That is what\n&gt;I ment with the &quot;documenting aspect&quot; of tests that follow\n&gt;the structure of the application.\n\nI&#39;ll admit that I don&#39;t have as much experience in that regard -- I\nhaven&#39;t worked on a project where the tests have been difficult to find\nbecause the code has been refactored away from the tests, even though\nthe tests still run. For Programmer Tests, I can&#39;t imagine that that&#39;s\neven possible. For Customer Tests, I would never expect to find a CT by\nlooking for a method name; I would look for the name of a use case or\ntransaction script or feature.\n\n&gt;JUnitDoclet allows re-generating, so it&#39;s not much work \n&gt;to keep tests and app in sync.\n\nRegenerating what? Does it regenerate test stubs? Do I need to\nreimplement my test?!\n\n&gt;&gt; Also, if you haven&#39;t written the test, then how can you be sure that\n&gt;&gt; the stub:\n&gt;&gt; \n&gt;&gt; 1. ...has the proper signature?\n&gt;&gt; 2. ...is named well?\n&gt;&gt; 3. ...should be class- or instance-level?\n&gt;&gt; 4. ...is written on the appropriate object?\n&gt;\n&gt;At that point I&#39;m not sure either. But with the skeleton of \n&gt;the application method in place, one can use the full power \n&gt;of the IDE. I&#39;m using JUnitDoclet together with IDEA.\n&lt;snip /&gt;\n\nI admit that since the IDE makes it easy to &quot;fix mistakes&quot;, we have the\nfreedom to make more mistakes and not pay as much of a price; but\nstill, nothing beats thinking about it first.\n\nI would have to try writing the stub, then the test, then making it\npass, in order to comment further. Since I&#39;m not working on any big\nprojects these days, I&#39;m not sure I&#39;ll learn enough to make the\nexperiment worthwhile. :)\n\n&gt;&gt; Generally speaking, you don&#39;t really know these things until you\nwrite\n&gt;&gt; test code, which is really just sample client code, look at it,\n&gt;&gt; evaluate it and move on. In general, it is when one sees it &quot;in\nprint&quot;\n&gt;&gt; than one really looks at it carefully. Writing the test first\n&gt;&gt; guarantees this, while writing the stub first does not.\n&gt;\n&gt;I consider the stub to be flexible when implementing the test. \n&gt;There is not much of a difference, except we are using \n&gt;different supporting features of the IDE.\n\nYou&#39;re right. You&#39;re willing to guess as to the stub&#39;s signature and\nchange it when you guess wrong. I prefer not to guess, but rather to\nlet the test tell me. There isn&#39;t much difference when a good IDE is\nthere to support you.\n\nI suppose that the more you guess wrong, the more information that\ngives you -- perhaps you DON&#39;T understand the task you&#39;re trying to\nimplement. Back to the CRC cards...\n\n&gt;&gt; I don&#39;t use JUnitDoclet, so I can&#39;t comment on how using it changes\nthe\n&gt;&gt; rules of the game. If it&#39;s easy to set up (less than 1 hour), then I\n&gt;&gt; may start using it, just for the experience.\n&gt;\n&gt;I&#39;d be glad to help, if there would be a problem. \n&gt;If you want to look at JUnitDoclet before you install it:\n&gt;\n&gt;  http://www.junitdoclet.org/demo.html\n\nI&#39;ll check it out...\n\n&gt;&gt; I would like you to expand on this: what &quot;documenting aspect&quot; do you\n&gt;&gt; mean? and why does writing the stub first enable this feature and\n&gt;&gt; writing the test first not enable this feature?\n&gt;\n&gt;I hope, my lines in the beginning of this email clarified, \n&gt;what I ment. Sorry, if I wasn&#39;t more precise in former emails.\n\nIt did. Thanks.\n\n\nJ. B. Rainsberger,\nPresident, Diaspar Software Services\nLet&#39;s write software that people understand.\nhttp://www.diasparsoftware.com/\ntelephone: +1 416 791-8603\nAll correspondence (c) 2002 Diaspar Software Services.\nIf you want to use it, just ask; don&#39;t steal.\n\n\n", 
    "profile": "nails762", 
    "topicId": 6697, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 89240252, 
    "prevInTime": 6704, 
    "contentTrasformed": false, 
    "postDate": "1043358533", 
    "canDelete": false, 
    "nextInTopic": 6706, 
    "prevInTopic": 6702, 
    "headers": {
        "inReplyToHeader": "PDNFMkU3MzY0LjI2OTY0LjM1MEFEQ0Bsb2NhbGhvc3Q+", 
        "messageIdInHeader": "PDIwMDMwMTIzMTY0ODUzMDAwMy4wMDZCMDBGQkBzbXRwLnltLnBodWIubmV0LmNhYmxlLnJvZ2Vycy5jb20+", 
        "referencesHeader": "PDNFMkU3MzY0LjI2OTY0LjM1MEFEQ0Bsb2NhbGhvc3Q+"
    }
}