{
    "numMessagesInTopic": 7, 
    "nextInTime": 6742, 
    "senderId": "2l_3lkWtlLy_8qtP3vh0HZOGKXgb4CiBMB1YysLqIq0Nc0iA6t7b-mc2QcLsw3xR5uK5qlgWSUBFpfu49qX-A8qQAwFLXw", 
    "systemMessage": false, 
    "subject": "Re: [junit] Tests naming", 
    "from": "Kirill Maximov &lt;kir@...&gt;", 
    "authorName": "Kirill Maximov", 
    "msgSnippet": "On  0, J. B. Rainsberger  wrote: Thank you for the feedback! Please see my comments below. ... In my experience, there are several", 
    "msgId": 6741, 
    "rawEmail": "Return-Path: &lt;kir@...&gt;\r\nX-Sender: kir@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_3_0); 26 Jan 2003 10:00:31 -0000\r\nReceived: (qmail 27976 invoked from network); 26 Jan 2003 10:00:30 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m3.grp.scd.yahoo.com with QMQP; 26 Jan 2003 10:00:30 -0000\r\nReceived: from unknown (HELO queen.actimind.com) (62.152.93.3)\n  by mta3.grp.scd.yahoo.com with SMTP; 26 Jan 2003 10:00:30 -0000\r\nReceived: (from kir@localhost)\n\tby queen.actimind.com (8.9.3/8.9.3) id NAA19111\n\tfor junit@yahoogroups.com; Sun, 26 Jan 2003 13:00:28 +0300\r\nDate: Sun, 26 Jan 2003 13:00:28 +0300\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] Tests naming\r\nMessage-ID: &lt;20030126100028.GA6278@...&gt;\r\nMail-Followup-To: junit@yahoogroups.com\r\nReferences: &lt;20030125194902.GA12329@...&gt; &lt;200301251504490331.0110A0B3@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=koi8-r\r\nContent-Disposition: inline\r\nIn-Reply-To: &lt;200301251504490331.0110A0B3@...&gt;\r\nUser-Agent: Mutt/1.4i\r\nFrom: Kirill Maximov &lt;kir@...&gt;\r\nX-Yahoo-Group-Post: member; u=85102992\r\nX-Yahoo-Profile: maxkir1\r\n\r\nOn  0, &quot;J. B. Rainsberger&quot; &lt;jbr@...&gt; wrote:\n\n  Thank you for the feedback! Please see my comments below.\n\n&gt; &gt;As far as I learned, usually we shall test behaviour and design, \n&gt; &gt;not specific classes and methods. This allows us to keep tests \n&gt; &gt;task-oriented and not implementation-oriented.\n&gt; &gt;Considering this, I see the following possible decisions regarding\n&gt; &gt;tests organization: \n&gt; &gt;\n&gt; &gt;1. For Functional tests:\n&gt; &gt;    - all tests for a use case (and, possibly, alternative flows) are \n&gt; &gt;    placed into a single package with an appropriate name. \n&gt; \n&gt; Generally there is one test per use case scenario (different flow\n&gt; through the use case). Choosing to write more or fewer tests should be\n&gt; done thoughtfully.\n\n  In my experience, there are several alternative flows for a ordinary\n  use case. And I see reasonable to test at least two of them: basic\n  flow and error flow. What do you think?\n\n&gt; \n&gt; &gt;    - each test scenario is placed into single class with appropriate\n&gt; name.\n&gt; \n&gt; Each use case scenario is a test. Test classes should almost always\n&gt; evolve based around a fixture, not some other arbitrary organization\n&gt; mechanism. A given use case may be implemented as its own Customer Test\n&gt; class, but it is usually better to let the organization of tests into\n&gt; TestCase implementations depend on shared fixture requirements.\n\n  But we can share fixtures using inheritance as well. I have two points here:\n\n   - for a complicated test case it may be better to keep it in a separate class.\n   - It is easier to get full list of existing functional tests if we put\n     each test case into a single class. Getting the list is quite usual\n     task requested by QA department or customer (or I&#39;m wrong here?)\n     \n\n&gt; \n&gt; &gt;2. For Unit tests:\n&gt; &gt;    - test package shall be the same as for the production code, \n&gt; &gt;    but it is better to use a different source tree.\n&gt; &gt;    - for simple classes (such as value objects) it is OK to name\n&gt; &gt;    test classes after the name of the class under test \n&gt; &gt;    (like UTestFooBar or FooBarTest). Names of test methods,\n&gt; &gt;    in its turn, may include the name of the tested method.\n&gt; &gt;    - for complex classes, which require a complex fixture to be set,\n&gt; &gt;    test case class shall be named using fixture description. \n&gt; &gt;    (The issue was discussed previously on this list).\n&gt; &gt;    Test method name in this case shall describe the tested behaviour.\n&gt; \n&gt; The last point is the general case, and the previous points are special\n&gt; cases when the tests (not the code under test) are very simple.\n\n  Agreed. The issue here is to fugure out proper fixture class when you \n  want to add a new test (for instance, when you find a bug). The task \n  may become more complicated if you never seen the code before and there\n  are nobody to ask (bad things happen). I see two possible solutions:\n\n   - Use IDE features to find usages of tested code (if you have such IDE)\n   - Make a error in the production code and see which test breaks.\n\n&gt; \n&gt; &gt;3. For Integration Tests:\n&gt; &gt;    - I suggest, names of Integration tests must differ from Unit\n&gt; tests.\n&gt; &gt;    Usually, integration tests run longer, and consequently, more\n&gt; seldom. \n&gt; &gt;    That&#39;s why it is convinient to name them differently. One may name\n&gt; \n&gt; &gt;    unit tests using UTest prefix, anf Integration tests using ITest\n&gt; &gt;prefix.\n&gt; \n&gt; On a past project, we used tag interfaces to distinguish Programmer\n&gt; Tests from Customer Tests. This made it easy to write a TestRunner that\n&gt; picked one or the other or both when building a test suite. You may\n&gt; find this technique useful.\n\n  I saw an article where static variable with specific value was used \n  to mark a test and TestSuite class used reflection to include only \n  tests with specific value of the variable. It is quite close to your\n  approach.\n\n  What for me, I use ant to build/run my test suites. That&#39;s why I \n  suggest class naming approach.\n\n&gt; \n&gt; Also, place the different kinds of tests in different packages in order\n&gt; to reduce the number of naming collisions.\n\n  Sorry, I don&#39;t see your point clearly. Are you talking about unit tests,\n  functional tests?\n\n&gt; \n&gt; I have to say that your list of points is excellent and should be\n&gt; turned into a short article on the subject.\n\n  Thank you very much. Actually, I thought about it and I&#39;ll possibly\n  try to write one.\n\n  With best regards,\n \n\n-- \nKirill Maximov aka KIR\nkir@... | http://www.maxkir.com/\nSt.Petersburg, Russia\n\n", 
    "profile": "maxkir1", 
    "topicId": 6735, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 85102992, 
    "prevInTime": 6740, 
    "contentTrasformed": false, 
    "postDate": "1043575228", 
    "canDelete": false, 
    "nextInTopic": 6745, 
    "prevInTopic": 6736, 
    "headers": {
        "inReplyToHeader": "PDIwMDMwMTI1MTUwNDQ5MDMzMS4wMTEwQTBCM0BzbXRwLnltLnBodWIubmV0LmNhYmxlLnJvZ2Vycy5jb20+", 
        "messageIdInHeader": "PDIwMDMwMTI2MTAwMDI4LkdBNjI3OEBxdWVlbi5hY3RpbWluZC5jb20+", 
        "referencesHeader": "PDIwMDMwMTI1MTk0OTAyLkdBMTIzMjlAcXVlZW4uYWN0aW1pbmQuY29tPiA8MjAwMzAxMjUxNTA0NDkwMzMxLjAxMTBBMEIzQHNtdHAueW0ucGh1Yi5uZXQuY2FibGUucm9nZXJzLmNvbT4="
    }
}