{
    "numMessagesInTopic": 7, 
    "nextInTime": 6754, 
    "senderId": "fNatD5sd_SVgcGE9CSuf3jjdbBa-j4LVbSCX9Jyb-GPMB-_i8gX8mUsMjDYV-VNG8fEOPAWEDLzUjfAep5MtiEChyan-3w", 
    "systemMessage": false, 
    "subject": "Re: [junit] Tests naming", 
    "from": "Kirill Maximov &lt;kir@...&gt;", 
    "authorName": "Kirill Maximov", 
    "msgSnippet": "... OK, now I see what you mean. Sorry, actually I ve read your text not as test case per user case scenario but test case per use case . Now, I still", 
    "msgId": 6753, 
    "rawEmail": "Return-Path: &lt;kir@...&gt;\r\nX-Sender: kir@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_3_0); 27 Jan 2003 05:01:20 -0000\r\nReceived: (qmail 49208 invoked from network); 27 Jan 2003 05:01:20 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m5.grp.scd.yahoo.com with QMQP; 27 Jan 2003 05:01:20 -0000\r\nReceived: from unknown (HELO queen.actimind.com) (62.152.93.3)\n  by mta1.grp.scd.yahoo.com with SMTP; 27 Jan 2003 05:01:19 -0000\r\nReceived: (from kir@localhost)\n\tby queen.actimind.com (8.9.3/8.9.3) id IAA22319\n\tfor junit@yahoogroups.com; Mon, 27 Jan 2003 08:01:19 +0300\r\nDate: Mon, 27 Jan 2003 08:01:19 +0300\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] Tests naming\r\nMessage-ID: &lt;20030127050119.GC15025@...&gt;\r\nMail-Followup-To: junit@yahoogroups.com\r\nReferences: &lt;20030125194902.GA12329@...&gt; &lt;200301251504490331.0110A0B3@...&gt; &lt;20030126100028.GA6278@...&gt; &lt;200301261502360219.007DA35B@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=koi8-r\r\nContent-Disposition: inline\r\nIn-Reply-To: &lt;200301261502360219.007DA35B@...&gt;\r\nUser-Agent: Mutt/1.4i\r\nFrom: Kirill Maximov &lt;kir@...&gt;\r\nX-Yahoo-Group-Post: member; u=85102992\r\nX-Yahoo-Profile: maxkir1\r\n\r\nOn  0, &quot;J. B. Rainsberger&quot; &lt;jbr@...&gt; wrote:\n&gt; Kirill!\n&gt; \n&gt; &lt;snip /&gt;\n&gt; &gt;&gt;&gt; Generally there is one test per use case scenario (different flow\n&gt; &gt;&gt;&gt; through the use case). Choosing to write more or fewer tests should\n&gt; be\n&gt; &gt;&gt;&gt; done thoughtfully.\n&gt; &gt;&gt;\n&gt; &gt;&gt; In my experience, there are several alternative flows for a ordinary\n&gt; &gt;&gt; use case. And I see reasonable to test at least two of them: basic\n&gt; &gt;&gt; flow and error flow. What do you think?\n&gt; \n&gt; Usually there are three kinds of flows:\n&gt; \n&gt; 1. The usual flow\n&gt; 2. Alternate usual flows\n&gt; 3. Error flows\n&gt; \n&gt; I use the term &quot;use case scenario&quot; to mean a path through a use case\n&gt; with many flows. Each &quot;flow&quot; is a use case scenario. I believe that\n&gt; this is the standard UML term. When I say &quot;use case scenario&quot;, it is\n&gt; now clear what I mean.\n&gt; \n&gt; Generally, the goal is to write one Customer Test per use case\n&gt; scenario. There may even be additional tests, depending on the number\n&gt; of different representative data points along the way.\n&gt; \n&gt; I prioritize as follows:\n&gt; \n&gt; 1. Usual flow test\n&gt; 2. Fatal error flow tests\n&gt; 3. Normal alternative flow tests\n&gt; 4. Non-fatal error flow tests\n&gt; 5. Others\n&gt; \n&gt; If there are, for example, 20 scenarios for a use case, then I need to\n&gt; sit down and decide whether the use case is too big.\n\n  OK, now I see what you mean. Sorry, actually I&#39;ve read your text not \n  as &quot;test case per user case scenario&quot; but &quot;test case per use case&quot;. \n  Now, I still suggest having a package per use case and test class per\n  use case scenario.\n\n  Now about &quot;too big&quot; part. I&#39;m not sure if you can do anything with use \n  case size itself. You can implement scenarios one-by-one, in order you \n  suggested, and make each flow a separate story. But all of them \n  still belong to the same use case! From this point of view, it is right \n  to have Customer test per scenario.\n  \n&gt; \n&gt;  \n&gt; &gt;&gt;&gt; &gt; - each test scenario is placed into single class with appropriate\n&gt; &gt;&gt;&gt; name.\n&gt; &gt;&gt;&gt; \n&gt; &gt;&gt;&gt; Each use case scenario is a test. Test classes should almost always\n&gt; &gt;&gt;&gt; evolve based around a fixture, not some other arbitrary\n&gt; organization\n&gt; &gt;&gt;&gt; mechanism. A given use case may be implemented as its own Customer\n&gt; Test\n&gt; &gt;&gt;&gt; class, but it is usually better to let the organization of tests\n&gt; into\n&gt; &gt;&gt;&gt; TestCase implementations depend on shared fixture requirements.\n&gt; &gt;&gt;\n&gt; &gt;&gt; But we can share fixtures using inheritance as well. I have two\n&gt; points\n&gt; &gt;&gt;here:\n&gt; &gt;&gt;\n&gt; &gt;&gt; - for a complicated test case it may be better to keep it in a\n&gt; separate\n&gt; &gt;&gt;class.\n&gt; &gt;&gt; - It is easier to get full list of existing functional tests if we\n&gt; put\n&gt; &gt;&gt; each test case into a single class. Getting the list is quite usual\n&gt; &gt;&gt; task requested by QA department or customer (or I&#39;m wrong here?)\n&gt; \n&gt; Certainly this is a good idea. There must be a way to present the list\n&gt; of currently-implemented Customer Tests to groups like QA. Dividing the\n&gt; tests among classes is one way to achieve this. Some kind of xDoclet\n&gt; thing would be another. (Step in, Mr. Gemkow, to provide some\n&gt; information here.)\n\n  I&#39;ll try to look at it. But, as far as I expect, this tool separates\n  the test description from code. And I envision the situation when \n  &quot;copy class&quot; or &quot;copy method&quot; feature will be used without updating\n  the description. To have incorrect test/class name is quite more\n  noticable, than having incorrect javadoc and such.\n\n&gt; \n&gt; &gt;&gt;&gt; &gt;2. For Unit tests:\n&gt; &gt;&gt;&gt; &gt; - test package shall be the same as for the production code, \n&gt; &gt;&gt;&gt; &gt; but it is better to use a different source tree.\n&gt; &gt;&gt;&gt; &gt; - for simple classes (such as value objects) it is OK to name\n&gt; &gt;&gt;&gt; &gt; test classes after the name of the class under test \n&gt; &gt;&gt;&gt; &gt; (like UTestFooBar or FooBarTest). Names of test methods,\n&gt; &gt;&gt;&gt; &gt; in its turn, may include the name of the tested method.\n&gt; &gt;&gt;&gt; &gt; - for complex classes, which require a complex fixture to be set,\n&gt; &gt;&gt;&gt; &gt; test case class shall be named using fixture description. \n&gt; &gt;&gt;&gt; &gt; (The issue was discussed previously on this list).\n&gt; &gt;&gt;&gt; &gt; Test method name in this case shall describe the tested\n&gt; behaviour.\n&gt; &gt;&gt;&gt; \n&gt; &gt;&gt;&gt; The last point is the general case, and the previous points are\n&gt; special\n&gt; &gt;&gt;&gt; cases when the tests (not the code under test) are very simple.\n&gt; &gt;&gt;\n&gt; &gt;&gt; Agreed. The issue here is to fugure out proper fixture class when\n&gt; you \n&gt; &gt;&gt; want to add a new test (for instance, when you find a bug). The task\n&gt; \n&gt; &gt;&gt; may become more complicated if you never seen the code before and\n&gt; there\n&gt; &gt;&gt; are nobody to ask (bad things happen). I see two possible solutions:\n&gt; &gt;&gt;\n&gt; &gt;&gt; - Use IDE features to find usages of tested code (if you have such\n&gt; IDE)\n&gt; &gt;&gt; - Make a error in the production code and see which test breaks.\n&gt; \n&gt; If you cannot figure out where to add the new test, then you can find\n&gt; the test that breaks by breaking the production code; however, that\n&gt; assumes that you know what production code you need to change in order\n&gt; to add the feature. This may not be the case, and certainly is not\n&gt; always (often?) the case when test-driving the new feature.\n&gt; \n&gt; If I am in that situation and I cannot find a test fixture to match my\n&gt; current needs, then I build a new one and let the team refactor it as\n&gt; they come across it. Eventually, someone will feel the pain of not\n&gt; having the right test fixture and will find the problem.\n\n  Good point. But it should be a spirit in the team to fix tests of\n  another team member as soon as the see duplication in the test code.\n\n&gt; \n&gt; &gt;&gt;&gt; &gt;3. For Integration Tests:\n&gt; &gt;&gt;&gt; &gt; - I suggest, names of Integration tests must differ from Unit\n&gt; &gt;&gt;&gt; tests.\n&gt; &gt;&gt;&gt; &gt; Usually, integration tests run longer, and consequently, more\n&gt; &gt;&gt;&gt; seldom. \n&gt; &gt;&gt;&gt; &gt; That&#39;s why it is convinient to name them differently. One may\n&gt; name\n&gt; &gt;&gt;&gt; \n&gt; &gt;&gt;&gt; &gt; unit tests using UTest prefix, anf Integration tests using ITest\n&gt; &gt;&gt;&gt; &gt;prefix.\n&gt; &gt;&gt;&gt; \n&gt; &gt;&gt;&gt; On a past project, we used tag interfaces to distinguish Programmer\n&gt; &gt;&gt;&gt; Tests from Customer Tests. This made it easy to write a TestRunner\n&gt; that\n&gt; &gt;&gt;&gt; picked one or the other or both when building a test suite. You may\n&gt; &gt;&gt;&gt; find this technique useful.\n&gt; &gt;&gt;\n&gt; &gt;&gt; I saw an article where static variable with specific value was used \n&gt; &gt;&gt; to mark a test and TestSuite class used reflection to include only \n&gt; &gt;&gt; tests with specific value of the variable. It is quite close to your\n&gt; &gt;&gt; approach.\n&gt; &gt;&gt;\n&gt; &gt;&gt; What for me, I use ant to build/run my test suites. That&#39;s why I \n&gt; &gt;&gt; suggest class naming approach.\n&gt; \n&gt; Certainly a class naming convention works very well with Ant&#39;s\n&gt; JUnit:batchtest task.\n&gt; \n&gt; &gt;&gt;&gt; Also, place the different kinds of tests in different packages in\n&gt; order\n&gt; &gt;&gt;&gt; to reduce the number of naming collisions.\n&gt; &gt;&gt;\n&gt; &gt;&gt; Sorry, I don&#39;t see your point clearly. Are you talking about unit\n&gt; tests,\n&gt; &gt;&gt; functional tests?\n&gt; \n&gt; Yes.:)\n&gt; \n&gt; I mean place CTs in one package and PTs in another.\n\n   Yes, sure, it could even be different source trees and different teams\n   (development/QA) working on them.\n\n&gt; \n&gt; &gt;&gt;&gt; I have to say that your list of points is excellent and should be\n&gt; &gt;&gt;&gt; turned into a short article on the subject.\n&gt; &gt;&gt;\n&gt; &gt;&gt; Thank you very much. Actually, I thought about it and I&#39;ll possibly\n&gt; &gt;&gt; try to write one.\n&gt; \n&gt; I am more than willing to edit it, if you need some help.\n\n  Thank you for the offer. BTW, is is OK to post draft on the list\n  for feedback? Possibly someone else will also want to comment.\n\n  Good luck,\n\n-- \nKirill Maximov aka KIR\nkir@... | http://www.maxkir.com/\nSt.Petersburg, Russia\n\n", 
    "profile": "maxkir1", 
    "topicId": 6735, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 85102992, 
    "prevInTime": 6752, 
    "contentTrasformed": false, 
    "postDate": "1043643679", 
    "canDelete": false, 
    "nextInTopic": 6762, 
    "prevInTopic": 6745, 
    "headers": {
        "inReplyToHeader": "PDIwMDMwMTI2MTUwMjM2MDIxOS4wMDdEQTM1QkBzbXRwLnltLnBodWIubmV0LmNhYmxlLnJvZ2Vycy5jb20+", 
        "messageIdInHeader": "PDIwMDMwMTI3MDUwMTE5LkdDMTUwMjVAcXVlZW4uYWN0aW1pbmQuY29tPg==", 
        "referencesHeader": "PDIwMDMwMTI1MTk0OTAyLkdBMTIzMjlAcXVlZW4uYWN0aW1pbmQuY29tPiA8MjAwMzAxMjUxNTA0NDkwMzMxLjAxMTBBMEIzQHNtdHAueW0ucGh1Yi5uZXQuY2FibGUucm9nZXJzLmNvbT4gPDIwMDMwMTI2MTAwMDI4LkdBNjI3OEBxdWVlbi5hY3RpbWluZC5jb20+IDwyMDAzMDEyNjE1MDIzNjAyMTkuMDA3REEzNUJAc210cC55bS5waHViLm5ldC5jYWJsZS5yb2dlcnMuY29tPg=="
    }
}