{
    "numMessagesInTopic": 19, 
    "nextInTime": 6828, 
    "senderId": "t-XcarVoeA6HXNHkE0GPE_YZdMFpk5zrltPM5Q8Ue2CNWybID7aL-TdQXpE4mGJ7v4vQf9ev1guNu8e02jLGoHnq4zsK8jv2B6l-", 
    "systemMessage": false, 
    "subject": "Separate Assertion Object", 
    "from": "Curt Sampson &lt;yahoo_sucks@...&gt;", 
    "authorName": "Curt Sampson", 
    "msgSnippet": "... This sort of ties in to something I ve been thinking about for a while. Why does a TestCase inherit all of its assertion routines? I found a while back", 
    "msgId": 6827, 
    "profile": "cjstokyo", 
    "topicId": 6804, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 110189933, 
    "messageBody": "<div id=\"ygrps-yiv-1017122968\">On Thu, 30 Jan 2003, J. B. Rainsberger wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I want to see the full strings in a ComparisonFailure if they are no<br/>\n&gt; more than 40 characters long enough.<br/>\n&gt;<br/>\n&gt; I want to know at which character index the first difference occurs.<br/>\n&gt;<br/>\n&gt; If the strings are long (&gt; 40 characters), I want at least 10<br/>\n&gt; characters of context on either side of the beginning of the<br/>\n&gt; difference.<br/>\n<br/>\n </span></blockquote>This sort of ties in to something I&#39;ve been thinking about for a while.<br/>\n<br/>\nWhy does a TestCase inherit all of its assertion routines?<br/>\n<br/>\nI found a while back that I wanted to be able to set up some general<br/>\nparameters for my assertions before I used them, and continue to use<br/>\nthose parameters over and over again. The first time this happened, I<br/>\nneeded to insert the current date and time into a column in a database<br/>\ntable. I didn&#39;t need much accuracy, and wanted to save some space in<br/>\na multi-million row table, so I was using an MS SQL server date type<br/>\nthat was smaller (4 bytes instead of eight, I recall) but accurate only<br/>\ndown to several seconds. So at any particular point, if I inserted<br/>\nthe current time, the time coming back out of the database would be<br/>\ndifferent than what I&#39;d inserted, though always certainly less than a<br/>\nminute or so different.<br/>\n<br/>\nSo what I did was create a separate DateAssertion object that took,<br/>\nin the constructor, a parameter saying just how different the two Date<br/>\nobjects could be and still be &quot;equal&quot; for my purposes. Then I&#39;d invoke<br/>\nthe DateAssertion&#39;s assert() method.<br/>\n<br/>\nIt seems to me one could just as well make a StringAssertion object that<br/>\none could set up with appropriate parameters so that you&#39;d get output,<br/>\nwhen an assertion fails, that&#39;s more appropriate for your particular<br/>\ncircumstance.<br/>\n<br/>\nThat led me to start thinking about whether it might not be cleaner and<br/>\nsimpler, overall, to completely separate the assertion code from the test<br/>\ncases by using separate assertion objects for everything.<br/>\n<br/>\ncjs<br/>\n-- <br/>\nCurt Sampson  &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cjs@...\">cjs@...</a>&gt;   +81 90 7737 2974   <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.netbsd.org\">http://www.netbsd.org</a><br/>\n    Don&#39;t you know, in this new Dark Age, we&#39;re all light.  --XTC</div>", 
    "prevInTime": 6826, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1044061229", 
    "canDelete": false, 
    "nextInTopic": 6832, 
    "prevInTopic": 6819, 
    "headers": {
        "inReplyToHeader": "PDIwMDMwMTMwMTgxMjA4MDAzMS4wMTY5OEQyN0BzbXRwPg==", 
        "messageIdInHeader": "PFBpbmUuTkVCLjQuNTEuMDMwMjAxMDk1MjA0MC41MTdAYW5nZWxpYy5jeW5pYy5uZXQ+", 
        "referencesHeader": "PGIxYzdzcStkbGkwQGVHcm91cHMuY29tPiA8MjAwMzAxMzAxODEyMDgwMDMxLjAxNjk4RDI3QHNtdHA+"
    }
}