{
    "numMessagesInTopic": 41, 
    "nextInTime": 6831, 
    "senderId": "UjD9YB7rS1V9blbyCQ4MW8oMtYGKp22IFGYc4TWxMB3puZt41HE8Q5J9zuLhqmrVJfHriDT7wutlzOIPbMEX32GMHVhsAh-8bLaIkhMi-Q", 
    "systemMessage": false, 
    "subject": "RE: [junit] Websphere Connection Pool", 
    "from": "&quot;Scott Stirling&quot; &lt;scottstirling@...&gt;", 
    "authorName": "Scott Stirling", 
    "msgSnippet": "... [...] ... If you ve done this many times it seems a reusable mock object could be useful across all these implementations.  Something as fundamental and ", 
    "msgId": 6830, 
    "profile": "jrun5", 
    "topicId": 6711, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 112036634, 
    "messageBody": "<div id=\"ygrps-yiv-1035435428\"><blockquote><span title=\"ireply\">&gt; -----Original Message-----<br/>\n&gt; From: Curt Sampson [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yahoo_sucks@...\">yahoo_sucks@...</a>]<br/>\n </span></blockquote>[...]<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Well, it *was* your example, and I thought it was an intentional<br/>\n&gt; &gt; simplification, not an example of production code.<br/>\n&gt;<br/>\n&gt; It was an intentional simplification, and it was also an example of<br/>\n&gt; production code. I&#39;ve done the same thing in many production systems,<br/>\n&gt; and I rarely test it.<br/>\n<br/>\n </span></blockquote>If you&#39;ve done this many times it seems a reusable mock object could be<br/>\nuseful across all these implementations.  Something as fundamental and<br/>\ncommon as Connections and Datasources are used in lots of projects,<br/>\nobviously.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Note that Kent Beck says, right in the first page or two of his chapter<br/>\n&gt; on testing in _Extreme Programming Explained_, you should not write<br/>\n&gt; tests for things that seem simple and unlikely to break. (I&#39;d quote it,<br/>\n&gt; but I&#39;m at home right now and the book is at work.)<br/>\n<br/>\n </span></blockquote>I read it as applying mainly to simple accessors and mutators, but I get the<br/>\npoint.  Again, the simplicity of the code example had nothing to do with the<br/>\noriginal thread, which was about how to unit test certain predicaments<br/>\npeople code themselves into (or inherit from someone else).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My concern is not about shipping it with the product; my concern is<br/>\n&gt; that, whether it ships or not, it&#39;s extra code to write and maintain.<br/>\n<br/>\n </span></blockquote>Like I said, there&#39;s no reason it couldn&#39;t be reused.  We&#39;re talking about a<br/>\nConnection and some kind of ConnectionFactory, pretty commonly used, as you<br/>\nsaid above.<br/>\n<br/>\nAnother idea, borrowed from Kent Beck&#39;s latest book on TDD, is SelfShunt,<br/>\nwhere you have the TestCase itself be a kind of mock object, implementing<br/>\nthe interface of whatever class your class under test expects to interact<br/>\nwith.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Well, I saw it, perhaps incorrectly, as you saying &quot;there is never<br/>\n&gt; a case where it&#39;s better to modify implementation code to make it<br/>\n&gt; testable,&quot; and I presented a single case that I thought disproved this<br/>\n&gt; statement. (At the very least, it does for me. I guess it&#39;s a matter of<br/>\n&gt; opinion whether or not it does for others.)<br/>\n<br/>\n </span></blockquote>I think &quot;testability&quot; can become a slippery slope.  We&#39;re only debating<br/>\nafter all, and in this debate I chose and am sticking to my original<br/>\nargument that (and not the capitulation to &quot;last resort,&quot; where I don&#39;t<br/>\ncompletely disagree with you):<br/>\n<br/>\n&quot;I would predict that the strategy listed above, while good intentioned, on<br/>\na project of any size would wind up with lots of extra code throughout added<br/>\njust for testability.  I don&#39;t think you should add a method just to make<br/>\nyour stuff accessible to a test class, unless possibly as a last resort.<br/>\nTestability is an aspectual concern, not really a part of an object being<br/>\nmodeled.  So this strategy has the potential to make testability a<br/>\ncorrupting influence on the modeling of objects, in my opinion.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I wouldn&#39;t, because it was test-driven development that drove me to the<br/>\n&gt; above solution in the first place. I thought, &quot;Darn, to test this I&#39;ve<br/>\n&gt; got to make another mock object here, and pass it a database connection.<br/>\n&gt; Why not just pass in the connection directly, and save myself the effort?&quot;<br/>\n<br/>\n </span></blockquote>OK, that&#39;s cool.  What can I say?  Seems fine in this situation.<br/>\n<br/>\nScott S.</div>", 
    "prevInTime": 6829, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1044153412", 
    "canDelete": false, 
    "nextInTopic": 6833, 
    "prevInTopic": 6825, 
    "headers": {
        "inReplyToHeader": "PFBpbmUuTkVCLjQuNTEuMDMwMjAxMDkzODM1MC41MTdAYW5nZWxpYy5jeW5pYy5uZXQ+", 
        "messageIdInHeader": "PEtJRUhJQklPQkFFTEpBSElQTkhES0VMRkNPQUEuc2NvdHRzdGlybGluZ0ByY24uY29tPg=="
    }
}