{
    "numMessagesInTopic": 41, 
    "nextInTime": 6835, 
    "senderId": "RoCk9fwe5kM41JpLWSwOlU8ll2O4oxGvP6r422IGXniciL5YfGNVA7a1LUfLZ7k0ASEHH3fABsMrghn9TZRFxifg35BBw7T6dnns", 
    "systemMessage": false, 
    "subject": "RE: [junit] Websphere Connection Pool", 
    "from": "Curt Sampson &lt;yahoo_sucks@...&gt;", 
    "authorName": "Curt Sampson", 
    "msgSnippet": "... I thought I addressed the point quite directly: make this simple change to the code and you ll be able to test it easily. ... Sure. But even just doing the", 
    "msgId": 6834, 
    "profile": "cjstokyo", 
    "topicId": 6711, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 110189933, 
    "messageBody": "<div id=\"ygrps-yiv-898146400\">On Sat, 1 Feb 2003, Scott Stirling wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Again, the simplicity of the code example had nothing to do with the<br/>\n&gt; original thread, which was about how to unit test certain predicaments<br/>\n&gt; people code themselves into (or inherit from someone else).<br/>\n<br/>\n </span></blockquote>I thought I addressed the point quite directly: make this simple change to<br/>\nthe code and you&#39;ll be able to test it easily.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; My concern is not about shipping it with the product; my concern is<br/>\n&gt; &gt; that, whether it ships or not, it&#39;s extra code to write and maintain.<br/>\n&gt;<br/>\n&gt; Like I said, there&#39;s no reason it couldn&#39;t be reused.<br/>\n<br/>\n </span></blockquote>Sure. But even just doing the setup on that object is still more code<br/>\nthan simply not testing it.<br/>\n<br/>\nI don&#39;t feel I&#39;ll ever get any payback from that test; that is to say, I<br/>\ndon&#39;t think it would ever fail. Thus, I don&#39;t write the test. If I ever<br/>\nstart getting bitten by bugs in that sort of code, I&#39;ll realize that<br/>\nmy prediction in this type of case is sometimes wrong, and I&#39;ll start<br/>\nwriting those tests.<br/>\n<br/>\n(Only tests that ever fail at some point pay back their investment; the<br/>\ntests that never fail never catch any bugs, and are thus a waste of time<br/>\nand money. It&#39;s just our lack of perfect knowledge about what&#39;s going<br/>\nto fail in the future that forces us to waste time and money. XP&#39;s unit<br/>\ntesting strategy, as I see it, tries to maximize the overall return on<br/>\nthe test investment.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Another idea, borrowed from Kent Beck&#39;s latest book on TDD, is SelfShunt,<br/>\n&gt; where you have the TestCase itself be a kind of mock object, implementing<br/>\n&gt; the interface of whatever class your class under test expects to interact<br/>\n&gt; with.<br/>\n<br/>\n </span></blockquote>I&#39;ve done that. I&#39;ve also just created anonymous objects on the fly.<br/>\nBoth are good ideas, though orthogonal to the discussion above of<br/>\nwhether or not one should test something in the first place.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;I would predict that the strategy listed above, while good intentioned, on<br/>\n&gt; a project of any size would wind up with lots of extra code throughout added<br/>\n&gt; just for testability.<br/>\n<br/>\n </span></blockquote>It&#39;s not lots of extra code. I added, in my example, two extra lines of<br/>\ncode: a method declaration and a method call. Another line was extracted<br/>\nfrom the other method, and so existed anyway. (I&#39;m not counting the lone<br/>\nclosing brace or the extra whitespace lines as lines of code.)<br/>\n<br/>\nI think that you would probably have added the same amount of code to<br/>\nthe test case just to set up the mock connection factory, not to mention<br/>\nintroducing another object into the system rather than just an extra<br/>\nmethod, making things more complex rather than less. IMHO, of course.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Testability is an aspectual concern, not really a part of an object being<br/>\n&gt; modeled.<br/>\n<br/>\n </span></blockquote>I disagree. Maybe it comes from seeing engineers design buildings and<br/>\nsimilar structures: it turns out that you design them not only so that<br/>\nthey fulfill their intended function after you&#39;re done building them,<br/>\nbut also so that they have good &quot;buildability.&quot; They&#39;ll add in stuff<br/>\nthat has no relevance to the final function simply to make it faster,<br/>\ncheaper or easier to build. This was a pretty stunning concept to me<br/>\nwhen I first found out about it, because it was something I&#39;d never<br/>\nconsidered before.<br/>\n<br/>\nSo now, always, testability is high on my list of things I consider when<br/>\nI design any system. I usually am expected to provide some way of showing,<br/>\non a continuous basis, that the system will do what&#39;s expected of it, so<br/>\nit&#39;s really almost a final function of the system in the same way that<br/>\nthe behaviour the client is looking for is a final function of it.<br/>\n<br/>\ncjs<br/>\n-- <br/>\nCurt Sampson  &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cjs@...\">cjs@...</a>&gt;   +81 90 7737 2974   <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.netbsd.org\">http://www.netbsd.org</a><br/>\n    Don&#39;t you know, in this new Dark Age, we&#39;re all light.  --XTC</div>", 
    "prevInTime": 6833, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1044174516", 
    "canDelete": false, 
    "nextInTopic": 6835, 
    "prevInTopic": 6833, 
    "headers": {
        "inReplyToHeader": "PEtJRUhJQklPQkFFTEpBSElQTkhES0VMRkNPQUEuc2NvdHRzdGlybGluZ0ByY24uY29tPg==", 
        "messageIdInHeader": "PFBpbmUuTkVCLjQuNTEuMDMwMjAyMTcxMjAwMC41MDlAYW5nZWxpYy5jeW5pYy5uZXQ+", 
        "referencesHeader": "PEtJRUhJQklPQkFFTEpBSElQTkhES0VMRkNPQUEuc2NvdHRzdGlybGluZ0ByY24uY29tPg=="
    }
}