{
    "numMessagesInTopic": 41, 
    "nextInTime": 6863, 
    "senderId": "qZM1785U6uds2g3Mq9MaQvfkWo-yEZD5uF_KfX3yPeA445AYdMVX7OysCddsZ_jnt4leQ1sT5WUiPPShgoJmtAstQpWD3zn8Iv27CXIGUA", 
    "systemMessage": false, 
    "subject": "RE: [junit] Websphere Connection Pool", 
    "from": "&quot;Scott Stirling&quot; &lt;scottstirling@...&gt;", 
    "authorName": "Scott Stirling", 
    "msgSnippet": "... One thing I don t think we ever discussed is the fact that, in the case we were discussing, the mock object approach allows you to separate your test from", 
    "msgId": 6862, 
    "rawEmail": "Return-Path: &lt;scottstirling@...&gt;\r\nX-Sender: scottstirling@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_3_4); 4 Feb 2003 01:00:28 -0000\r\nReceived: (qmail 56045 invoked from network); 4 Feb 2003 01:00:28 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m9.grp.scd.yahoo.com with QMQP; 4 Feb 2003 01:00:28 -0000\r\nReceived: from unknown (HELO smtp-hub.mrf.mail.rcn.net) (207.172.4.107)\n  by mta2.grp.scd.yahoo.com with SMTP; 4 Feb 2003 01:00:29 -0000\r\nReceived: from smtp01.mrf.mail.rcn.net ([207.172.4.60])\n\tby smtp-hub.mrf.mail.rcn.net with esmtp (Exim 3.35 #4)\n\tid 18frRs-0005Aq-00\n\tfor junit@yahoogroups.com; Mon, 03 Feb 2003 20:00:28 -0500\r\nReceived: from 207-172-67-6.c3-0.frm-ubr1.sbo-frm.ma.cable.rcn.com ([207.172.67.6] helo=javalaptop)\n\tby smtp01.mrf.mail.rcn.net with smtp (Exim 3.35 #4)\n\tid 18frRs-0003bL-00\n\tfor junit@yahoogroups.com; Mon, 03 Feb 2003 20:00:28 -0500\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nSubject: RE: [junit] Websphere Connection Pool\r\nDate: Mon, 3 Feb 2003 20:00:08 -0500\r\nMessage-ID: &lt;KIEHIBIOBAELJAHIPNHDCEMLCOAA.scottstirling@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain;\n\tcharset=&quot;us-ascii&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Priority: 3 (Normal)\r\nX-MSMail-Priority: Normal\r\nX-Mailer: Microsoft Outlook IMO, Build 9.0.2416 (9.0.2911.0)\r\nX-MimeOLE: Produced By Microsoft MimeOLE V6.00.2800.1106\r\nIn-Reply-To: &lt;Pine.NEB.4.51.0302021712000.509@...&gt;\r\nImportance: Normal\r\nFrom: &quot;Scott Stirling&quot; &lt;scottstirling@...&gt;\r\nReply-To: &lt;scottstirling@...&gt;\r\nX-Yahoo-Group-Post: member; u=112036634\r\nX-Yahoo-Profile: jrun5\r\n\r\n&gt; -----Original Message-----\n&gt; From: Curt Sampson [mailto:yahoo_sucks@...]\n&gt;\n&gt; On Sat, 1 Feb 2003, Scott Stirling wrote:\n&gt;\n&gt; &gt; Again, the simplicity of the code example had nothing to do with the\n&gt; &gt; original thread, which was about how to unit test certain predicaments\n&gt; &gt; people code themselves into (or inherit from someone else).\n&gt;\n&gt; I thought I addressed the point quite directly: make this simple change to\n&gt; the code and you&#39;ll be able to test it easily.\n\nOne thing I don&#39;t think we ever discussed is the fact that, in the case we\nwere discussing, the mock object approach allows you to separate your test\nfrom the database connection.  I find this extremely useful, and often use\nmock objects because they allow me to separate tests from heavy duty\nexternal dependencies like databases and app servers.  Mock objects for\ncommon things become extremely useful and wind up being re-used across the\nteam.\n\n&gt; &gt; &gt; My concern is not about shipping it with the product; my concern is\n&gt; &gt; &gt; that, whether it ships or not, it&#39;s extra code to write and maintain.\n&gt; &gt;\n&gt; &gt; Like I said, there&#39;s no reason it couldn&#39;t be reused.\n&gt;\n&gt; Sure. But even just doing the setup on that object is still more code\n&gt; than simply not testing it.\n\nAt this point the discussion turned to not testing the example at all,\nrather than which strategy for testing was better.  I didn&#39;t sign up for\nthis turn of events.  :-&gt;\n\n&gt; &gt; &quot;I would predict that the strategy listed above, while good\n&gt; &gt; intentioned, on a project of any size would wind up with\n&gt; &gt; lots of extra code throughout added just for testability.\n&gt;\n&gt; It&#39;s not lots of extra code. I added, in my example, two extra lines of\n&gt; code:\n\nHa, ha.  Again, we are discussing general principles and you retreat to the\nparticular case.  Yes, two lines in this case.  But I am trying to analyze\nthe strategy via the example, not just this example.  For the sake of\nargument, keep in mind you&#39;re going to have a system of 100,000 LOC.  Does\nadding mixed in methods scale on a large project?\n\nSide note: I think one thing worth pointing out is that any time someone on\nthis list sends us a method and asks &quot;How the hell do I test this?&quot; they\nobviously aren&#39;t doing TDD.  If they were, they wouldn&#39;t have gotten into\nthat situation in the first  place.  There are two broad categories of JUnit\nusers: the TDD and XP folks, and the others who use it as an API and tool\nfor testing Java, regardless of development methodology.  Has nothing to do\nwith this discussion except as a hint about this problem of &quot;testability&quot;\nand my reasons for thinking it should rarely, if ever, be represented as a\nmethod added *only* to make a class testable.  I will enumerate some of my\nreasons in the separate thread on &quot;Testability.&quot;\n\n&gt; I disagree. Maybe it comes from seeing engineers design buildings and\n&gt; similar structures: it turns out that you design them not only so that\n&gt; they fulfill their intended function after you&#39;re done building them,\n&gt; but also so that they have good &quot;buildability.&quot; They&#39;ll add in stuff\n&gt; that has no relevance to the final function simply to make it faster,\n&gt; cheaper or easier to build. This was a pretty stunning concept to me\n&gt; when I first found out about it, because it was something I&#39;d never\n&gt; considered before.\n\nCar and motherboard manufacturers do the same thing (Boris Beizer reminds\nme).  But I&#39;m still interested in the thought process behind testability and\nhow it impacts object oriented design.  We need some principles to guide us.\nI mean, hell, you could just as well add a main() method or a test() method\nto every class you want to test, but what kind of thinking process is that?\nIt&#39;s certainly not test *first*.  I&#39;ve seen this (the main() method idea)\nrecommended as a good idea (I think in the &#39;The Practical Programmer&#39;).\nObviously there are benefits to doing your tests in a framework like JUnit,\nbut there&#39;s more to it than just having an API and a test runner and\nreporting mechanism.  I&#39;m interested in making explicit the thinking that\nguides testability.  What is &quot;testability?&quot;  And what is &quot;maintainability?&quot;\nThey are similar kinds of things.  I am hoping they fall out of good design,\nbut have yet to prove it.\n\nScott Stirling\n\n\n\n", 
    "profile": "jrun5", 
    "topicId": 6711, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 112036634, 
    "prevInTime": 6861, 
    "contentTrasformed": false, 
    "postDate": "1044320408", 
    "canDelete": false, 
    "nextInTopic": 6864, 
    "prevInTopic": 6857, 
    "headers": {
        "inReplyToHeader": "PFBpbmUuTkVCLjQuNTEuMDMwMjAyMTcxMjAwMC41MDlAYW5nZWxpYy5jeW5pYy5uZXQ+", 
        "messageIdInHeader": "PEtJRUhJQklPQkFFTEpBSElQTkhEQ0VNTENPQUEuc2NvdHRzdGlybGluZ0ByY24uY29tPg=="
    }
}