{
    "numMessagesInTopic": 17, 
    "nextInTime": 6889, 
    "senderId": "xd3OCmxBIVh9kG4eUon6Yp21KDKc_ZqpKqzieLz2pTP1LBKS1q7BK9pOKlgB1gfwGoNSaaIeDaEkOqwYsYY7B6wr-ZC65GvpBkQuKOnLBCM", 
    "systemMessage": false, 
    "subject": "Re: [junit] Testability", 
    "from": "Steven Taschuk &lt;staschuk@...&gt;", 
    "authorName": "Steven Taschuk", 
    "msgSnippet": "Quoth Scott Stirling: [...] ... I gather from your comments that you consider it an important principle of object-oriented development that a one-to-one (or ", 
    "msgId": 6888, 
    "topicId": 6863, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 114327599, 
    "messageBody": "<div id=\"ygrps-yiv-1000148924\">Quoth Scott Stirling:<br/>\n  [...]<br/>\n<blockquote><span title=\"ireply\"> &gt; Put another way, I wonder the same thing about any behavior added to an<br/>\n&gt; object.  Testing is not a behavior of most objects.  So we should hope to<br/>\n&gt; test most objects without modeling testing in them in any way.  So how do<br/>\n&gt; you make things testable without corrupting the object design with behaviors<br/>\n&gt; added or modified just to make objects testable?  [...]<br/>\n<br/>\n </span></blockquote>I gather from your comments that you consider it an important<br/>\nprinciple of object-oriented development that a one-to-one (or<br/>\nnearly one-to-one) correspondence between the objects being<br/>\nmodelled and the code objects used to model them is desirable.  I<br/>\nhave a feeling (entirely unsupported by any knowledge of the<br/>\nhistory of the field) that this principle might have arisen in the<br/>\ncontext of the analysis and design of simulations, rather than<br/>\nmore general software development.  It belongs to simulations,<br/>\nimho, and is not very useful elsewhere.<br/>\n<br/>\nFor example, consider the model of concurrently executing<br/>\nprocesses provided by multitasking operating systems, and in<br/>\nparticular the process and resource objects of such models.<br/>\n<br/>\nProcesses do not represent any real-world object; they are<br/>\nentirely constructs of the model.  The question of faithfulness of<br/>\nrepresentation doesn&#39;t arise.<br/>\n<br/>\nResources often do represent real-world objects, but it is highly<br/>\ndesirable that the representations have properties those objects<br/>\ndo not -- sharability among concurrently executing processes, for<br/>\nexample.<br/>\n<br/>\nThis illustrates a mode completely different from that of<br/>\nsimulation, one in which the greatest good of the model is<br/>\nconvenience for its clients (be they software or human), and<br/>\nfaithfulness of representation is, if not meaningless, of<br/>\nmarginal, zero, or even negative utility.  In such modes, adding<br/>\nbehaviour to improve testability does not necessarily corrupt the<br/>\ndesign.  (Refactoring might be better, but adding might do.)<br/>\n<br/>\nAdding such behaviour might even improve the design: testable code<br/>\nis easier to change, not only because tests can tell you when your<br/>\nchanges have broken something, but also because testable code is<br/>\nin general more modular.  Changeability is imho the most desirable<br/>\nproperty of code, and beats faithfulness of representation any<br/>\nday.  Fred Brooks writes that you should plan to throw one<br/>\nimplementation of your system away, since you will anyway.  (It<br/>\nmight be said that the XP folk plan to throw away *every*<br/>\nimplementation.)  This summarizes quite nicely my own experience,<br/>\nwhich is that the code changes many times during development and<br/>\nmaintenance.<br/>\n<br/>\n-- <br/>\nSteven Taschuk           |   7&#92; 7&#39;Z {&~         .     St. George<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:staschuk@...\">staschuk@...</a> |     Y r          --/hG-      &  the<br/>\n                         | (__/ )_             1^1`     Dragon</div>", 
    "prevInTime": 6887, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1044571540", 
    "canDelete": false, 
    "nextInTopic": 6889, 
    "prevInTopic": 6887, 
    "headers": {
        "inReplyToHeader": "PEtJRUhJQklPQkFFTEpBSElQTkhETUVNTkNPQUEuc2NvdHRzdGlybGluZ0ByY24uY29tPjsgZnJvbSBzY290dHN0aXJsaW5nQHJjbi5jb20gb24gVHVlLCBGZWIgMDQsIDIwMDMgYXQgMTI6NDg6MDVBTSAtMDUwMA==", 
        "messageIdInHeader": "PDIwMDMwMjA2MTU0NTQwLkE0MjNAdGliaWEuYW1vdGxwYWEuYm9ndXM+", 
        "referencesHeader": "PEtJRUhJQklPQkFFTEpBSElQTkhETUVNTkNPQUEuc2NvdHRzdGlybGluZ0ByY24uY29tPg=="
    }
}