{
    "numMessagesInTopic": 17, 
    "nextInTime": 6891, 
    "senderId": "gb-LS_iypHtJCqNs3bVtwt_85TmpNva3wTufoBBRvPo8335Kd1XbPuV2s3GjuhUpWx5WiqUcYaBXvJJ5HwDcRdkIq5FCCyVZHf_Kvst69w", 
    "systemMessage": false, 
    "subject": "Re: [junit] Testability", 
    "from": "&quot;Scott Stirling&quot; &lt;scottstirling@...&gt;", 
    "authorName": "Scott Stirling", 
    "msgSnippet": "... I admit, this is all I was really thinking about at the time.  I had Robert Martin s recent book on my mind, specifically the TDD bowling game application ", 
    "msgId": 6890, 
    "profile": "jrun5", 
    "topicId": 6863, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 112036634, 
    "messageBody": "<div id=\"ygrps-yiv-1146637813\">--- Steven Taschuk &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:staschuk@...\">staschuk@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I gather from your comments that you consider it an<br/>\n&gt; important principle of object-oriented development <br/>\n&gt; that a one-to-one (or nearly one-to-one) <br/>\n&gt; correspondence between the objects being modelled <br/>\n&gt; and the code objects used to model them is <br/>\n&gt; desirable.  <br/>\n<br/>\n </span></blockquote>I admit, this is all I was really thinking about at<br/>\nthe time.  I had Robert Martin&#39;s recent book on my<br/>\nmind, specifically the TDD bowling game application<br/>\n(chapter 6).  Immediately afterward, as I mulled over<br/>\nwhat I&#39;d said and talked about it with others, I<br/>\nremembered how commonly objects in OOP are pretty lame<br/>\nrepresentations of anything real.  <br/>\n<br/>\nFor example, JavaBeans are nothing but simple data<br/>\nstructures with inheritance.  The ubiquitous<br/>\n&quot;services&quot; in today&#39;s many service oriented<br/>\narchitectures (e.g., JMX-based J2EE servers like JBoss<br/>\n& JRun 4) are fundamentally JavaBeans with lifecycle<br/>\nmanagement.  Other poor examples of objects modeling<br/>\nreality are Hashtable, LinkedList, and certainly<br/>\nObject!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have a feeling (entirely unsupported by any<br/>\n&gt; knowledge of the history of the field) that this<br/>\n&gt; principle might have arisen in the context of the <br/>\n&gt; analysis and design of simulations, rather than<br/>\n&gt; more general software development.  It belongs to<br/>\n&gt; simulations, imho, and is not very useful elsewhere.<br/>\n<br/>\n </span></blockquote>I&#39;m not very knowledgeable about the historical<br/>\ndetails either, but now am more interested. <br/>\nNevertheless, I think the correspondence principle is<br/>\nhelpful in data modeling, like for designing databases<br/>\n(e.g., Person, Employee, Group, and Address tables). <br/>\nIt&#39;s also helpful for UI programming with its windows,<br/>\nbuttons, menus, etc.<br/>\n<br/>\nBut on the other hand, of the least important things<br/>\nin XP and TDD is what you name the objects and methods<br/>\ninitially (you always can and should refactor the<br/>\nnames to be communicative, but initially it&#39;s not as<br/>\nimportant as getting the outputs right).  It&#39;s amazing<br/>\nhow much a very clean, tight TDD design, at the end,<br/>\ncan look so different from what one would have<br/>\ndeveloped if going with the top-down, modeling objects<br/>\napproach.<br/>\n<br/>\n[...]<br/>\n<blockquote><span title=\"ireply\"> &gt; Processes do not represent any real-world object;<br/>\n&gt; they are entirely constructs of the model.  The <br/>\n&gt; question of faithfulness of representation doesn&#39;t <br/>\n&gt; arise.<br/>\n<br/>\n </span></blockquote>I am a little on the fence with this example.  You can<br/>\nexplain that a process has a start and an end, ways of<br/>\ninteracting with the environment, that they use<br/>\nresources, and are controlled, enabled or regulated by<br/>\na larger system.  In this sense, a software process<br/>\ncould correspond to a natural process, like<br/>\nphotosynthesis or blood clotting.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Resources often do represent real-world objects, but<br/>\n&gt; it is highly desirable that the representations have<br/>\n&gt; properties those objects do not -- sharability among<br/>\n&gt; concurrently executing processes, for example.<br/>\n<br/>\n </span></blockquote>How do you represent &quot;shareability&quot; as a property in<br/>\nsomething like a software file?  Is it that different<br/>\n(correspondence-wise) from making photocopies of a<br/>\nfile and letting several people read them at the same<br/>\ntime?  I don&#39;t know.  &quot;Shareability&quot; is another one of<br/>\nthese &quot;-ability&quot; words that seem difficult to explain<br/>\nbecause they are really (I think) vague terms for more<br/>\nprecise things we have yet to analyze.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This illustrates a mode completely different from<br/>\n&gt; that of simulation, one in which the greatest good <br/>\n&gt; of the model is convenience for its clients (be they<br/>\n<br/>\n&gt; software or human), and faithfulness of<br/>\n&gt; representation is, if not meaningless, of<br/>\n&gt; marginal, zero, or even negative utility. In such<br/>\n&gt; modes, adding behaviour to improve testability does <br/>\n&gt; not necessarily corrupt the design.  (Refactoring <br/>\n&gt; might be better, but adding might do.)<br/>\n<br/>\n </span></blockquote>[...]<br/>\n<blockquote><span title=\"ireply\"> &gt; Changeability is imho the most desirable property of<br/>\n&gt; code, and beats faithfulness of representation any <br/>\n&gt; day.<br/>\n<br/>\n </span></blockquote>I wonder if &quot;changeability&quot; could be reduced and made<br/>\nmore precise by analysis, like I am trying to reduce<br/>\n&quot;testability&quot; and &quot;maintainability.&quot;  I think most of<br/>\nthese &quot;-ability&quot; words are shorthand for more<br/>\nfundamental principles that, if made explicit, would<br/>\nhelp raise software engineering to a more sophisticated <br/>\nart form if not a science.<br/>\n<br/>\nScott Stirling</div>", 
    "prevInTime": 6889, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1044589483", 
    "canDelete": false, 
    "nextInTopic": 6891, 
    "prevInTopic": 6889, 
    "headers": {
        "messageIdInHeader": "PEtJRUhJQklPQkFFTEpBSElQTkhETUVOT0NPQUEuc2NvdHRzdGlybGluZ0ByY24uY29tPg=="
    }
}