{
    "numMessagesInTopic": 41, 
    "nextInTime": 6917, 
    "senderId": "IVM7WsS1jpf-c-x0du-AKzvTMGVRroxVkRr9dLEA44xrN1xFaCQGo8zJmJfgVccINm1F69rzW2VxRaxs500n1XLUIup9-lEmHvJl", 
    "systemMessage": false, 
    "subject": "Re: [junit] Programmer Tests and the Database", 
    "from": "Curt Sampson &lt;yahoo_sucks@...&gt;", 
    "authorName": "Curt Sampson", 
    "msgSnippet": "I ll respond to several points made in various messages here. First, WRT to putting all of the SQL in one place in the code : I m not sure what various", 
    "msgId": 6916, 
    "rawEmail": "Return-Path: &lt;yahoo_sucks@...&gt;\r\nReceived: (qmail 72177 invoked from network); 9 Feb 2003 14:49:24 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m4.grp.scd.yahoo.com with QMQP; 9 Feb 2003 14:49:24 -0000\r\nReceived: from unknown (HELO n4.grp.scd.yahoo.com) (66.218.66.88)\n  by mta3.grp.scd.yahoo.com with SMTP; 9 Feb 2003 14:49:24 -0000\r\nX-eGroups-Return: yahoo_sucks@...\r\nReceived: from [66.218.67.158] by n4.grp.scd.yahoo.com with NNFMP; 09 Feb 2003 14:49:23 -0000\r\nX-Sender: yahoo_sucks@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_3_4); 9 Feb 2003 09:35:05 -0000\r\nReceived: (qmail 45646 invoked from network); 9 Feb 2003 09:35:05 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m2.grp.scd.yahoo.com with QMQP; 9 Feb 2003 09:35:05 -0000\r\nReceived: from unknown (HELO platonic.cynic.net) (204.80.150.245)\n  by mta1.grp.scd.yahoo.com with SMTP; 9 Feb 2003 09:35:05 -0000\r\nReceived: from angelic.cynic.net (angelic-platonic.cvpn.cynic.net [198.73.220.226])\n\tby platonic.cynic.net (Postfix) with ESMTP id 7303CBF4C\n\tfor &lt;junit@yahoogroups.com&gt;; Sun,  9 Feb 2003 09:30:23 +0000 (UTC)\r\nReceived: from localhost (localhost [127.0.0.1])\n\tby angelic.cynic.net (Postfix) with ESMTP id 504018736\n\tfor &lt;junit@yahoogroups.com&gt;; Sun,  9 Feb 2003 18:30:06 +0900 (JST)\r\nDate: Sun, 9 Feb 2003 18:30:06 +0900 (JST)\r\nX-X-Sender: cjs@...\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] Programmer Tests and the Database\r\nIn-Reply-To: &lt;200302081537190354.048CA85A@...&gt;\r\nMessage-ID: &lt;Pine.NEB.4.51.0302091757340.570@...&gt;\r\nReferences: &lt;KIEHIBIOBAELJAHIPNHDCEMLCOAA.scottstirling@...&gt;\n &lt;Pine.NEB.4.51.0302061540350.7356@...&gt;\n &lt;200302060930510769.0047340B@...&gt;\n &lt;Pine.NEB.4.51.0302071427340.369@...&gt;\n &lt;200302081537190354.048CA85A@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: TEXT/PLAIN; charset=US-ASCII\r\nFrom: Curt Sampson &lt;yahoo_sucks@...&gt;\r\nX-Yahoo-Group-Post: member; u=110189933\r\nX-Yahoo-Profile: cjstokyo\r\nX-eGroups-Approved-By: nails762 &lt;jbr@...&gt; via web; 09 Feb 2003 14:49:21 -0000\r\n\r\nI&#39;ll respond to several points made in various messages here.\n\nFirst, WRT to putting all of the SQL &quot;in one place in the code&quot;:\n\nI&#39;m not sure what various definitions of &quot;in once place&quot; are, but if\nanybody&#39;s talking about putting all SQL in one class, I&#39;ve worked with\na system that did that, it was a real pain as far as development went.\nThe class grew to a enormous size (several thousand lines), and it was\ndifficult to find the particular bit of code you were looking for, and\nto find out what other code in the system used it. Dealing with, say,\nthe database and internal representation of a &quot;user&quot; or a &quot;folder&quot;\nbecame much easier when we kept all of the code--including SQL--for a\nuser or folder together, rather than having some (the Java code) in one\nclass and some (the database code) in another.\n\nSecond, I&#39;m not sure where people came up with the &quot;SQL scattered\nthoughout the application&quot; idea. All of our database code, both the\nSQL portions and the Java portions, is in one package containing our\ndatabase interface layer. If you change the database schema, it&#39;s quite\neasy to find the bits that are using that because we give single objects\nor small sets of objects the authority over that part of the database.\nAll access to information about, say, a &quot;user&quot; goes though the class\nthat owns that information, so that there&#39;s one central point of control\nover it. And of course running all of the unit tests before a commit\nwill help make sure that any changes you&#39;ve made to any code--database\nor other-- do not have bad consequences. If you forgot to modify an SQL\nstatement that needed to be modified, the unit tests would catch it\nbefore you commit.\n\nYes, these add significant (compared to the non-database tests) time to\nthe full unit test run. But it&#39;s not as bad as some here have made out.\nIt&#39;s nowhere near one second per statement, as Rainsberger suggested.\nOur complete suite of unit tests (for the entire system, not just the\ndatabase code) takes approximately 35 seconds to run on a modern machine\n(2GHz P4), and a quick count shows that this includes coverage of 84 SQL\nstatements in 72 unit tests in the database package, amongst all the\nrest of it.\n\nAs for not running the database tests with every unit test run, I really\ndon&#39;t like the idea. The Java code is only part of the application code:\nthe complete application code includes the entire SQL schema and all of\nthe SQL statements that access it. If you&#39;re not testing that, you&#39;re\nnot testing your entire application. (We keep the SQL schemas for our\nvarious databases--we actually have four separate ones we access--in\nseparate directories from our Java code, but we have a unit testing\nsystem for that, too, and the full set of unit tests for a database\nschema, as well as the full set of Java unit tests, is run every time\nthe schema is touched.)\n\nThis also makes nonsense of the idea of having to &quot;search the\napplication&quot; for SQL statements that need to be modified, even if they\nwere widely scattered; just run the unit tests and you will very quickly\nfind every statement that needs to be modified.\n\nAs for a few specific points:\n\n&gt; From: Andrew McDonagh &lt;andrew.mcdonagh@...&gt;\n&gt;\n&gt; My point (and there is one honestly ) is that if all of the SQL was in the\n&gt; resource file in the first place, then its less likely (I feel) that people\n&gt; would of mixed the cases used within the statements.\n\nWho cares? The point is, you ran the unit tests and caught all of the\nproblems. Whether it&#39;s &quot;less likely&quot; that the problem would have appeared\nin the first place is not nearly so important as that you will catch this\nand any other such problem with proper testing.\n\nDr. Strebel writes that he uses inner classes to deal with database\ncode; that looks a lot like what we do for getting objects out of the\ndatabase, actually. I developed a builder interface that contains the\nSQL query and the code to create objects from the resulting ResultSet,\nand I pass this builder to a common build method that takes care of the\nexception handling and other details.\n\n&gt; From: Bob Koss &lt;koss@...&gt;\n&gt;\n&gt; If you have database access spread throughout your code, different places\n&gt; will do the accessing differently. One place might use a table to do a join,\n&gt; another uses a table to create a view, and yet a third uses the table as a\n&gt; target for a SELECT. Rearrange the schema and it&#39;s rarely clear what the\n&gt; changes to the app are going to have to be, let alone writing a regex to\n&gt; locate them.\n\nWell, there&#39;s no question in my mind that spreading database access out\nlike this is a bad thing, which is why I don&#39;t do it. (Whatever made\nanybody think I did, I wonder?) I almsot invariably give a specific\nclass or small set of related classes ownership over a particular\ndatabase table or set of related tables. And this helps to make sure\nthat not only the appropriate embedded SQL code gets changed, but also\nthe Java code that relies closely on it. And that was my big problem\nwith pulling the SQL away from this Java code; you might find the SQL\nmore easily (though as I said, once that SQL class I used in an old\nproject grew to several thousand lines, we could no longer do even\nthat), but it makes it harder to see what Java code changes are also\nrequired.\n\n&gt; From: J. B. Rainsberger &lt;jbr@...&gt;\n&gt;\n&gt; If I test your implementation rather than just checking the SQL\n&gt; string, then I have to run that [taking a lot of time] OR I simply\n&gt; don&#39;t run those tests. (If I knew ahead of time what would break, then\n&gt; I wouldn&#39;t want to run all the tests all the time, but I don&#39;t, so I\n&gt; do.)\n\nI read this as you suggesting that you want to run all the tests and\nhave reasonable coverage, but you don&#39;t want to run the SQL code. That\nmakes no sense to me; if you&#39;re not running the SQL code, you&#39;re not\ntesting it. Proving that the SQL code compares to some arbitrary string\nis not at all the same thing as saying that, when executed, it does the\nright thing in the context of the application, and the surrounding Java\ncode that uses the result of that SQL statement does the right thing.\n\nIn other words, it sounds like you&#39;re not testing the entire application\nat all. You&#39;re just hoping the SQL will work, rather than proving it by\nactually executing it and verifying the results.\n\n(And as I said, the tests do not take nearly as long as you&#39;ve\nsuggested, if you set things up properly. There are lots of tricks, such\nas using very small sets of sample data for the unit tests, that help\nkeep things moving quickly.)\n\ncjs\n-- \nCurt Sampson  &lt;cjs@...&gt;   +81 90 7737 2974   http://www.netbsd.org\n    Don&#39;t you know, in this new Dark Age, we&#39;re all light.  --XTC\n\n\n", 
    "profile": "cjstokyo", 
    "topicId": 6711, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 110189933, 
    "prevInTime": 6915, 
    "contentTrasformed": false, 
    "postDate": "1044783006", 
    "canDelete": false, 
    "nextInTopic": 6918, 
    "prevInTopic": 6915, 
    "headers": {
        "inReplyToHeader": "PDIwMDMwMjA4MTUzNzE5MDM1NC4wNDhDQTg1QUBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PFBpbmUuTkVCLjQuNTEuMDMwMjA5MTc1NzM0MC41NzBAYW5nZWxpYy5jeW5pYy5uZXQ+", 
        "referencesHeader": "PEtJRUhJQklPQkFFTEpBSElQTkhEQ0VNTENPQUEuc2NvdHRzdGlybGluZ0ByY24uY29tPiA8UGluZS5ORUIuNC41MS4wMzAyMDYxNTQwMzUwLjczNTZAYW5nZWxpYy5jeW5pYy5uZXQ+IDwyMDAzMDIwNjA5MzA1MTA3NjkuMDA0NzM0MEJAc3NtdHAuYmxvb3IuaXMubmV0LmNhYmxlLnJvZ2Vycy5jb20+IDxQaW5lLk5FQi40LjUxLjAzMDIwNzE0MjczNDAuMzY5QGFuZ2VsaWMuY3luaWMubmV0PiA8MjAwMzAyMDgxNTM3MTkwMzU0LjA0OENBODVBQHNzbXRwLmJsb29yLmlzLm5ldC5jYWJsZS5yb2dlcnMuY29tPg=="
    }
}