{
    "numMessagesInTopic": 2, 
    "nextInTime": 6918, 
    "senderId": "6pc8ceMmJHU6aaMdhlkUL_EsiBROmnBC_Biprv2pHqRJB60DWnHvuuLxbznJWyB190UV8TIvw7ln1QOnRPVqWRogbKJZeLr73-9v", 
    "systemMessage": false, 
    "subject": "Re: [junit] Making an App Testable", 
    "from": "Curt Sampson &lt;yahoo_sucks@...&gt;", 
    "authorName": "Curt Sampson", 
    "msgSnippet": "... I ve been there. Unfortunately, in many cases these applications are written in a way that make them extremely difficult to unit test. Especially if the ", 
    "msgId": 6917, 
    "profile": "cjstokyo", 
    "topicId": 6910, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 110189933, 
    "messageBody": "<div id=\"ygrps-yiv-275646051\">On Fri, 7 Feb 2003, Eric Armstrong wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The question is this: I have an existing app is that is in dire need of<br/>\n&gt; refactoring. Clearly, I need a test suite. The need for refactoring is<br/>\n&gt; made obvious by the fact that fixing some bugs tends to generate<br/>\n&gt; others, so an even more important reason to create the test suite is<br/>\n&gt; to make sure that I have thought through the desired behaviors and<br/>\n&gt; have verified that they will occur.<br/>\n<br/>\n </span></blockquote>I&#39;ve been there.<br/>\n<br/>\nUnfortunately, in many cases these applications are written in a way<br/>\nthat make them extremely difficult to unit test. Especially if the<br/>\ndesign is not very modular, it can be nearly impossible to get any<br/>\nreasonable unit test coverage without modifying the application to make<br/>\nit more modular. In such cases, if you can, it might be worth writing<br/>\nan automated functional test suite first, getting as much coverage<br/>\nfrom that as you can, so that you can use that to help verify that<br/>\nyour changes are not breaking the system behaviour that is currently<br/>\nworking. But often you just have to live with the pain of breaking<br/>\nuntested things as you modify the application. That&#39;s unfortunate, but<br/>\nsince you break the application anyway every time you touch it, if the<br/>\ncurrent situation calls for continuing modifications in the future<br/>\nyou&#39;re going to be breaking it anyway. You might as well be using the<br/>\nneed for changes to try and bring the application into a more testable<br/>\nstate.<br/>\n<br/>\nThe key here, I&#39;ve found, is just clean up the bits you are directly<br/>\ntouching as you add features and fix bugs. Keep the changes to other<br/>\nparts of the system as minimal as possible, and don&#39;t go changing<br/>\nsomething just for the sake of adding testing to it. If a particular<br/>\npiece of code really is broken, you&#39;ll have a bug report and thus a<br/>\nreason to go changing it.<br/>\n<br/>\ncjs<br/>\n-- <br/>\nCurt Sampson  &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cjs@...\">cjs@...</a>&gt;   +81 90 7737 2974   <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.netbsd.org\">http://www.netbsd.org</a><br/>\n    Don&#39;t you know, in this new Dark Age, we&#39;re all light.  --XTC</div>", 
    "prevInTime": 6916, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1044783615", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 6910, 
    "headers": {
        "inReplyToHeader": "PDNFNDQ0MUQ3LjgwQTUxRTdFQHN1bi5jb20+", 
        "messageIdInHeader": "PFBpbmUuTkVCLjQuNTEuMDMwMjA5MTgzNDMxMC41NzBAYW5nZWxpYy5jeW5pYy5uZXQ+", 
        "referencesHeader": "PEtJRUhJQklPQkFFTEpBSElQTkhETUVNTkNPQUEuc2NvdHRzdGlybGluZ0ByY24uY29tPiA8M0U0MDJGQzkuODM0NTU3NzZAc3VuLmNvbT4gPDNFNDQ0MUQ3LjgwQTUxRTdFQHN1bi5jb20+"
    }
}