{
    "numMessagesInTopic": 41, 
    "nextInTime": 6930, 
    "senderId": "giWpMf3CLfNbRFjOcZOg4vt0L6rImcoMquHtAcgz7VPqq41VY_taODuWJfkmlderCIkG1Z0tjFU", 
    "systemMessage": false, 
    "subject": "Re: [junit] Programmer Tests and the Database", 
    "from": "john.link@...", 
    "authorName": "john.link@gmx.net", 
    "msgSnippet": "... Having read the last 20 or so messages on the subject I see a common theme: Keep together what changes together. However, what changes together might be ", 
    "msgId": 6929, 
    "profile": "jlinkyh", 
    "topicId": 6711, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 34183400, 
    "messageBody": "<div id=\"ygrps-yiv-1096814635\"><blockquote><span title=\"ireply\">&gt; &gt;Well, true...but how you get away with not changing the SQL for long<br/>\n&gt; &gt;periods is beyond me. I&#39;ve never done serious develoment on a system<br/>\n&gt; &gt;with a lot of database code where the database wasn&#39;t changing all the<br/>\n&gt; &gt;time. But we probably just tend to work on different styles of<br/>\n&gt; projects.<br/>\n&gt; <br/>\n&gt; If I change the SQL statements, then I test the new statements as<br/>\n&gt; needed. That&#39;s why I put them in one place, to make them easier to test<br/>\n&gt; all at once and in isolation from the rest of the system.<br/>\n<br/>\n </span></blockquote>Having read the last 20 or so messages on the subject I see a common theme:<br/>\nKeep together what changes together. However, what changes together might be<br/>\ncompletely different in different development scenarios. Two examples:<br/>\n- If you are developing a new application and you have full control over the<br/>\nDB schema, a change in the domain model will most probably entail a<br/>\ncorresponding (and easy to recognize) change in the schema and thus entail a change<br/>\nin the SQL sattements. It then makes perfect sense IMO to keep domain code and<br/>\nSQL close together (eg. in an inner class as suggested).<br/>\n- If you develop an application on top of an existing database over which<br/>\nyou have no control you probably need a dedicated layer to map your objects<br/>\nonto the RDBMS. Then the code in the three layers (domain, mapping, database)<br/>\nwill have different reasons for change, so it should be kept separately.<br/>\n<br/>\nYou&#39;re facing even more differences if you develop for 2,3 or 4 DBMS.<br/>\nMoreover, the development scenario is likely to change one day, eg. as soon as the<br/>\napplication is in production you cannot change the schema easily any more.<br/>\nThis change of situation might force you to change your policy of where to put<br/>\nyour SQL.<br/>\n<br/>\nMy point in short: There&#39;s no single best way where to put the SQL.<br/>\n<br/>\nJohannes<br/>\n<br/>\n<br/>\n-- <br/>\n+++ GMX - Mail, Messaging & more  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gmx.net\">http://www.gmx.net</a> +++<br/>\nNEU: Mit GMX ins Internet. Rund um die Uhr für 1 ct/ Min. surfen!</div>", 
    "prevInTime": 6928, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1044955957", 
    "canDelete": false, 
    "nextInTopic": 6947, 
    "prevInTopic": 6925, 
    "headers": {
        "messageIdInHeader": "PDI5Mzg4LjEwNDQ5NTU5NTdAd3d3MjkuZ214Lm5ldD4=", 
        "referencesHeader": "PDIwMDMwMjEwMjE1ODA1MDMzNC4xMDM1RkE3QUBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4="
    }
}