{
    "numMessagesInTopic": 13, 
    "nextInTime": 6985, 
    "senderId": "ZVWvKQ7W7JG7LOEteHqWLtspnmEbG_KRxeS1gpShJqqS6SWyb2g7ilmFUMelxBEKHXtZl7PjyDj42hdRSwkjX_TbibC6mSIfxBceHCmbFQ", 
    "systemMessage": false, 
    "subject": "RE: [junit] Management wants to know ...", 
    "from": "&quot;Scott Stirling&quot; &lt;scottstirling@...&gt;", 
    "authorName": "Scott Stirling", 
    "msgSnippet": "... J.B. Rainsberger has a nice phrase to answer this: Test until fear turns to boredom.  That s one way to think about it. There are so many types of", 
    "msgId": 6984, 
    "profile": "jrun5", 
    "topicId": 6975, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 112036634, 
    "messageBody": "<div id=\"ygrps-yiv-1187130058\"><blockquote><span title=\"ireply\">&gt; -----Original Message-----<br/>\n&gt; From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tumb@...\">tumb@...</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tumb@...\">tumb@...</a>]<br/>\n&gt;<br/>\n&gt; Is there any recommended (or better yet documented) ideal level of<br/>\n&gt; testing?<br/>\n<br/>\n </span></blockquote>J.B. Rainsberger has a nice phrase to answer this: &quot;Test until fear turns to<br/>\nboredom.&quot;  That&#39;s one way to think about it.<br/>\n<br/>\nThere are so many types of testing, there is no one ideal level.  I mean<br/>\nthere&#39;s unit testing, subsystem testing, integration testing, various types<br/>\nof load testing (performance, stress, reliability, scalability), install and<br/>\nconfiguration testing, etc.<br/>\n<br/>\nThere are a few metrics that can be a good guide though.<br/>\n<br/>\n1. Code coverage analysis.  Everyone will say 100% code coverage is ideal.<br/>\nThey won&#39;t always say 100% what -- line, method, branch, path?  But in my<br/>\nexperience 100% coverage of any kind never gets done in reality (maybe the<br/>\nnext product I work on!).  70% statement coverage is very good for a new<br/>\nserver-side software product of 200K lines of code, in my experience.  Maybe<br/>\nit&#39;s easier for GUI programs.<br/>\n<br/>\n2. McCabe&#39;s metric (aka, cyclomatic complexity -- based on the number of<br/>\nbranches possible in a method).  This metric along with lines of code<br/>\nmetrics, actually, can be a guide to how many bugs you should find in a<br/>\npiece of code (more if it&#39;s new code, less if it&#39;s tried and true, reused<br/>\ncode).  But it&#39;s just a heuristic.  Can&#39;t be relied on for more than a guide<br/>\nfor where you should focus your tests.<br/>\n<br/>\n3. Bug metrics.  If you track bugs and you can get reports from the bug<br/>\ntracker somehow, look at bug entry and fix trends.  Bug finding, represented<br/>\nby new bugs entered, should slow down prior to shipping the product.  If<br/>\nthere&#39;s no sign of slowing, and QA is finding good bugs, then you obviously<br/>\ncan&#39;t have much confidence in the quality of the software.  The rate of bug<br/>\nfixing should also slow down and stabilize prior to shipping, because<br/>\nroughly 1 out of 4 bug fixes introduces a regression or a new bug.  So QA<br/>\nneeds time to re-test software after it&#39;s been fixed.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Our company is working on adopting XP and perhaps test driven practises.<br/>\n&gt; We have a question about whether certain groups are testing too little or<br/>\n&gt; too much. How, if at all, do you determine what&#39;s too little or too much?<br/>\n<br/>\n </span></blockquote>You should really check out the <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:testdrivendevelopment@yahoogroups.com\">testdrivendevelopment@yahoogroups.com</a> group.<br/>\nThere&#39;s a currently a discussion about how TDD is more about design than<br/>\ntesting.<br/>\n<br/>\nScott Stirling</div>", 
    "prevInTime": 6983, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1045614349", 
    "canDelete": false, 
    "nextInTopic": 6986, 
    "prevInTopic": 6982, 
    "headers": {
        "inReplyToHeader": "PDIwMDMwMjE4LjE1MjExNy4tMTI3NDQ5LjE1LnR1bWJAanVuby5jb20+", 
        "messageIdInHeader": "PEtJRUhJQklPQkFFTEpBSElQTkhEQ0VGUENQQUEuc2NvdHRzdGlybGluZ0ByY24uY29tPg=="
    }
}