{
    "numMessagesInTopic": 2, 
    "nextInTime": 6993, 
    "senderId": "vCTee9S61ayRR7BunufwctLGzjXxMulkCJNAO8gWSvWkEZNJznqiaTar2Ga2J6Ish-zMsAQ0AGJPCdpMIQzTT0Kxhxin-3cQfNz2HaRDVmwH", 
    "systemMessage": false, 
    "subject": "Re: [junit] Effectiveness of Testing ....", 
    "from": "&quot;Lauren Bish&quot; &lt;developerdude@...&gt;", 
    "authorName": "Lauren Bish", 
    "msgSnippet": "... From: Manish P  ... I have found that determining the reasons why a particular bug made it through a test cycle need not", 
    "msgId": 6992, 
    "profile": "gs_nomad", 
    "topicId": 6987, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 117292773, 
    "messageBody": "<div id=\"ygrps-yiv-1397045523\"><blockquote><span title=\"qreply\">----- Original Message -----<br/>\nFrom: &quot;Manish P&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:manish_the_friend@...\">manish_the_friend@...</a>&gt;<br/>\n<br/>\n&gt; In our organisation we typically face problem of<br/>\n&gt; evaluating Testing effectiveness.<br/>\n&gt; The scenario is a bit different. In our organisation<br/>\n&gt; testing is evolving. Additionally there is a common<br/>\n&gt; problem of Devlopment Vs Testing arguments. In any<br/>\n&gt; regression round if a new bug comes in then the issue<br/>\n&gt; raised will be why this bug was not identified in<br/>\n&gt; previous round though it will be fixed later.<br/>\n<br/>\nI have found that determining the reasons why a particular bug made it<br/>\nthrough a test cycle need not be complex or formal beyond having a tester<br/>\n(be they developer or dedicated tester) consider the cause of the bug and<br/>\nadd it to their test suite. As time progresses testing patterns evolve -<br/>\nsome may be general patterns that apply to most testing efforts, some may<br/>\nonly apply to a specific codebase - but I don&#39;t think to much consideration<br/>\nshould be given to post mortems of single bugs. Once a project or at least a<br/>\nmilestone is over, then maybe a given set of or class of bugs could be post<br/>\nmortemed and both coding practices and test suites updated/adjusted.<br/>\n<br/>\n&gt; We thought over and looked into the possibility of<br/>\n&gt; checking effectiveness of testing.<br/>\n<br/>\nI think such things as coverage metrics and overall number of bugs (or their<br/>\nseverity) will tell you more about test effectiveness than looking at<br/>\nindividual bugs that make it past a testing effort.<br/>\n<br/>\n&gt; As the process is still evolving Testing gets less amount of inputs ...<br/>\n&gt; in all sense - time, resource, documents, functional<br/>\n&gt; training... !<br/>\n<br/>\nI am not sure what you are saying here. As processes evolve testing should<br/>\nrequire less information input as the requirements become clearer and more<br/>\nspecific, but probably more resources (everybody, developers and testers<br/>\nalike, underestimate resource allotments).<br/>\n<br/>\n&gt;<br/>\n&gt; My question is, in such constraints how one can<br/>\n&gt; measure and control the effectiveness of Testing?<br/>\n<br/>\nI more or less covered it in my first post.<br/>\n<br/>\n&gt; This is typically for Manual Testing. The issue of<br/>\n&gt; Automated Testing remains apart ... :)<br/>\n&gt;<br/>\n<br/>\nIf you mean automated unit testing, then I don&#39;t think that is very much<br/>\ndifferent than manual unit testing in nature; the latter eventually becomes<br/>\nthat latter. If you mean system or GUI testing, then that is a different<br/>\nissue and probably a bit off-topic for this list, but I have found that the<br/>\nearlier you test (TDD and/or unit testing), the more manageable &quot;manual&quot;<br/>\ntesting (anything that can&#39;t be automated) becomes.<br/>\n<br/>\nFWIW,<br/>\nLauren<br/>\n<br/>\n=====<br/>\nLooking for an experienced Java/C++ Software Engineer?<br/>\nSee: <a rel=\"nofollow\" target=\"_blank\" href=\"http://developerdude.mystarband.net/resume.html\">http://developerdude.mystarband.net/resume.html</a> </span></blockquote></div>", 
    "prevInTime": 6991, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1045630463", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 6987, 
    "headers": {
        "messageIdInHeader": "PDAxNTUwMWMyZDdkMyQ2NDA1Mzc5MCQwMzlhNDA5NEBHb3J0Pg==", 
        "referencesHeader": "PDIwMDMwMjE5MDQyMTEzLjMxMTY5LnFtYWlsQHdlYjgwMDUubWFpbC5pbi55YWhvby5jb20+"
    }
}