{
    "numMessagesInTopic": 22, 
    "nextInTime": 7018, 
    "senderId": "6pItJdkOa9nISQ1GQacD2FrzxFFp0Qh55LxWfgw8qRuErHS34JAkvgOsTi8GMeLFx9nvWfMffK_e_pN12g6WWWv9KAULHcU7C_VjMldVuDb8", 
    "systemMessage": false, 
    "subject": "Re: [junit] Digest Number 778", 
    "from": "&quot;Lauren Bish&quot; &lt;developerdude@...&gt;", 
    "authorName": "Lauren Bish", 
    "msgSnippet": "... From: J. B. Rainsberger  ... That is all true - but I didn t say that a dedicated unit tester s purpose was to replace TDD -", 
    "msgId": 7017, 
    "profile": "gs_nomad", 
    "topicId": 7008, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 117292773, 
    "messageBody": "<div id=\"ygrps-yiv-1830834380\"><blockquote><span title=\"qreply\">----- Original Message -----<br/>\nFrom: &quot;J. B. Rainsberger&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jbr@...\">jbr@...</a>&gt;<br/>\n<br/>\n<br/>\n&gt;<br/>\n&gt; Hear, hear.<br/>\n&gt;<br/>\n&gt; The goal of Programmer Tests is to for the programmer to:<br/>\n&gt;<br/>\n&gt; * have tangible evidence of progress<br/>\n&gt; * clarify the needs of the design<br/>\n&gt; * &quot;eat his own dog food&quot; by being forced to write client code before<br/>\n&gt; writing provider code<br/>\n&gt; * keep focus on small steps<br/>\n&gt; * avoid writing too much code in one flow<br/>\n&gt;<br/>\n&gt; I don&#39;t see how a dedicated unit tester can make that happen for a<br/>\n&gt; programmer.<br/>\n<br/>\nThat is all true - but I didn&#39;t say that a dedicated unit tester&#39;s purpose<br/>\nwas to replace TDD - what I said was that the dedicated unit tester helped<br/>\nin getting more and better tests earlier. A dedicated unit tester also helps<br/>\nintroduce the concept and value of unit and early testing to teams,<br/>\nmanagement, companies and developers. This helps get your foot in the door.<br/>\nYou have to remember that there are a lot of companies out there that don&#39;t<br/>\npractice XP or even halfway decent practices, and you can&#39;t make them<br/>\nswallow XP or TDD all in one gulp. The purpose of any good practice is to<br/>\nimprove the quality of software, but you can&#39;t accomplish that in one fell<br/>\nswoop.<br/>\n<br/>\n&gt;<br/>\n&gt; What I *can* see is how a dedicated tester can think of tests that the<br/>\n&gt; programmer didn&#39;t need to drive the design, or just plain missed.<br/>\n&gt; Still, a dedicated unit tester seems to aim at the wrong spot. A<br/>\n&gt; dedicated integration tester or end-to-end tester seems about right.<br/>\n&gt;<br/>\n<br/>\nEarly testing has a value all its own, whether it is accomplished by TDD, or<br/>\ndedicated unit testers or both. As I said in original post, developers<br/>\ntypically don&#39;t have the aptitude, attitude or experience to write good test<br/>\ncases. TDD is great, but if the quality of the tests the developer writes<br/>\nsuck, then bugs in the design and the code are going to make it through.<br/>\nThat is where a dedicated unit tester shines; they serve as an independent<br/>\nand fresh unbiased set of eyes on the code/design. If you just assume that<br/>\nthe tests written by developers during TDD were good enough, and then wait<br/>\nuntil integration or system testing to test again, you are going to be<br/>\nsurprised by an existing bugs that you could have probably caught earlier.<br/>\nYou will also be risking big-bang integration, or at least one aspect of it.<br/>\n<br/>\nI have been on both sides of the fence; I have equal years experience in<br/>\nboth QA/Testing and on the development side of the software engineering<br/>\nfence (15+ years in all), and typically, a developer will not test their own<br/>\ncode as well or as thoroughly as an independent tester - especially a good<br/>\ntester who has the right attitude.<br/>\n<br/>\nDevelopment/writing code is essentially a creative process, and a creative<br/>\nattitude is usually the result. Testing is a destructive process and it<br/>\noften takes a destructive attitude (and aptitude) to properly test software.<br/>\nSome developers can do it, but usually not right off the bat - many<br/>\ndevelopers never truly get the hang of it. TDD is good, but it does not<br/>\nobviate the need for further testing, and as with all testing, the earlier<br/>\nit is done, the earlier you will find bugs - and that is a &quot;good thing&quot;.<br/>\n<br/>\n&gt; I feel appropriately inspired. Let me write the article, then I&#39;ll be<br/>\n&gt; back. :)<br/>\n<br/>\nI don&#39;t see the need. As I said I don&#39;t see a conflict between TDD and<br/>\nindependent unit testing. The two can coexist. The only danger I would see<br/>\nwith both coexisting is that the developer may adopt the attitude that since<br/>\nthere is an independent unit tester, that there is no reason for him/her to<br/>\ndo TDD. That is a mistake in comprehension, logic and a flawed conclusion -<br/>\nit requires education, not the elimination of independent unit testing. The<br/>\nsame could be said for any kind of testing right? After all, why do<br/>\nintegration or system testing if we already did TDD? TDD catches all bugs<br/>\nanyway right? Why bother with further testing? Wrong!<br/>\n<br/>\nIf I had developers that wrote poor tests because they felt the unit testers<br/>\nwould catch the bugs anyway, I would probably approach the situation the<br/>\nsame as if I had a developer who wrote poor code because testers would<br/>\nsooner or later find any bugs. If they couldn&#39;t be made to see the wisdom of<br/>\nearly testing and TDD, then I would probably replace them with someone who<br/>\ndid.<br/>\n<br/>\nNow maybe some people out there have a unique team of developers who really<br/>\ndo write such good tests during TDD that an independent unit tester would<br/>\njust be a waste of time. Kewl! Good for you! Then don&#39;t waste the time. But<br/>\nI live in the real world where developers don&#39;t write good tests, especially<br/>\nfor their own code. I also live in a world where management and developers<br/>\nare often resistant to XP practices (hell, even I don&#39;t really care for<br/>\nPaired Programming).<br/>\n<br/>\nThe original question was not about TDD vs. independent unit testing, the<br/>\noriginal question was how do you justify either one to management and<br/>\nproject teams. The fact that the question was asked indicates a problem that<br/>\nI suggested a possible way to get your foot in the door. Unless you are<br/>\nstarting a new company, or a new team, and you are starting a new project,<br/>\nyou often have to find a way to ease these practices in the back door. Most<br/>\nof us don&#39;t have the luxury or ability of starting anew from scratch, and we<br/>\nhave to get management and recalcitrant developers to buy into new ideas.<br/>\n<br/>\nAlso, as I said, don&#39;t make the mistake of hubris in thinking that TDD is<br/>\ngoing to find all the bugs and that an independent unit tester wouldn&#39;t find<br/>\nat least some also - I dare say that an independent unit tester would<br/>\nprobably find numerous bugs. Hire me and I will prove it to you. ;-)<br/>\n<br/>\nFWIW,<br/>\nLauren<br/>\n<br/>\n=====<br/>\nLooking for an experienced Java/C++ Software Engineer?<br/>\nSee: <a rel=\"nofollow\" target=\"_blank\" href=\"http://developerdude.mystarband.net/resume.html\">http://developerdude.mystarband.net/resume.html</a> </span></blockquote></div>", 
    "prevInTime": 7016, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1045865749", 
    "canDelete": false, 
    "nextInTopic": 7018, 
    "prevInTopic": 7016, 
    "headers": {
        "messageIdInHeader": "PDAzNzAwMWMyZDlmNyQzY2U5NTdiMCQwMzlhNDA5NEBHb3J0Pg==", 
        "referencesHeader": "PDIwMDMwMjIxMjA1OTM5LjE5ODc5LnFtYWlsQHdlYjExMTA2Lm1haWwueWFob28uY29tPiA8MjAwMzAyMjExNjI4MTIwNTIyLjAwNzFDNTc5QHNzbXRwLmJsb29yLmlzLm5ldC5jYWJsZS5yb2dlcnMuY29tPg=="
    }
}