{
    "numMessagesInTopic": 22, 
    "nextInTime": 7021, 
    "senderId": "L_t7RCxTFz1s4x0LtQ2O3oZ_8_Ywi-eBfMluLDwVbtcD53gOOQ346wX7_FETw3Ph2CdbrQxo5N88UgThcfeGZIDe9iXadpHBGEgPl1JYLn8K", 
    "systemMessage": false, 
    "subject": "Re: [junit] Digest Number 778", 
    "from": "&quot;Lauren Bish&quot; &lt;developerdude@...&gt;", 
    "authorName": "Lauren Bish", 
    "msgSnippet": "... From: J. B. Rainsberger  ... Well, like I said, I have seen the use of unit testing be a foot in the door - or part of one", 
    "msgId": 7020, 
    "rawEmail": "Return-Path: &lt;developerdude@...&gt;\r\nReceived: (qmail 50069 invoked by uid 7800); 22 Feb 2003 13:58:01 -0000\r\nX-Sender: developerdude@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_3_4); 22 Feb 2003 00:25:13 -0000\r\nReceived: (qmail 2284 invoked from network); 22 Feb 2003 00:25:13 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m14.grp.scd.yahoo.com with QMQP; 22 Feb 2003 00:25:13 -0000\r\nReceived: from unknown (HELO apollo.email.starband.net) (148.78.247.23)\n  by mta2.grp.scd.yahoo.com with SMTP; 22 Feb 2003 00:25:13 -0000\r\nReceived: from Gort (vsat-148-64-154-3.c005.g4.mrt.starband.net [148.64.154.3])\n\tby apollo.email.starband.net (8.12.4/8.12.4) with SMTP id h1M0OxH5026982\n\tfor &lt;junit@yahoogroups.com&gt;; Fri, 21 Feb 2003 19:25:05 -0500\r\nMessage-ID: &lt;039201c2da09$55351c20$039a4094@Gort&gt;\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nReferences: &lt;20030221205939.19879.qmail@...&gt; &lt;200302211628120522.0071C579@...&gt; &lt;037001c2d9f7$3ce957b0$039a4094@Gort&gt; &lt;200302211849140460.0010FBE4@...&gt;\r\nSubject: Re: [junit] Digest Number 778\r\nDate: Fri, 21 Feb 2003 16:24:11 -0800\r\nMIME-Version: 1.0\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Priority: 3\r\nX-MSMail-Priority: Normal\r\nX-Mailer: Microsoft Outlook Express 6.00.2800.1106\r\nX-MimeOLE: Produced By Microsoft MimeOLE V6.00.2800.1106\r\nFrom: &quot;Lauren Bish&quot; &lt;developerdude@...&gt;\r\nX-Yahoo-Group-Post: member; u=117292773\r\nX-Yahoo-Profile: gs_nomad\r\nX-eGroups-Approved-By: nails762 &lt;jbr@...&gt; via email; 22 Feb 2003 13:58:01 -0000\r\n\r\n----- Original Message -----\nFrom: &quot;J. B. Rainsberger&quot; &lt;jbr@...&gt;\n\n\n\n&gt; Oh, I know. I&#39;ve worked for them. I&#39;m in the XPAdoption group, trying\n&gt; to figure out how to change all that. I&#39;m convinced that the only thing\n&gt; to do is to start my own shop, but I don&#39;t have the business and\n&gt; marketing knowledge to run it, nor do I have the funds to pay someone\n&gt; else to run it on day one.\n\nWell, like I said, I have seen the use of unit testing be a &quot;foot in the\ndoor&quot; - or part of one anyway; I worked for a company that went from doing\nalmost no testing, to adopting many XP practices and having developers write\nunittests for their own code before checking it in. Some even did TDD. Part\nof the foot in the door was that the project was a whole new practice that\nthe project manager convinced management to let him use some XP practices,\nmixed in with things like JAD and so on. It worked out fairly well for a\nfirst attempt. Everyone involved agreed that unit testing and XP practices\nwere a significant factor in the quality of the end result - which was a\nvery high quality product. QA was especially pleased that they had so much\ninput from the beginning and that most of the bugs they found were not of\nthe kind that should have been found earlier.\n\nI have always been a believer in early testing, but that project gave me the\nexperience in a situation where the abandoning the old bad practices and\nadopting the new good practices resulted in a difference like night and day.\n\n&gt; No argument there. My concern is that everyone wants to test, but not\n&gt; everyone has the same goals. In this case, I think it&#39;s important to\n&gt; identify each person&#39;s (role&#39;s?) goals, then partition the work in a\n&gt; way that there is sufficient overlap for crosschecking, but not so much\n&gt; that we&#39;re all doing Solo Testing, but duplicating effort.\n\nIn my experience most people don&#39;t want to test. Hell I got burnt out on it\nafter 7 years of doing nothing but QA and testing. Even people who write\nunit code tests would rather develop production code than write test code (I\nam happy doing either, but happier writing production code). In the project\nI was involved in there wasn&#39;t a wall between the dedicated tester and the\nproduction developer; we usually paired a tester with 1-2 developers, the\ndevelopers serving as mentors of a sort with regards to teaching these\npeople how to code. Many of them were people we brought in with the idea\nthat eventually they would be writing production code themselves, and many\nof them eventually did - but by then they knew the value of unit testing and\ndefensive programming, and were more amenable to concepts such as TDD.\n\nSo, there was no real duplication of effort; unit testers more or less\npicked up where developers had left off and added to or extended their unit\ntesting efforts. The unit testers also learned the codebase, and hopefully\nlearned food coding practices by being under the wing of more experienced\ndevelopers.\n\n\n&gt; I might approach the situation by explaining that the tests in TDD are\n&gt; not meant to test, but rather the guide the design. In that light,\n&gt; surely outside testing looks like a good idea.\n&gt;\n\nI don&#39;t know that I would call it &quot;outside&quot; testing. We had a very\nintegrated team; in that project you were not a member of QA, a member of\ndevelopment, or a member of marketing - you were a member of the team with a\ncertain expertise that the project needed. We had unit testers and we had\nintegration system testers, and everybody was one big happy family. ;-)\n\n&gt; This is where my ignorance shines. I don&#39;t know how to convince anyone\n&gt; of anything, so I&#39;m content to let others try to do it.\n\nI have found that leading by example with gentle persuasion generally works\nwell. Sometimes I have had to leave companies because few people there &quot;got\nit&quot;, and it was a lost cause until someone in power came in and turned\nthings around or upside down. It can take years for good practices to be\nadopted and it takes patience. As long as there is progress and a\ncommittment to improvement, then I can feel that I am accomplishing\nsomething.\n\n&gt; Well, of course TDD won&#39;t find all the bugs. TDD isn&#39;t about finding\n&gt; bugs.\n\nThen we are in agreement. Early testing, properly managed can accomplish a\nhigher quality product - and so I think there is room for a unit testing\neffort that works in cooperation with TDD. I have seen it work and the\nresults were much better than waiting for testing to get involved later.\n\nFWIW,\nLauren\n\n=====\nLooking for an experienced Java/C++ Software Engineer?\nSee: http://developerdude.mystarband.net/resume.html\n\n\n\n\n\n", 
    "profile": "gs_nomad", 
    "topicId": 7008, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 117292773, 
    "prevInTime": 7019, 
    "contentTrasformed": false, 
    "postDate": "1045873451", 
    "canDelete": false, 
    "nextInTopic": 7021, 
    "prevInTopic": 7019, 
    "headers": {
        "messageIdInHeader": "PDAzOTIwMWMyZGEwOSQ1NTM1MWMyMCQwMzlhNDA5NEBHb3J0Pg==", 
        "referencesHeader": "PDIwMDMwMjIxMjA1OTM5LjE5ODc5LnFtYWlsQHdlYjExMTA2Lm1haWwueWFob28uY29tPiA8MjAwMzAyMjExNjI4MTIwNTIyLjAwNzFDNTc5QHNzbXRwLmJsb29yLmlzLm5ldC5jYWJsZS5yb2dlcnMuY29tPiA8MDM3MDAxYzJkOWY3JDNjZTk1N2IwJDAzOWE0MDk0QEdvcnQ+IDwyMDAzMDIyMTE4NDkxNDA0NjAuMDAxMEZCRTRAc3NtdHAuYmxvb3IuaXMubmV0LmNhYmxlLnJvZ2Vycy5jb20+"
    }
}