{
    "numMessagesInTopic": 13, 
    "nextInTime": 7023, 
    "senderId": "r8uzCE7akncLAxjNZDo8pMLhkic8SuN5p2NYOVdCGciJVDWogYVOEb6G3vk7m4N_y0zoBtYF1XZenJdBkFCSbhKLOUA604y7nr0TaY0x", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: one-time setup", 
    "from": "Eric Armstrong &lt;eric.armstrong@...&gt;", 
    "authorName": "Eric Armstrong", 
    "msgSnippet": "Hey, Bill. Glad to hear from you again. Long time since JavaOne and JavaWorld. It s good to know that I wasn t the only one confused by the overloading of the", 
    "msgId": 7022, 
    "rawEmail": "Return-Path: &lt;eric.armstrong@...&gt;\r\nReceived: (qmail 24689 invoked by uid 7800); 22 Feb 2003 13:58:06 -0000\r\nX-Sender: eric.armstrong@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_3_4); 22 Feb 2003 04:41:29 -0000\r\nReceived: (qmail 48133 invoked from network); 22 Feb 2003 04:41:29 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m8.grp.scd.yahoo.com with QMQP; 22 Feb 2003 04:41:29 -0000\r\nReceived: from unknown (HELO patan.sun.com) (192.18.98.43)\n  by mta3.grp.scd.yahoo.com with SMTP; 22 Feb 2003 04:41:29 -0000\r\nReceived: from ha1sca-mail1.SFBay.Sun.COM ([129.145.155.51])\n\tby patan.sun.com (8.9.3+Sun/8.9.3) with ESMTP id VAA10007\n\tfor &lt;junit@yahoogroups.com&gt;; Fri, 21 Feb 2003 21:41:28 -0700 (MST)\r\nReceived: from sun.com (d-usca14-129-126 [129.145.129.126])\n\tby ha1sca-mail1.SFBay.Sun.COM (8.11.6+Sun/8.10.2/ENSMAIL,v2.1p1) with ESMTP id h1M4fRh00048\n\tfor &lt;junit@yahoogroups.com&gt;; Fri, 21 Feb 2003 20:41:27 -0800 (PST)\r\nMessage-ID: &lt;3E56FF7C.47E13A29@...&gt;\r\nDate: Fri, 21 Feb 2003 20:41:32 -0800\r\nX-Mailer: Mozilla 4.8 [en] (Windows NT 5.0; U)\r\nX-Accept-Language: en\r\nMIME-Version: 1.0\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] Re: one-time setup\r\nReferences: &lt;b360nm+vplk@...&gt;\r\nContent-Type: text/plain; charset=us-ascii\r\nContent-Transfer-Encoding: 7bit\r\nFrom: Eric Armstrong &lt;eric.armstrong@...&gt;\r\nX-Yahoo-Group-Post: member; u=78994084\r\nX-Yahoo-Profile: ericsilverlight\r\nX-eGroups-Approved-By: nails762 &lt;jbr@...&gt; via email; 22 Feb 2003 13:58:06 -0000\r\n\r\nHey, Bill. Glad to hear from you again.\nLong time since JavaOne and JavaWorld.\n\nIt&#39;s good to know that I wasn&#39;t the only one confused by the\noverloading of the word &quot;test&quot;. My next major hurdle is getting\na good handle on the process of TDD -- the paradigm shift\nlooks as big as shyifting into O-O thinking. (I seem to be having\nas much trouble doing it, at least.)\n\nAltima looks pretty interesting. I like the separation of reporting\nfrom testing, and the runpath idea. The short summary doesn&#39;t\nreally tell me what a recipe file is good for, though. I guess I need\nto know more about the possible &quot;run properties of a particular\nsuite&quot;, and why I would want to use them.\n\nMost of all, I&#39;m looking forward to understanding more about\nhow it &quot;can help developers create unit and conformance tests&quot;.\n\n...And to understanding more about how to do TDD well in the\nfirst place.\n\nIt&#39;s funny, on my last project I had the sudden realization that\n&quot;document-driven design&quot; (requirements gathering, really) was\nthe right way to go. And it worked. It did a dynamite job of\ngathering the requirements and generating the program&#39;s user\nguide, in tandem with the design notes. So, even while the design\nwas evolving, I knew where I needed to go. (And as additional\nquestions came up, I had a place to record the answers.)\n\nThe interesting thing, though, is that while the process &quot;works&quot;,\nI would have a very difficult time describing *how* it works.\nTDD seems a lot like that. It&#39;s something that works well when\nyou really understand it, but something that at the same time\nappears to be very difficult to describe!\n\n&quot;billvenners &quot; wrote:\n\n&gt;  Eric,\n&gt;\n&gt; &gt; Somehow, I was under the impression that each test\n&gt; &gt; in a test case started with a &quot;clean slate&quot; -- that the\n&gt; &gt; setup code was re-run for each test method.\n&gt; &gt;\n&gt; &gt; But that doesn&#39;t appear to be the case. The test object\n&gt; &gt; created during setup turned out to be reused for\n&gt; &gt; subsequent tests in the test case, which caused problems\n&gt; &gt; arising from old state, until I figured it out.\n&gt; &gt;\n&gt; &gt; Now, for performance, it only makes sense that a fixture\n&gt; &gt; would be reused for each test in a test case class. So I&#39;m\n&gt; &gt; not suggesting that the implementation is wrong.\n&gt; &gt;\n&gt; For a long time my impression was that an instance of TestCase is\n&gt; created, and all test methods are invoked on that same instance. The\n&gt; reason I thought this was that it seemed like the natural way to do\n&gt; it to me, plus it justified the existence of setUp. Given fixtures\n&gt; are usually instance data, a method like setUp is needed only if you\n&gt; are going to reuse the same instance on multiple test methods, and\n&gt; some of those test methods may destroy the fixture.\n&gt;\n&gt; While looking through JUnit&#39;s source code, I discovered that JUnit\n&gt; creates a new instance for each test method when it runs. So then I\n&gt; got to wondering what setUp was really there for, because if you are\n&gt; going to create a new TestCase instance for each test method, then\n&gt; you could use the constructor to initialized the fixture.\n&gt;\n&gt; Last year I created a testing toolkit similar to JUnit, Artima\n&gt; SuiteRunner, that also serves as a JUnit runner to run JUnit test\n&gt; suites. What I ended up doing in SuiteRunner was running all the test\n&gt; methods on the same Suite instance, calling setUpFixture and\n&gt; tearDownFixture before and after each test method. SuiteRunner is\n&gt; free and open source:\n&gt;\n&gt; http://www.artima.com/suiterunner/\n&gt;\n&gt; I&#39;m curious if anyone out there has some kind of dependency on\n&gt; JUnit&#39;s approach of creating a new TestCase instance for each test\n&gt; method.\n&gt;\n&gt; &gt; But I read the docs at the main site, and I&#39;ve been following\n&gt; &gt; these threads for quite a while, and still I had a dead-wrong\n&gt; &gt; impression of what&#39;s going on.\n&gt; &gt;\n&gt; &gt; For example, in the FAQ, q2 &quot;How do I use a text fixture?&quot;\n&gt; &gt; says:\n&gt; &gt;    &quot;Each test runs in its own test fixture to isolate tests from the\n&gt;\n&gt; &gt;    changes made by other tests. Because the tests are isolated,\n&gt; &gt;    they can be run in any order.... The JUnit framework\n&gt; &gt;    automatically invokes the setUp() method before each test is\n&gt; &gt;    run and the tearDown() method after each test is run.&quot;\n&gt; &gt;\n&gt; &gt; Now for &quot;test&quot;, I was reading &quot;test *method*&quot;. As in testX(),\n&gt; &gt; testY(). But my recent epiphany suggests that I should have\n&gt; &gt; been reading it as &quot;test *case*&quot;, as in &quot;test-case class&quot;. And\n&gt; &gt; since the example shows a single test case class, with multiple\n&gt; &gt; test methods in it, it was easy to make that assumption.\n&gt; &gt;\n&gt; &gt; Note:\n&gt; &gt; In general, I&#39;m not much fond of the name, &quot;TestCase&quot;, because\n&gt; &gt; to me that represents a single test. Since a TestCase class can\n&gt; &gt; actually have multiple test methods, the name &quot;TestFixture&quot; is\n&gt; &gt; probably more appropriate. But be that as it may...\n&gt; &gt;\n&gt; &gt; It appears to me that the word &quot;test&quot; is badly overloaded in the\n&gt; &gt; docs, meaning at various times, test method, test case, and\n&gt; &gt; potentially even test suite.\n&gt; &gt;\n&gt; &gt; The best way to eliminate confusion that I can see is to do a\n&gt; &gt; global search on &quot;test &quot;, and replace with one of the hyphenated\n&gt; &gt; words &quot;test-method&quot;, &quot;test-case&quot;, or &quot;test-suite&quot;, as appropriate.\n&gt;\n&gt; I too was confused by JUnit&#39;s overloading of the word test. There&#39;s a\n&gt; Test interface, and a both TestCase and a TestSuite implement Tests.\n&gt; So it looks conceptually like test cases and test suites are two\n&gt; kinds of tests. But test methods also seem to be tests. I wasn&#39;t sure\n&gt; what JUnit&#39;s notion of the concept of &quot;test&quot; was by looking at the\n&gt; API or reading the articles.\n&gt;\n&gt; One thing I tried hard to do in SuiteRunner was have a clearly but\n&gt; abstractly defined notion of &quot;test.&quot; The only place the word test\n&gt; shows up in the API is in testX, testY methods and 4 Reporter\n&gt; methods: testStarting, testSucceeded, testFailed, testAborted. A test\n&gt; method is one kind of conceptual test that can be reported via the 4\n&gt; Reporter methods, but not the only kind.\n&gt;\n&gt; I also tried to be clear about what a &quot;suite&quot; was. There&#39;s a class\n&gt; Suite that represents the concept of suite, which is simply a\n&gt; collection of conceptual tests. Typically people will subclass Suite\n&gt; and add test methods -- that&#39;s one kind of suite. But once again, it&#39;s\n&gt;\n&gt; not the only kind of Suite. I have a JUnitSuite internal to the\n&gt; package that I use to run JUnit test suites. That&#39;s another kind of\n&gt; conceptual suite that is represented by a sublcass of Suite.\n&gt;\n&gt;\n&gt;                    Yahoo! Groups Sponsor\n                        ADVERTISEMENT\n\n\n&gt;\n&gt; To unsubscribe from this group, send an email to:\n&gt; junit-unsubscribe@yahoogroups.com\n&gt;\n&gt;\n&gt; Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.\n\n\n\n\n\n", 
    "profile": "ericsilverlight", 
    "topicId": 6946, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 78994084, 
    "prevInTime": 7021, 
    "contentTrasformed": false, 
    "postDate": "1045888892", 
    "canDelete": false, 
    "nextInTopic": 7024, 
    "prevInTopic": 7014, 
    "headers": {
        "messageIdInHeader": "PDNFNTZGRjdDLjQ3RTEzQTI5QHN1bi5jb20+", 
        "referencesHeader": "PGIzNjBubSt2cGxrQGVHcm91cHMuY29tPg=="
    }
}