{
    "numMessagesInTopic": 6, 
    "nextInTime": 7032, 
    "senderId": "uFVIBZK9f7YhgOEGmM7Ebsx683G7bAdUr50YYHabcaflfIuEx_a1FGCGEav-OSWhEp5Q6a13OJTu1TPlP7OnMJLYTg", 
    "systemMessage": false, 
    "subject": "Test cases that are inconclusive", 
    "from": "Linus Tolke &lt;linus@...&gt;", 
    "authorName": "Linus Tolke", 
    "msgSnippet": "How do I signal to the JUnit framework that the result of the test is inconclusive? In the application I am working with (ArgoUML) we have a set of JUnit test", 
    "msgId": 7031, 
    "profile": "linus_tolke", 
    "topicId": 7031, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 82845701, 
    "messageBody": "<div id=\"ygrps-yiv-1027845780\">How do I signal to the JUnit framework that the result of the test is<br/>\ninconclusive?<br/>\n<br/>\nIn the application I am working with (ArgoUML) we have a set of JUnit<br/>\ntest cases. The application is normally run as a desktop application and<br/>\nthe classes within rely on the availability of the window system in order<br/>\nto become created and do what they normally do. When I run the JUnit<br/>\ntest cases in batch (from cron) I do not have a window system available<br/>\nand for that reason some classes cannot be created and tested. Currently<br/>\nsome of these tests fail with the<br/>\n    [junit] Problem creating javax.swing.plaf.metal.MetalLookAndFeel with method getMenuTextFont and args { : java.lang.reflect.InvocationTargetException<br/>\nerror and some of them I have &quot;fixed&quot; to catch that error and not fail.<br/>\n<br/>\nI like neither of these solutions. I would like to catch the error and<br/>\nthrow an &quot;inconclusive&quot;-error to the JUnit framework because conceptually<br/>\nthese tests have neither passed, nor found any problem. Is there a way<br/>\nto do this? I mean it is important that the inconclusive tests show up in<br/>\nthe summary as inconclusive so noone thinks that they passed and it is<br/>\nlikewise important that they don&#39;t show up as failed because they have<br/>\nnot detected any error.<br/>\n<br/>\nThe alterative solution would be to just have two set of tests, one that<br/>\nare runnable without the window system and one that is not and run them<br/>\nboth when a window system is available and just the one of them when it<br/>\nis not but this is a lot more complicated since we then risk to forget<br/>\nrunning some of the tests some of the times.<br/>\n<br/>\n        /Linus</div>", 
    "prevInTime": 7030, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1045985834", 
    "canDelete": false, 
    "nextInTopic": 7033, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDIwMDMwMjIzMDczNy5oMU43YkV3MDIzODdAZXBhY3Quc2U+"
    }
}