{
    "numMessagesInTopic": 1, 
    "nextInTime": 7082, 
    "senderId": "9HodsKQ-gSAAE9XpDWc250uAVfZv_HS71jzQGJf6Vyr0rNkFki8PTy52t9H5TRFY7I1GX4sh52RvR71crTeh42qP3vPeNYXkASRq-ZTZ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Application Testing Strategy", 
    "from": "Eric Armstrong &lt;eric.armstrong@...&gt;", 
    "authorName": "Eric Armstrong", 
    "msgSnippet": "... My interest in testing stems from a security application I once wrote. Since it had to be secure, I had to be ultra-careful in every phase of it s", 
    "msgId": 7081, 
    "rawEmail": "Return-Path: &lt;eric.armstrong@...&gt;\r\nX-Sender: eric.armstrong@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_3_4); 26 Feb 2003 21:12:12 -0000\r\nReceived: (qmail 3663 invoked from network); 26 Feb 2003 21:12:12 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m14.grp.scd.yahoo.com with QMQP; 26 Feb 2003 21:12:12 -0000\r\nReceived: from unknown (HELO patan.sun.com) (192.18.98.43)\n  by mta1.grp.scd.yahoo.com with SMTP; 26 Feb 2003 21:12:12 -0000\r\nReceived: from ha1sca-mail1.SFBay.Sun.COM ([129.145.155.51])\n\tby patan.sun.com (8.9.3+Sun/8.9.3) with ESMTP id OAA23312;\n\tWed, 26 Feb 2003 14:12:09 -0700 (MST)\r\nReceived: from sun.com (d-usca14-129-126 [129.145.129.126])\n\tby ha1sca-mail1.SFBay.Sun.COM (8.11.6+Sun/8.10.2/ENSMAIL,v2.1p1) with ESMTP id h1QLC9h12175;\n\tWed, 26 Feb 2003 13:12:09 -0800 (PST)\r\nMessage-ID: &lt;3E5D2DA8.8C2363D5@...&gt;\r\nDate: Wed, 26 Feb 2003 13:12:09 -0800\r\nX-Mailer: Mozilla 4.8 [en] (Windows NT 5.0; U)\r\nX-Accept-Language: en\r\nMIME-Version: 1.0\r\nTo: junit@yahoogroups.com, hm &lt;eric@...&gt;\r\nSubject: Re: [junit] Application Testing Strategy\r\nReferences: &lt;FEEAIFIMLHLKAJCEPONHCEAPCGAA.mg@...&gt;\r\nContent-Type: text/plain; charset=us-ascii\r\nContent-Transfer-Encoding: 7bit\r\nFrom: Eric Armstrong &lt;eric.armstrong@...&gt;\r\nX-Yahoo-Group-Post: member; u=78994084\r\nX-Yahoo-Profile: ericsilverlight\r\n\r\n&gt; &gt; -----Original Message-----\n&gt; &gt; From: Sukhvinder Singh Namdhari\n&gt; &gt; I want to write unit tests for my Server application,\n&gt; &gt; but till now we haven&#39;t written any testing code...\n&gt; &gt; Can anyone suggest how I could apply unit\n&gt; &gt; test technique in the existing Server Application?\n\nMy interest in testing stems from a security application I once wrote.\nSince it had to be secure, I had to be ultra-careful in every phase of\nit&#39;s development. This was in the days before the TDD concept, so\nI methodically worked the design in stages, going from the largest\nsystem diagram and drilling down, block by block, until I had a\nrepresentation that was tantamount to a flowchart for the code.\n\n(One of the intersting developments along the way was a diagramming\ntechnique that was equally suited for system block diagrams and code\nflowcharts, which allowed for the seamless design strategy -- but that&#39;s\n\nanother story.)\n\nWhen I was done with the design, had desk-checked it, and had it\nreviewed by the client, I set about the task of implementing.\n\nAgain, this was intended to be a secure application, so &quot;bug free&quot; was\na critical requirement, because any bug can be exploited to compromise\nsecurity.\n\nThe strategy I chose was to implement from the bottom up. While the\ndesign had been top down, the implementation proceeded from the\nopposite direction. I implemented the lowest level routines first, and\nbuilt a test harness side-by-side. After thoroughly testing each routine\n\nin the initial library, I built the next level of functionality, and\nthen created\nthe tests for the new functionality.\n\nNotes:\n  * One interesting revelation in this process was that, if level 3 was\nbuilt\n     on level 2, most bugs were confined to level 3. Occasionally, but\n     rarely, a bug would be found in level 2 that had been missed by the\n\n     previous tests, but no bugs in level 1 *ever* surfaced.\n\n  * Another interesting revelation was how good it felt to be developing\n\n     this way. I actually had confidence that the code would work, and\n     do what I expected it to!\n\n  * When I delivered the completed application, I did so confidentally.\n     Interestingly, they did discover one bug in the completed app. But\n     it was a minor oversight in the very topmost level of the code,\nthat\n     the client easily discerned and repaired, without even needing to\n     call me back. (They told me about it, and praised both the\nstructure\n     of the app and its commenting.)\n\nAnyway, to get to the moral of the story, I would suggest that to test\na legacy app, you identify the lowest level of functionality in the\nsystem,\nand build a framework to test the heck out of that. Then work up, level\nby level, to the topmost layers of the system. (I call that process\n&#39;level\ntesting&quot;. You are testing individual units at each level, but the units\nare\ndoing increasingly more at each level.)\n\nFinally, a few specific refactorings are needed to make an application\ntestable.\n  * The first is to make it a &quot;bean&quot;.\n     That means being able to create the application as an object, set\n     its properties, and invoke run() to kick it off. That achieves two\n     goals. The first is that some other application you never expected\n     can invoke it and make use of its results. The second is that you\n     can now drive it from your test framework.\n\n     Note:\n     For a server, the &quot;processing&quot; part of the system should be a bean\n     that you can test normally. The &quot;serving&quot; part of the system\n     undoubtedly needs a special test harness that is intended to drive\n     a server app. I believe those exist, although I haven&#39;t used any.\n\n  * The second is to encapsulate all error handling and output messaging\n\n     in one place with\n        a) a setErrorHandler(ErrorHandler) method, and\n        b) a setWriter(Writer) method.\n     The writer can default to new java.io.Writer(System.out) but the\n     abiliy to set it means that you can set to a StringWriter in your\ntest\n     case, and then inspect the StringWriter to see what messages the\n     server generated.\n\n     Note:\n     It is also possible that having one location error handling and one\nfor\n     messaging better -- the ideal picture is still emerging)\n\nThese strategies open up a number of testing possibilities:\n  1) You can create an anonymous subclass of the application object,\n       overriding a single method for testing purposes. For example, it\n       could record the list of items that were &quot;processed&quot;, rather than\n\n       actually processing them.\n\n   2) You can create an anonymous error-handler subclass that\n        overrides an error condition. It could then set a flag to\nindicate\n        that the error occurred, and then exit with a fatal exception.\n        (The test method would then count the fatal exception as a\n          success, if and only if the flag was set.)\n\n    3) You can run the application with a variety of inputs, and compare\n\n         examine the messages it generates. (Less certain, since it\n         changing text or internationalizing it will cause failures. But\n\n         easier.)\n\nThat&#39;s as far as I&#39;ve been able to think things out for the moment.\nI&#39;ll add a writeup to my web page, or possibly to the JUnit site.\n\nHope this helps!\n\nNote:\nI&#39;m thinking about writing up the details for this pattern, and some\nother &quot;application patterns&quot; in a book, which would have code\nsamples. In the meantime, this rough outline may be enought to\nget started. (In the meantime, writing up this much has gotten me\nwell on the way towards writing at least one chapter in the book!)\n\n\n\n\n\n\n\n\n\n", 
    "profile": "ericsilverlight", 
    "topicId": 7081, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 78994084, 
    "prevInTime": 7080, 
    "contentTrasformed": false, 
    "postDate": "1046293929", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDNFNUQyREE4LjhDMjM2M0Q1QHN1bi5jb20+", 
        "referencesHeader": "PEZFRUFJRklNTEhMS0FKQ0VQT05IQ0VBUENHQUEubWdAcGhjLmRrPg=="
    }
}