{
    "numMessagesInTopic": 2, 
    "nextInTime": 7204, 
    "senderId": "nFE-_10bshlXq0-3t4mpdGJbinRdkQe5ZmjumOOz2Jx5nPDYYbomkECwtM3lFbxCt5mGB-PMp6dgrBuruwiR-SkxIyl4", 
    "systemMessage": false, 
    "subject": "Update of Junit.org", 
    "from": "Shane Duan &lt;sduan@...&gt;", 
    "authorName": "Shane Duan", 
    "msgSnippet": "Hi, I am wondering if anyone knows how to contact the web master of junit.org.  I noticed today that in the IDEs section it is missing the support of JUnit", 
    "msgId": 7203, 
    "profile": "wolfdancer_dodo", 
    "topicId": 7203, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 73579768, 
    "messageBody": "<div id=\"ygrps-yiv-1604636758\">Hi,<br/>\n<br/>\nI am wondering if anyone knows how to contact the web master of <br/>\njunit.org.  I noticed today that in the IDEs section it is missing the <br/>\nsupport of JUnit within JBuilder itself, although this feature has been <br/>\nthere since 2001 and has been updated for usability.<br/>\n<br/>\nThanks<br/>\nShane<br/>\n<br/>\n-- <br/>\nDisclaimer:  I join all the news groups out of my own interest.  All opinions expressed here are my own and not necessarily those of my employer.<br/>\n<br/>\nBorland -- Enabling the digital world where our customers have the freedom of choice to develop, deploy, and integrate applications across the enterprise and  the Internet. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.borland.com\">http://www.borland.com</a><br/>\n<br/>\nThis e-mail, and any attachments thereto, is intended only for use by the addressee(s) named herein and may contain legally privileged and/or confidential information.  If you are not the intended recipient of this e-mail, you are hereby notified that any dissemination, distribution or copying of this e-mail, and any attachments thereto, is strictly prohibited.  If you have received this e-mail in error, please immediately and permanently delete the original and any copy of any e-mail and any printout thereof.</div>", 
    "prevInTime": 7202, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1047492502", 
    "canDelete": false, 
    "nextInTopic": 7204, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDNFNkY3Nzk2LjQwODA4MDBAYm9ybGFuZC5jb20+"
    }
}