{
    "numMessagesInTopic": 4, 
    "nextInTime": 7227, 
    "senderId": "1RjEqvIcjq4bwR1NQAo8E7VGD72VAH-aycMh0Mj_S-SSnfoSCVUzKcmeat0H40-SgDqySjuuZIhfc34YuAdjwiEEG8K0ecH_Vv9G2Q", 
    "systemMessage": false, 
    "subject": "Polygenix AgileTest - Mock Object Testing Suite", 
    "from": "&quot;rupertthomas&quot; &lt;rupert@...&gt;", 
    "authorName": "rupertthomas", 
    "msgSnippet": "We ve just announced the release of an Early Access Preview of our AgileTest mock object testing solution. Agiletest differs from other mock object", 
    "msgId": 7226, 
    "profile": "RupertThomas", 
    "topicId": 7226, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 141181290, 
    "messageBody": "<div id=\"ygrps-yiv-382137397\">We&#39;ve just announced the release of an Early Access Preview of <br/>\nour AgileTest mock object testing solution. Agiletest differs from <br/>\nother mock object implementations in that it operates at the bytecode <br/>\nlevel. Other implementations are generally based on either <br/>\nstraightforward source-code generation, or the insertion of a dynamic <br/>\nproxy. The former approach increases the number of artefacts in your <br/>\ndevelopment project (which must also be kept in synchronisation with <br/>\ndevelopment) whilst the latter is limited to the mocking of <br/>\ninterfaces. The upshot is that, using AgileTest, it is possible to <br/>\ncreate mocks (or Imposters) of classes as well as interfaces, without <br/>\nrequiring source code for the class under test and without generating <br/>\na pile of additional source files. <br/>\n<br/>\nAgileTest also includes another neat feature - Interlopers - which <br/>\nallows for dynamic object substitution at any point in the class <br/>\nunder test, allowing for comprehensive mock-based testing of non <br/>\nparameterized object collaborations. This means that common <br/>\nprogramming idioms like static factory calls, or JNDI InitialContext <br/>\ncalls in EJBs, can now be successfully mocked.</div>", 
    "prevInTime": 7225, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1047659148", 
    "canDelete": false, 
    "nextInTopic": 7228, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGI0c3ZxYytidGNwQGVHcm91cHMuY29tPg=="
    }
}