{
    "numMessagesInTopic": 27, 
    "nextInTime": 7284, 
    "senderId": "Ix4iXGjPvFIFDcs0h9xGztPry2KwQacO8-1zd67PTgDRNQz1EiyFfAry_pb37BcMl26t53LkCwHX3EHWQs4LK_kI0Q", 
    "systemMessage": false, 
    "subject": "Re: [junit] JUnit Design?", 
    "from": "Bill Venners &lt;bv@...&gt;", 
    "authorName": "Bill Venners", 
    "msgSnippet": "... One difference between SuiteRunner s and JUnit s design that I believe Eric Armstrong didn t hit on is that JUnit s Test interface has a run method, a way", 
    "msgId": 7283, 
    "profile": "billvenners", 
    "topicId": 7266, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 5637428, 
    "messageBody": "<div id=\"ygrps-yiv-242034342\">On Thursday, March 20, 2003, at 08:29 AM, Vladimir R. Bossicard wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Someone pointed out a few months ago that the JUnit tests are not <br/>\n&gt; executed in<br/>\n&gt; the same order depending on the vm used.  If your tests are <br/>\n&gt; order-dependant it&#39;s<br/>\n&gt; also an issue.<br/>\n&gt;<br/>\n&gt; Considering that you have simple ways to share resources, I wonder if <br/>\n&gt; having one<br/>\n&gt; test object and invoking all of its test methods is the best solution.<br/>\n&gt;<br/>\n </span></blockquote>One difference between SuiteRunner&#39;s and JUnit&#39;s design that I believe <br/>\nEric Armstrong didn&#39;t hit on is that JUnit&#39;s Test interface has a run <br/>\nmethod, a way to run one test. That pretty much dictates that each test <br/>\nwill run in its own instance. SuiteRunner&#39;s Suite class has an execute <br/>\nmethod, which executes an *entire suite of tests*, not just one test. <br/>\nSuite provides a default implementation of the execute method, but it <br/>\ncan be overridden.<br/>\n<br/>\nThe default method discovers and invokes the test methods &quot;in no <br/>\nparticular order&quot; on itself (i.e., the same instance), and executes <br/>\neach sub-Suite. But if you want those test methods to be invoked in a <br/>\nparticular order, you can override execute (or executeTestMethods) in <br/>\nyour subclass. Or if you want your test methods to each be invoked in a <br/>\nseparate instance a la JUnit, you can override execute and do it the <br/>\nJUnit way. As I pointed out to Jacob in my reply to his &quot;JUnit and test <br/>\ndata&quot; post earlier this week, another thing you can do is override <br/>\nexecute to drive tests from data read in from a database or file, <br/>\nrather than using test methods at all. The first time I actually <br/>\noverrode execute in a Suite subclass was to create <br/>\norg.suiterunner.JUnitSuite, a package access Suite subclass that <br/>\nexecutes a suite of JUnit tests. In other words, I implemented running <br/>\nJUnit tests from SuiteRunner by creating a Suite subclass whose execute <br/>\nmethod knows how to run JUnit tests.<br/>\n<br/>\nI attempted to provide a default implementation of execute in Suite <br/>\nthat I figured would be useful 90% of the time, but tried to leave the <br/>\ndoor open for subclasses to execute suites of tests in any other way <br/>\nthat suits their designer. That was one big &quot;refactor&quot; of JUnit&#39;s <br/>\ndesign that I did in SuiteRunner, because I felt the run method of <br/>\nJUnit&#39;s Test interface doesn&#39;t allow for much flexibility in the way <br/>\nsuites of tests are executed.<br/>\n<br/>\n--------<br/>\n<br/>\nBy the way: Does Yahoo perform extensive background checks on people <br/>\nposting to this list before letting each message through? My posts have <br/>\nbeen taking 8 to 15 hours to make it back to my inbox. I just posted a <br/>\nreply to this list via the web site, to see if that&#39;s faster. This one <br/>\nI&#39;m posting via email. We&#39;ll see which one wins.<br/>\n<br/>\nBill<br/>\n--<br/>\nBill Venners<br/>\nArtima Software, Inc.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.artima.com\">http://www.artima.com</a></div>", 
    "prevInTime": 7282, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1048189156", 
    "canDelete": false, 
    "nextInTopic": 7284, 
    "prevInTopic": 7282, 
    "headers": {
        "inReplyToHeader": "PDEwNDgxNzc3ODQuM2U3OWVjNzg1NTA2YkBtYWlsLnNjZGkub3JnPg==", 
        "messageIdInHeader": "PEEyQzhBMjk1LTVCMEItMTFENy05OUQ4LTAwMDM5MzAxRDQ0NkBhcnRpbWEuY29tPg=="
    }
}