{
    "numMessagesInTopic": 4, 
    "nextInTime": 7301, 
    "senderId": "Usqz4vYgv3ePwUlfW74C2-v9tOr6Wrl_3zlrZb-TBaxIJvFIouPMorNpzSFptQtjAtpl1lsZiZ6N1PFs6FTV7o5PYpE41uqOLyOb", 
    "systemMessage": false, 
    "subject": "Logging and Object IDs", 
    "from": "&quot;samrhjoseph&quot; &lt;gaijin@...&gt;", 
    "authorName": "samrhjoseph", 
    "msgSnippet": "Hi (apologies if this comes through twice - I think my previous post failed ...), So I ve been using JUnitDoclet to generate test shells for some existing", 
    "msgId": 7300, 
    "profile": "samrhjoseph", 
    "topicId": 7219, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 29226057, 
    "messageBody": "<div id=\"ygrps-yiv-1095806635\">Hi (apologies if this comes through twice - I think my previous post <br/>\nfailed ...),<br/>\n<br/>\nSo I&#39;ve been using JUnitDoclet to generate test shells for some <br/>\nexisting code, and I think I&#39;ve finally picked up the point that the <br/>\nsetUp and tearDown methods along with the test constructor are all <br/>\ncalled for each individual test method in the test class.<br/>\n<br/>\nI can see the logic behind this is that each test should be conducted <br/>\nstandalone so to speak. I can see from the FAQ <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://junit.sourceforge.net/doc/faq/faq.htm#organize_3\">http://junit.sourceforge.net/doc/faq/faq.htm#organize_3</a> that there is <br/>\na way to write code such that setUp or tearDown methods are called <br/>\nonly once, but that this is not encouraged.<br/>\n<br/>\nMy situation is that I was just adding logging support to my classes, <br/>\nand that the classes are set up so that each time a class is created <br/>\nit is handed a unique id.  As a consequence if I have 7 test methods <br/>\nin my class, the logging system gets initialized 7 times (since the <br/>\ninit() method is in setUp) and 7 objects with 7 different object ids <br/>\nget created, one for each test method.<br/>\n<br/>\nI can see that conceivably there might be interactions such that the <br/>\nmultiple re-initializations help make the tests more robust, but I&#39;m <br/>\nnot sure quite what they are.<br/>\n<br/>\nSo my question is, does initialization of a logging system count as <br/>\nsomething that deserves a unique setUp method?<br/>\n<br/>\nAnd if I want to conduct a series of tests on one object with a <br/>\nparticular id, should I try and create the object in a unique setUp <br/>\nmethod, or should I create single test methods that test a series of <br/>\noperations on a particular object?<br/>\n<br/>\nI am guessing that really I should have multiple test methods, to <br/>\ntest each operation and then other tests to test series of combined <br/>\noperations.  I am then concerned about whether these more complex <br/>\ntests should be in the same test class or in a different one.  <br/>\nPerhaps unit testing should only ever test a single method at a time, <br/>\nand the desire to test a series of them at once suggests there should <br/>\nbe another method, or object that can encapsulate the complex <br/>\noperation, and then this can be tested in another class?<br/>\n<br/>\nThanks in advance.<br/>\n<br/>\nCHEERS&gt; SAM</div>", 
    "prevInTime": 7299, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1047546074", 
    "canDelete": false, 
    "nextInTopic": 7302, 
    "prevInTopic": 7298, 
    "headers": {
        "messageIdInHeader": "PGI0cGhjcStzMjdxQGVHcm91cHMuY29tPg=="
    }
}