{
    "numMessagesInTopic": 11, 
    "nextInTime": 732, 
    "senderId": "QOGDaIFsxuBBa6HIOVkEQaYDPg-AiJTMUNpHemFbnLITZRXTw0ulify2lZwE4bvQJg4vL_jXQ7EhRYfHZOzOzGk", 
    "systemMessage": false, 
    "subject": "Re: [junit] Implementing JUnit AFTER development has started...", 
    "from": "Joi Ellis &lt;joi@...&gt;", 
    "authorName": "Joi Ellis", 
    "msgSnippet": "... I pretend to do XP for one.  What I did when I started using JUnit was to pick an interesting existing class, and write tests for just that class, as a", 
    "msgId": 731, 
    "topicId": 729, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1885289826\">On Fri, 16 Mar 2001, David M. Goudreau wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Does anyone have any opinions, suggestions or approaches as to how to best<br/>\n&gt; implement JUnit AFTER development has started?  We have a significant code<br/>\n&gt; base already and we&#39;re trying to move to JUnit.  What issues did you have<br/>\n&gt; when trying this yourself?  Was your testing hierarchy exactly the same as<br/>\n&gt; your application package structure?  Did you start only using JUnit with new<br/>\n&gt; development or with bugs as well?  Or did you take a month off and have<br/>\n&gt; everyone write JUnit tests?  Any help would be greatly appreciated.<br/>\n<br/>\n </span></blockquote>I pretend to do XP for one.  What I did when I started using JUnit was<br/>\nto pick an interesting existing class, and write tests for just that class,<br/>\nas a learning exercise.<br/>\n<br/>\nAll new code is written test-first (unless it&#39;s a spike.)  <br/>\n<br/>\nBefore I change a pre-existing class I write tests for it.  If it&#39;s<br/>\na big class I may write tests covering the behavior I&#39;m changing.<br/>\nIE If I&#39;m changing a method on a Java bean which deals with one field,<br/>\nand that field doesn&#39;t influence some other fields, I may not take the<br/>\ntime to write tests right now for those other fields.<br/>\n<br/>\nWriting tests for existing classes is on my @todo list but they&#39;re nowhere<br/>\nnear the top.  I have a very deep @todo list. :/<br/>\n<br/>\nIf I&#39;ve acquired new 3rd party code with sources, and it doesn&#39;t come<br/>\nwith its own tests (most don&#39;t) then I&#39;ll often write tests for the<br/>\nclasses/methods I&#39;m using, often as a learning exercise.  <br/>\n<br/>\n-- <br/>\nJoi Ellis                    Software Engineer<br/>\nAravox Technologies          <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joi@...\">joi@...</a>, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gyles19@...\">gyles19@...</a><br/>\n<br/>\nNo matter what we think of Linux versus FreeBSD, etc., the one thing I<br/>\nreally like about Linux is that it has Microsoft worried.  Anything<br/>\nthat kicks a monopoly in the pants has got to be good for something.<br/>\n           - Chris Johnson</div>", 
    "prevInTime": 730, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "984788966", 
    "canDelete": false, 
    "nextInTopic": 732, 
    "prevInTopic": 730, 
    "headers": {
        "inReplyToHeader": "PE5FQkJLUEhOSUtGTExFSE5JTUtLR0VEQ0REQUEuZGF2aWRfZ291ZHJlYXVAY3Jvc3Njb21tZXJjZS5jb20+", 
        "messageIdInHeader": "PFBpbmUuTE5YLjQuMjEuMDEwMzE2MTgxOTA2MC4zMTgwNC0xMDAwMDBAam9pLmFyYXZveC5jb20+"
    }
}