{
    "numMessagesInTopic": 27, 
    "nextInTime": 7324, 
    "senderId": "-1Gzo1zRo50wZAGWSi-saglRu0JAtMfJ8mr1pQsFCGI0ZzfUVgqm0RGgukkETdifJAVsWFxXvVPEMdIA6RxtmHX18QTLTcVZU4BJTw", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: JUnit Design?", 
    "from": "Robert Bateman &lt;rbatemanmi@...&gt;", 
    "authorName": "Robert Bateman", 
    "msgSnippet": "... I did this very thing by accident - as I m new to JUnit testing. I have legacy DB code I have to test and the original author used a static anonymous class", 
    "msgId": 7323, 
    "profile": "rbatemanmi", 
    "topicId": 7266, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124365129, 
    "messageBody": "<div id=\"ygrps-yiv-1188133055\">--- Bill Venners &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bv@...\">bv@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; If the fixture includes an expensive database <br/>\n&gt; connection, for example, could that connection not be created by the <br/>\n&gt; first test method and stored in a static variable for all subsequent <br/>\n&gt; test methods to share? Not sure how you could close the connection at <br/>\n&gt; the end of the last test method executed, though. Has anyone used <br/>\n&gt; static variables to share fixture objects among multiple test methods?<br/>\n<br/>\n </span></blockquote>I did this very thing by accident - as I&#39;m new to JUnit testing.<br/>\n<br/>\nI have legacy DB code I have to test and the original author used a static anonymous class to<br/>\ncreate the connection cache.  I use setup() to instantiate the underlying class and get/close my<br/>\nDB connections in each test.  I pay the penalty for the connection creation in the first test, but<br/>\nevery other test is fairly fast.<br/>\n<br/>\n<br/>\nSo far, I&#39;ve found JUnits testing of each test method to be low level in design and nature...  I<br/>\ncreate a method in an object and my test methods exercise my method - checking for validity of<br/>\nexecution.  I&#39;ve found JUnit assumes I&#39;m interested in assuring the tested method executes and<br/>\nprovides some specific result.  <br/>\n<br/>\nMaybe I&#39;m still too new to JUnit to know what I&#39;m missing with SuiteRunner - but I&#39;ve always<br/>\nthought the first test I must *always* perform is the validation of my code against the<br/>\nspecifications - that what I&#39;m writing is performing to expectations.<br/>\n<br/>\nYour right, if I write code that modifies a part of my object in some way, I need to insure that I<br/>\nhaven&#39;t created an artifact that can damage some other part of the code.  Isn&#39;t that the basis of<br/>\nperforming lots of different asserts in each of your tests?  If I can alter some part of my object<br/>\nthru my code, then after my code runs, don&#39;t I want to verify the contents of the underlying<br/>\nobject?  All within one test? (Not Suite of tests - but an individual test...)<br/>\n<br/>\nIf I&#39;m too far off topic, please forgive me.<br/>\n<br/>\nBob<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo you Yahoo!?<br/>\nYahoo! Platinum - Watch CBS&#39; NCAA March Madness, live on your desktop!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://platinum.yahoo.com\">http://platinum.yahoo.com</a></div>", 
    "prevInTime": 7322, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1048447763", 
    "canDelete": false, 
    "nextInTopic": 7336, 
    "prevInTopic": 7307, 
    "headers": {
        "inReplyToHeader": "PDBDNjREMDY3LTVCN0EtMTFENy04OEYyLTAwMDM5MzAxRDQ0NkBhcnRpbWEuY29tPg==", 
        "messageIdInHeader": "PDIwMDMwMzIzMTkyOTIzLjczMTcxLnFtYWlsQHdlYjEyNTA2Lm1haWwueWFob28uY29tPg=="
    }
}