{
    "numMessagesInTopic": 45, 
    "nextInTime": 7356, 
    "senderId": "wh1w83kFaXn24MKNvPHWa-MulqRz-ygquIP05pW9vkMaJdH-_MRAFTlZcySecdK_5L2itKW7SN3wXRQ3dAFEr09-6m7UOyc", 
    "systemMessage": false, 
    "subject": "JUnit considered problematic", 
    "from": "&quot;javainsel&quot; &lt;javainsel@...&gt;", 
    "authorName": "javainsel", 
    "msgSnippet": "Sorry, I know very little about both of them until now. But it seems to me that I don t need necessarily JUnit test cases or suites if I use the new assert", 
    "msgId": 7355, 
    "profile": "javainsel", 
    "topicId": 7355, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 137093095, 
    "messageBody": "<div id=\"ygrps-yiv-1875323125\">Sorry, I know very little about both of them until now.<br/>\n<br/>\nBut it seems to me that I don&#39;t need necessarily JUnit test cases or <br/>\nsuites if I use the new assert statement in the code I write.<br/>\n<br/>\nOf course it is better to have JUnit tests, but it has many side <br/>\neffects in my eyes. Using assert statements would be a compromise.<br/>\n<br/>\nI think I could use assert statements at the beginning of a method <br/>\nand at the end, checking preconditions and postconditions.<br/>\n<br/>\nBy marking them somehow as preconditions and postconditions it should <br/>\ntheoretically be possible to automate generation of JUnit <br/>\ntests/suites, including test data. The test data can be created <br/>\nautomatically by a tool which obeys the preconditions for that <br/>\npurpose. Java Modelling Language seems to do exactly this. But I <br/>\nthink it is not adopted widely.<br/>\n<br/>\nIt seems that with JUnit I can only test methods which return a <br/>\nvalue. Using JUnit will change the code one would normally create: <br/>\nBecause of JUnit you need to overwrite equals(), toString() and are <br/>\nnot allowed to use void return type if you want to test that method.<br/>\n<br/>\nUsing the assert statement instead I can also test classes which <br/>\nreturn no value.<br/>\n<br/>\nBesides all this problems whis JUnit is another one: Successful <br/>\nJUnits tests are no guarantee that there are no bugs in the code I <br/>\nread. This has to do with data chains. But I didn&#39;t understand this.<br/>\n<br/>\nAnd I read that it is extremely time consuming to create test cases <br/>\nfor all possible cases.<br/>\n<br/>\nThe good thing about using assert statements would also be, that the <br/>\ntest is included in the method. So no extra coding of classes would <br/>\nbe requiered as with using JUnit. Everything is in one place, user <br/>\nfriendly.<br/>\n<br/>\nUsing assert statements will not force the developer to use a special <br/>\ndeveloping practice like testdriven development. He is free to <br/>\ndevelop in his own style.<br/>\n<br/>\nThe synchronisation between test cases and methods to be tested would <br/>\nis time consuming. And what happens if you change a method so that <br/>\npreconditions or postconditions will become different? Will you <br/>\nremember to change the JUnit to fit these changes? Or will you <br/>\nsometimes forget? Error detecting is then twice as hard, since it can <br/>\noriginate in the test class or in the class to be tested. Thats a <br/>\npoint where assert statements are better in my eyes compared to JUnit.<br/>\n<br/>\nSo what do you think about my assumptions? I can be wrong because I&#39;m <br/>\ninexperienced with both of them.<br/>\n<br/>\nMaybe I write complete nonsense. So please correct me if necessary. <br/>\nThe side effects of pure JUnit programming seem very large to me.</div>", 
    "prevInTime": 7354, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1049189403", 
    "canDelete": false, 
    "nextInTopic": 7383, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGI2Ym02citnYXQwQGVHcm91cHMuY29tPg=="
    }
}