{
    "numMessagesInTopic": 1, 
    "nextInTime": 7357, 
    "senderId": "kS85mabfZaFNI2r930cNJpGxDj0YqS85akWkfL9e12kF9IkN6LXmgX5yJVvQbrTwJzX6cKc5F1h_fZvE83oI_bQbOBSreZ4ZUn_t", 
    "systemMessage": false, 
    "subject": "TestRunner Doubt", 
    "from": "Manu Anand &lt;manua@...&gt;", 
    "authorName": "Manu Anand", 
    "msgSnippet": "Yes I am a newbie. So please don t kill me :) I read this in the javadocs for TestRunner *A test runner either expects a static method suite as the entry point", 
    "msgId": 7356, 
    "topicId": 7356, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 143015850, 
    "messageBody": "<div id=\"ygrps-yiv-1316165811\">Yes I am a newbie. So please don&#39;t kill me :)<br/>\n<br/>\n I read this in the javadocs for TestRunner<br/>\n<br/>\n*A test runner either expects a static method suite as the entry point to<br/>\nget a test to run or it will extract the suite automatically*<br/>\n<br/>\nWhat is this supposed to mean?? How will the task run on its own??<br/>\n-Manu<br/>\nHelp stamp out mental illness, or I will kill you!!<br/>\n<br/>\n<br/>\nDISCLAIMER: Information contained and transmitted by this E-MAIL is<br/>\nproprietary to Mascot Systems Limited and is intended for use only by the<br/>\nindividual or entity to which it is addressed, and may contain information<br/>\nthat is privileged, confidential or exempt from disclosure under applicable<br/>\nlaw. If this is a forwarded message, the content of this E-MAIL may not have<br/>\nbeen sent with the authority of the Company. If you are not the intended<br/>\nrecipient, an agent of the intended recipient or a person responsible for<br/>\ndelivering the information to the named recipient, you are notified that any<br/>\nuse, distribution, transmission, printing, copying or dissemination of this<br/>\ninformation in any way or in any manner is strictly prohibited. If you have<br/>\nreceived this communication in error, please delete this mail & notify us<br/>\nimmediately at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Mailadmin@...\">Mailadmin@...</a> Before opening attachments,<br/>\nplease scan for viruses.</div>", 
    "prevInTime": 7355, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1049216815", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDU1NzU0NzNENDUzMkQ0MTFCRTRDMDA5MDI3RThDODM4MEFCODE2QjVAbWFzYmxyZXhjMDIubWFzY290c3lzdGVtcy5jb20+"
    }
}