{
    "numMessagesInTopic": 14, 
    "nextInTime": 7361, 
    "senderId": "CbiY9-wBEOtAK9jxI2nd0wGM6rEWVcI6wCFjMVXkrfvco_UgsFxUoKbKvh3AJNWSx83bfMFMypAXOYNLrqrIHdvAHWj2uHanxpaO8OyTMNRnjLo", 
    "systemMessage": false, 
    "subject": "How do I make Unit Testing practical?", 
    "from": "&quot;swpalmer2001&quot; &lt;scott.palmer@...&gt;", 
    "authorName": "swpalmer2001", 
    "msgSnippet": "First off I better say up front that this is not meant as a troll, or to start some sort of flame war about unit testing....  I m really looking for simple", 
    "msgId": 7360, 
    "rawEmail": "Return-Path: &lt;scott.palmer@...&gt;\r\nReceived: (qmail 81409 invoked from network); 2 Apr 2003 00:19:46 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m5.grp.scd.yahoo.com with QMQP; 2 Apr 2003 00:19:46 -0000\r\nReceived: from unknown (HELO n29.grp.scd.yahoo.com) (66.218.66.85)\n  by mta1.grp.scd.yahoo.com with SMTP; 2 Apr 2003 00:19:46 -0000\r\nX-eGroups-Return: scott.palmer@...\r\nReceived: from [66.218.67.165] by n29.grp.scd.yahoo.com with NNFMP; 02 Apr 2003 00:19:44 -0000\r\nX-Sender: scott.palmer@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_6_5); 1 Apr 2003 20:24:05 -0000\r\nReceived: (qmail 63405 invoked from network); 1 Apr 2003 20:07:31 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m10.grp.scd.yahoo.com with QMQP; 1 Apr 2003 20:07:31 -0000\r\nReceived: from unknown (HELO n8.grp.scd.yahoo.com) (66.218.66.92)\n  by mta2.grp.scd.yahoo.com with SMTP; 1 Apr 2003 20:07:31 -0000\r\nReceived: from [66.218.67.150] by n8.grp.scd.yahoo.com with NNFMP; 01 Apr 2003 20:07:28 -0000\r\nDate: Tue, 01 Apr 2003 20:07:28 -0000\r\nTo: junit@yahoogroups.com\r\nSubject: How do I make Unit Testing practical?\r\nMessage-ID: &lt;b6cri0+9hie@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 2658\r\nX-Mailer: Yahoo Groups Message Poster\r\nFrom: &quot;swpalmer2001&quot; &lt;scott.palmer@...&gt;\r\nX-Yahoo-Group-Post: member; u=124593303\r\nX-Yahoo-Profile: swpalmer2001\r\nX-eGroups-Approved-By: clarkware &lt;mike@...&gt; via web; 02 Apr 2003 00:19:43 -0000\r\n\r\nFirst off I better say up front that this is not meant as a troll, or\nto start some sort of flame war about unit testing....  I&#39;m really\nlooking for simple insight from people who have been where I am now,\nlinks to articles on the web and so forth....\n\nI like, the rest off you, have heard great things about unit testing.\n I believe a lot of it.  I want to start writing unit tests for my\ncode and in general improve my development practices.   So I downloaded\nJUnit, and read through some articles and examples.\n\nThey are all too trivial.\n\nI am struggling as to how I can write unit tests for &quot;real code&quot;.   \nMost of the examples I see are testing objects that are VERY general\n(lists, or other simple container classes, a calculator, etc..).   \nBut my &quot;real classes&quot; are written for my &quot;real application&quot; and as\nsuch there is an entire environment that is created as they work\ntogether.  Testing the classes in isolation seems next to impossible.\n\nSome people will be quick to jump in and say that this must be a\nfundamental problem with my design.. my classes shouldn&#39;t be so\ndependent on each other, or something similar.    In some (trivial)\ncases it is possible to write stand alone classes, and they are\nfairly easy to test in isolation.  But a complex application needs\nall sorts of classes that bind trivial bits together... and these\nclasses must rely on the very classes that they are causing to work\ntogether.\n\nI find that it is these classes that are difficult to\ncompartmentalize where most of my bugs tend to show up anyway, but of\ncourse not always.   How do you unit test such beasts?\n\nSo far in all my attempts to get started at this I find that the test\ncode itself becomes very complex - not as complex as my application,\nbut enough that the time I would end up writing and debugging the\ntest seems completely unreasonable.   I would love to have the\nfinished tests, but I simply can&#39;t see how I could justify writing\nthem, as it would more than double my design and coding development\ntime.\n\nIn the end I would almost end up with an &quot;automated user&quot;, and of\ncourse that is a tad extreme and prone to it&#39;s own sorts of errors\nand assumptions.\n\nI&#39;ve told co-workers about what I have read about unit testing,\ntesting frameworks etc.  None of my co-workers do unit tests, and ll\nof them have the same attitude.  Unit testing is too\ncomplex/difficult to use when making real complete programs.\n\nSo I&#39;m asking... Who else has been down this path?  How do I get past\nthis point?   Am I making sense or have I just gotten something\ncompletely wrong? Or is this unit testing just a passing fad that is\nreally nothing more than a bunch of hype?\n\n\n\n", 
    "profile": "swpalmer2001", 
    "topicId": 7360, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124593303, 
    "prevInTime": 7359, 
    "contentTrasformed": false, 
    "postDate": "1049227648", 
    "canDelete": false, 
    "nextInTopic": 7389, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGI2Y3JpMCs5aGllQGVHcm91cHMuY29tPg=="
    }
}