{
    "numMessagesInTopic": 1, 
    "nextInTime": 7374, 
    "senderId": "Vp4MYuSHDRlI2wRsGRL5f71H6B0M4yp863noqjO-4RzcFNYRrq05KDtESTw5DhdiusmQLYupOUI9Y8bvAbLfgLOR0QBbG2vU0rvQIt0Pj4fQQKHzRyradg", 
    "systemMessage": false, 
    "subject": "SR. SW QA ENGINEER OPENING (SQA4)  E2Open  Redwood City, CA", 
    "from": "&quot;camdenjobs&quot; &lt;paul.stevens@...&gt;", 
    "authorName": "camdenjobs", 
    "msgSnippet": "SR. SOFTWARE QA ENGINEER (SQA4) – E2Open – Redwood City, CA Hello, my name is Paul Stevens and I am a staffing consultant with a software company based in", 
    "msgId": 7373, 
    "profile": "camdenjobs", 
    "topicId": 7373, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 129987003, 
    "messageBody": "<div id=\"ygrps-yiv-1759784494\">SR. SOFTWARE QA ENGINEER (SQA4)  E2Open  Redwood City, CA<br/>\n<br/>\nHello, my name is Paul Stevens and I am a staffing consultant with a <br/>\nsoftware company based in Redwood City, CA called E2open <br/>\n(www.e2open.com). We currently have openings for 3 Senior Quality <br/>\nAssurance Developers with strong Java, QA, Unix (Solaris) and XML <br/>\nexperience.  For these positions we need automation experience using <br/>\nJava and shell scripting and experience in frameworks like JUNIT. We <br/>\nare not seeking expertise in UI automation test tools like SILK and <br/>\nMercury Interactive.  If that is your background, let&#39;s save each <br/>\nother some time.  We are searching for an accomplished software <br/>\ndeveloper with a strong background in Java Development (Unix <br/>\nPlatform) who straddles the line between QA and Development, who <br/>\nunderstands QA methodology, whose expertise is in analyzing and <br/>\ntesting components, who is secure in a QA role and who understands <br/>\nthe importance that a strong QA perspective brings to the development <br/>\nprocess.  Expertise in developing supply chain software and <br/>\nRosettaNet would be a big plus.<br/>\n<br/>\nWhen responding to this posting, please include your name and the <br/>\nletters SQA4 in the subject line.  Email your resume to <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:qacareers@...\">qacareers@...</a>.<br/>\n<br/>\nPrimary Responsibilities: <br/>\n<br/>\n\tWriting and evaluating test plans, developing and running <br/>\nperformance measurement tests and working with other test and <br/>\ndevelopment teams. <br/>\n\tWorking closely in a team atmosphere with engineers from <br/>\nproduct development and quality assurance to create Automated, <br/>\nfunctional, load/performance and system tests.<br/>\n<br/>\nJob Qualifications: <br/>\n<br/>\n\tTwo years experience in a Quality Assurance department with <br/>\nat least 1 year QA test automation development experience using JAVA, <br/>\nJUNIT, EJB and XML.<br/>\n\tTwo years experience in design, development, QA, or <br/>\nintegration of Supply Chain enterprise resource planning (ERP) <br/>\nsoftware.<br/>\n\tExperience programming in a Unix environment. <br/>\n\tExperience working  with Oracle, HTML and SQL <br/>\n\tBachelor&#39;s degree in CS, Engineering, or other closely <br/>\nrelated technical field required<br/>\n<br/>\nABOUT E2OPEN:<br/>\n<br/>\nE2open (www.e2open.com) is the global collaboration network for the <br/>\nelectronics industry.  E2open enables effective collaboration among <br/>\nOEMs, contract manufacturers, distributors and suppliers and supports <br/>\nthe entire product lifecycle, including design, manufacturing, <br/>\nprocurement and asset recovery for computing, networking and consumer <br/>\nelectronics products.  E2open was formed by industry leaders Acer, <br/>\nHitachi, IBM, LG Electronics, Lucent Technologies, Matsushita <br/>\nElectric (Panasonic), Nortel Networks, Seagate Technology, Solectron <br/>\nand Toshiba, as well as the prominent investors Crosspoint Venture <br/>\nPartners and Morgan Stanley Dean Witter.  E2open Strategic Members <br/>\ninclude Mitsubishi Electric, Omron, Ricoh, Sanyo and Sharp.<br/>\n<br/>\nIMPORTANT MESSAGE:<br/>\n <br/>\nThank you for taking the time to review the above job requirements.  <br/>\nIf your background matches the experience listed, I would very much <br/>\nlike to hear from you.  If not, please take a moment to reflect upon <br/>\nwho in your circle of friends or co-workers might benefit from this <br/>\nopportunity. Then pass this message along. Your selfless act may <br/>\npropel them to a career of a lifetime.<br/>\n<br/>\nNo entry level or contract positions are available at this time. <br/>\nInterested local candidates (no relocation offered) should forward a <br/>\ncover letter and resume in any of the following formats - .DOC <br/>\n(preferred), plain text, RTF, HTML, or PDF to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:qacareers@...\">qacareers@...</a>.<br/>\n<br/>\n<br/>\nPlease understand that due to the large volume of responses, I will <br/>\nnot be able to acknowledge each of you individually.  Be assured, <br/>\nhowever, that I will thoroughly examine each resume received and will <br/>\narrange interviews with the best qualified candidates.  In order to <br/>\nmanage this process timely and efficiently, I will not be able to <br/>\nrespond to telephone inquiries or provide you with status updates.  <br/>\nAlthough I gratefully acknowledge my agency friends&#39; willingness to <br/>\nassist me, I am unable to accept resumes/profiles from any 3rd <br/>\nparties (recruiters, agencies, contract firms, search firms, etc., at <br/>\nthis time).  Thanks again for considering E2open and I look forward <br/>\nto your early response.<br/>\n <br/>\nCONTACT INFO:<br/>\n<br/>\nPaul Stevens<br/>\nSr. Staffing Consultant<br/>\nE2Open<br/>\n1600 Seaport Blvd.<br/>\nRedwood City, CA 94063<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:qacareers@...\">qacareers@...</a><br/>\nwww.e2open.com</div>", 
    "prevInTime": 7372, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1048827238", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGI2MGtoNitlZWw5QGVHcm91cHMuY29tPg=="
    }
}