{
    "numMessagesInTopic": 45, 
    "nextInTime": 7395, 
    "senderId": "12hse_ZC25u874Uq-kAG4Ab_jI3eP2eI2MgcTNmGbIxRVQV_doq_pxycg1Gcmre8NqeDRELsrq-hpvFvfv4j4a0tCzDhqgcC97OWpQ-9jucY", 
    "systemMessage": false, 
    "subject": "Re: [junit] JUnit considered problematic", 
    "from": "&quot;Lauren Bish&quot; &lt;developerdude@...&gt;", 
    "authorName": "Lauren Bish", 
    "msgSnippet": "... From: javainsel  ... As already stated, such asserts do not test code - they only check for problems in pre and postconditions. There", 
    "msgId": 7394, 
    "profile": "gs_nomad", 
    "topicId": 7355, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 117292773, 
    "messageBody": "<div id=\"ygrps-yiv-1561191530\"><blockquote><span title=\"qreply\">----- Original Message -----<br/>\nFrom: &quot;javainsel&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:javainsel@...\">javainsel@...</a>&gt;<br/>\n<br/>\n<br/>\n&gt; Of course it is better to have JUnit tests, but it has many side<br/>\n&gt; effects in my eyes. Using assert statements would be a compromise.<br/>\n&gt;<br/>\n&gt; I think I could use assert statements at the beginning of a method<br/>\n&gt; and at the end, checking preconditions and postconditions.<br/>\n&gt;<br/>\n<br/>\nAs already stated, such asserts do not test code - they only check for<br/>\nproblems in pre and postconditions. There is a lot more to testing than just<br/>\nthat.<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Besides all this problems whis JUnit is another one: Successful<br/>\n&gt; JUnits tests are no guarantee that there are no bugs in the code I<br/>\n&gt; read. This has to do with data chains. But I didn&#39;t understand this.<br/>\n&gt;<br/>\n&gt; And I read that it is extremely time consuming to create test cases<br/>\n&gt; for all possible cases.<br/>\n<br/>\nA few axioms that any tester worth their salt knows by heart:<br/>\n<br/>\n1) There is no way to guarantee there are no bugs in any code no matter what<br/>\nyou do.<br/>\n<br/>\n2) You can never test all code for all possible cases - a fairly simple<br/>\nexample is often quoted of a small snippet of code that adds two integers<br/>\ntogether taking several millenia just to test the obvious cases - and that<br/>\nis with the computer doing the testing.<br/>\n<br/>\nWhat you can do is test the cases that are most likely to find a bug - the<br/>\nnumber of cases and amount of time necessary to find bugs and properly test<br/>\nthe code drops by several orders of magnitude.<br/>\n<br/>\n&gt; The synchronisation between test cases and methods to be tested would<br/>\n&gt; is time consuming. And what happens if you change a method so that<br/>\n&gt; preconditions or postconditions will become different? Will you<br/>\n&gt; remember to change the JUnit to fit these changes? Or will you<br/>\n&gt; sometimes forget? Error detecting is then twice as hard, since it can<br/>\n&gt; originate in the test class or in the class to be tested. Thats a<br/>\n&gt; point where assert statements are better in my eyes compared to JUnit.<br/>\n<br/>\nYour production code and test code should not be so tightly coupled that<br/>\nthese are real problems - especially the problem of where you need to find<br/>\nthe error.<br/>\n<br/>\nThe alternatives? Finding bugs in your code later (asserts don&#39;t really test<br/>\nyour code and don&#39;t show bugs near as often as unit tests). It is always<br/>\ncheaper to find bugs/errors early on. You can test early, find your bugs<br/>\nearly and fix them early when the cost is low, or you can test later and fix<br/>\nyour bugs when it is much more costly. This doesn&#39;t even address the<br/>\nbenefits you get from TDD which are numerous and somewhat separate.<br/>\n<br/>\nFWIW,<br/>\nLauren<br/>\n<br/>\n=====<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://developerdude.mystarband.net\">http://developerdude.mystarband.net</a> </span></blockquote></div>", 
    "prevInTime": 7393, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1049250934", 
    "canDelete": false, 
    "nextInTopic": 7409, 
    "prevInTopic": 7393, 
    "headers": {
        "messageIdInHeader": "PDAwNjAwMWMyZjhjMSQyNGI0MmVjMCQwMzlhNDA5NEBHb3J0Pg==", 
        "referencesHeader": "PGI2Ym02citnYXQwQGVHcm91cHMuY29tPg=="
    }
}