{
    "numMessagesInTopic": 14, 
    "nextInTime": 7403, 
    "senderId": "vEbaWNAlE_nOxAp_DzQpZsIrlIuHZHDGtNWuzp0WZ6efp7_3jsHiRXadak5XHXr5Wg-EQn75HsGjtc2V5IKbhro2jQ4vzqggppAyZFEZtfla4f2WKg", 
    "systemMessage": false, 
    "subject": "Re: [junit] How do I make Unit Testing practical?", 
    "from": "&quot;Jeff Nielsen&quot; &lt;jeff.nielsen@...&gt;", 
    "authorName": "Jeff Nielsen", 
    "msgSnippet": "For the last two years we have been writing real applications that have unit tests for every method.  These are complex, web-based apps that currently", 
    "msgId": 7402, 
    "rawEmail": "Return-Path: &lt;jeff.nielsen@...&gt;\r\nX-Sender: jeff.nielsen@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_6_5); 2 Apr 2003 05:08:10 -0000\r\nReceived: (qmail 61655 invoked from network); 2 Apr 2003 05:08:09 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m3.grp.scd.yahoo.com with QMQP; 2 Apr 2003 05:08:09 -0000\r\nReceived: from unknown (HELO smtp2-cm.mail.eni.net) (216.133.226.135)\n  by mta1.grp.scd.yahoo.com with SMTP; 2 Apr 2003 05:08:09 -0000\r\nReceived: from jnielsen2 (0-1pool40-152.nas36.philadelphia1.pa.us.da.qwest.net [65.129.40.152])\n\tby smtp2-cm.mail.eni.net (8.12.8p1/8.12.8) with SMTP id h32586mZ017071\n\tfor &lt;junit@yahoogroups.com&gt;; Tue, 1 Apr 2003 21:08:07 -0800\r\nMessage-ID: &lt;05d401c2f8d6$0663aa80$e705000a@jnielsen2&gt;\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nReferences: &lt;b6cri0+9hie@...&gt;\r\nSubject: Re: [junit] How do I make Unit Testing practical?\r\nDate: Wed, 2 Apr 2003 00:09:20 -0500\r\nMIME-Version: 1.0\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Priority: 3\r\nX-MSMail-Priority: Normal\r\nX-Mailer: Microsoft Outlook Express 5.50.4522.1200\r\nX-MimeOLE: Produced By Microsoft MimeOLE V5.50.4522.1200\r\nFrom: &quot;Jeff Nielsen&quot; &lt;jeff.nielsen@...&gt;\r\nX-Yahoo-Group-Post: member; u=65487161\r\nX-Yahoo-Profile: jeffreymads\r\n\r\nFor the last two years we have been writing &quot;real applications&quot; that have\nunit tests for every method.  These are complex, web-based apps that\ncurrently process billions of dollars worth of financial transactions each\nweek.  The largest of these consists of over 500 source files, with over 200\nof these being test classes.  The 900+ &quot;basic&quot; unit tests run in just under\n15 seconds, every time someone does a build.  There are another 100\nintegration-type tests (also written in JUnit) that run in 10-12 minutes\nwith every checkin.\n\nMy point with all of these numbers is that it is possible--and desirable--to\ndo unit testing for large applications.  No way would we live without our\nunit tests.  They have saved us many time, and enable us to make changes and\nadd new functionality *much* faster than we otherwise could.\n\nThe biggest thing that is required to get started is a commitment on the\npart of all invovled.  Just commit to yourselves and each other that you\nwon&#39;t write any more code that doesn&#39;t have a unit test for it.  It does\ntake some time up front to get it all figured out.  You have to learn the\nbasic testing patterns.  You will probably have to tweak your architecture\nsome so that you can write less-coupled code.  You have to get a feel for\nwhen to use a mock object, when to override a method in an anonymous\nsubclass (Java), how to write container-based code that will run outside a\ncontainer, etc.\n\nSo it shouldn&#39;t be surprising that there is ramp-up time before you really\nget good at this.  Like trying to learn any new skill, it *does* initially\nslow you down before it speeds you up.  And yes, it&#39;s difficult while you&#39;re\nstill a novice.  But they payoff is well worth it!  When we started two\nyears ago, we had many of the same questions and concerns that you do.  But\nnow we&#39;re at the point where the question of whether to write unit tests as\nwe develop is a non-issue.  As far as we&#39;re concerned, you might as well try\nto write code without a compiler--you could do it, but why would you?\n\nThe good news is that people have solved almost all of the issues you are\nlikely to encounter.  If you ask the right questions, you can find papers &\nexamples of how to unit test almost every kind of code.  A book you should\nwatch for is Dave Astel&#39;s soon-to-be-published &quot;A Practical Guide to\nTest-Driven Development&quot;.\n\nJeff Nielsen\nDigital Focus\nwww.digitalfocus.com\n\n\n----- Original Message -----\nFrom: &quot;swpalmer2001&quot; &lt;scott.palmer@...&gt;\nTo: &lt;junit@yahoogroups.com&gt;\nSent: Tuesday, April 01, 2003 3:07 PM\nSubject: [junit] How do I make Unit Testing practical?\n\n\n&gt; First off I better say up front that this is not meant as a troll, or\n&gt; to start some sort of flame war about unit testing....  I&#39;m really\n&gt; looking for simple insight from people who have been where I am now,\n&gt; links to articles on the web and so forth....\n&gt;\n&gt; I like, the rest off you, have heard great things about unit testing.\n&gt; I believe a lot of it.  I want to start writing unit tests for my\n&gt; code and in general improve my development practices.   So I downloaded\n&gt; JUnit, and read through some articles and examples.\n&gt;\n&gt; They are all too trivial.\n&gt;\n&gt; I am struggling as to how I can write unit tests for &quot;real code&quot;.\n&gt; Most of the examples I see are testing objects that are VERY general\n&gt; (lists, or other simple container classes, a calculator, etc..).\n&gt; But my &quot;real classes&quot; are written for my &quot;real application&quot; and as\n&gt; such there is an entire environment that is created as they work\n&gt; together.  Testing the classes in isolation seems next to impossible.\n&gt;\n&gt; Some people will be quick to jump in and say that this must be a\n&gt; fundamental problem with my design.. my classes shouldn&#39;t be so\n&gt; dependent on each other, or something similar.    In some (trivial)\n&gt; cases it is possible to write stand alone classes, and they are\n&gt; fairly easy to test in isolation.  But a complex application needs\n&gt; all sorts of classes that bind trivial bits together... and these\n&gt; classes must rely on the very classes that they are causing to work\n&gt; together.\n&gt;\n&gt; I find that it is these classes that are difficult to\n&gt; compartmentalize where most of my bugs tend to show up anyway, but of\n&gt; course not always.   How do you unit test such beasts?\n&gt;\n&gt; So far in all my attempts to get started at this I find that the test\n&gt; code itself becomes very complex - not as complex as my application,\n&gt; but enough that the time I would end up writing and debugging the\n&gt; test seems completely unreasonable.   I would love to have the\n&gt; finished tests, but I simply can&#39;t see how I could justify writing\n&gt; them, as it would more than double my design and coding development\n&gt; time.\n&gt;\n&gt; In the end I would almost end up with an &quot;automated user&quot;, and of\n&gt; course that is a tad extreme and prone to it&#39;s own sorts of errors\n&gt; and assumptions.\n&gt;\n&gt; I&#39;ve told co-workers about what I have read about unit testing,\n&gt; testing frameworks etc.  None of my co-workers do unit tests, and ll\n&gt; of them have the same attitude.  Unit testing is too\n&gt; complex/difficult to use when making real complete programs.\n&gt;\n&gt; So I&#39;m asking... Who else has been down this path?  How do I get past\n&gt; this point?   Am I making sense or have I just gotten something\n&gt; completely wrong? Or is this unit testing just a passing fad that is\n&gt; really nothing more than a bunch of hype?\n&gt;\n&gt;\n&gt;\n&gt;       Yahoo! Groups Sponsor\n&gt;             ADVERTISEMENT\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; To unsubscribe from this group, send an email to:\n&gt; junit-unsubscribe@yahoogroups.com\n&gt;\n&gt;\n&gt; Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.\n&gt;\n&gt;\n\n\n", 
    "profile": "jeffreymads", 
    "topicId": 7360, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 65487161, 
    "prevInTime": 7401, 
    "contentTrasformed": false, 
    "postDate": "1049260160", 
    "canDelete": false, 
    "nextInTopic": 7405, 
    "prevInTopic": 7398, 
    "headers": {
        "messageIdInHeader": "PDA1ZDQwMWMyZjhkNiQwNjYzYWE4MCRlNzA1MDAwYUBqbmllbHNlbjI+", 
        "referencesHeader": "PGI2Y3JpMCs5aGllQGVHcm91cHMuY29tPg=="
    }
}