{
    "numMessagesInTopic": 14, 
    "nextInTime": 7406, 
    "senderId": "CS4kixrEAT4xqhxBL7kdf_g7Bcy7fdXIUIKbxnoJzzhXSsRsqjZxKLU-obYnGV6oeaYOpcLX7yMvMDwJpCqW", 
    "systemMessage": false, 
    "subject": "RE: [junit] How do I make Unit Testing practical?", 
    "from": "&quot;Bernd&quot; &lt;berndq@...&gt;", 
    "authorName": "Bernd", 
    "msgSnippet": "Scott, ... Do you know www.mockobjects.com ? Have your classes depend on interfaces (and not on other classes) and implement the interfaces with mock objects. ", 
    "msgId": 7405, 
    "topicId": 7360, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 106754364, 
    "messageBody": "<div id=\"ygrps-yiv-260878181\">Scott, <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am struggling as to how I can write unit tests for &quot;real code&quot;.   <br/>\n&gt; Most of the examples I see are testing objects that are VERY general<br/>\n&gt; (lists, or other simple container classes, a calculator, etc..).   <br/>\n&gt; But my &quot;real classes&quot; are written for my &quot;real application&quot; and as<br/>\n&gt; such there is an entire environment that is created as they work<br/>\n&gt; together.  Testing the classes in isolation seems next to impossible.<br/>\n&gt; <br/>\n&gt; Some people will be quick to jump in and say that this must be a<br/>\n&gt; fundamental problem with my design.. my classes shouldn&#39;t be so<br/>\n&gt; dependent on each other, or something similar.    In some (trivial)<br/>\n&gt; cases it is possible to write stand alone classes, and they are<br/>\n&gt; fairly easy to test in isolation.  But a complex application needs<br/>\n&gt; all sorts of classes that bind trivial bits together... and these<br/>\n&gt; classes must rely on the very classes that they are causing to work<br/>\n&gt; together.<br/>\n&gt; <br/>\n&gt; I find that it is these classes that are difficult to<br/>\n&gt; compartmentalize where most of my bugs tend to show up anyway, but of<br/>\n&gt; course not always.   How do you unit test such beasts?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Do you know www.mockobjects.com ?<br/>\nHave your classes depend on interfaces (and not on other classes)<br/>\nand implement the interfaces with mock objects.<br/>\n<br/>\nThis should help to make test setup more easy.<br/>\n<br/>\nYou may want to have a look at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.clarkware.com/software/JDepend.html\">http://www.clarkware.com/software/JDepend.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.objectmentor.com/publications/oodmetrc.pdf\">http://www.objectmentor.com/publications/oodmetrc.pdf</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So I&#39;m asking... Who else has been down this path?  How do I get past<br/>\n&gt; this point?   Am I making sense or have I just gotten something<br/>\n&gt; completely wrong? Or is this unit testing just a passing fad that is<br/>\n&gt; really nothing more than a bunch of hype?<br/>\n<br/>\n </span></blockquote>It works realy well for me, so IMHO it is much more that a hype.<br/>\n<br/>\nWhen I started unit testing I found it difficult or impossible to test some <br/>\nfunctionality of my classes. I realized that I could easily extract such <br/>\nuntestable functionality into a new class which was easily unit-testable.<br/>\nIn the end the design comes out clearer, without thinking much about design<br/>\nwhile trying to make the code testable.<br/>\n<br/>\nNext step would be TDD, I guess with TDD I would never had put too much<br/>\nresponsability into a specific class.<br/>\n<br/>\nBernd</div>", 
    "prevInTime": 7404, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1049262603", 
    "canDelete": false, 
    "nextInTopic": 7425, 
    "prevInTopic": 7402, 
    "headers": {
        "inReplyToHeader": "PGI2Y3JpMCs5aGllQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDAwMGEwMWMyZjhkYiRiODVhNTgxMCQxZjAzYThjMEBkZWxsPg=="
    }
}