{
    "numMessagesInTopic": 45, 
    "nextInTime": 7410, 
    "senderId": "Ro0rV4Tr_krMIcaYAJ8nmf8qZ38XdVWa1FeVKYL2f2Wy_MxL6QbdWoIeyiNES4pxsYyUGRZgROnl974HAfzx-YfsjPAqhQ", 
    "systemMessage": false, 
    "subject": "RE: [junit] JUnit considered problematic", 
    "from": "&quot;Ilja Preuss&quot; &lt;preuss@...&gt;", 
    "authorName": "Ilja Preuss", 
    "msgSnippet": "... Perhaps you should experiment with both for a while... ... Violating pre- and postconditions is just a small subset of what can go wrong in your code. Unit", 
    "msgId": 7409, 
    "rawEmail": "Return-Path: &lt;preuss@...&gt;\r\nX-Sender: preuss@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_6_5); 2 Apr 2003 07:50:01 -0000\r\nReceived: (qmail 47422 invoked from network); 2 Apr 2003 07:50:01 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m2.grp.scd.yahoo.com with QMQP; 2 Apr 2003 07:50:01 -0000\r\nReceived: from unknown (HELO disy.net) (213.30.245.34)\n  by mta3.grp.scd.yahoo.com with SMTP; 2 Apr 2003 07:50:01 -0000\r\nReceived: from PARIS (paris.disy.net [192.168.100.112])\n\tby disy.net (8.9.3/8.9.3) with ESMTP id JAA08396\n\tfor &lt;junit@yahoogroups.com&gt;; Wed, 2 Apr 2003 09:49:55 +0200\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nSubject: RE: [junit] JUnit considered problematic\r\nDate: Wed, 2 Apr 2003 09:49:55 +0200\r\nMessage-ID: &lt;000e01c2f8ec$73df9cc0$7064a8c0@PARIS&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain;\n\tcharset=&quot;US-ASCII&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Priority: 3 (Normal)\r\nX-MSMail-Priority: Normal\r\nX-Mailer: Microsoft Outlook, Build 10.0.2616\r\nIn-Reply-To: &lt;b6bm6r+gat0@...&gt;\r\nImportance: Normal\r\nX-MimeOLE: Produced By Microsoft MimeOLE V6.00.2800.1106\r\nFrom: &quot;Ilja Preuss&quot; &lt;preuss@...&gt;\r\nX-Yahoo-Group-Post: member; u=96623270\r\nX-Yahoo-Profile: ipreussde\r\n\r\n&gt; Sorry, I know very little about both of them until now.\n\nPerhaps you should experiment with both for a while...\n\n&gt; But it seems to me that I don&#39;t need necessarily JUnit test cases or \n&gt; suites if I use the new assert statement in the code I write.\n&gt; \n&gt; Of course it is better to have JUnit tests, but it has many side \n&gt; effects in my eyes. Using assert statements would be a compromise.\n&gt;\n&gt; I think I could use assert statements at the beginning of a method \n&gt; and at the end, checking preconditions and postconditions.\n\nViolating pre- and postconditions is just a small subset of what can go\nwrong in your code. Unit tests often test the interplay of two or three\nmethods, or even of several objects. You can&#39;t do this (effectively)\nwith embedded assertions.\n \n&gt; By marking them somehow as preconditions and postconditions it should \n&gt; theoretically be possible to automate generation of JUnit \n&gt; tests/suites, including test data. The test data can be created \n&gt; automatically by a tool which obeys the preconditions for that \n&gt; purpose. Java Modelling Language seems to do exactly this.\n\nDo you have a pointer?\n\n\n&gt; It seems that with JUnit I can only test methods which return a \n&gt; value.\n\nThat&#39;s wrong, as others already stated.\n\n&gt; Using JUnit will change the code one would normally create: \n&gt; Because of JUnit you need to overwrite equals(), toString() and are \n&gt; not allowed to use void return type if you want to test that method.\n\nThe latter is simply wrong, the former is typically a good thing -\n(unit-)testable code is decoupled code.\n\n&gt; Besides all this problems whis JUnit is another one: Successful \n&gt; JUnits tests are no guarantee that there are no bugs in the code I \n&gt; read. This has to do with data chains. But I didn&#39;t understand this.\n\nAsserts are even less a guarantee. Asserts need to be executed to be\neffective - if you don&#39;t have external code invoking them in a well\ndirected manner, they will not be of any use until in the production\nenvironment.\n\n&gt; And I read that it is extremely time consuming to create test cases \n&gt; for all possible cases.\n\nMost people experience that it is less time consuming to create test\ncases for the reasonable cases than to have to debug the code later on.\n\n&gt; The good thing about using assert statements would also be, that the \n&gt; test is included in the method. So no extra coding of classes would \n&gt; be requiered as with using JUnit. Everything is in one place, user \n&gt; friendly.\n\nIf you really prefer this way, it wouldn&#39;t be too hard to include the\nunit tests into your production code. Most people seem to prefer to\nseperate the two.\n\n&gt; Using assert statements will not force the developer to use a special \n&gt; developing practice like testdriven development. He is free to \n&gt; develop in his own style.\n\nJunit doesn&#39;t force you to develop test-driven at all.\n\n\n&gt; The synchronisation between test cases and methods to be tested would \n&gt; is time consuming.\n\nYou might fear that it is. In practice, it doesn&#39;t seem to be that way.\n\n&gt; And what happens if you change a method so that \n&gt; preconditions or postconditions will become different? Will you \n&gt; remember to change the JUnit to fit these changes? Or will you \n&gt; sometimes forget? Error detecting is then twice as hard, since it can \n&gt; originate in the test class or in the class to be tested. Thats a \n&gt; point where assert statements are better in my eyes compared to JUnit.\n\nWith Junit, you can (and probably should) run the tests every couple of\nminutes. There are even tools to automate this. My IDE shows me wether I\nrun the tests since the last code change, and an integration server\nemails me if I broke a test nevertheless.\n\nI wouldn&#39;t know how to do that with embedded asserts. It seems to me\nthat they make it much more likely to detecht an error not until late in\ndevelopment.\n\nSo, did that help?\n\nRegards, Ilja\n\n\n", 
    "profile": "ipreussde", 
    "topicId": 7355, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 96623270, 
    "prevInTime": 7408, 
    "contentTrasformed": false, 
    "postDate": "1049269795", 
    "canDelete": false, 
    "nextInTopic": 7418, 
    "prevInTopic": 7394, 
    "headers": {
        "inReplyToHeader": "PGI2Ym02citnYXQwQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDAwMGUwMWMyZjhlYyQ3M2RmOWNjMCQ3MDY0YThjMEBQQVJJUz4="
    }
}