{
    "numMessagesInTopic": 11, 
    "nextInTime": 742, 
    "senderId": "BpdTH0Lb8Dm3trmHI_mzKdPvsjwlOh1ymJqQhGi2ExyENrWre3ph_eBaJbW8CGBlNqOpxlsj8Q", 
    "systemMessage": false, 
    "subject": "Re: Implementing JUnit AFTER development has started...", 
    "from": "ghouston@...", 
    "authorName": "ghouston@iss.net", 
    "msgSnippet": "One thing to watch out for:  Existing classes that are hard to test! I ve built tests on existing code and frequently I see classes that are very hard to test.", 
    "msgId": 741, 
    "topicId": 729, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-683723462\">One thing to watch out for:  Existing classes that are hard to test!<br/>\n<br/>\nI&#39;ve built tests on existing code and frequently I see classes that <br/>\nare very hard to test.  This happens because the classes were <br/>\noriginally developed without Unit Testing in mind.  For a class to be <br/>\neasy to test, it needs to follow good Object Oriented Design <br/>\npractices where the class is well encapsulated and has little <br/>\ncoupling with other classes.<br/>\n<br/>\n[Note:  I&#39;ve also seen Unit Testing improve the design.  Making the <br/>\nclasses testable makes for better encapsulation and lower coupling]<br/>\n<br/>\nPutting Unit Tests on existing code can get very ugly.  Some classes <br/>\nmay not be worth Unit Testing until they are first refactored into <br/>\nsomething more easily tested.  This refactoring is beneficial but <br/>\ncostly.  You will have to make the cost-benefit determination to see <br/>\nif you should Unit Test the difficult code, refactor it, defer it.</div>", 
    "prevInTime": 740, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "985019376", 
    "canDelete": false, 
    "nextInTopic": 742, 
    "prevInTopic": 734, 
    "headers": {
        "inReplyToHeader": "PE5FQkJLUEhOSUtGTExFSE5JTUtLR0VEQ0REQUEuZGF2aWRfZ291ZHJlYXVAY3Jvc3Njb21tZXJjZS5jb20+", 
        "messageIdInHeader": "PDk5NWM1Zyt2M2c3QGVHcm91cHMuY29tPg=="
    }
}