{
    "numMessagesInTopic": 5, 
    "nextInTime": 7421, 
    "senderId": "XTTOOJHTmcx8bzuV7Ih319uyMWENtXrujTgapgJLPfXw3ARh-migzDSq7t7KVxoQTGjuuiLN2WjsCogqCkeMZpqJZe3NuJogzXbhxdc", 
    "systemMessage": false, 
    "subject": "JUnit Result Logging", 
    "from": "&quot;Gupta, Vipul&quot; &lt;Vipul.Gupta@...&gt;", 
    "authorName": "Gupta, Vipul", 
    "msgSnippet": "Hi Friends, I am new to the JUnit group and also in the using of JUnit framework. We are migrating our projects into Java and so need some good test cases to", 
    "msgId": 7420, 
    "profile": "vipulgupta1", 
    "topicId": 7420, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 80438104, 
    "messageBody": "<div id=\"ygrps-yiv-956944073\">Hi Friends,<br/>\n<br/>\nI am new to the JUnit group and also in the using of JUnit framework. We are<br/>\nmigrating our projects into Java and so need some good test cases to be made<br/>\nfor the automated testing.<br/>\n<br/>\nCan anyone tell whether there is any method provided in JUnit to log the<br/>\ntest results so that one can have look on them later on.<br/>\n<br/>\nRegards<br/>\nVipul<br/>\n- - - - - - - DISCLAIMER - - - - - - - -<br/>\nUnless indicated otherwise, the information contained in this message is<br/>\nprivileged and confidential, and is intended only for the use of the<br/>\naddressee(s) named above and others who have been specifically authorized to<br/>\nreceive it. If you are not the intended recipient, you are hereby notified<br/>\nthat any dissemination, distribution or copying of this message and/or<br/>\nattachments is strictly prohibited. The company accepts no liability for any<br/>\ndamage caused by any virus transmitted by this email. Furthermore, the<br/>\ncompany does not warrant a proper and complete transmission of this<br/>\ninformation, nor does it accept liability for any delays. If you have<br/>\nreceived this message in error, please contact the sender and delete the<br/>\nmessage. Thank you.</div>", 
    "prevInTime": 7419, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1049275951", 
    "canDelete": false, 
    "nextInTopic": 7467, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDgwMDRGM0UwODg3REQ0MTE5NjJFMDA1MDhCNTVDOEFBQkQ5MjIxQG5vaWZwczAxLmJhcmNvLmNvbT4="
    }
}