{
    "numMessagesInTopic": 14, 
    "nextInTime": 7426, 
    "senderId": "KNEisPCI5nrr6dS2wZa6_syGrHA-LZ5rrfmxPNsL9jUIFCPfr_l_Tim9hfXutJdMdMrCpf5YUGi0dz0irxfhGVSBslN5TJfCxPSI0z_bgwDp", 
    "systemMessage": false, 
    "subject": "Re: [junit] How do I make Unit Testing practical?", 
    "from": "Scott Palmer &lt;scott.palmer@...&gt;", 
    "authorName": "Scott Palmer", 
    "msgSnippet": "Thanks for the comments so far, they have been reassuring.. but of course that was expected from this group ;-) more questions: Is unit testing much harder if", 
    "msgId": 7425, 
    "profile": "swpalmer2001", 
    "topicId": 7360, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124593303, 
    "messageBody": "<div id=\"ygrps-yiv-793679420\">Thanks for the comments so far, they have been reassuring.. but of <br/>\ncourse that was expected from this group ;-)<br/>\n<br/>\nmore questions:<br/>\nIs unit testing much harder if I don&#39;t use TDD?<br/>\n<br/>\nI&#39;ve got a lot of code written already and retrofitting the test cases <br/>\nis going to be fun.  Also, what is done about the &#39;bloat&#39; that is added <br/>\nto classes by test code?  (mainly when inner classes are used to <br/>\nfacilitate testing).  I don&#39;t care about it in the development <br/>\nenvironment, but if my application is to be downloaded and there are <br/>\nmegabytes of embedded test code it can become an issue.  (So far my <br/>\ncode is a small fraction of the download, so this isn&#39;t an issue - yet)<br/>\n<br/>\nAnother comment:<br/>\nI&#39;ve been trying to get started with the unit testing and have been <br/>\nencouraging other&#39;s in my company to try it too, but I can&#39;t get any <br/>\nbuy-in. I&#39;m finding it difficult to get started so I don&#39;t really have <br/>\na convincing argument for it other than &quot;I&#39;ve read that it is a great <br/>\nthing&quot; :), obviously if I can make it work for me it would help.   It&#39;s <br/>\ngood to hear that others have had the same issues and have gotten past <br/>\nthem.   The examples make it look so simple and easy...<br/>\n<br/>\nOn Wednesday, April 2, 2003, at 12:46 AM, Levi Cook <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:levicook@...\">levicook@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; On Tuesday, April 1, 2003, at 02:07  PM, swpalmer2001 wrote:<br/>\n&gt;<br/>\n&gt;&gt; Or is this unit testing just a passing fad that is<br/>\n&gt;&gt; really nothing more than a bunch of hype?<br/>\n&gt;<br/>\n&gt; PS&gt; Despite your opening disclaimer this sounds a little like trolling<br/>\n&gt; :)<br/>\n&gt;<br/>\n </span></blockquote>Yes, it does (sorry).. My intention was to get a feel for how many <br/>\npeople out there have been down this road and concluded that it wasn&#39;t <br/>\nall that it was promised to be. (Not that I would find many of those <br/>\npeople on this list.  But maybe I could find others that were <br/>\nstruggling.)  I&#39;ve heard the &#39;pros&#39;  and they are quite convincing, I <br/>\nwas after the &#39;cons&#39;.<br/>\n<br/>\n<br/>\nScott</div>", 
    "prevInTime": 7424, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1049294425", 
    "canDelete": false, 
    "nextInTopic": 7427, 
    "prevInTopic": 7405, 
    "headers": {
        "inReplyToHeader": "PDEwNDkyNjIzNjkuMzI4NS4zMDUxNy5tMUB5YWhvb2dyb3Vwcy5jb20+", 
        "messageIdInHeader": "PDBBNkI2N0RBLTY1MTktMTFENy1CNTAyLTAwMEE5NTY4M0UwMkAyY29ubmVjdGVkLm9yZz4="
    }
}