{
    "numMessagesInTopic": 45, 
    "nextInTime": 7441, 
    "senderId": "FZelUL-sUb4d8yNDndzHhUyJZ8YvLu9VVleJVVOCMAnrKcamLP6aIwpQmYT7fJIrftfJhFKjg5Klb_hIussSloNoGyc2", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: JUnit considered problematic", 
    "from": "Eric Vought &lt;evought@...&gt;", 
    "authorName": "Eric Vought", 
    "msgSnippet": "... That would be great if it worked. Unfortunately, the compiler, even in a language like Eiffel, can only detect constraint violations at compile time in the", 
    "msgId": 7440, 
    "rawEmail": "Return-Path: &lt;evought@...&gt;\r\nX-Sender: evought@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_6_5); 2 Apr 2003 18:53:27 -0000\r\nReceived: (qmail 33174 invoked from network); 2 Apr 2003 18:53:27 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m6.grp.scd.yahoo.com with QMQP; 2 Apr 2003 18:53:27 -0000\r\nReceived: from unknown (HELO ral.qlue.com) (65.86.123.178)\n  by mta2.grp.scd.yahoo.com with SMTP; 2 Apr 2003 18:53:27 -0000\r\nDate: Wed, 2 Apr 2003 13:54:25 -0500\r\nSubject: Re: [junit] Re: JUnit considered problematic\r\nContent-Type: text/plain; delsp=yes; charset=US-ASCII; format=flowed\r\nMime-Version: 1.0 (Apple Message framework v551)\r\nTo: junit@yahoogroups.com\r\nContent-Transfer-Encoding: 7bit\r\nIn-Reply-To: &lt;b6e4g6+2k10@...&gt;\r\nMessage-Id: &lt;8608DA72-653C-11D7-9AB1-000393C30ECE@...&gt;\r\nX-Mailer: Apple Mail (2.551)\r\nFrom: Eric Vought &lt;evought@...&gt;\r\nX-Yahoo-Group-Post: member; u=77258944\r\nX-Yahoo-Profile: eric_vought\r\n\r\n\nOn Wednesday, April 2, 2003, at 02:46  PM, javainsel wrote:\n\n&gt; I wish I would be a expert to convince you of a better approach than\n&gt; JUnit provides (and TDD).\n&gt;\n&gt; But I try.\n&gt;\n&gt; I consider Design by Contract to be suitable to replace JUnit and TDD\n&gt; completely. It can provide many benefits and by the same time not\n&gt; having all the side effects that JUnit and TDD have. Examples are\n&gt; Eiffel and Java Modelling Language (JML).\n&gt;\n&gt; Why? How? I&#39;ll explain.\n&gt;\n&gt; Testing of the code (methods) can be done with precondition,\n&gt; invartiants and postconditions (the contracts). Thats how I\n&gt; understand Design by Contract. You write your method definition and\n&gt; then you write the contract for it. Then you implement your method.\n&gt;\n&gt; Now the great thing: When you compile your code the implementation\n&gt; can be checked whether it obeys the contract. If not, a compile error\n&gt; is thrown. That it! No JUnit test needed! Not TDD needed! Besides\n&gt; this, a contract serves as a documentation. And it can use invariants\n&gt; which JUnit will always lack of.\n\nThat would be great if it worked. Unfortunately, the compiler, even in  \na language like Eiffel, can only detect constraint violations at  \ncompile time in the simplest of cases. A design-by-contract language  \njust inserts run-time checks the rest of the time. The run-time checks  \nonly work if all the code is actually executed. If a method is not run  \nin testing, the check will never have a chance to fail before it gets  \nin the hands of users. This leaves you with either trying to run the  \napplication manually and try *everything* or find a way to automate the  \ntest process. This in turn leads to something like JUnit.\n\nAn additional problem with design-by-contract is that general-purpose  \npostcondition checks are difficult to write. With a non-trivial method,  \nthe postcondition code must often either be as complex as the method  \nitself (and therefore at least as likely to have errors) or must depend  \non the same underlying code as the method (I see people cut and paste  \noften). Writing an external test-case is often much easier by  \ncomparison. You can choose inputs for which the output is easy to  \nverify and control the environment using constructs like Mock-Objects.\n\nDesign-by-contract does not replace unit-testing. When combined with  \ndesign-by-contract, unit testing is much more effective. When the  \napplication is constantly verifying its own state, failures tend to  \noccur much closer to the actual bug than otherwise. It is very possible  \nfor a testcase without DBC to succeed but leave the code in an unstable  \nstate. Since a unit test throws away its data after every run, this  \nwill not be detected without either more complex unit tests or  \ndesign-by-contract assertions.\n\nDesign-by-contract assertions also allow one to check internal state  \nthat one does not wish to expose to unit testing. Having unit tests  \nreach too deeply in the code makes your test suite fragile. Instead,  \nuse unit tests to exercise the code and verify external behavior while  \nletting the assertions verify internal consistency after each operation.\n\nI have used Eiffel, have used design-by-contract principles in other  \nlanguages, and have followed the process with home grown macros for  \nlonger than DBC has been called such. It is a useful tool, but DBC is  \nnot magic and does not make the need for testing go away.\n\n&gt;\n&gt; Now come on and don&#39;t tell me: &quot;We always used JUnit, most people do,\n&gt; why do you little inexperienced programer think you have a better\n&gt; idea than people like Gamma or Fowler?&quot;\n&gt;\n&gt; I am not satisfied with the JUnit and TDD &quot;paradigma&quot;. They are\n&gt; originated because of a *poverty* in Java programing language. If\n&gt; Java would support proper Design by Contract and a compiler for that\n&gt; than no one would bother with JUnit and TDD.\n&gt;\n&gt;\n&gt;\n&gt; ------------------------ Yahoo! Groups Sponsor  \n&gt; ---------------------~--&gt;\n&gt; Get 128 Bit SSL Encryption!\n&gt; http://us.click.yahoo.com/xaxhjB/hdqFAA/VygGAA/5cFolB/TM\n&gt; --------------------------------------------------------------------- \n&gt; ~-&gt;\n&gt;\n&gt; To unsubscribe from this group, send an email to:\n&gt; junit-unsubscribe@yahoogroups.com\n&gt;\n&gt;\n&gt; Your use of Yahoo! Groups is subject to  \n&gt; http://docs.yahoo.com/info/terms/\n&gt;\n&gt;\n\n\n", 
    "profile": "eric_vought", 
    "topicId": 7355, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 77258944, 
    "prevInTime": 7439, 
    "contentTrasformed": false, 
    "postDate": "1049309665", 
    "canDelete": false, 
    "nextInTopic": 7447, 
    "prevInTopic": 7439, 
    "headers": {
        "inReplyToHeader": "PGI2ZTRnNisyazEwQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDg2MDhEQTcyLTY1M0MtMTFENy05QUIxLTAwMDM5M0MzMEVDRUBxbHVlLmNvbT4="
    }
}