{
    "numMessagesInTopic": 14, 
    "nextInTime": 7444, 
    "senderId": "XbzrAOZEH0GZi9JeCRcToskuOy_mi06kgYzrwOqHjO7_F1_9tfFK3WfQiM77KvDnXx7jLWxn_NQiZhHsg9AwTMOwU7mRymb8Y7nq070IaQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] How do I make Unit Testing practical?", 
    "from": "Frank Burough &lt;fburough@...&gt;", 
    "authorName": "Frank Burough", 
    "msgSnippet": "... Retrofitting unit tests to existing code is certainly more difficult than writing tests before writing the code (as TDD suggests). ... My experience is", 
    "msgId": 7443, 
    "topicId": 7360, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 142170960, 
    "messageBody": "<div id=\"ygrps-yiv-686889434\">On Wed, 2003-04-02 at 09:40, Scott Palmer wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Thanks for the comments so far, they have been reassuring.. but of <br/>\n&gt; course that was expected from this group ;-)<br/>\n&gt; <br/>\n&gt; more questions:<br/>\n&gt; Is unit testing much harder if I don&#39;t use TDD?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Retrofitting unit tests to existing code is certainly more difficult<br/>\nthan writing tests before writing the code (as TDD suggests). <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve got a lot of code written already and retrofitting the test cases <br/>\n&gt; is going to be fun.  Also, what is done about the &#39;bloat&#39; that is added <br/>\n&gt; to classes by test code?  (mainly when inner classes are used to <br/>\n&gt; facilitate testing).  I don&#39;t care about it in the development <br/>\n&gt; environment, but if my application is to be downloaded and there are <br/>\n&gt; megabytes of embedded test code it can become an issue.  (So far my <br/>\n&gt; code is a small fraction of the download, so this isn&#39;t an issue - yet)<br/>\n<br/>\n </span></blockquote>My experience is that when I get serious about testing existing code, I<br/>\nfind myself redesigning existing pieces to make them more easily<br/>\ntestable. I end up with a lot more classes, most of which are more<br/>\nfocused on their intent than the original. A great side-effect is that I<br/>\nam finding myself with a lot of reusable code that I did not know I had.<br/>\nI am not sure because I have not run any statistics, but I think my<br/>\ntotal number of lines of code generally decreases during this process. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Another comment:<br/>\n&gt; I&#39;ve been trying to get started with the unit testing and have been <br/>\n&gt; encouraging other&#39;s in my company to try it too, but I can&#39;t get any <br/>\n&gt; buy-in. I&#39;m finding it difficult to get started so I don&#39;t really have <br/>\n&gt; a convincing argument for it other than &quot;I&#39;ve read that it is a great <br/>\n&gt; thing&quot; :), obviously if I can make it work for me it would help.   It&#39;s <br/>\n&gt; good to hear that others have had the same issues and have gotten past <br/>\n&gt; them.   The examples make it look so simple and easy...<br/>\n<br/>\n </span></blockquote>Been there, done that. Most developers don&#39;t want to write tests because<br/>\nthey think testing is boring or has no value added to them (i.e. it does<br/>\nnot help them write code better or faster). I was in that camp for quite<br/>\na while. However, when I found myself writing acceptance tests and<br/>\nhaving them find bugs that should have been found earlier in the<br/>\ndevelopment cycle, I began to look for a &#39;better way&#39;. For me, using<br/>\nJUnit as an integral part of my software development process does allow<br/>\nme to write code that I am much more confident in. The examples do make<br/>\nit look simple and easy. In practice I find it pretty simple and easy to<br/>\nwrite tests, after the initial learning curve. I am by no means an<br/>\nexpert, having started doing serious work with JUnit just a couple of<br/>\nmonths ago. But the more I use it the better I like it.<br/>\n <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; On Wednesday, April 2, 2003, at 12:46 AM, Levi Cook <br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:levicook@...\">levicook@...</a>&gt; wrote:<br/>\n&gt; &gt; On Tuesday, April 1, 2003, at 02:07  PM, swpalmer2001 wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt;&gt; Or is this unit testing just a passing fad that is<br/>\n&gt; &gt;&gt; really nothing more than a bunch of hype?<br/>\n&gt; &gt;<br/>\n&gt; &gt; PS&gt; Despite your opening disclaimer this sounds a little like trolling<br/>\n&gt; &gt; :)<br/>\n&gt; &gt;<br/>\n&gt; Yes, it does (sorry).. My intention was to get a feel for how many <br/>\n&gt; people out there have been down this road and concluded that it wasn&#39;t <br/>\n&gt; all that it was promised to be. (Not that I would find many of those <br/>\n&gt; people on this list.  But maybe I could find others that were <br/>\n&gt; struggling.)  I&#39;ve heard the &#39;pros&#39;  and they are quite convincing, I <br/>\n&gt; was after the &#39;cons&#39;.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Scott<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 7442, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1049303223", 
    "canDelete": false, 
    "nextInTopic": 7451, 
    "prevInTopic": 7436, 
    "headers": {
        "inReplyToHeader": "PDBBNkI2N0RBLTY1MTktMTFENy1CNTAyLTAwMEE5NTY4M0UwMkAyY29ubmVjdGVkLm9yZz4=", 
        "messageIdInHeader": "PDEwNDkzMDMyMjMuMTg4My4xMy5jYW1lbEBmYnVyb3VnaD4=", 
        "referencesHeader": "PDBBNkI2N0RBLTY1MTktMTFENy1CNTAyLTAwMEE5NTY4M0UwMkAyY29ubmVjdGVkLm9yZz4="
    }
}