{
    "numMessagesInTopic": 11, 
    "nextInTime": 746, 
    "senderId": "89hghxxLSH-YgE8Q8LdNWlK7aYnKGRiALqVIfdZru2IKTZtcrQVZ7Ki6kUxYenMi6M-IobRGn8OJ1tJs98w3xvx-SHXyv8fb_1WDebEZz70ZRg", 
    "systemMessage": false, 
    "subject": "RE: [junit] Re: Implementing JUnit AFTER development has started...", 
    "from": "&quot;Jason Trip&quot; &lt;jason_trip@...&gt;", 
    "authorName": "Jason Trip", 
    "msgSnippet": "You are right about the ugliness of testing existing classes.  If I try to make one Junit test for one of our existing classes, I end up either (a) putting a", 
    "msgId": 745, 
    "topicId": 729, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1680597130\">You are right about the ugliness of testing existing classes.  If I try to<br/>\nmake one Junit test for one of our existing classes, I end up either (a)<br/>\nputting a lot of code in the setup() method that gets used by only some of<br/>\nthe test methods or (b) not using the setup() and teardown() at all since<br/>\nthe data setup is completely different for each method to test. Plus there<br/>\nis other problems with not being familiar with the class and the large<br/>\namounts of database setup that has to occur.<br/>\n<br/>\nIs the intention of each Junit test to test one CLASS?  And if so, should<br/>\neach method in a Junit class correspond to a test of one public method in<br/>\nthe class it is testing?  I think this is the case, but our existing code<br/>\ndoes not lend itself easily to this.  So I take it that (a.) all classes<br/>\nshould be designed so that they can be unit tested with ONE testcase (b.)<br/>\nwhere all the code in the setup() and teardown() are useful for each of the<br/>\ntest methods in the class and (c.) there should be ONE test method<br/>\ncorresponding to each public method in the class being tested?<br/>\n<br/>\nAssuming the above is true, how would I test the following:  If I have one<br/>\ntest method for the constructor, and one test method for each of the methods<br/>\nthat act on that constructed object, the setup() and teardown() code becomes<br/>\nreally ugly because I need to setup data (requires A LOT of database setup)<br/>\nfor the constructor and I need to use the constructor method itself for the<br/>\nsetup() to test the other methods.<br/>\n...I think the answer is that I should not test that constructor in that<br/>\nunit test, and instead I should have a completely different unit test for<br/>\nthe creation of the object (it would be a unit test of a Factory object)?<br/>\n<br/>\n<br/>\nIs there ever a VALID case when a one-to-one correspondence of<br/>\nclass-to-unit-test should not make sense?  Can you ever make a properly<br/>\ndesigned class that would require 4 or 5 completely different unit tests?<br/>\nIf so, these 4 or 5 tests sound like functional tests rather than &#39;unit&#39;<br/>\ntests, and does this tell me that my class wasn&#39;t defined correctly in the<br/>\nfirst place, and that I need to &#39;refactor&#39; it?<br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ghouston@...\">ghouston@...</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ghouston@...\">ghouston@...</a>]<br/>\nSent: Monday, March 19, 2001 8:30 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSubject: [junit] Re: Implementing JUnit AFTER development has started...<br/>\n<br/>\n<br/>\n<br/>\nOne thing to watch out for:  Existing classes that are hard to test!<br/>\n<br/>\nI&#39;ve built tests on existing code and frequently I see classes that<br/>\nare very hard to test.  This happens because the classes were<br/>\noriginally developed without Unit Testing in mind.  For a class to be<br/>\neasy to test, it needs to follow good Object Oriented Design<br/>\npractices where the class is well encapsulated and has little<br/>\ncoupling with other classes.<br/>\n<br/>\n[Note:  I&#39;ve also seen Unit Testing improve the design.  Making the<br/>\nclasses testable makes for better encapsulation and lower coupling]<br/>\n<br/>\nPutting Unit Tests on existing code can get very ugly.  Some classes<br/>\nmay not be worth Unit Testing until they are first refactored into<br/>\nsomething more easily tested.  This refactoring is beneficial but<br/>\ncostly.  You will have to make the cost-benefit determination to see<br/>\nif you should Unit Test the difficult code, refactor it, defer it.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a></div>", 
    "prevInTime": 744, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "985036037", 
    "canDelete": false, 
    "nextInTopic": 746, 
    "prevInTopic": 742, 
    "headers": {
        "inReplyToHeader": "PDk5NWM1Zyt2M2c3QGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PE5FQkJKRUNQRk1MSE9CQkJLTkxLR0VPQUNFQUEuamFzb25fdHJpcEBjcm9zc2NvbW1lcmNlLmNvbT4="
    }
}