{
    "topicId": 729, 
    "postDate": "985044403", 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "from": "&quot;Chas Schley&quot; &lt;chas@...&gt;", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "5XrqRx4AYqWKjYxNuie0-Unt4ESaCPJASefs86Vl1UjAarbAD5Q0XrW0qmbq_GdLDI58Rh8KCWquzGCDkw1Uxw0lqEMy6Q", 
    "nextInTime": 747, 
    "userId": 0, 
    "prevInTime": 745, 
    "prevInTopic": 745, 
    "headers": {
        "messageIdInHeader": "PDAxNDcwMWMwYjBjYyQwZWU2YWYzMCQ2NDY2NjQwYUB6aGFucmEuY29tPg==", 
        "referencesHeader": "PE5FQkJKRUNQRk1MSE9CQkJLTkxLR0VPQUNFQUEuamFzb25fdHJpcEBjcm9zc2NvbW1lcmNlLmNvbT4="
    }, 
    "authorName": "Chas Schley", 
    "numMessagesInTopic": 11, 
    "msgSnippet": "It sounds to me like your prevalent coding practice is that each class has a constructor and several public instance methods that act on the constructed ", 
    "contentTrasformed": false, 
    "msgId": 746, 
    "nextInTopic": 750, 
    "systemMessage": false, 
    "rawEmail": "Return-Path: &lt;chas@...&gt;\r\nX-Sender: chas@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-7_0_4); 19 Mar 2001 23:22:36 -0000\r\nReceived: (qmail 89413 invoked from network); 19 Mar 2001 23:22:35 -0000\r\nReceived: from unknown (10.1.10.27) by l10.egroups.com with QMQP; 19 Mar 2001 23:22:35 -0000\r\nReceived: from unknown (HELO napa.zhanra.com) (63.91.87.120) by mta2 with SMTP; 19 Mar 2001 23:22:34 -0000\r\nReceived: from chas (chas.zhanra.com [10.100.102.100]) by napa.zhanra.com (8.9.3/8.9.3) with SMTP id PAA23104 for &lt;junit@yahoogroups.com&gt;; Mon, 19 Mar 2001 15:24:23 -0800\r\nMessage-ID: &lt;014701c0b0cc$0ee6af30$6466640a@...&gt;\r\nReply-To: &quot;Chas Schley&quot; &lt;chas@...&gt;\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nReferences: &lt;NEBBJECPFMLHOBBBKNLKGEOACEAA.jason_trip@...&gt;\r\nSubject: Re: [junit] Re: Implementing JUnit AFTER development has started...\r\nDate: Mon, 19 Mar 2001 15:26:43 -0800\r\nOrganization: Zhanra Corporation\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Priority: 3\r\nX-MSMail-Priority: Normal\r\nX-Mailer: Microsoft Outlook Express 5.00.2919.6600\r\nX-MimeOLE: Produced By Microsoft MimeOLE V5.00.2919.6600\r\nFrom: &quot;Chas Schley&quot; &lt;chas@...&gt;\r\n\r\nIt sounds to me like your prevalent coding practice is that each class has a\nconstructor and several public instance methods that act on the constructed\nobject.\n\nIf you have more than just the default constructor (public MyClass() { }),\nthen you should have several tests for each constructor in the class under\ntest (vary the inputs).  If you have to, you can use the newly constructed\nobjects in subsequent tests, but try to avoid doing that since it would\ncause otherwise independent tests to depend on each other.\n\nYou can usually test static methods without constructing the object under\ntest.\n\nTo test instance methods, you need an instance of the class on which the\nmethods are defined.  To solve this, I implemented a test case (i.e., a\nclass that extends TestCase) that initializes default instances of each\nobject in our object layer and provides factory methods for that default\ninstance.  All of our test cases extend that class.  This way, each test\nautomatically has access to an instance of the class under test.\nNon-intrusive tests (accesors) simply use the default instance of the class\nprovided by the test case superclass.  Intrusive tests (mutators) fetch a\nnew instance from the factory in the superclass, mutate it as needed and run\ntheir test assertion.  You could also push the object cloning code into the\nproduct classes if you think it might be useful there (we did).  The bulk of\nour tests for instance methods no longer need to construct an instance of\nthe class under test before running their test.\n\nUsing this methodology, your generic database setup is done once at the\noutset of your AllTests suite and shared amongst all of your test cases.\n\nAlso consider using mock objects to simulate the class under test.  You\nmight save yourself mounds of test-specific database setup.\n\nCheers,\n\n_chas_\n\n&gt; From: &quot;Jason Trip&quot; &lt;jason_trip@...&gt;\n&gt; To: &lt;junit@yahoogroups.com&gt;\n&gt; Sent: Monday, March 19, 2001 1:07 PM\n&gt; Subject: RE: [junit] Re: Implementing JUnit AFTER development has\nstarted...\n&gt;\n\n&gt; You are right about the ugliness of testing existing classes.  If I try to\n&gt; make one Junit test for one of our existing classes, I end up either (a)\n&gt; putting a lot of code in the setup() method that gets used by only some of\n&gt; the test methods or (b) not using the setup() and teardown() at all since\n&gt; the data setup is completely different for each method to test. Plus there\n&gt; is other problems with not being familiar with the class and the large\n&gt; amounts of database setup that has to occur.\n&gt;\n&gt; Is the intention of each Junit test to test one CLASS?  And if so, should\n&gt; each method in a Junit class correspond to a test of one public method in\n&gt; the class it is testing?  I think this is the case, but our existing code\n&gt; does not lend itself easily to this.  So I take it that (a.) all classes\n&gt; should be designed so that they can be unit tested with ONE testcase (b.)\n&gt; where all the code in the setup() and teardown() are useful for each of\nthe\n&gt; test methods in the class and (c.) there should be ONE test method\n&gt; corresponding to each public method in the class being tested?\n&gt;\n&gt; Assuming the above is true, how would I test the following:  If I have one\n&gt; test method for the constructor, and one test method for each of the\nmethods\n&gt; that act on that constructed object, the setup() and teardown() code\nbecomes\n&gt; really ugly because I need to setup data (requires A LOT of database\nsetup)\n&gt; for the constructor and I need to use the constructor method itself for\nthe\n&gt; setup() to test the other methods.\n&gt; ...I think the answer is that I should not test that constructor in that\n&gt; unit test, and instead I should have a completely different unit test for\n&gt; the creation of the object (it would be a unit test of a Factory object)?\n\n\n", 
    "subject": "Re: [junit] Re: Implementing JUnit AFTER development has started..."
}