{
    "numMessagesInTopic": 12, 
    "nextInTime": 7537, 
    "senderId": "nUzCGMY_gHq1GCotopFTZDpgtYWK_EZj-kkdSNt_Qszjj2b86dDzHj7Ds5t9ZGE7fL7mot_ulvaZuuPfFWYkkPvmMif4Sw", 
    "systemMessage": false, 
    "subject": "Re: [junit] J2EE &quot;patterns&quot;", 
    "from": "Mike Clark &lt;mike@...&gt;", 
    "authorName": "Mike Clark", 
    "msgSnippet": "... IMO, it s a pattern in the sense that it is a common solution to a reoccurring problem in distributed computing.  By naming it, we establish a common", 
    "msgId": 7536, 
    "profile": "clarkware", 
    "topicId": 7518, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 33026788, 
    "messageBody": "<div id=\"ygrps-yiv-347343066\">J. B. Rainsberger wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I will make a statement that probably better belongs on another list, but I&#39;ll make it here and welcome either private responses or an invitation to a more appropriate place to discuss this.<br/>\n&gt;<br/>\n&gt;I do not react well to calling J2EE implementation idioms &quot;patterns&quot;. They are hacks designed to increase performance and work around the obvious limitations and faulty intentions of J2EE.<br/>\n&gt;<br/>\n&gt;Session facade is not a &quot;pattern&quot; in the sense of &quot;improves design&quot;. It is a hack that gets around the fact that J2EE tries to hide RMI from the programmer. If we didn&#39;t have to worry about remote objects, then how would we design it? I don&#39;t think we&#39;d arrive at these implementation idioms/hacks if it weren&#39;t for working around either remote objects or a persistence mechanism that tries to call &quot;save&quot; for every method call.<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>IMO, it&#39;s a pattern in the sense that it is a common solution to a <br/>\nreoccurring problem in distributed computing.  By naming it, we <br/>\nestablish a common vocabulary for recognizing and debating the problem. <br/>\n Moreover, I believe session facade does improve design.  It decouples <br/>\nremote clients from persistent objects, perhaps modeled as entity beans, <br/>\nand encapsulates business logic in a cohesive location.  That is, it&#39;s a <br/>\nlayering technique to separate concerns and manage dependencies.  <br/>\n<br/>\nOne person&#39;s pattern is another person&#39;s hack.<br/>\n<br/>\nMike<br/>\n<br/>\n-- <br/>\nMike Clark<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://clarkware.com\">http://clarkware.com</a><br/>\n(303) 589-3812</div>", 
    "prevInTime": 7535, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1049468208", 
    "canDelete": false, 
    "nextInTopic": 7543, 
    "prevInTopic": 7535, 
    "headers": {
        "messageIdInHeader": "PDNFOEQ5RDMwLjEwMzAzMDRAY2xhcmt3YXJlLmNvbT4=", 
        "referencesHeader": "PE9GRENBMjlFNTYuNkUxQTIzNEItT05DMTI1NkNGRS4wMDMzOTYxMkBzYmFiLnNlPiA8MjAwMzA0MDQwOTAyMzUwMjMxLjBBOENFMTI3QHNzbXRwLmJsb29yLmlzLm5ldC5jYWJsZS5yb2dlcnMuY29tPg=="
    }
}