{
    "numMessagesInTopic": 4, 
    "nextInTime": 7552, 
    "senderId": "_Z2H2OgaGroCLamZ3PYNRxNqnQpjuHRCy5xA3RtJK3l8w5xVNkocMjnN5Vk9AvCIJyXzIX09dE7z62ct9WcE3g", 
    "systemMessage": false, 
    "subject": "The Responsible CIO", 
    "from": "James &lt;jm04469@...&gt;", 
    "authorName": "James", 
    "msgSnippet": "Working on writing an article for an upcoming issue of a magazine targeted towards CIOs. Here is the basic thought: The vast majority of CIOs have been", 
    "msgId": 7551, 
    "profile": "jm04469", 
    "topicId": 7551, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 108677532, 
    "messageBody": "<div id=\"ygrps-yiv-844854721\">Working on writing an article for an upcoming issue of<br/>\na magazine targeted towards CIOs. Here is the basic<br/>\nthought:<br/>\n<br/>\nThe vast majority of CIOs have been wreckless in their<br/>\nthinking about outsourcing. The notion of sending work<br/>\nprimarily to India is minimally irresponsible. CIOs<br/>\nhave the fiduciary duty to protect the integrity of<br/>\ntheir systems and the health and welfare of existing<br/>\nemployees.<br/>\n<br/>\nThe responsible CIOs have taken steps that address the<br/>\nIndia movement. For example, the CIO of Phoenix Life<br/>\ntook the initiative to build their own outsourcing<br/>\nfacility in Bangalore India instead of giving it over<br/>\nto a third party. They did not underestimate the need<br/>\nfor &quot;employees&quot; to do work instead of third parties.<br/>\n<br/>\nOther CIOs that have adapted Agile approaches realize<br/>\nthat people interaction is more important than<br/>\nprocesses and tools. They figured out that outsourcing<br/>\nto locations where interaction with existing staff is<br/>\neasier makes the most sense. The really smart CIOs<br/>\nhave looked at smaller countries in the same time zone<br/>\nas their employees. For example, there are outsourcing<br/>\ncompanies in Barbados and Trinidad.<br/>\n<br/>\nThe Agile CIO also understands that his/her own<br/>\nemployees need to periodically travel in order to form<br/>\na viable partnership. Choosing countries that have<br/>\ndirect flights from major airports such as JFK, Miami,<br/>\netc are responsible. Likewise choosing countries where<br/>\nculture is similar to US/UK is also responsible. <br/>\n<br/>\nIgnoring the fact that the world is changing where<br/>\nterrorist activities are prevalent, choosing countries<br/>\nwhere this will not jeopardize the business is vital.<br/>\nImagine how many strategies are at risk if Pakistan<br/>\ndecides to fight India. One could academically argue<br/>\nthat maybe Trinidad would fight Barbados but this<br/>\nwould be silly.<br/>\n<br/>\nCIOs simply need to be more responsible...<br/>\n<br/>\n__________________________________________________<br/>\nDo you Yahoo!?<br/>\nYahoo! Tax Center - File online, calculators, forms, and more<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tax.yahoo.com\">http://tax.yahoo.com</a></div>", 
    "prevInTime": 7550, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1049546429", 
    "canDelete": false, 
    "nextInTopic": 7556, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDIwMDMwNDA1MTI0MDI5LjQ0NTkwLnFtYWlsQHdlYjIwODAyLm1haWwueWFob28uY29tPg=="
    }
}