{
    "numMessagesInTopic": 4, 
    "nextInTime": 7557, 
    "senderId": "ZAjLup6z4-P0iAJeOgi_ZS9NH9teiua63rauJgbuoBBKuUmoRbrTOy_WGru2HfM8stV4Ev7lPT2PUK6MapMIF9SvLZN3XP_HPW2isxECpg", 
    "systemMessage": false, 
    "subject": "[offtopic] RE: [junit] The Responsible CIO", 
    "from": "&quot;Scott Stirling&quot; &lt;scottstirling@...&gt;", 
    "authorName": "Scott Stirling", 
    "msgSnippet": "... [snip] I think this post is pretty offtopic.  But, you used the word Agile, so, I read it and am replying. Interesting article thoughts.  Also quite", 
    "msgId": 7556, 
    "profile": "jrun5", 
    "topicId": 7551, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 112036634, 
    "messageBody": "<div id=\"ygrps-yiv-1268324091\"><blockquote><span title=\"ireply\">&gt; From: James [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jm04469@...\">jm04469@...</a>]<br/>\n&gt;<br/>\n&gt; Working on writing an article for an upcoming issue of<br/>\n&gt; a magazine targeted towards CIOs. Here is the basic<br/>\n&gt; thought:<br/>\n </span></blockquote>[snip]<br/>\n<br/>\nI think this post is pretty offtopic.  But, you used the word &quot;Agile,&quot; so, I<br/>\nread it and am replying.<br/>\n<br/>\nInteresting article thoughts.  Also quite &quot;high level&quot; and speculative,<br/>\nwhich made me wonder about some facts.<br/>\n<br/>\nFor instance, what&#39;s the typical salary for a senior or principal developer<br/>\nin India?  How much is their salary affected by whether that engineer is<br/>\nworking out of Bombay or a suburb or some small city?  Just curious what the<br/>\nCIOs are up against in their decision process -- how much money can be saved<br/>\non a project by outsourcing some of the work?  What are the most successful<br/>\nways to leverage outsourcing help?<br/>\n<br/>\nHow much is outsourcing the decision of a CIO?  I&#39;ve seen outsourcing<br/>\nproposed and advocated at the department Director and VP level, though the<br/>\nCIO is usually involved to approve any large IT/Dev expenditure.  Of course<br/>\nwith job title inflation the past few years, there are lots of &quot;CIOs&quot; of<br/>\nlittle start-ups too.  Anyway, is this typically a decision the CIO would<br/>\nreally dig into?  Or is it a lower level decision just needing financial<br/>\napproval at the higher level?<br/>\n<br/>\nI&#39;m curious why we can&#39;t get more U.S. people employed in the computer<br/>\nprofessions.  Every place I&#39;ve worked in the past few years (including a<br/>\ncouple big time software companies) has had several H1 Visa employees,<br/>\nusually Indian or Chinese.  I&#39;ve found that these folks vary in their<br/>\nexperience and technical expertise as much as anyone else I&#39;ve worked with.<br/>\n<br/>\nFinally, there&#39;s the notion of Agile CIO, which is intriguing.  But is it<br/>\njust b.s.?  I mean, CIOs are high level managers, not developers.  How do<br/>\nyou presume to apply agile methods at the CIO level in more than tenuous<br/>\nanalogies?  I think it quite possible the whole notion of CIO is contra<br/>\nagile methodology.<br/>\n<br/>\nScott Stirling</div>", 
    "prevInTime": 7555, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1049652305", 
    "canDelete": false, 
    "nextInTopic": 7571, 
    "prevInTopic": 7551, 
    "headers": {
        "inReplyToHeader": "PDIwMDMwNDA1MTI0MDI5LjQ0NTkwLnFtYWlsQHdlYjIwODAyLm1haWwueWFob28uY29tPg==", 
        "messageIdInHeader": "PEtJRUhJQklPQkFFTEpBSElQTkhET0VQSERCQUEuc2NvdHRzdGlybGluZ0ByY24uY29tPg=="
    }
}