{
    "numMessagesInTopic": 4, 
    "nextInTime": 7572, 
    "senderId": "GLmXfWbiguQ8VlCbDGGOIee_RF6nUjkkeYY9BCQw-iM_T3kjTefxHtMRMfKThPMCkYjxL5rGUqB053D9O11Ds0tnX04tOUgLmS-V1kjW12QN", 
    "systemMessage": false, 
    "subject": "Re: [offtopic] RE: [junit] The Responsible CIO", 
    "from": "&quot;Lauren Bish&quot; &lt;developerdude@...&gt;", 
    "authorName": "Lauren Bish", 
    "msgSnippet": "... From: Scott Stirling  ... I ... Yes it is, and I too am replying. I work for a large company that has offices in Israel, Belgium,", 
    "msgId": 7571, 
    "profile": "gs_nomad", 
    "topicId": 7551, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 117292773, 
    "messageBody": "<div id=\"ygrps-yiv-630861838\"><blockquote><span title=\"qreply\">----- Original Message -----<br/>\nFrom: &quot;Scott Stirling&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:scottstirling@...\">scottstirling@...</a>&gt;<br/>\n&gt;<br/>\n&gt; I think this post is pretty offtopic.  But, you used the word &quot;Agile,&quot; so,<br/>\nI<br/>\n&gt; read it and am replying.<br/>\n&gt;<br/>\n&gt; Interesting article thoughts.  Also quite &quot;high level&quot; and speculative,<br/>\n&gt; which made me wonder about some facts.<br/>\n<br/>\nYes it is, and I too am replying. I work for a large company that has<br/>\noffices in Israel, Belgium, Canada, the US, and various other locales around<br/>\nthe world. Many of these places have development teams, some of them sharing<br/>\ndevelopment tasks on the same projects. A lot of large companies that have a<br/>\nworldwide presence also have their development efforts spread out around the<br/>\nworld. Also, the Open Source movement seems to have a widespread community.<br/>\nI don&#39;t know that outsourcing is that much different with respect to<br/>\nefficiency/comminication/etc. compared to other forms of geographically<br/>\ndisparate development teams.<br/>\n<br/>\nThere are of course problems with communication/etc. - but somehow the job<br/>\nstill gets done and I haven&#39;t seen a huge mass exodus from the US of<br/>\ndevelopment jobs despite the fact that some very big names have been<br/>\npredicting such a trend for over a decade. What I wonder is, what are the<br/>\ncore objections to outsourcing? Do people object to:<br/>\n<br/>\n1) The fact that some people around the world will work for less than they<br/>\ndo? If so, get used to it - welcome to the new world. I welcome and applaud<br/>\ncompetition. When I was unemployed I actively let employers know I was<br/>\nwilling to underbid just about anybody because the alternative was being<br/>\nunemployed.<br/>\n<br/>\n2) The fact that these people may not engender the kind of loyalty we get<br/>\nfrom our employers? If so, get real; just ask any of the thousands of<br/>\nunemployed Java developers how loyal and concerned their former employers<br/>\nwere.<br/>\n<br/>\n3) Responsiblity? Concerned about the conditions in a third world country<br/>\nnot being as good as in the US? Welcome to the real world. A programmer in<br/>\nIndia is going to have better living conditions than 99% of the rest of the<br/>\npopulace, and by making a decent living wage for their locale (and probably<br/>\nthen some), they help the local economy and create other jobs by spending<br/>\nthier wages. It is a tired axiom but generally true; as the tide rises, so<br/>\ndo all boats.<br/>\n<br/>\nIf outsourcing is such a bad idea, if there are problems that make it an<br/>\neconomically stupid thing to do, then eventually companies will discover<br/>\nthat fact or fail - just as many discovered they couldn&#39;t make money by<br/>\njumping on the internet bandwagon without a sound business plan.<br/>\n<br/>\nFWIW,<br/>\nLCB </span></blockquote></div>", 
    "prevInTime": 7570, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1049656013", 
    "canDelete": false, 
    "nextInTopic": 7574, 
    "prevInTopic": 7556, 
    "headers": {
        "messageIdInHeader": "PDAwYzYwMWMyZmM3MCQ2NmVmMjMwMCQwMzlhNDA5NEBHb3J0Pg==", 
        "referencesHeader": "PEtJRUhJQklPQkFFTEpBSElQTkhET0VQSERCQUEuc2NvdHRzdGlybGluZ0ByY24uY29tPg=="
    }
}