{
    "numMessagesInTopic": 4, 
    "nextInTime": 7575, 
    "senderId": "Jvy-V50Bv4E4iaRrGnsXRjrN_44tRFliYIRJ2O-w2rixPxLUUzrQruBIUaFW72hCnTN7cvDCPm9jjgRpY3a2Eo2AzbvJCiQ", 
    "systemMessage": false, 
    "subject": "RE: [offtopic] RE: [junit] The Responsible CIO", 
    "from": "&quot;TechInfo&quot; &lt;techlists@...&gt;", 
    "authorName": "TechInfo", 
    "msgSnippet": "I am writing from Bangalore, India where I write lots of code for a humble living and pray for world peace while I am not coding :-) I am sorry but I am forced", 
    "msgId": 7574, 
    "rawEmail": "Return-Path: &lt;techlists@...&gt;\r\nX-Sender: techlists@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_6_5); 7 Apr 2003 16:48:50 -0000\r\nReceived: (qmail 15831 invoked from network); 7 Apr 2003 16:48:49 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m8.grp.scd.yahoo.com with QMQP; 7 Apr 2003 16:48:49 -0000\r\nReceived: from unknown (HELO mail.active-venture.com) (202.157.161.163)\n  by mta2.grp.scd.yahoo.com with SMTP; 7 Apr 2003 16:48:48 -0000\r\nReceived: (qmail 22915 invoked by uid 399); 7 Apr 2003 16:40:09 -0000\r\nReceived: from unknown (HELO Rajesh) (219.65.136.132)\n  by mail.active-venture.com with SMTP; 7 Apr 2003 16:40:09 -0000\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nSubject: RE: [offtopic] RE: [junit] The Responsible CIO\r\nDate: Mon, 7 Apr 2003 22:18:20 +0530\r\nMessage-ID: &lt;003b01c2fd25$88e3c140$8d8441db@Rajesh&gt;\r\nMIME-Version: 1.0\r\nX-Priority: 3 (Normal)\r\nX-MSMail-Priority: Normal\r\nX-Mailer: Microsoft Outlook, Build 10.0.2627\r\nX-MimeOLE: Produced By Microsoft MimeOLE V6.00.2600.0000\r\nIn-Reply-To: &lt;KIEHIBIOBAELJAHIPNHDOEPHDBAA.scottstirling@...&gt;\r\nImportance: Normal\r\nFrom: &quot;TechInfo&quot; &lt;techlists@...&gt;\r\nX-Yahoo-Group-Post: member; u=142400472\r\nX-Yahoo-Profile: rajbatam\r\nContent-Type: text/plain; charset=ISO-2022-JP\r\nContent-Transfer-Encoding: 7bit\r\n\r\nI am writing from Bangalore, India where I write lots of code for a\nhumble living and pray for world peace while I am not coding :-)\nI am sorry but I am forced to continue this thread on JUnit which is not\nappropriate. I apologize and request to allow me to express myself once\nand retreat for ever. No follow up replies from me irrespective of its\nintensity.\nJames, if you wish we can continue this discussion in\ncomputerbooksandauthors as I see this an interesting topic for me to\nwrite a book on \u001b$B!H\u001b(BBehavioral trends in changing economic scenarios\u001b$B!I\u001b(B !! \n \nIn the recent years I have observed a very peculiar behavior from the\nprofessionals in the USA which reminds of those days of Marxism,\nLeninism\nJust because their jobs are at stake they started to react saying that\ntheir government should adopt protectionist measures without really\nadmitting that they are no more delivering value for money. Did you ever\nthink that there were so many talented jobless in other parts of the\nworld whose talents were not put to good use prior to globalization. If\none advocates the right to equality and right to freedom of\naccessibility, one should pursue it till the end and should not change\ntones in between.\n \nThese countries (India and China) which you are referring to where\ncriticized by governments in advanced countires for having protectionist\npolicies and were advised to open up and allow globalization. Now that\nthese countries are serious about opening up their markets and expect\nother countries to reciprocate by allowing them sell what they sell the\nbest, why all this hue and cry ?!!\nWhile hardware selling is China\u001b$B!G\u001b(Bs strength, selling software services\nis India\u001b$B!G\u001b(Bs strength partly attributed to its attractive rates.\nShouldn\u001b$B!G\u001b(Bt we allow others also to sell their expertise or is it written\nin the bible that only the USA is privileged to sell its ideas to whole\nworld.\n \nExcuse me if my tone seems to be abnormal. But that\u001b$B!G\u001b(Bs the reality and\nit bites.\n \nTo answer Scotts question, it costs 30 to 40% cheaper taking into\naccount all hidden costs like travel costs of project managers,\nimplementation teams, internet connectivity costs etc.\n \nRegards\n \nRajesh\nhttp://www.zudha.com\n \n \n \n-----Original Message-----\nFrom: Scott Stirling [mailto:scottstirling@...] \nSent: Sunday, April 06, 2003 11:35 PM\nTo: junit@yahoogroups.com\nSubject: [offtopic] RE: [junit] The Responsible CIO\n \n&gt; From: James [mailto:jm04469@...]\n&gt;\n&gt; Working on writing an article for an upcoming issue of\n&gt; a magazine targeted towards CIOs. Here is the basic\n&gt; thought:\n[snip]\n\nI think this post is pretty offtopic.  But, you used the word &quot;Agile,&quot;\nso, I\nread it and am replying.\n\nInteresting article thoughts.  Also quite &quot;high level&quot; and speculative,\nwhich made me wonder about some facts.\n\nFor instance, what&#39;s the typical salary for a senior or principal\ndeveloper\nin India?  How much is their salary affected by whether that engineer is\nworking out of Bombay or a suburb or some small city?  Just curious what\nthe\nCIOs are up against in their decision process -- how much money can be\nsaved\non a project by outsourcing some of the work?  What are the most\nsuccessful\nways to leverage outsourcing help?\n\nHow much is outsourcing the decision of a CIO?  I&#39;ve seen outsourcing\nproposed and advocated at the department Director and VP level, though\nthe\nCIO is usually involved to approve any large IT/Dev expenditure.  Of\ncourse\nwith job title inflation the past few years, there are lots of &quot;CIOs&quot; of\nlittle start-ups too.  Anyway, is this typically a decision the CIO\nwould\nreally dig into?  Or is it a lower level decision just needing financial\napproval at the higher level?\n\nI&#39;m curious why we can&#39;t get more U.S. people employed in the computer\nprofessions.  Every place I&#39;ve worked in the past few years (including a\ncouple big time software companies) has had several H1 Visa employees,\nusually Indian or Chinese.  I&#39;ve found that these folks vary in their\nexperience and technical expertise as much as anyone else I&#39;ve worked\nwith.\n\nFinally, there&#39;s the notion of Agile CIO, which is intriguing.  But is\nit\njust b.s.?  I mean, CIOs are high level managers, not developers.  How\ndo\nyou presume to apply agile methods at the CIO level in more than tenuous\nanalogies?  I think it quite possible the whole notion of CIO is contra\nagile methodology.\n\nScott Stirling\n\n\n\n\n\n\nYahoo! Groups Sponsor\n\n \n&lt;http://us.ard.yahoo.com/M=249982.3083889.4452939.1728375/D=egroupweb/S=\n1705006905:HM/A=1524963/R=0/*http:/hits.411web.com/cgi-bin/autoredir?cam\np=556&llineid=3083889\u001b$B&quot;g\u001b(B=egroupweb&pos=HM&gt; \n\n \n&lt;http://us.adserver.yahoo.com/l?M=249982.3083889.4452939.1728375/D=egrou\npmail/S=:HM/A=1524963/rand=569095716&gt; \n\nTo unsubscribe from this group, send an email to:\njunit-unsubscribe@yahoogroups.com\n\n\nYour use of Yahoo! Groups is subject to the Yahoo!\n&lt;http://docs.yahoo.com/info/terms/&gt;  Terms of Service. \n\n\n[Non-text portions of this message have been removed]\n\n\n", 
    "profile": "rajbatam", 
    "topicId": 7551, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 142400472, 
    "prevInTime": 7573, 
    "contentTrasformed": false, 
    "postDate": "1049734100", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 7571, 
    "headers": {
        "inReplyToHeader": "PEtJRUhJQklPQkFFTEpBSElQTkhET0VQSERCQUEuc2NvdHRzdGlybGluZ0ByY24uY29tPg==", 
        "messageIdInHeader": "PDAwM2IwMWMyZmQyNSQ4OGUzYzE0MCQ4ZDg0NDFkYkBSYWplc2g+"
    }
}