{
    "numMessagesInTopic": 14, 
    "nextInTime": 7641, 
    "senderId": "ahGKi-TJUfFzesDGgtDD31SbLBRP8p-UnihvVODJ0jdJ8q4lES_foacmBKaeF3mbAk1oEKNoeSOY5lVN40HJw4U-9Xiw9eFb9qjavtOQ", 
    "systemMessage": false, 
    "subject": "Re: How do I make Unit Testing practical?", 
    "from": "&quot;Paul Zabelin&quot; &lt;pavel_zabelin@...&gt;", 
    "authorName": "Paul Zabelin", 
    "msgSnippet": "... downloaded ... For last 2 years of using JUnit for several big project I have not found real code , that is not possible to unit test, except bad design. ", 
    "msgId": 7640, 
    "profile": "paul_zabelin", 
    "topicId": 7360, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 126772157, 
    "messageBody": "<div id=\"ygrps-yiv-401882722\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;swpalmer2001&quot; &lt;scott.palmer@2...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;  I believe a lot of it.  I want to start writing unit tests for my<br/>\n&gt; code and in general improve my development practices.   So I <br/>\n </span></blockquote>downloaded<br/>\n<blockquote><span title=\"ireply\"> &gt; JUnit, and read through some articles and examples.<br/>\n&gt; They are all too trivial.<br/>\n<br/>\n </span></blockquote>For last 2 years of using JUnit for several big project I have not <br/>\nfound &quot;real code&quot;, that is not possible to unit test, except bad <br/>\ndesign.<br/>\nI am saying there is very little to none of the code that is <br/>\nconsidered a well designed and hard to test with JUnit.<br/>\nAll my tests look very trivial too, but they together are the net <br/>\nthat catches 99% of the bugs. Time spent for building it worth every <br/>\nsecond!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; course not always.   How do you unit test such beasts?<br/>\n<br/>\n&gt; <br/>\n&gt; So far in all my attempts to get started at this I find that the <br/>\n </span></blockquote>test<br/>\n<blockquote><span title=\"ireply\"> &gt; code itself becomes very complex - not as complex as my application,<br/>\n&gt; but enough that the time I would end up writing and debugging the<br/>\n&gt; test seems completely unreasonable.   I would love to have the<br/>\n&gt; finished tests, but I simply can&#39;t see how I could justify writing<br/>\n&gt; them, as it would more than double my design and coding development<br/>\n&gt; time.<br/>\n<br/>\n </span></blockquote>I would be glad to have a look on your complex code. Learning unit <br/>\ntest writing is definetly better for new code in small projects, but <br/>\nonce mastered those skills can easily be appied to &quot;complex&quot; code. <br/>\nCan you challenge me with an example of buildable code, that is so <br/>\nhard to test?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In the end I would almost end up with an &quot;automated user&quot;, and of<br/>\n&gt; course that is a tad extreme and prone to it&#39;s own sorts of errors<br/>\n&gt; and assumptions.<br/>\n </span></blockquote>Sounds like functional test.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve told co-workers about what I have read about unit testing,<br/>\n&gt; testing frameworks etc.  None of my co-workers do unit tests, and ll<br/>\n&gt; of them have the same attitude.  Unit testing is too<br/>\n&gt; complex/difficult to use when making real complete programs.<br/>\n&gt; <br/>\n&gt; So I&#39;m asking... Who else has been down this path?  How do I get <br/>\n </span></blockquote>past this point?   Am I making sense or have I just gotten something<br/>\n<blockquote><span title=\"ireply\"> &gt; completely wrong? Or is this unit testing just a passing fad that is<br/>\n&gt; really nothing more than a bunch of hype?<br/>\n<br/>\n </span></blockquote>I&#39;ve been there, down this path! And now I am unit test advocate in <br/>\nmy team. It is one of the easiest XP policy to explain to managers. <br/>\nMore IT managers convinced that unit tests can significanly improve <br/>\nquality of software. JUnit is very lightweight framework for unit <br/>\ntests.</div>", 
    "prevInTime": 7639, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1049868929", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 7454, 
    "headers": {
        "inReplyToHeader": "PGI2Y3JpMCs5aGllQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PGI3MGRxMSs0ZjI3QGVHcm91cHMuY29tPg=="
    }
}