{
    "numMessagesInTopic": 12, 
    "nextInTime": 7689, 
    "senderId": "Gj2pYY6BZ42NZptB7TXmCtj3ML1aPYvlGSZkbbFaXa7ou_Os3TOm6JSRev5zLthiC5mX_ojI0D8sSS_oZtm_LMRNPsJoluTjEkeuA48", 
    "systemMessage": false, 
    "subject": "RE: [junit] Using Mock objects or another system?", 
    "from": "Terry Wilcox &lt;terry.wilcox@...&gt;", 
    "authorName": "Terry Wilcox", 
    "msgSnippet": "Here s a few examples my own experiences with solutions like this: We have two types of tests: those that test our persistence layer and those that test the", 
    "msgId": 7688, 
    "topicId": 7674, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 130152767, 
    "messageBody": "<div id=\"ygrps-yiv-777061945\">Here&#39;s a few examples my own experiences with solutions like this:<br/>\n<br/>\nWe have two types of tests: those that test our persistence layer and those<br/>\nthat test the layers above the persistence layer. Testing our persistence<br/>\nlayer is slow because we&#39;re actually testing that it properly reads and<br/>\nwrites to the database. Very slow. So slow that we tend to avoid running the<br/>\ntests, which can be painful later.<br/>\n<br/>\nTesting layers above the peristence layers is fast because we mocked out the<br/>\npersistence layer. Those tests get run a lot and we can be sure that any<br/>\nfailures in these tests are not the fault of the persistence layer. Before<br/>\nwe mocked out the persistence layer, database access bugs had a large and<br/>\nalarming ripple effect. One code change could cause dozens of seemingly<br/>\nunrelated tests to fail.<br/>\n<br/>\nWe don&#39;t have individual databases, we share a test database. Imagine what<br/>\nhappens when two people run the same test at the same time against the same<br/>\ndatabase. If your tests aren&#39;t really careful about what data they delete,<br/>\nyou&#39;re going to have a lot of frustration.<br/>\n<br/>\nWe still run functional tests that exercise the complete system. There&#39;s<br/>\nalways the odd case where the code does exactly what it&#39;s supposed to do but<br/>\nnot what somebody else is expecting.<br/>\n<br/>\nTerry Wilcox<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:terry.wilcox@...\">terry.wilcox@...</a><br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; He wants to include two methods in the JUnit tests: makeTestData() <br/>\n&gt; and deleteTestData(). The first method would be called before the <br/>\n&gt; testing is started. The second method he wants to call after testing <br/>\n&gt; is finished.<br/>\n&gt; <br/>\n&gt; What he wants is to do in makeTestData() is to write test data into <br/>\n&gt; the database for testing purposes. So he thinks we don&#39;t need Mock <br/>\n&gt; objects. </span></blockquote></div>", 
    "prevInTime": 7687, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1049989570", 
    "canDelete": false, 
    "nextInTopic": 7689, 
    "prevInTopic": 7686, 
    "headers": {
        "messageIdInHeader": "PDhCQ0EwREQzRDQzNUFGNEI4NEFBNjAxODk5NTk4Q0Y5N0NGNkZDQGVudGVyby0xLkVudGVyby5jb20+"
    }
}