{
    "numMessagesInTopic": 10, 
    "nextInTime": 7716, 
    "senderId": "91-GKpH6qnOKKL_wqdBtMvEFbZ_uwtcjs_qBewkC_AvJ692mmbmU1i6QlLGNr8HTzLqTO8G7VOHgyeG8QYWzldRa7ksOmNpvQAySvJ2Rqges9ZXxnGt1", 
    "systemMessage": false, 
    "subject": "Re: [junit] Using the Reflection API for private methods? Package access?", 
    "from": "&quot;Vladimir R. Bossicard&quot; &lt;vladimir@...&gt;", 
    "authorName": "Vladimir R. Bossicard", 
    "msgSnippet": "... It s really up to you to decide.  I always have my tests in the same package and happily survived this situation until now. In fact I don t understand why", 
    "msgId": 7715, 
    "profile": "vbossica", 
    "topicId": 7714, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 43178095, 
    "messageBody": "<div id=\"ygrps-yiv-399714594\"><blockquote><span title=\"ireply\">&gt; 1. We separate the test cases in an own package. Is that best <br/>\n&gt; practice?<br/>\n<br/>\n </span></blockquote>It&#39;s really up to you to decide.  I always have my tests in the same package and<br/>\nhappily survived this situation until now.<br/>\n<br/>\nIn fact I don&#39;t understand why someone would want to set hurdles by having a new<br/>\npackage for the tests.  Testing should not be a challenge (although it sometimes<br/>\nis) so keep your options open and place your tests in the same package.  If you<br/>\nnever need to test your protected methods, fine.  But if you suddendly have to,<br/>\nyou still have the option to easily do so.<br/>\n<br/>\nAnd even if your tests are in the same package, you don&#39;t have to test the<br/>\nprotected methods.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 2. When doing this, some methods with default (package) visiblilty <br/>\n&gt; cannot be accessed. But when using the Reflection API, this methods <br/>\n&gt; can be accessed. Is it okay to use the reflection? Or is it bad <br/>\n&gt; style?<br/>\n<br/>\n </span></blockquote>See: just because you (&#39;you&#39; is general, not &#39;you&#39; in particular) wanted to<br/>\nwrite the cleanest tests of all and have a different package for them, you&#39;re<br/>\nnow messing with the Reflection API for writing a simple test.<br/>\n<br/>\nThere&#39;s a lot of situations where you want to test protected methods (like when<br/>\nyou write abstract classes that are meant to be published as part of an API) so<br/>\nkeep your options open.<br/>\n<br/>\nI would say that the Reflection API should be only used when everything else has<br/>\nfailed.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 3. What about testing private methods? It is normally not possible <br/>\n&gt; if the test is in an own class. But again I can use the reflection <br/>\n&gt; to acess private methods. Should I do that?<br/>\n<br/>\n </span></blockquote>search the archive.  You&#39;ll have plenty of threads about it.  I never had to<br/>\ndirectly test private methods, but if you have a large code base with no tests<br/>\nat all, it can be your only option.<br/>\n<br/>\nIf you want to test private methods, don&#39;t reinvent the wheel and use the<br/>\nPrivateAccessor class of the (you guessed it right!) JUnit-addons package. <br/>\n<br/>\n-Vladimir<br/>\n<br/>\n-- <br/>\nVladimir R. Bossicard<br/>\nwww.bossicard.com</div>", 
    "prevInTime": 7714, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1050273113", 
    "canDelete": false, 
    "nextInTopic": 7717, 
    "prevInTopic": 7714, 
    "headers": {
        "inReplyToHeader": "PGI3Y2ljNis0bWdnQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDEwNTAyNzMxMTMuM2U5OWU1NTlkZTc5YkBtYWlsLnNjZGkub3JnPg==", 
        "referencesHeader": "PGI3Y2ljNis0bWdnQGVHcm91cHMuY29tPg=="
    }
}