{
    "numMessagesInTopic": 11, 
    "nextInTime": 7797, 
    "senderId": "sB14GQFfE_9ww1SjGfNcCWbSoVPch2FQex5XefyUAEy_e5rzHdbXzQzLXA2zjxdnAGCYAhC8J5gPgUIaurg7kodsrDo-l3mFuK99_mlnNJpf", 
    "systemMessage": false, 
    "subject": "Re: [junit] JUnit and EJB! please help, a beginner", 
    "from": "&quot;Andrew Forward&quot; &lt;milkforlife@...&gt;", 
    "authorName": "Andrew Forward", 
    "msgSnippet": "Scott Stirling said: JUnit is suitable for unit testing EJBs if you don t even know how to pack a jar file?  Just a side concept about that packaging of", 
    "msgId": 7796, 
    "profile": "andrewforward1978", 
    "topicId": 7788, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 87266687, 
    "messageBody": "<div id=\"ygrps-yiv-1443231047\">Scott Stirling said:<br/>\n<br/>\n&quot;JUnit is suitable for unit testing EJBs if you don&#39;t even know how to<br/>\n&quot;pack&quot;<br/>\na jar file? &quot;<br/>\n<br/>\nJust a side concept about that packaging of jar files.  From a computer<br/>\nscience perspective - issues like building and deployment are not a very hot<br/>\ntopic - at any level.  It would be nice it things were otherwise - but some<br/>\nmay argue that university is not there just to prepare you for a job... so,<br/>\ninterest in deployment would be rooted in the research possibilities (which<br/>\nI have not seen much of)...<br/>\n<br/>\nLearning to jar takes about an hour .. learning it really well - half a day.<br/>\nNow learning about testing methodologies (such as unit testing and load<br/>\ntesting) and other computer science concepts take much, much longer.<br/>\n<br/>\nMy point - just because you don&#39;t know  how to use a particular tool (and<br/>\nthat&#39;s all jar is) does not mean that you are poorly suited for a research<br/>\nposition (or even an employment one either).  It is more closely related to<br/>\nhow well you conduct research in general - and how well you can search out<br/>\nanswers to your questions in an academic manner.<br/>\n<br/>\n<br/>\nandrew f</div>", 
    "prevInTime": 7795, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1050852044", 
    "canDelete": false, 
    "nextInTopic": 7798, 
    "prevInTopic": 7793, 
    "headers": {
        "messageIdInHeader": "PEJBWTEtREFWNTdSZjZDaTZueDgwMDAwMjQzNUBob3RtYWlsLmNvbT4=", 
        "referencesHeader": "PEtJRUhJQklPQkFFTEpBSElQTkhETUVHT0RDQUEuc2NvdHRzdGlybGluZ0ByY24uY29tPg=="
    }
}