{
    "numMessagesInTopic": 11, 
    "nextInTime": 7802, 
    "senderId": "5GG8s3JAjB2mw1SEuJGfovNkFpasZZQwuU1U3sGYPG9ByaMYJVP5Yf-UQnUVIjWq-cLXM_EuIVcboas_ksXiWxWslKEbZYNByNNR-tve7A", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: JUnit and EJB! please help, a beginner", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... Testing is not factory work. There is no ten-step guide to testing with EJBs. In fact, testing with EJBs -- really doing good Programmer Testing -- is no", 
    "msgId": 7801, 
    "profile": "nails762", 
    "topicId": 7788, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-503901918\"><blockquote><span title=\"ireply\">&gt;So said james_khu on 4/21/2003 --------------------<br/>\n<br/>\n&gt;Before, I was looking for a quick solution, by trying to look for <br/>\n&gt;hands on tutorial which explains about EJB as well as the testing <br/>\n&gt;itself. I guess there&#39;s no such thing out there. <br/>\n<br/>\n </span></blockquote>Testing is not factory work. There is no ten-step guide to testing with EJBs. In fact, testing with EJBs -- really doing good Programmer Testing -- is no different from testing code that lives in any other framework. There are a number of approaches, and the suggestions I have for you depend on your approach. That&#39;s why I asked you a question.<br/>\n<br/>\nSeeing as you&#39;re supposedly doing research at the graduate level, I assumed that you were both capable and willing to think for yourself a little. Google is not some oracle that knows all.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;However, I must say this. I am really disappointed at some of the <br/>\n&gt;replies out there which really don&#39;t address the real question. <br/>\n </span></blockquote>&lt;snip /&gt;<br/>\n<br/>\nWhen you ask skilled people in their area a question and they give you a strange answer, you could begin by assuming that they have a purpose to that answer. I&#39;m not saying that every answer you got was a good one -- frankly, that doesn&#39;t concern me -- but did you think about what I asked you at all? If you did, then what did you come up with? What kind of testing are you trying to do? What is it that you&#39;re trying to verify?<br/>\n<br/>\n1. The business logic in your EJBs?<br/>\n2. The way you connect your business logic into the EJB framework?<br/>\n3. Your EJB/RDB mapping for a CMP entity bean?<br/>\n4. Your EJB lifecycle methods?<br/>\n<br/>\nI would suggest different approaches -- and tools -- for each. #1 requires some deft refactoring work, #2 and #3 probably require connecting to the container and #4 is dead straight-forward &quot;plain old Java object&quot; testing.<br/>\n<br/>\nAs you can see, &quot;Testing EJBs&quot; is really not enough information for me to point you in what I think is the right direction.<br/>\n<br/>\nStill think it was a useless and irrelevant answer?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Anyway, I am just expressing myself, and I hope that I don&#39;t offend, <br/>\n&gt;or tick off anyone. I totally appreciate the time you guys took to <br/>\n&gt;reply to my message.<br/>\n<br/>\n </span></blockquote>Your comments, though, lead me to believe that my assumption was faulty: that you are not interested in thinking about the problem. Instead, you just want to be told what 14 steps to follow to get a result. I realize that I never finished a Master&#39;s Degree, but when I was there and working on it, I was responsible for thinking through problems and grappling with questions.<br/>\n<br/>\nMaybe I&#39;ve gone too far, here, but I&#39;m just expressing myself. :)<br/>\n<br/>\n<br/>\nJ. B. Rainsberger,<br/>\nPresident, Diaspar Software Services<br/>\nLet&#39;s write software that people understand.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com/\">http://www.diasparsoftware.com/</a><br/>\ntelephone: +1 416 791-8603</div>", 
    "prevInTime": 7800, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1050929450", 
    "canDelete": false, 
    "nextInTopic": 7803, 
    "prevInTopic": 7798, 
    "headers": {
        "inReplyToHeader": "PGI3dm5odCtkZjZyQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDIwMDMwNDIxMDg1MDUwMDIxMC4wQTUzNzlCOUBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "referencesHeader": "PGI3dm5odCtkZjZyQGVHcm91cHMuY29tPg=="
    }
}