{
    "numMessagesInTopic": 11, 
    "nextInTime": 7804, 
    "senderId": "nHmdj0dN7lCS11D-z9Ywuel5FL4aclcfVWYyYVmjO50zRZab65H4a9g6YlAJZMS3oBRvoTO5Qsy8ZqgRfmXQHKc0XcVfnhQeWpvj7_w", 
    "systemMessage": false, 
    "subject": "Re: [junit] JUnit and EJB! please help, a beginner", 
    "from": "Scott Stirling &lt;scottstirling@...&gt;", 
    "authorName": "Scott Stirling", 
    "msgSnippet": "... I agree.  I didn t think EJB was very hot either, being pretty far from the cutting edge of research and being squarely focused on business rather than ", 
    "msgId": 7803, 
    "profile": "jrun5", 
    "topicId": 7788, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 112036634, 
    "messageBody": "<div id=\"ygrps-yiv-1293554968\"><blockquote><span title=\"ireply\">&gt;From: &quot;Andrew Forward&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:milkforlife@...\">milkforlife@...</a>&gt;  <br/>\n&gt;<br/>\n&gt;Just a side concept about that packaging of jar files.  From a computer<br/>\n&gt;science perspective - issues like building and deployment are not a very hot<br/>\n&gt;topic - at any level.<br/>\n<br/>\n </span></blockquote>I agree.  I didn&#39;t think EJB was very hot either, being pretty far from the <br/>\ncutting edge of research and being squarely focused on business rather than <br/>\nscience.  That&#39;s why I asked what his university was &quot;local&quot; to -- it seems <br/>\nlike a fishy project for a comp sci grad student.<br/>\n<br/>\nI mean, it&#39;s not a quest to discover the unknown is it?  Everyone knows how to <br/>\ntest EJBs with JUnit, or at least knows where to find out.  Is this information <br/>\nunobtainable from inside our local universities?  Not at all.  So what kind of <br/>\ngraduate research project is it?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Learning to jar takes about an hour .. learning it really well - half a day.<br/>\n&gt;Now learning about testing methodologies (such as unit testing and load<br/>\n&gt;testing) and other computer science concepts take much, much longer.<br/>\n<br/>\n </span></blockquote>I was just keying into the user&#39;s &quot;confession&quot; of the state of his ignorance.  <br/>\nHe writes in asking how to unit and load test EJBs with JUnit and adds almost <br/>\nin a p.s., by the way, I don&#39;t know how to create a jar file.  Hello!  This is <br/>\nwhere you must meet him if you want to go to his level and bring him up near <br/>\nyours.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;My point - just because you don&#39;t know  how to use a particular tool (and<br/>\n&gt;that&#39;s all jar is) does not mean that you are poorly suited for a research<br/>\n&gt;position (or even an employment one either).  It is more closely related to<br/>\n&gt;how well you conduct research in general - and how well you can search out<br/>\n&gt;answers to your questions in an academic manner.<br/>\n<br/>\n </span></blockquote>I guess the main tool to learn how to use well in research is your own brain.<br/>\n<br/>\nScott Stirling</div>", 
    "prevInTime": 7802, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1050936001", 
    "canDelete": false, 
    "nextInTopic": 7804, 
    "prevInTopic": 7801, 
    "headers": {
        "messageIdInHeader": "PEUxOTdjU2YtMDAwNjNVLTAwQHNtdHAwMy5tcmYubWFpbC5yY24ubmV0Pg=="
    }
}