{
    "numMessagesInTopic": 12, 
    "nextInTime": 7840, 
    "senderId": "-rD-JBv5KBPg8NVN6s01g4034ANgQkY4iXbi4Q1V7_oFVgO55QmuVjJeepjL3ThrB8d3e_RTvm5l1gSkqyURkzT4B3kBlJVQnJXwqVm7", 
    "systemMessage": false, 
    "subject": "RE: [junit] The right amount of testing !?", 
    "from": "&quot;Robert Brown&quot; &lt;robert.brown@...&gt;", 
    "authorName": "Robert Brown", 
    "msgSnippet": "In my opinion, you should test every public method of a class.  The reason I have for this is that even though you know that the method turns around and calls", 
    "msgId": 7839, 
    "profile": "robrhys", 
    "topicId": 7834, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 144845213, 
    "messageBody": "<div id=\"ygrps-yiv-1821208222\">In my opinion, you should test every public method of a class.  The<br/>\nreason I have for this is that even though you know that the method<br/>\nturns around and calls another method that is tested somewhere else,<br/>\nthat may not always be the case, and you don&#39;t know that the call is<br/>\ncoded correctly either, or that the underlying class/method hasn&#39;t been<br/>\nchanged to return something that is unexpected.  So even though you have<br/>\nan action called login/logoff that may turn right around and call<br/>\nlogin/logoff on another class that has been tested properly, I&#39;d at<br/>\nleast test that the call is accomplished appropriately and the results<br/>\nare correct.  <br/>\n <br/>\nIMHO Yes and no to more tests = better software.   You can create a<br/>\nbunch of tests that don&#39;t actually test anything (writing an object<br/>\ncreation test that asserts not null for example instead of testing that<br/>\nthe object is correct) that won&#39;t make better software.  However, more<br/>\nproper tests definitely improve your software maintenance and can catch<br/>\nerrors that only occur once in a blue moon.  That said, it&#39;s almost<br/>\nimpossible to test every condition, which is why when an error occurs<br/>\nthe first thing you do is write a test for it so you can be fairly sure<br/>\nit can&#39;t happen again. <br/>\n <br/>\nRobert Brown<br/>\nManager Software Engineering<br/>\nSinex Aviation Technologies<br/>\n <br/>\nWhat is the &quot;right&quot; amount of testing, is it best to do the same test<br/>\nbut<br/>\non different levels in order to make sure that NO strange behaviour is<br/>\ndiscovered or should I just test the whole flow?<br/>\n<br/>\nMore tests = better software? ;)<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 7838, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1051196709", 
    "canDelete": false, 
    "nextInTopic": 7842, 
    "prevInTopic": 7838, 
    "headers": {
        "inReplyToHeader": "PDAwNjkwMWMzMGE1ZSRiNzQ2NTdmMCQwNjAwYThjMEBpbWJyaWRnZS5zZT4=", 
        "messageIdInHeader": "PDAwMTcwMWMzMGE3MiRlNjJhY2NlMCQ2MjAwYThjMEB0aW1iZXJ3b2xmPg=="
    }
}