{
    "numMessagesInTopic": 13, 
    "nextInTime": 7900, 
    "senderId": "3mnLMqXnFAAWp6ehRwCnmwH48bJhBI0ZzXmJlCZHz1bMDSerziCxOsW1MoUny6Gz0Vw557QXl1VREZ5v3BY1M4zGmrrx8M-Wy9k", 
    "systemMessage": false, 
    "subject": "Re: [junit] Sun doesn&#39;t use JUnit. Why?", 
    "from": "Timothy Wall &lt;twall@...&gt;", 
    "authorName": "Timothy Wall", 
    "msgSnippet": "... My point was that in order for ant to be useful for those things it would need to provide the predefined tasks.  If you have to write up the task from", 
    "msgId": 7899, 
    "topicId": 7873, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 106503903, 
    "messageBody": "<div id=\"ygrps-yiv-847708536\">On Tuesday, April 29, 2003, at 10:47 PM, Curt Sampson wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; On Mon, 28 Apr 2003 <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:twall@...\">twall@...</a> wrote:<br/>\n&gt;<br/>\n&gt;&gt; In short, because ANT doesn&#39;t have built-in, precompiled and <br/>\n&gt;&gt; configured<br/>\n&gt;&gt; dependency rules and flags for things like &quot;cc&quot;, &quot;ld&quot;, and so on.<br/>\n&gt;<br/>\n&gt; Nor does make. All of that is in a couple of hundred lines of code<br/>\n&gt; /usr/share/mk/sys.mk, at least on Berkely-flavoured Unix systems.<br/>\n<br/>\n </span></blockquote>My point was that in order for ant to be useful for those things it <br/>\nwould need to provide the predefined tasks.  If you have to write up <br/>\nthe task from scratch (especially if you have to write java code for <br/>\nit), it&#39;s easier to script it than to code it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;&gt; These are things that are trivially constructed in a shell call or<br/>\n&gt;&gt; make dependency rules, but rather complex, verbose, and circuitous<br/>\n&gt;&gt; when wrapped in XML.<br/>\n&gt;<br/>\n&gt; Actually, make code is a pretty bad nightmare for any sort of complex<br/>\n&gt; build system as well. Just take a look at the almost four thousand <br/>\n&gt; lines<br/>\n&gt; of make code in the various files in /usr/share/mk on a Berkely system<br/>\n&gt; (this is the support for building the entire OS) for a look. But yeah, <br/>\n&gt; I<br/>\n&gt; agree that ant is not any better, at least at the moment.<br/>\n<br/>\n<br/>\n </span></blockquote>Any large and complex system with today&#39;s tools looks pretty crappy.  <br/>\nNo matter how well laid out your build.xml or makefiles, you&#39;re still <br/>\nleft traipsing through the stuff with a text editor (and no, an XML <br/>\neditor does not buy you anything related to comprehending the build <br/>\nstructure).<br/>\n<br/>\nDon&#39;t get me wrong.  I&#39;d certainly like to see something that handles <br/>\ncomplexity weil, and allows for flexible and easy definition of <br/>\ndependencies, and a host of other things that a real build system <br/>\nshould have.  It just doesn&#39;t look like ant is going there, probably <br/>\nbecause no one with the time to work on it sees a need.<br/>\n<br/>\nThe two major drawbacks I see currently with Ant for use in development <br/>\nare 1) requiring java code for customization, as it applies to doing <br/>\nthings you&#39;d typically do with a script for quick turnaround and 2) <br/>\nlack of a decent representation of conditional execution based on <br/>\ndependencies.<br/>\n<br/>\nBoth of these have a big effect on development time.</div>", 
    "prevInTime": 7898, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1051673157", 
    "canDelete": false, 
    "nextInTopic": 7900, 
    "prevInTopic": 7898, 
    "headers": {
        "inReplyToHeader": "PFBpbmUuTkVCLjQuNTEuMDMwNDMwMTE0MzU5MC40MTZAYW5nZWxpYy12dGZ3LmN2cG4uY3luaWMubmV0Pg==", 
        "messageIdInHeader": "PDc1M0M1NTI2LTdBQkItMTFENy1BMTRELTAwMzA2NUJGODNEQUBvY3VsdXN0ZWNoLmNvbT4="
    }
}