{
    "numMessagesInTopic": 4, 
    "nextInTime": 7905, 
    "senderId": "YQ1T8uGDI6STTCCeVE4dbWVzHwxEMAbe8ABviG-1BAJtoymF-Y6aY7HAAw1AylTxKwF9fPXqm7mQXmIVtfhYpAis7pPZJJU6mQlbiEkpgQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] JUnit Testing Process", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... In my experience, it depends. Some defects are easy to diagnose. Some are instances of user error. If you have Programmer Test coverage and QA still finds", 
    "msgId": 7904, 
    "profile": "nails762", 
    "topicId": 7901, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-564431320\"><blockquote><span title=\"ireply\">&gt;So said jennybearcan on 2003-04-30 --------------------<br/>\n&gt;In general what are developers expected to do with failed test <br/>\n&gt;reports? Is the expectation that the error message should give all <br/>\n&gt;the information necessary to identify the bug?<br/>\n&gt;<br/>\n&gt;Or is it expected that the developer have knowledege of (or discover) <br/>\n&gt;what the test is doing? or run the test in debug mode? or other?<br/>\n<br/>\n </span></blockquote>In my experience, it depends. Some defects are easy to diagnose. Some are instances of user error.<br/>\n<br/>\nIf you have Programmer Test coverage and QA still finds defects, then the programmers aren&#39;t using QA&#39;s tests, and they probably should. QA is automating the tests, right? (I hope so.)<br/>\n<br/>\nIf QA raises a defect, I ask the finder to work with me to reproduce it. I then isolate the cause, write the appropriate missing Programmer Tests, fix the problem and off we go.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;We are testing methods that take xml Strings as parameters and return <br/>\n&gt;xml. It would be nice to see what was passed in and what was returned <br/>\n&gt;if anything .. even when something like a NullPointerException is <br/>\n&gt;failing the test. Also we are running the tests in different <br/>\n&gt;environments so a developer may not see the same error if they run <br/>\n&gt;the test in the development environment.<br/>\n<br/>\n </span></blockquote>This is not really a testing consideration. It&#39;s a logging consideration, and logging is important in enterprise-scale applications where it is usually impossible to run your tests at the client site. I would log information at the key handoff points between components. Within a component, there should be tests. Presumably you only need to know that XML strings are coming into a component because you fear that they are not what the target component expects. Consider using XML schema here to avoid the problem.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Is a separate logging mechanism the answer?<br/>\n<br/>\n </span></blockquote>It is, by the sound of it.<br/>\n<br/>\n<br/>\nJ. B. Rainsberger,<br/>\nPresident, Diaspar Software Services<br/>\nLet&#39;s write software that people understand.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com/\">http://www.diasparsoftware.com/</a><br/>\ntelephone: +1 416 791-8603</div>", 
    "prevInTime": 7903, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1051735801", 
    "canDelete": false, 
    "nextInTopic": 7905, 
    "prevInTopic": 7902, 
    "headers": {
        "inReplyToHeader": "PGI4b3NnMStyanRsQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDIwMDMwNDMwMTY1MDAxMDc2MC4wMEYxQkMzOEBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "referencesHeader": "PGI4b3NnMStyanRsQGVHcm91cHMuY29tPg=="
    }
}