{
    "numMessagesInTopic": 2, 
    "nextInTime": 7920, 
    "senderId": "znZ9oT47o2QIRfrYBcYQBp6x8_SvbKYdu2Ouawla-OGBz9W1C5bPHtIYEyMlWGNScKFbQU4HKqAgpzMnQcHWuyCt3Lrj8hsMMg", 
    "systemMessage": false, 
    "subject": "Ignore attribute", 
    "from": "Ed Howland &lt;ulysees2001@...&gt;", 
    "authorName": "Ed Howland", 
    "msgSnippet": "Hi. About JUnit addon s _ignore feature. NUnit has an attribute called [Ignore(string mesg)] that you can attach to a test case. This essentially works the", 
    "msgId": 7919, 
    "profile": "ulysees2001", 
    "topicId": 7918, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 81500147, 
    "messageBody": "<div id=\"ygrps-yiv-1535765068\">Hi.<br/>\n<br/>\nAbout JUnit addon&#39;s &quot;_ignore&quot; feature. NUnit has an attribute called<br/>\n[Ignore(string mesg)] that you can attach to a test case. This essentially<br/>\nworks the same as the _ignore name change. The progress bar turns yellow and<br/>\nyou get all the statistics.<br/>\n<br/>\nWhat&#39;s nice about C# in this regard is you can create your own attributes (they<br/>\nare just classes that can be reflected on at runtime,) to do various things. Is<br/>\nthere a way to approach this in Java/JUnit with XDoclet, AspectJ or some other<br/>\nmethod?<br/>\n<br/>\nGoing further, I&#39;d like see a modification of TestRunner that externalizes the<br/>\nrunnable states of test cases for a given fixture. I see a repeated pattern of<br/>\nusage with JUnit: after a refactoring, some test or tests break. You want to<br/>\nfocus on those, either by fixing them or the code. Eliminating the rest of the<br/>\ncases while narrowly focusing on a few can be time consuming if there are many.<br/>\n<br/>\nIt would be handy to have a GUI or file to indicate some or all of the tests to<br/>\nbe ignored. In the case of the file (for command line/Ant usage,) a pattern<br/>\nsimilar to the TCP wrappers accept or deny files. If a file called junit.ignore<br/>\nexists, it is read for the cases to ignore. A special case called ALLCASES<br/>\nwould ignore the entire named fixture. After that, a section for cases to run.<br/>\nThese would be the short list of cases to run while the others are ignored.<br/>\n<br/>\nThis file could act as the serialized state of the GUI component which would<br/>\nhave a bunch of check boxes and buttons to Ignore ALL, Run All. There could<br/>\nalso be a nested element in Ant&#39;s JUnit task to accomplish this. (Ant does have<br/>\nif/unless &quot;property&quot; but that is still per test.)<br/>\n<br/>\nDoes anybody else think this is a good idea?<br/>\n<br/>\nEd<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n__________________________________<br/>\nDo you Yahoo!?<br/>\nThe New Yahoo! Search - Faster. Easier. Bingo.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://search.yahoo.com\">http://search.yahoo.com</a></div>", 
    "prevInTime": 7918, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1051992507", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 7918, 
    "headers": {
        "inReplyToHeader": "PDIwMDMwNTAyMTYxNy5WQUEyNTE2MEBteWlyaXMuY29tPg==", 
        "messageIdInHeader": "PDIwMDMwNTAzMjAwODI3LjQ2MDU2LnFtYWlsQHdlYjExMzA4Lm1haWwueWFob28uY29tPg=="
    }
}