{
    "numMessagesInTopic": 31, 
    "nextInTime": 8022, 
    "senderId": "X6R05V7OtDUCsmJPdK_6feRZY9DUyDCdx8dE1dIq66hUXA2bFzyQlJyN0_MsTOx4e2Yoxnh00-kCMwkZB_2Ip3elZAXVPLTm", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: OT: final", 
    "from": "Rick Berman &lt;rick.berman@...&gt;", 
    "authorName": "Rick Berman", 
    "msgSnippet": "I probably started using it for local variables after reading Joshua Bloch s Effective Java although I can t rapidly find a specific paragraph to cite as a ", 
    "msgId": 8021, 
    "profile": "noer2b", 
    "topicId": 7948, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 103456310, 
    "messageBody": "<div id=\"ygrps-yiv-1126872248\">I probably started using it for local variables after<br/>\nreading Joshua Bloch&#39;s Effective Java although I can&#39;t<br/>\nrapidly find a specific paragraph to cite as a<br/>\nrecommendation to use it.<br/>\n<br/>\nI don&#39;t use it quite as much as it seems Mike Bowler<br/>\ndoes (the HtmlUnit coding conventions rather emphasize<br/>\nit).  I have started experimenting with using it for<br/>\nparameter declarations after exploring HtmlUnit a bit<br/>\nbut haven&#39;t reached a conclusion for my own habits).<br/>\n<br/>\nI do find it helps clarify my intent about a local<br/>\nvariable particularly in large methods.  (My current<br/>\ncontract has me working on some pretty &quot;procedural&quot;<br/>\nJava code and it&#39;s not always appropriate to jump in<br/>\nand refactor until the methods are all nice and<br/>\nsmall.)  Using final for local variables in these big<br/>\nmethods makes it clear to anyone reading the code that<br/>\nthe variable is expected to at least be predictable as<br/>\nto what object or value it refers to for the rest of<br/>\nthe method.  The only thing I expect the compiler to<br/>\ndo with it is enforce the &quot;set once&quot; property just in<br/>\ncase I or anyone else forgets that they shouldn&#39;t set<br/>\nit again.<br/>\n<br/>\nI&#39;m not sure it helps much when methods are small but<br/>\nI do find that I&#39;m starting to put it in even with<br/>\nsmall methods just to be consistent.<br/>\n<br/>\nDoing it because it might help the compiler generate<br/>\nbetter code hasn&#39;t tempted me.  I guess I suspect that<br/>\nif I have a performance problem in a method, I won&#39;t<br/>\nfix it just by giving the compiler a hint like final. <br/>\nI expect I&#39;d have to think harder about how to reduce<br/>\nthe cost of the work being performed in that method<br/>\nand perhaps it&#39;s neighbors in the call stack.<br/>\n<br/>\nRick Berman<br/>\nAncilla SF LLC<br/>\n415-819-4865</div>", 
    "prevInTime": 8020, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1052626700", 
    "canDelete": false, 
    "nextInTopic": 8025, 
    "prevInTopic": 8019, 
    "headers": {
        "inReplyToHeader": "PDIwMDMwNTEwMTYzNTMyMDQ2OS4wMEE4Q0YxQkBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PDIwMDMwNTExMDQxODIwLjg1NDU4LnFtYWlsQHdlYjgwNDAyLm1haWwueWFob28uY29tPg=="
    }
}