{
    "numMessagesInTopic": 1, 
    "nextInTime": 8064, 
    "senderId": "itjxeIsvSzv4sg6_Yv-Cq_Wz4itJag1qIp0aOtsORCq6ItsmqB3tb9BkhKtCaCqUvHCGh-NbN_opLB3Lh3Jbarv2A3v2LiflfNofNqOxhHaq", 
    "systemMessage": false, 
    "subject": "Why utility computing is not agile", 
    "from": "&quot;James McGovern&quot; &lt;james@...&gt;", 
    "authorName": "James McGovern", 
    "msgSnippet": "I listened to a speech given by my own CIO regarding utility computing and how he thought this approach had merit for exploration by our organization. Of", 
    "msgId": 8063, 
    "rawEmail": "Return-Path: &lt;james@...&gt;\r\nReceived: (qmail 17084 invoked by uid 7800); 15 May 2003 14:58:44 -0000\r\nX-Sender: james@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (EGP: mail-8_2_6_6); 15 May 2003 12:06:43 -0000\r\nReceived: (qmail 95152 invoked from network); 15 May 2003 12:06:42 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m13.grp.scd.yahoo.com with QMQP; 15 May 2003 12:06:42 -0000\r\nReceived: from unknown (HELO theta.hostspectrum.com) (64.62.141.190)\n  by mta1.grp.scd.yahoo.com with SMTP; 15 May 2003 12:06:41 -0000\r\nReceived: from 69.0.53.250.adsl.snet.net ([69.0.53.250] helo=USCT04)\n\tby theta.hostspectrum.com with smtp (Exim 3.36 #1)\n\tid 19GHVr-0004fd-00; Thu, 15 May 2003 05:07:07 -0700\r\nTo: &lt;numberonewebservicesbook@yahoogroups.com&gt;\r\nSubject: Why utility computing is not agile\r\nDate: Thu, 15 May 2003 08:04:34 -0400\r\nMessage-ID: &lt;000a01c31ada$26166360$0300a8c0@USCT04&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Priority: 3 (Normal)\r\nX-MSMail-Priority: Normal\r\nX-Mailer: Microsoft Outlook IMO, Build 9.0.6604 (9.0.2911.0)\r\nImportance: Normal\r\nReply-By: Mon, 30 Jun 2003 11:15:00 -0400\r\nX-Message-Flag: Reply to All\r\nX-MimeOLE: Produced By Microsoft MimeOLE V6.00.2800.1106\r\nX-AntiAbuse: This header was added to track abuse, please include it with any abuse report\r\nX-AntiAbuse: Primary Hostname - theta.hostspectrum.com\r\nX-AntiAbuse: Original Domain - yahoogroups.com\r\nX-AntiAbuse: Originator/Caller UID/GID - [0 0] / [0 0]\r\nX-AntiAbuse: Sender Address Domain - architectbook.com\r\nFrom: &quot;James McGovern&quot; &lt;james@...&gt;\r\nX-Yahoo-Group-Post: member; u=129925442\r\nX-Yahoo-Profile: jm04469\r\nX-eGroups-Approved-By: nails762 &lt;jbrains@...&gt; via email; 15 May 2003 14:58:44 -0000\r\n\r\nI listened to a speech given by my own CIO regarding utility computing and\nhow he thought this approach had merit for exploration by our organization.\nOf course, always thinking agile I had to think about how it would align\nwith principles the industry should be held to and reached several\nconclusions.\n\nThe reference to &quot;utility&quot; is stolen from your water, electric, phone, etc\ncompanies. If one were to study their models, they essentially meter\nresources and charge for utilization. On the surface this sound really good.\nPay for what you use. But if you peel back the onion, you will find the\napproach flawed in many subtle ways.\n\nFirst, the economics of utilities favor cost recovery over value creation.\nWhen a utility incorporates a feature or a function, it seeks subsidy to\nguarantee its return on investment. A utility is a social construct that\nuses cross-subsidies to assure that everyone has access to the desire\nresource at &quot;equitable&quot; price.\n\nUtilities are successful in that they also guarantee standards (We all use\nthe same plugs but not XML schemas) and encourage interoperability (unlike\nMS). The problem is that the utility model totally ignores many of the\nhard-learned lessons from events that effected it such as deregulation.\n\nThe model fell apart when it was discovered that large corporate customers\nwere subsidizing consumers and vice versa. You will also notice in this\nmodel that companies such as Enron also lost the ability to track the real\ncosts of doing business.\n\nThe pricing model also falls apart in that many utilities still haven&#39;t\nfigured out how to charge for peak vs off-peak scenarios. Utilities in the\nvast majority of situations also are successful because they are monopolies.\nWhen one has a monolopy they tend to not value collaboration.\n\nWhen looking back into the cost recovery model, one will also need to\nconsider that many large manufacturing companies are now moving their\nelectrical needs to their own forms of electrical generation as the &quot;cost\nrecovery&quot; model has made it more expensive for them to share than to do it\nthemselves.\n\nLikewise, utilities over time also have little incentive in a cost recovery\nmodel to perform continous improvements (key agile principle). If one were\nto examine telephone companies, you would think that services such as DSL\nwould be pervasive, but the financial model of utilities prevents many forms\nof progress.\n\nUtility computing is simply a financial model. Nothing more, nothing less\nand in this light should be discussed by the CFO if it has merit, not IT.\n\nCIOs have become savage in the pursuit of the answer that allows them to get\na handle on reducing the amount of failed infrastructure projects and\nuncontrolled spending on capacity but utility computing may not be the\nsilver bullet they seek.\n\nIf you are interested in learning more about applying agile methods to\ninfrastructure, please visit\nhttp://groups.yahoo.com/group/agileinfrastructure\n\nJames McGovern\nCo-author of best selling book: Java Web Services Architecture\nhttp://www.amazon.com/exec/obidos/ASIN/1558609008/\n\n\n\n", 
    "profile": "jm04469", 
    "topicId": 8063, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 129925442, 
    "prevInTime": 8062, 
    "contentTrasformed": false, 
    "postDate": "1053000274", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDAwMGEwMWMzMWFkYSQyNjE2NjM2MCQwMzAwYThjMEBVU0NUMDQ+"
    }
}