{
    "numMessagesInTopic": 7, 
    "nextInTime": 8102, 
    "senderId": "BlzDmPtkKdAAohbSgSAR4Hvb0ZNhE9PYA33757Pvy-NaWcN-QY7mCAuwMw2hAl4UwKWpxq6Hhk81lJo_YynJH4CmGU_uYcJz4To", 
    "systemMessage": false, 
    "subject": "Re: [junit] Beginner&#39;s Question", 
    "from": "Kevin Klinemeier &lt;zipwow@...&gt;", 
    "authorName": "Kevin Klinemeier", 
    "msgSnippet": "... The quickest approach may be to change the scope of those methods from private to protected, and test them that way.  This is assuming, of course, that", 
    "msgId": 8101, 
    "profile": "zipwow", 
    "topicId": 8098, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 82914509, 
    "messageBody": "<div id=\"ygrps-yiv-835479256\"><blockquote><span title=\"ireply\">&gt; The problem is that each class<br/>\n&gt; only exposes the constructor and the run() method - so there is<br/>\n&gt; really not public facing methods to check. The run() goes off on its<br/>\n&gt; own, doing all kinds of steps using private methods, only ending upon<br/>\n&gt; death.<br/>\n&gt; \tSo for example, the Mover thread is checking for files in a given<br/>\n&gt; directory, if it finds a file it parses information from the filename<br/>\n&gt; to find its destination, them moves the file to that destination.<br/>\n&gt; Once it has finished with all of the files it sleeps for a few<br/>\n&gt; minutes. I would like to check all of parsing steps, but they are<br/>\n&gt; private only.<br/>\n<br/>\n </span></blockquote>The quickest approach may be to change the scope of those methods from<br/>\nprivate to protected, and test them that way.  This is assuming, of<br/>\ncourse, that your test class is in the same package.  Its kind of a<br/>\nhack, but it works.  <br/>\n<br/>\nGenerally when I see myself making a lot of protected methods like<br/>\nthis, its a signal that I ought to look at the design.  Should your<br/>\nthread class have these methods as private methods, or would it make<br/>\nmore sense to have a &quot;parser&quot; class that has these operations?  <br/>\n<br/>\nI&#39;m not saying this is definitely the case, but it might be something<br/>\nto look into.  There are a lot of red flags like this when you&#39;re<br/>\ntesting, generally summed up as &quot;If its hard to test, it may be hard to<br/>\nre-use.&quot;<br/>\n<br/>\nOtherwise, you&#39;ll have to make up a bunch of test files.  I&#39;d suggest<br/>\nkeeping the data for the files in your code, and writing them out to a<br/>\ntemporary directory your code makes rather than having a set of magic<br/>\ndirectories.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; (2) A second program relies on all of its data in a MS SQL database<br/>\n&gt; (connection using jdbc). Is there so way to build a fake set of<br/>\n&gt; tables using junit so that when run under junit it would get data<br/>\n&gt; from a set of objects instead of actually going to the database. That<br/>\n&gt; way I can provide for my own data - both bad and good - and track<br/>\n&gt; those results.<br/>\n<br/>\n </span></blockquote>I think Mock objects are exactly what you want here, see<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mockobjects.com/\">http://www.mockobjects.com/</a><br/>\n<br/>\n-Kevin<br/>\n<br/>\n__________________________________<br/>\nDo you Yahoo!?<br/>\nThe New Yahoo! Search - Faster. Easier. Bingo.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://search.yahoo.com\">http://search.yahoo.com</a></div>", 
    "prevInTime": 8100, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1053374476", 
    "canDelete": false, 
    "nextInTopic": 8102, 
    "prevInTopic": 8098, 
    "headers": {
        "inReplyToHeader": "PDRDOURFMzdBQTFDNDM5NEU5NTMzRDdDRTg1RTBFN0I2MDRGRUU5QGNpdGF0aW9uLmNoYXJsc29uLmxvY2FsPg==", 
        "messageIdInHeader": "PDIwMDMwNTE5MjAwMTE2LjEyNDI2LnFtYWlsQHdlYjgwNTEyLm1haWwueWFob28uY29tPg=="
    }
}