{
    "numMessagesInTopic": 7, 
    "nextInTime": 8103, 
    "senderId": "Q-1c8Ou1sSDd7hugG3QrAVvPN8MTN2nxaXqWMvATLcK_TmUetSWHuxzrkYo62Kk-VDkyX8doStRkxwvGtXsCZ-nDrLepqeufciYPilRu", 
    "systemMessage": false, 
    "subject": "Re: [junit] Beginner&#39;s Question", 
    "from": "Jason Rogers &lt;jacaetevha@...&gt;", 
    "authorName": "Jason Rogers", 
    "msgSnippet": "Refactor the privates to other classes and test them.  It s most likely a better design that way anyhow, since the program would be more modular, more", 
    "msgId": 8102, 
    "profile": "jacaetev", 
    "topicId": 8098, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 109352929, 
    "messageBody": "<div id=\"ygrps-yiv-873546635\">Refactor the privates to other classes and test them.  It&#39;s most likely<br/>\na better design that way anyhow, since the program would be more<br/>\nmodular, more reusable, and (*perhaps most importantly) more testable.<br/>\n<br/>\n=jason<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, 2003-05-19 at 13:38, Chip Dunning wrote:<br/>\n&gt; I have inherited several Java programs with no existing design documents, test cases, or jdocs. I am tackling each of these in turn and now that I have a better layout and docs I am tackling the lack for test cases. However, since these are the first junit test cases I have ever written I am getting stuck.<br/>\n&gt; <br/>\n&gt; (1) One program spawns off three threads. One thread moves files into storage, a second deletes files from storage, and the third catalogs all existing files in the storage. The problem is that each class only exposes the constructor and the run() method - so there is really not public facing methods to check. The run() goes off on its own, doing all kinds of steps using private methods, only ending upon death.<br/>\n&gt; \tSo for example, the Mover thread is checking for files in a given directory, if it finds a file it parses information from the filename to find its destination, them moves the file to that destination. Once it has finished with all of the files it sleeps for a few minutes. I would like to check all of parsing steps, but they are private only.<br/>\n&gt; <br/>\n&gt; (2) A second program relies on all of its data in a MS SQL database (connection using jdbc). Is there so way to build a fake set of tables using junit so that when run under junit it would get data from a set of objects instead of actually going to the database. That way I can provide for my own data - both bad and good - and track those results.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Chip<br/>\n&gt; -----<br/>\n&gt; Programming: Its not just a job - its an indenture <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a> <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>", 
    "prevInTime": 8101, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1053379284", 
    "canDelete": false, 
    "nextInTopic": 8122, 
    "prevInTopic": 8101, 
    "headers": {
        "inReplyToHeader": "CTw0QzlERTM3QUExQzQzOTRFOTUzM0Q3Q0U4NUUwRTdCNjA0RkVFOUBjaXRhdGlvbi5jaGFybHNvbi5sb2NhbD4=", 
        "messageIdInHeader": "PDEwNTMzNzkyODQuMTM2NS44OC5jYW1lbEBSaGlubz4=", 
        "referencesHeader": "PDRDOURFMzdBQTFDNDM5NEU5NTMzRDdDRTg1RTBFN0I2MDRGRUU5QGNpdGF0aW9uLmNoYXJsc29uLmxvY2FsPg=="
    }
}