{
    "numMessagesInTopic": 1, 
    "nextInTime": 8125, 
    "senderId": "LX1oDJ3wIfd8tFrfuz12EB7Xg8Vk6RM5BcNYqHESKRzFuJWuKwaH8-6kEt23uYVBLgzaO4cRTojONxRNfyTcsV_egU5M1EYnR2UFJRlpD7nZrvKArZ5hTw", 
    "systemMessage": false, 
    "subject": "SR. SOFTWARE QA ENGINEER (SQA5)  E2Open  Redwood City, CA", 
    "from": "&quot;camdenjobs&quot; &lt;paul.stevens@...&gt;", 
    "authorName": "camdenjobs", 
    "msgSnippet": "SR. SOFTWARE QA ENGINEER (SQA5) – E2Open – Redwood City, CA Here we go again.  E2Open is expanding.  Hello, my name is Paul Stevens and I am a staffing", 
    "msgId": 8124, 
    "profile": "camdenjobs", 
    "topicId": 8124, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 129987003, 
    "messageBody": "<div id=\"ygrps-yiv-1110193615\">SR. SOFTWARE QA ENGINEER (SQA5)  E2Open  Redwood City, CA<br/>\n<br/>\nHere we go again.  E2Open is expanding.  Hello, my name is Paul <br/>\nStevens and I am a staffing consultant with a software company based <br/>\nin Redwood City, CA called E2open (www.e2open.com). We currently <br/>\nhave openings for 3 Senior Quality Assurance Developers with strong <br/>\nJava, QA, Unix (Solaris) and XML experience.  For these positions we <br/>\nneed automation experience using Java and shell scripting and <br/>\nexperience in frameworks like JUNIT. We are not seeking expertise in <br/>\nUI automation test tools like SILK and Mercury Interactive.  If that <br/>\nis your background, let&#39;s save each other some time.  We are <br/>\nsearching for an accomplished software developer with a strong <br/>\nbackground in Java Development (Unix Platform) who straddles the <br/>\nline between QA and Development, who understands QA methodology, <br/>\nwhose expertise is in analyzing and testing components, who is <br/>\nsecure in a QA role and who understands the importance that a strong <br/>\nQA perspective brings to the development process.  Expertise in <br/>\ndeveloping supply chain software and RosettaNet would be a big plus.<br/>\n<br/>\nWhen responding to this posting, please include your name and the <br/>\nletters SQA5 in the subject line.  Email your resume to <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:qacareers@...\">qacareers@...</a>.<br/>\n<br/>\nPrimary Responsibilities: <br/>\n<br/>\n\tWriting and evaluating test plans, developing and running <br/>\nperformance measurement tests and working with other test and <br/>\ndevelopment teams. <br/>\n\tWorking closely in a team atmosphere with engineers from <br/>\nproduct development and quality assurance to create Automated, <br/>\nfunctional, load/performance and system tests.<br/>\n<br/>\nJob Qualifications: <br/>\n<br/>\n\tTwo years experience in a Quality Assurance department with <br/>\nat least 1 year QA test automation development experience using <br/>\nJAVA, JUNIT, EJB and XML.<br/>\n\tTwo years experience in design, development, QA, or <br/>\nintegration of Supply Chain enterprise resource planning (ERP) <br/>\nsoftware.<br/>\n\tExperience programming in a Unix environment. <br/>\n\tExperience working  with Oracle, HTML and SQL <br/>\n\tBachelor&#39;s degree in CS, Engineering, or other closely <br/>\nrelated technical field required<br/>\n<br/>\nABOUT E2OPEN:<br/>\n<br/>\nE2open (www.e2open.com) is the global collaboration network for the <br/>\nelectronics industry.  E2open enables effective collaboration among <br/>\nOEMs, contract manufacturers, distributors and suppliers and <br/>\nsupports the entire product lifecycle, including design, <br/>\nmanufacturing, procurement and asset recovery for computing, <br/>\nnetworking and consumer electronics products.  E2open was formed by <br/>\nindustry leaders Acer, Hitachi, IBM, LG Electronics, Lucent <br/>\nTechnologies, Matsushita Electric (Panasonic), Nortel Networks, <br/>\nSeagate Technology, Solectron and Toshiba, as well as the prominent <br/>\ninvestors Crosspoint Venture Partners and Morgan Stanley Dean <br/>\nWitter.  E2open Strategic Members include Mitsubishi Electric, <br/>\nOmron, Ricoh, Sanyo and Sharp.<br/>\n<br/>\nIMPORTANT MESSAGE:<br/>\n <br/>\nThank you for taking the time to review the above job requirements.  <br/>\nIf your background matches the experience listed, I would very much <br/>\nlike to hear from you.  If not, please take a moment to reflect upon <br/>\nwho in your circle of friends or co-workers might benefit from this <br/>\nopportunity. Then pass this message along. Your selfless act may <br/>\npropel them to a career of a lifetime.<br/>\n<br/>\nNo entry level or contract positions are available at this time. <br/>\nInterested local candidates (no relocation offered) should forward a <br/>\ncover letter and resume in any of the following formats - .DOC <br/>\n(preferred), plain text, RTF, HTML, or PDF to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:qacareers@...\">qacareers@...</a>.<br/>\n<br/>\n<br/>\nPlease understand that due to the large volume of responses, I will <br/>\nnot be able to acknowledge each of you individually.  Be assured, <br/>\nhowever, that I will thoroughly examine each resume received and <br/>\nwill arrange interviews with the best qualified candidates.  In <br/>\norder to manage this process timely and efficiently, I will not be <br/>\nable to respond to telephone inquiries or provide you with status <br/>\nupdates.   Although I gratefully acknowledge my agency friends&#39; <br/>\nwillingness to assist me, I am unable to accept resumes/profiles <br/>\nfrom any 3rd parties (recruiters, agencies, contract firms, search <br/>\nfirms, etc.), at this time.  Thanks again for considering e2open and <br/>\nI look forward to early response.<br/>\n <br/>\nCONTACT INFO:<br/>\n<br/>\nPaul Stevens<br/>\nSr. Staffing Consultant<br/>\nE2Open<br/>\n1600 Seaport Blvd.<br/>\nRedwood City, CA 94063<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:qacareers@...\">qacareers@...</a><br/>\nwww.e2open.com</div>", 
    "prevInTime": 8123, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1053491937", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGJhZXZ0MStmNmIxQGVHcm91cHMuY29tPg=="
    }
}