{
    "numMessagesInTopic": 3, 
    "nextInTime": 814, 
    "senderId": "lwBZZ8y0eCqTLVI14KDjPN91CgwhL9uDf_N8pImXD0YVlS3DKfATDYCK5tfgTb10n7Ip46F2uehWJFglaRGVGhimhp6nqA", 
    "systemMessage": false, 
    "subject": "Re: [junit] -noloader (was: cannot run testing with UI TestRunner?)", 
    "from": "&quot;Chas Schley&quot; &lt;chas@...&gt;", 
    "authorName": "Chas Schley", 
    "msgSnippet": "... Useful trick to know...  We wrote our own test runner.  It extends junit.runner.BaseTestRunner.  The default behavior of BaseTestRunner is to use the", 
    "msgId": 813, 
    "topicId": 806, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1480283611\"><blockquote><span title=\"ireply\">&gt; I learned about the class loader issue a year ago.  The instant I have<br/>\n&gt; a wierd problem with a test, I run it twice, once under swingui and again<br/>\n&gt; with textui.<br/>\n&gt;<br/>\n&gt; If it runs under textui but not swingui, my next step is to add -noloading<br/>\n&gt; to swingui.  That has always solved the problem, and -noloading goes<br/>\n&gt; right into the project&#39;s launcher from that point onward.<br/>\n&gt;<br/>\n&gt; This loading/noloading trick is necessary for JNI debugging as well,<br/>\n&gt; because with JNI the JVM will load a library at most once, no matter<br/>\n&gt; what classloader is involved.<br/>\n<br/>\n </span></blockquote>Useful trick to know...  We wrote our own test runner.  It extends<br/>\njunit.runner.BaseTestRunner.  The default behavior of BaseTestRunner is to<br/>\nuse the custom class loader.  I think that&#39;s counter-intuitive.  Anyone who<br/>\nwrites their own runner will have to learn about the custom class loader the<br/>\nhard way.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have no difficulties with the current default behavior.  The GUI<br/>\n&gt; interfaces, which you like to leave up and running, must obviously<br/>\n&gt; be using the custom classloader, because otherwise you&#39;re just restesting<br/>\n&gt; old classes already in the JVM.  TextUI doesn&#39;t stay running and doesn&#39;t<br/>\n&gt; take long to load, so it doesn&#39;t use the custom classloader.<br/>\n<br/>\n </span></blockquote>You think correctly - the GUIs should reload, the others should not.<br/>\n<br/>\nThanks,<br/>\n<br/>\n_chas_</div>", 
    "prevInTime": 812, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "985727333", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 807, 
    "headers": {
        "messageIdInHeader": "PDAxOGEwMWMwYjcwMiQyMGFiMDNiMCQ2NDY2NjQwYUB6aGFucmEuY29tPg==", 
        "referencesHeader": "PFBpbmUuTE5YLjQuMjEuMDEwMzI3MTMxMTIwMC4xMjQ5OC0xMDAwMDBAam9pLmFyYXZveC5jb20+"
    }
}