{
    "numMessagesInTopic": 51, 
    "nextInTime": 8326, 
    "senderId": "oVZXeg_opPLp1WiBbLFgVgOHMmLtypbN19DRNgoTfxBxxxvjbGFE49w6NZc7ECRFSpF6ucqbOAgIOTH3Me-I9FJvD78E6qK8tRveyRnKmg", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Any tools for Test Case generation?", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... But someone (human!) has to write that assertion or postcondition using a mental model of how the system ought to behave. The computer won t generate it", 
    "msgId": 8325, 
    "profile": "nails762", 
    "topicId": 8301, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-1603152939\"><blockquote><span title=\"ireply\">&gt;So said hehaifengcn on 2003-06-10 --------------------<br/>\n&gt;<br/>\n&gt;&gt; The idea of automatically generating tests is incompatible with the <br/>\n&gt;JUnit (and xUnit) philosophy. JUnit is a framework in which humans <br/>\n&gt;write tests; it is not a tool that writes tests.<br/>\n&gt;&gt; <br/>\n&gt;&gt; An interesting question for you: how do you expect any program to <br/>\n&gt;know the expected result for each code path? The key point of tests <br/>\n&gt;is to compare an expected result to the actual result. How is it <br/>\n&gt;possible for a non-human to know the expected result?<br/>\n&gt;&gt; <br/>\n&gt;<br/>\n&gt;I think one way is to use assertion or post-condition to check the <br/>\n&gt;validity of the execution. <br/>\n<br/>\n </span></blockquote>But someone (human!) has to write that assertion or postcondition using a mental model of how the system ought to behave. The computer won&#39;t generate it for you.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Another way to do is to automatically <br/>\n&gt;detect program anomalies. This is actually a purpose of my project. <br/>\n<br/>\n </span></blockquote>I don&#39;t understand you: how does one automatically detect a program anomaly. How does one decide what constitutes an anomaly in the first place? Surely the computer does not: it does not have the requisite ability to judge whether an event is anomalous.<br/>\n<br/>\nI suppose there are some obvious kinds of anomaly, such as a process aborting unexpectedly, but otherwise, what else is there that a computer could determine on its own? Even so, sometimes a process *should* abort.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Running the program with a large set of test case. For the execution <br/>\n&gt;to construct possible program invariant. If some test case cause the <br/>\n&gt;execution violates the deduced program invariant, a program bug might <br/>\n&gt;be found. That&#39;s why I want a tool for automatically generating test <br/>\n&gt;case. <br/>\n<br/>\n </span></blockquote>How does running a suite of tests -- of any size -- establish a program invariant? Even if it does, how meaningful can that invariant be?<br/>\n<br/>\nI think you&#39;re using the term &quot;test case&quot; to refer to something other than we expect. We define a &quot;test case&quot;, loosely, as code that executes some part of a program then compares its output with some known expected result. [Test cases need not be automatic, but this is a JUnit group after all.] The test case is said to pass if the output matches the expected result and fails otherwise. The key part of this definition is the expected result: how can a computer determine the expected result? It seems to me that only a human can do that. This is a consequence of the fact that computers only do what we tell them to do.<br/>\n<br/>\nIt sounds to me like you&#39;re just looking to generate random blocks of code that exercise different code paths in a program, with the goal of covering an ever-increasing portion of the possible execution paths. Those are not test cases -- at least not by our well-established and widely-accepted definition. Those are just blocks of code. Is that what you&#39;re trying to do? <br/>\n<br/>\nThat is something that a computer could be capable of: analyzing source code to generate legal (that is to say, compilable) blocks of code that call the program or its objects. A computer may even be capable of using elementary heuristics to generate &quot;somewhat meaningful&quot; blocks of code, by repeatedly invoking methods on the same object, for example. The resulting code, however, does nothing to answer the question, &quot;Does the program behave as expected?&quot; That is the question that we care about when we write tests.<br/>\n<br/>\nThe notion of using these generated blocks of code to establish probable system invariants is interesting, but my uninformed guess is that it is extremely unlikely to discover a meaningful system invariant without human guidance. The computer is likely incapable of identifying candidates to be meaningful invariants, let alone verify that they are actually invariant. [I say &quot;unlikely&quot; rather than impossible because it may be a mere limit of computing power, but I doubt it. Never say &#39;never&#39;.]<br/>\n<br/>\nIt&#39;s an interesting topic, but it sounds impossible within the Turing Machine model of computing. Not knowing any other models of computing in common use (in other words, for which you can find a functioning computer), I can&#39;t help you further on this. Good luck.<br/>\n<br/>\nLooking back, that reads as awfully negative; but my reasoning looks pretty solid. I&#39;m sorry if this throws cold water on a research project. Of course, if you think you can do it, you won&#39;t listen to me, anyway. :)<br/>\n<br/>\nTake care.<br/>\n<br/>\n<br/>\nJ. B. Rainsberger,<br/>\nPresident, Diaspar Software Services<br/>\nLet&#39;s write software that people understand.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com/\">http://www.diasparsoftware.com/</a><br/>\ntelephone: +1 416 791-8603</div>", 
    "prevInTime": 8324, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1055369807", 
    "canDelete": false, 
    "nextInTopic": 8326, 
    "prevInTopic": 8315, 
    "headers": {
        "inReplyToHeader": "PGJjNWw2cStjdHNuQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDIwMDMwNjExMTgxNjQ3MDU4MS4wMTlFODFGM0Bzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "referencesHeader": "PGJjNWw2cStjdHNuQGVHcm91cHMuY29tPg=="
    }
}