{
    "numMessagesInTopic": 51, 
    "nextInTime": 8326, 
    "senderId": "9nxDvCGAId9eORtDI2T-ojwpPROo4vfJrCGp8RPzzKtik-NgEpoOo3F2aJKRKuYEsv_sgL-Y5-PKuci-cHa4NdmVObWbNirk8krpsLI7Gw", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Any tools for Test Case generation?", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... But someone (human!) has to write that assertion or postcondition using a mental model of how the system ought to behave. The computer won t generate it", 
    "msgId": 8325, 
    "rawEmail": "Return-Path: &lt;jbrains@...&gt;\r\nX-Sender: jbrains@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 10450 invoked from network); 11 Jun 2003 22:16:46 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m14.grp.scd.yahoo.com with QMQP; 11 Jun 2003 22:16:46 -0000\r\nReceived: from unknown (HELO fep04-mail.bloor.is.net.cable.rogers.com) (66.185.86.74)\n  by mta3.grp.scd.yahoo.com with SMTP; 11 Jun 2003 22:16:45 -0000\r\nReceived: from quincy ([24.156.43.226])\n          by fep04-mail.bloor.is.net.cable.rogers.com\n          (InterMail vM.5.01.05.12 201-253-122-126-112-20020820) with ESMTP\n          id &lt;20030611221644.OSOO413153.fep04-mail.bloor.is.net.cable.rogers.com@quincy&gt;\n          for &lt;junit@yahoogroups.com&gt;; Wed, 11 Jun 2003 18:16:44 -0400\r\nMessage-ID: &lt;200306111816470581.019E81F3@...&gt;\r\nIn-Reply-To: &lt;bc5l6q+ctsn@...&gt;\r\nReferences: &lt;bc5l6q+ctsn@...&gt;\r\nX-Mailer: Calypso Version 3.30.00.00 (4)\r\nDate: Wed, 11 Jun 2003 18:16:47 -0400\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] Re: Any tools for Test Case generation?\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Authentication-Info: Submitted using SMTP AUTH LOGIN at fep04-mail.bloor.is.net.cable.rogers.com from [24.156.43.226] using ID &lt;jbrains@...&gt; at Wed, 11 Jun 2003 18:16:44 -0400\r\nFrom: &quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;\r\nReply-To: jbr@...\r\nX-Yahoo-Group-Post: member; u=127224993\r\nX-Yahoo-Profile: nails762\r\n\r\n&gt;So said hehaifengcn on 2003-06-10 --------------------\n&gt;\n&gt;&gt; The idea of au=\r\ntomatically generating tests is incompatible with the \n&gt;JUnit (and xUnit) p=\r\nhilosophy. JUnit is a framework in which humans \n&gt;write tests; it is not a =\r\ntool that writes tests.\n&gt;&gt; \n&gt;&gt; An interesting question for you: how do you =\r\nexpect any program to \n&gt;know the expected result for each code path? The ke=\r\ny point of tests \n&gt;is to compare an expected result to the actual result. H=\r\now is it \n&gt;possible for a non-human to know the expected result?\n&gt;&gt; \n&gt;\n&gt;I t=\r\nhink one way is to use assertion or post-condition to check the \n&gt;validity =\r\nof the execution. \n\nBut someone (human!) has to write that assertion or pos=\r\ntcondition using a mental model of how the system ought to behave. The comp=\r\nuter won&#39;t generate it for you.\n\n&gt;Another way to do is to automatically \n&gt;d=\r\netect program anomalies. This is actually a purpose of my project. \n\nI don&#39;=\r\nt understand you: how does one automatically detect a program anomaly. How =\r\ndoes one decide what constitutes an anomaly in the first place? Surely the =\r\ncomputer does not: it does not have the requisite ability to judge whether =\r\nan event is anomalous.\n\nI suppose there are some obvious kinds of anomaly, =\r\nsuch as a process aborting unexpectedly, but otherwise, what else is there =\r\nthat a computer could determine on its own? Even so, sometimes a process *s=\r\nhould* abort.\n\n&gt;Running the program with a large set of test case. For the =\r\nexecution \n&gt;to construct possible program invariant. If some test case caus=\r\ne the \n&gt;execution violates the deduced program invariant, a program bug mig=\r\nht \n&gt;be found. That&#39;s why I want a tool for automatically generating test \n=\r\n&gt;case. \n\nHow does running a suite of tests -- of any size -- establish a pr=\r\nogram invariant? Even if it does, how meaningful can that invariant be?\n\nI =\r\nthink you&#39;re using the term &quot;test case&quot; to refer to something other than we=\r\n expect. We define a &quot;test case&quot;, loosely, as code that executes some part =\r\nof a program then compares its output with some known expected result. [Tes=\r\nt cases need not be automatic, but this is a JUnit group after all.] The te=\r\nst case is said to pass if the output matches the expected result and fails=\r\n otherwise. The key part of this definition is the expected result: how can=\r\n a computer determine the expected result? It seems to me that only a human=\r\n can do that. This is a consequence of the fact that computers only do what=\r\n we tell them to do.\n\nIt sounds to me like you&#39;re just looking to generate =\r\nrandom blocks of code that exercise different code paths in a program, with=\r\n the goal of covering an ever-increasing portion of the possible execution =\r\npaths. Those are not test cases -- at least not by our well-established and=\r\n widely-accepted definition. Those are just blocks of code. Is that what yo=\r\nu&#39;re trying to do? \n\nThat is something that a computer could be capable of:=\r\n analyzing source code to generate legal (that is to say, compilable) block=\r\ns of code that call the program or its objects. A computer may even be capa=\r\nble of using elementary heuristics to generate &quot;somewhat meaningful&quot; blocks=\r\n of code, by repeatedly invoking methods on the same object, for example. T=\r\nhe resulting code, however, does nothing to answer the question, &quot;Does the =\r\nprogram behave as expected?&quot; That is the question that we care about when w=\r\ne write tests.\n\nThe notion of using these generated blocks of code to estab=\r\nlish probable system invariants is interesting, but my uninformed guess is =\r\nthat it is extremely unlikely to discover a meaningful system invariant wit=\r\nhout human guidance. The computer is likely incapable of identifying candid=\r\nates to be meaningful invariants, let alone verify that they are actually i=\r\nnvariant. [I say &quot;unlikely&quot; rather than impossible because it may be a mere=\r\n limit of computing power, but I doubt it. Never say &#39;never&#39;.]\n\nIt&#39;s an int=\r\neresting topic, but it sounds impossible within the Turing Machine model of=\r\n computing. Not knowing any other models of computing in common use (in oth=\r\ner words, for which you can find a functioning computer), I can&#39;t help you =\r\nfurther on this. Good luck.\n\nLooking back, that reads as awfully negative; =\r\nbut my reasoning looks pretty solid. I&#39;m sorry if this throws cold water on=\r\n a research project. Of course, if you think you can do it, you won&#39;t liste=\r\nn to me, anyway. :)\n\nTake care.\n\n\nJ. B. Rainsberger,\nPresident, Diaspar Sof=\r\ntware Services\nLet&#39;s write software that people understand.\nhttp://www.dias=\r\nparsoftware.com/\ntelephone: +1 416 791-8603\n\n\n", 
    "profile": "nails762", 
    "topicId": 8301, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "prevInTime": 8324, 
    "contentTrasformed": false, 
    "postDate": "1055369807", 
    "canDelete": false, 
    "nextInTopic": 8326, 
    "prevInTopic": 8315, 
    "headers": {
        "inReplyToHeader": "PGJjNWw2cStjdHNuQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDIwMDMwNjExMTgxNjQ3MDU4MS4wMTlFODFGM0Bzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "referencesHeader": "PGJjNWw2cStjdHNuQGVHcm91cHMuY29tPg=="
    }
}