{
    "numMessagesInTopic": 4, 
    "nextInTime": 8334, 
    "senderId": "ZBy6ukfWNE39Q8eXJp65Q-gBBlrd9J_Q73neOAQBz10l2WnqghJz57togLQfgstsqQwFFlDdsy7b6H7iXkxtPHHzuJliT5EO", 
    "systemMessage": false, 
    "subject": "Testing persistence systems", 
    "from": "Sam Joseph &lt;gaijin@...&gt;", 
    "authorName": "Sam Joseph", 
    "msgSnippet": "Hi All, Apologies for cross-posting to junit and prevayler, but I am working on an intersection of the two - I think you ll find my post relevant to both", 
    "msgId": 8333, 
    "profile": "samrhjoseph", 
    "topicId": 8333, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 29226057, 
    "messageBody": "<div id=\"ygrps-yiv-297728183\">Hi All,<br/>\n<br/>\nApologies for cross-posting to junit and prevayler, but I am working on <br/>\nan intersection of the two - I think you&#39;ll find my post relevant to <br/>\nboth lists.<br/>\n<br/>\nAnyways, a testing issue that has been bothering me for a while is the <br/>\nissue of testing persistent storage.<br/>\n<br/>\nRecently I have been using prevayler ( <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.prevayler.org\">http://www.prevayler.org</a> ) in <br/>\nplace of an RDBMS, and have been writing unit tests in JUnit ( <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.junit.org\">http://www.junit.org</a> ).<br/>\n<br/>\nThe point is, for a system like prevayler, in order to really confirm <br/>\nwhether something has been persisted or not, you need to shut down the <br/>\nJVM, and then re-start and then check whether the object you persisted <br/>\nstill exists.<br/>\n<br/>\nImplementing this in JUnit seems slightly problematic.  My current <br/>\nthinking is that maybe some kind of ant task that spawned a new JVM <br/>\nwould help.  Thinking some more, I guess the test class would need to be <br/>\naccessing the Prevayler system via a socket (like an RDBMS) and tell it <br/>\nto shut down and then restart inbetween requesting the persistence of an <br/>\nobject, and checking the object has been persisted.<br/>\n<br/>\nOf course this sort of defeats the purpose of the prevayler which is to <br/>\nhave all your persistence in the same JVM as your processes - I guess <br/>\nyou could delete everything and call the prevayler initialize methods, <br/>\nbut this suffers from the problem that the test is not actually testing <br/>\nthe thing we want, i.e. a shutdown and restart of the JVM, because if <br/>\nthe persistence doesn&#39;t survive this event, then it&#39;s of no use.<br/>\n<br/>\nI guess one could have a separately stored list of persisted objects, <br/>\nsay in a text file, that the junit test would record its persistence <br/>\nattempts to, and this could be used on startup to confirm what should be <br/>\nin the prevayler persistent store.  hmmm.<br/>\n<br/>\nAny thoughts or comments greatly appreciated.<br/>\n<br/>\nCHEERS&gt; SAM</div>", 
    "prevInTime": 8332, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1055385191", 
    "canDelete": false, 
    "nextInTopic": 8338, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDNFRTdFNjY3LjMwMDAxMDdAeWhhLmF0dC5uZS5qcD4="
    }
}