{
    "numMessagesInTopic": 19, 
    "nextInTime": 8419, 
    "senderId": "H_FE7I1w6pPUybAQwso0wfrhjpQbVzrxOgvsSHgNv90TNUHDrvxoBep6yEIlXh1Tuy_5ylWQ85e44I_jfh8xFEr2eMFKcsf93xM", 
    "systemMessage": false, 
    "subject": "Re: [junit] Unit Testing vs Integration Testing", 
    "from": "Kevin Klinemeier &lt;zipwow@...&gt;", 
    "authorName": "Kevin Klinemeier", 
    "msgSnippet": "Mike, I think that they re both valuable (and necessary), mostly because they test different things. My unit tests guarantee that the small parts of my code", 
    "msgId": 8418, 
    "rawEmail": "Return-Path: &lt;zipwow@...&gt;\r\nX-Sender: zipwow@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 94117 invoked from network); 20 Jun 2003 16:52:33 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m3.grp.scd.yahoo.com with QMQP; 20 Jun 2003 16:52:33 -0000\r\nReceived: from unknown (HELO web80503.mail.yahoo.com) (66.218.79.73)\n  by mta2.grp.scd.yahoo.com with SMTP; 20 Jun 2003 16:52:33 -0000\r\nMessage-ID: &lt;20030620165233.97368.qmail@...&gt;\r\nReceived: from [207.14.29.3] by web80503.mail.yahoo.com via HTTP; Fri, 20 Jun 2003 09:52:33 PDT\r\nDate: Fri, 20 Jun 2003 09:52:33 -0700 (PDT)\r\nSubject: Re: [junit] Unit Testing vs Integration Testing\r\nTo: junit@yahoogroups.com\r\nIn-Reply-To: &lt;bcv76j$p8m$1@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=us-ascii\r\nFrom: Kevin Klinemeier &lt;zipwow@...&gt;\r\nX-Yahoo-Group-Post: member; u=82914509\r\nX-Yahoo-Profile: zipwow\r\n\r\nMike,\n\nI think that they&#39;re both valuable (and necessary), mostly because they\ntest different things.\n\nMy unit tests guarantee that the small parts of my code work the way I\nexpect them to, and enforce the contracts of the API I&#39;m providing.  I\ncan test code that interacts with other systems even before those other\nsystems exist, so long as we&#39;ve defined their API.  Its important,\nhowever, to limit the scope of your unit tests to things that *you* are\nresponsible for.  If you miss that, you&#39;ll end up writing\nunit-integration tests, that I find become unwieldy fairly quickly.\n\nWhat I&#39;ve noticed in my integration testing is that now that I use unit\ntests, finding the actual problems that crop up during integration\ntesting takes much less time.  Whereas before all I knew was &quot;the\nwebpage does NOT appear&quot; and I had a forest of reasons why that could\nbe, now I know from my unit tests that large parts of the system are\nworking, and the problem must be somewhere in the &#39;seams&#39;.\n\nActually, I&#39;d say that leads me to the opposite of your hunch that &quot;the\ncost-per-bug-eliminated of unit testing is higher than that of\nintegration testing&quot;, because there&#39;s generally a long period of time\nin the integration test between bug discovery and bug repair, where in\nmy unit tests, its quite small.  I suppose I&#39;d also disagree that the\ntwo take the same amount of time to construct, as I&#39;m a true believer\n(tm) that writing unit tests at the same time as your code takes the\nsame time as writing your code without unit tests and testing by hand. \nIn both those cases you still have to go through integration tests when\nyou&#39;re done.\n\nLastly, the advantages in cleanup of your API (if it isn&#39;t easlity\ntestable, it may not be easily usable) are, to me at least, very real\nand significant.\n\nJust to be clear, I still integration test, too.  It just tends to go\nsmoother, and I have better knowledge of where the problem is.\n\nThis obviously wasn&#39;t a scientific study paper, but hopefully its a\nhelpful perspective.\n\nKevin\n\n--- Mike Bresnahan &lt;java-junit@...&gt; wrote:\n&gt; I have experience with integration testing but not much with unit\n&gt; testing.\n&gt; I&#39;ve been reading up on unit testing  (e.g. mock objects, test first\n&gt; development).  However, I have not found an article that explains the\n&gt; advantages of unit testing vs integration testing.  My perhaps naive\n&gt; hunch\n&gt; is that the cost-per-bug-eliminated of unit testing is higher than\n&gt; that of\n&gt; integration testing.  It appears this way because a single\n&gt; integration test\n&gt; tests a lot more code than a single unit test and takes about the\n&gt; same\n&gt; amount of time to construct.  Plus it seems to me that a whole suite\n&gt; of unit\n&gt; tests with 100% code coverage cannot guarantee that even the simplest\n&gt; system\n&gt; wide behavior is correct (e.g. the web page appears).  Am I wrong\n&gt; about\n&gt; this?  Can someone refer me information about this topic.  A\n&gt; scientific\n&gt; study paper with real numbers would be welcome.\n&gt; \n&gt; Mike Bresnahan\n\n__________________________________\nDo you Yahoo!?\nSBC Yahoo! DSL - Now only $29.95 per month!\nhttp://sbc.yahoo.com\n\n", 
    "profile": "zipwow", 
    "topicId": 8414, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 82914509, 
    "prevInTime": 8417, 
    "contentTrasformed": false, 
    "postDate": "1056127953", 
    "canDelete": false, 
    "nextInTopic": 8419, 
    "prevInTopic": 8417, 
    "headers": {
        "inReplyToHeader": "PGJjdjc2aiRwOG0kMUBtYWluLmdtYW5lLm9yZz4=", 
        "messageIdInHeader": "PDIwMDMwNjIwMTY1MjMzLjk3MzY4LnFtYWlsQHdlYjgwNTAzLm1haWwueWFob28uY29tPg=="
    }
}