{
    "topicId": 8414, 
    "postDate": "1056126747", 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "from": "Frank Burough &lt;fburough@...&gt;", 
    "canDelete": false, 
    "replyTo": "LIST", 
    "senderId": "CktNzamr818SOul5gQrhTNdjVdzOoHdU_KCsPzcQFL1XOEBjoGyq1Lmg8JlI8oPTDewylRldn9dplVcCSLFl_dCN1MUgJHzDnDdgkpwM9g", 
    "nextInTime": 8423, 
    "userId": 142170960, 
    "prevInTime": 8421, 
    "prevInTopic": 8421, 
    "headers": {
        "inReplyToHeader": "PGJjdjc2aiRwOG0kMUBtYWluLmdtYW5lLm9yZz4=", 
        "messageIdInHeader": "PDEwNTYxMjY3NDcuNTI4OS40Ny5jYW1lbEBsb2NhbGhvc3QubG9jYWxkb21haW4+", 
        "referencesHeader": "PGJjdjc2aiRwOG0kMUBtYWluLmdtYW5lLm9yZz4="
    }, 
    "authorName": "Frank Burough", 
    "numMessagesInTopic": 19, 
    "msgSnippet": "Mike: Thanks for the question. First, both integration and unit testing are extremely valuable and have their place. Integration tests do as you state. They", 
    "contentTrasformed": false, 
    "msgId": 8422, 
    "nextInTopic": 8423, 
    "systemMessage": false, 
    "rawEmail": "Return-Path: &lt;fburough@...&gt;\r\nReceived: (qmail 42498 invoked by uid 7800); 20 Jun 2003 17:13:08 -0000\r\nX-Sender: fburough@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 32391 invoked from network); 20 Jun 2003 16:32:29 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m14.grp.scd.yahoo.com with QMQP; 20 Jun 2003 16:32:29 -0000\r\nReceived: from unknown (HELO mail.elixirpharm.com) (66.236.179.163)\n  by mta1.grp.scd.yahoo.com with SMTP; 20 Jun 2003 16:32:28 -0000\r\nSubject: Re: [junit] Unit Testing vs Integration Testing\r\nTo: junit@yahoogroups.com\r\nIn-Reply-To: &lt;bcv76j$p8m$1@...&gt;\r\nReferences: &lt;bcv76j$p8m$1@...&gt;\r\nOrganization: Elixir Pharmaceuticals\r\nMessage-Id: &lt;1056126747.5289.47.camel@...&gt;\r\nMime-Version: 1.0\r\nX-Mailer: Ximian Evolution 1.4.0 \r\nDate: 20 Jun 2003 12:32:27 -0400\r\nFrom: Frank Burough &lt;fburough@...&gt;\r\nReply-To: fburough@...\r\nX-Yahoo-Group-Post: member; u=142170960\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Approved-By: nails762 &lt;jbrains@...&gt; via email; 20 Jun 2003 17:13:08 -0000\r\n\r\nMike:\n\nThanks for the question. First, both integration and unit testing are\nextremely valuable and have their place. Integration tests do as you\nstate. They can be used to validate proper system-wide behavior, and\nthey may well exercise a lot of code in the process. However, when an\nintegration test fails how do you know where to start looking for the\nunderlying cause? This is where unit tests come in. If you write unit\ntests as you write your software (or write the tests first as in TDD)\nyou will have a rich set of tests that exercise your code at a low\nlevel. This way you can be assured that each individual class and method\nis doing what it was designed to do. Integration tests then test the\ninteraction of these fully-tested modules. If an integration test fails,\nand all the modules that are involved in that test each passed their\nunit tests then\na) Perhaps the unit tests were inadequate and all desired behavior was\nnot tested\nb) Perhaps there is a misunderstanding between the modules, each of\nwhich is behaving &#39;properly&#39;. \n\nBecause I have a pretty thorough set of unit tests, if an integration\ntest fails I immediately suspect that there is a misunderstanding\nbetween what one module is providing and what is expected. When I find\nthe root cause, it is usually one of two things -- either I did not pay\nattention to my own documentation of the interface and assume a wrong\nreturn type (array of Strings vs a Vector of Strings for example), or I\ndid not properly test all the functionality in a module that I should\nhave. If I misunderstood the interface, I fix that (update documentation\nas appropriate) and go on. If I had not properly tested the\nfunctionality, I add unit tests, fix the problem and continue. \n\nI find that my experience is exactly counter to your &#39;naive hunch&#39; in\nthat my cost per bug eliminated is much less if I have unit tests.\nFurther, I find myself asking a key question whenever I am adding\nfunctionality: &quot;How will I test this automatically?&quot; I find that when I\nask this question first and make testability a key requirement in adding\nfunctionality two things happen. First, I write better code, more\nmodular, more loosely coupled, and smaller -- less code does more work.\nSecond, I have a lot fewer bugs uncovered during any level of testing.\nThis yields an even better unintended side effect -- more working code\nin less time. \n\nOne last thing. Unfortunately I can&#39;t provide scientific numbers, only\nmy own experience. Yours may vary. I have found myself being drawn into\nthe mode of writing tests first (and writing javadoc at the same time)\nbecause it works for me. I was always a firm believer in testing, and\nthat someone else should do it. Now I am in a small company with no QA\ndepartment and I have to write the software as well as ensure it works\nand support the end users. To do this I write javadoc and religiously\nmaintain it. I write unit tests religiously. And I write integration\ntests. I do all of this in less time than I used to just write code.\nAgain, your mileage may vary, but this approach definitely works for me.\n\nHopefully others will chime much more eloquently than I on this.\n\nFrank\n\n\n\nOn Fri, 2003-06-20 at 10:54, Mike Bresnahan wrote:\n\n&gt; I have experience with integration testing but not much with unit testing.\n&gt; I&#39;ve been reading up on unit testing  (e.g. mock objects, test first\n&gt; development).  However, I have not found an article that explains the\n&gt; advantages of unit testing vs integration testing.  My perhaps naive hunch\n&gt; is that the cost-per-bug-eliminated of unit testing is higher than that of\n&gt; integration testing.  It appears this way because a single integration test\n&gt; tests a lot more code than a single unit test and takes about the same\n&gt; amount of time to construct.  Plus it seems to me that a whole suite of unit\n&gt; tests with 100% code coverage cannot guarantee that even the simplest system\n&gt; wide behavior is correct (e.g. the web page appears).  Am I wrong about\n&gt; this?  Can someone refer me information about this topic.  A scientific\n&gt; study paper with real numbers would be welcome.\n&gt; \n&gt; Mike Bresnahan\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; \n&gt; To unsubscribe from this group, send an email to:\n&gt; junit-unsubscribe@yahoogroups.com\n&gt;  \n&gt; \n&gt; Your use of Yahoo! Groups is subject to http://docs.yahoo.com/info/terms/\n\n\n\n\n[Non-text portions of this message have been removed]\n\n\n", 
    "subject": "Re: [junit] Unit Testing vs Integration Testing"
}