{
    "numMessagesInTopic": 5, 
    "nextInTime": 8426, 
    "senderId": "v7fN8UlFTweByove2jpLu4CnOBrP4_EK1SwyH4YCHhttUKH4uvrRkN3DPor_iVKct5UhBKP7yXjHd72VBLdmzwRMqy-YwQIhu0k", 
    "systemMessage": false, 
    "subject": "Re: [junit] Testing complex interations", 
    "from": "Michael Orozco &lt;orozcom1@...&gt;", 
    "authorName": "Michael Orozco", 
    "msgSnippet": "Jonathan, I sort of had the same situation but with ejb s. I could reference my ejb s methods because they were abstract. So, I constructed a Delegate that was", 
    "msgId": 8425, 
    "profile": "orozcom1", 
    "topicId": 8413, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 151089469, 
    "messageBody": "<div id=\"ygrps-yiv-934833088\">Jonathan,<br/>\n <br/>\nI sort of had the same situation but with ejb&#39;s. I could reference my ejb&#39;s methods because they were abstract. So, I constructed a Delegate that was created from the ejb. I then created a JUnit test off of my Delegate. The JUnit test referenced my delegate and my delegate reference the ejb. <br/>\n <br/>\nThis sort of scenario may serve your purpose.<br/>\n <br/>\nMichael Orozco<br/>\n<br/>\nJonathan Oddy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:j.oddy@...\">j.oddy@...</a>&gt; wrote:<br/>\nDear All,<br/>\n<br/>\nI am writing a struts-based web application (not really relevent for this<br/>\ndiscussion however...).  I have a number of implementations of Action (used<br/>\nto service incoming Http requests).  My action classes collaborate with a<br/>\nnumber of other classes (data access, business and so forth) and I would<br/>\nlike to unit test my Action classes.  However they really only have one<br/>\npublic method of interest - the Action.execute, and this is I believe,<br/>\ncurrently, far to complex for sensible unit testing, what I really want is<br/>\nto test some of the collaborations (parts of the whole).  <br/>\n<br/>\nObviously I can (and have) refactored Action.execute and this has resulted<br/>\nin a number of protected and private methods.  But unit testing seems be<br/>\naimed at public interface testing, which my newly refactored methods do not<br/>\ncome under this description.  I am not keen to promote these methods to<br/>\npublic visibility because they are not part of the behavioural interface.<br/>\nMy current thought (but I am not happy with this) is to do the following:<br/>\nsubclass my target testing class and provide a number of public methods that<br/>\nsimply forward to the appropriate underlying protected method(s) and<br/>\nrecording their results (to be tested by Junit asserts).  This works but<br/>\nleaves me with the overhead of having to &quot;maintain&quot; my target subclass along<br/>\nwith the rest of my application.  Things are compounded somewhat by the fact<br/>\nthat I am also having to mock a fair number of objects in order to make my<br/>\naction class as independent as possible.<br/>\n<br/>\nHas anyone else come across a similar problem and if so how did you solve<br/>\nit?  I am still a relative newbie to unit testing (and very much a newbie)<br/>\nto testing complex interactions so any help/thoughts greatly appreciated.<br/>\n<br/>\nTIA<br/>\n<br/>\nJonathan<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nSBC Yahoo! DSL - Now only $29.95 per month!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 8424, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1056130152", 
    "canDelete": false, 
    "nextInTopic": 8426, 
    "prevInTopic": 8413, 
    "headers": {
        "inReplyToHeader": "PEU1Qzc5MDQ5RDQ2MUQzMTFCODMxMDAwNjI5NTBCNTRBMDEyN0MxNzRAbnQtc3RvYy0wLnNicz4=", 
        "messageIdInHeader": "PDIwMDMwNjIwMTcyOTEyLjc3Mzk3LnFtYWlsQHdlYjQwNzA5Lm1haWwueWFob28uY29tPg=="
    }
}