{
    "numMessagesInTopic": 16, 
    "nextInTime": 8431, 
    "senderId": "iDg4mvU_eAMGIo-d2k07rHLdZNNyYj3ntf6N_Ja_a82_Y62D0ac_YrFr8-CXeaNYPLqIEp6Agi6F7-NjAFspfnAW6bFYX3HtVrYEosfErg", 
    "systemMessage": false, 
    "subject": "RE: [junit] Re: Fork each test method?", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "...  ... Most of the time, though, we (TDD practitioners I know and I) don t want a brand new runtime for each test. Perhaps this points to a", 
    "msgId": 8430, 
    "profile": "nails762", 
    "topicId": 8358, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-1206589580\"><blockquote><span title=\"ireply\">&gt;So said Robert DiFalco on 2003-06-17 --------------------<br/>\n </span></blockquote>&lt;snip /&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;My issue is exposing much<br/>\n&gt;of the state of the object called Runtime to reset it&#39;s state when what<br/>\n&gt;you really want to do is just create a new object that hides it&#39;s<br/>\n&gt;details of initialization. To me, this is why a unit testing framework<br/>\n&gt;should run each test in a new runtime. <br/>\n<br/>\n </span></blockquote>Most of the time, though, we (TDD practitioners I know and I) don&#39;t want a brand new runtime for each test. Perhaps this points to a difference in design philosophy between you and us.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Otherwise, we have to break<br/>\n&gt;contracts or create (to me) overly complicated code to violate the state<br/>\n&gt;of the object, and arbitrarily reset it from an external client.<br/>\n&gt;<br/>\n&gt;Basically, I agree with everything you said. But maybe not this part:<br/>\n&gt;<br/>\n&gt;class Something<br/>\n&gt;    Something()<br/>\n&gt;        this(ClassRegistry.identify(Foo.class))<br/>\n&gt;<br/>\n&gt;    Something(identity)<br/>\n&gt;        // store in instance-level variable<br/>\n&gt;<br/>\n&gt;I suppose it really depends on Something. Is this meta-state or is it<br/>\n&gt;instance state? In my example, it was a static because this is a detail<br/>\n&gt;of Something that is shared across all it&#39;s instances. Now, if we had<br/>\n&gt;real MetaClasses in Java we might do something different -- say, create<br/>\n&gt;a SomethingClass that IS designed as you propose. In this case, however,<br/>\n&gt;initializing the class initializes the Identity that is to be used by<br/>\n&gt;all instances of Something.<br/>\n<br/>\n </span></blockquote>I think it&#39;s better to discuss this in the context of Something&#39;s public interface, because it could well be that testing Something is *not* complicated by the way it establishes its Identity. If it is so complicated, then I think it&#39;s a good idea to separate establishing Identity from using Identity. I can test the &quot;using Identity&quot; part very easily and I can test the &quot;establishing Identity&quot; part very easily, but I prefer not to test using Identity by assuming the particular Identity implementation that the object uses. If I do that, my tests are too tightly-coupled to the production system, which makes them brittle.<br/>\n<br/>\nI could see extracting the &quot;uses Identity&quot; part of Something, then having Something wrap that other class. Then we get the best of both worlds: Something still establishes its Identity at the class level, but it&#39;s also easier to test.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;So, I suppose where we differ is that I think a fresh Runtime instance<br/>\n&gt;should be achieved &quot;the same way each time&quot; -- through creation. I feel<br/>\n&gt;I am introducing the possibility for a bug by allowing methods that<br/>\n&gt;reset state that only exist for testing. I could be wrong, but I believe<br/>\n&gt;you are saying systems should be design so that one can reset it&#39;s state<br/>\n&gt;through some external actor at any time.<br/>\n<br/>\n </span></blockquote>By extracting part of Something, then testing *that* as a user of Identity, we eliminate the bug you mean, as there is no need to reset the Runtime state of Something.<br/>\n<br/>\nI&#39;m not specifically saying that systems should be designed so that one can reset state at any time; but I *am* saying that a system that puts together self-contained (cohesive) objects in a manner that allows for substituting implementations at runtime tends to be easier to test, to maintain, to debug and to extend/change. I do not believe it coincidental that those are the attributes of a system that is easy to test.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;And I agree that testing is very important, which is why I would like a<br/>\n&gt;new runtime for each test method, even though that would slow down the<br/>\n&gt;execution of tests. It&#39;s just that important to me to have a unit<br/>\n&gt;testing framework with no side-effects between test methods.<br/>\n<br/>\n </span></blockquote>It would slow down the execution of tests to the point where I would run them much less often, and that has disastrous consequences on my project plan.<br/>\n<br/>\n<br/>\nJ. B. Rainsberger,<br/>\nPresident, Diaspar Software Services<br/>\nLet&#39;s write software that people understand.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com/\">http://www.diasparsoftware.com/</a><br/>\ntelephone: +1 416 791-8603</div>", 
    "prevInTime": 8429, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1056138889", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 8380, 
    "headers": {
        "inReplyToHeader": "PENGRERFQjNCODcwRUUzNDZCQjU4M0QyQjA0MjBGNUFDMDEwMUU4NTlAc2VhYmFzcy50cmlwd2lyZS5jb20+", 
        "messageIdInHeader": "PDIwMDMwNjIwMTU1NDQ5MDkzOC4wMEYxQjkwMkBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "referencesHeader": "PENGRERFQjNCODcwRUUzNDZCQjU4M0QyQjA0MjBGNUFDMDEwMUU4NTlAc2VhYmFzcy50cmlwd2lyZS5jb20+"
    }
}