{
    "numMessagesInTopic": 19, 
    "nextInTime": 8447, 
    "senderId": "XWrXW0zejGKsCjTz9dfuj0KRTjLe0zvdbX1TBfcEjVxRqU8vLEeYdB5A-3khk0EL8LoNO2RZ7rIc7mQlGxDPqVZ2_jZhebpnXJGkaAjJtw", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Unit Testing vs Integration Testing", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... Google Learning Tests . In short, the idea is to formalize how you think the third-party API behaves in tests, then using that information with confidence", 
    "msgId": 8446, 
    "profile": "nails762", 
    "topicId": 8414, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-553894216\"><blockquote><span title=\"ireply\">&gt;So said Mike Bresnahan on 2003-06-20 --------------------<br/>\n&gt;A problem that I am very often faced with is writing some code that<br/>\n&gt;interacts with a 3rd party API which I am unfamiliar with.  In these cases<br/>\n&gt;it seems counter productive to create unit tests for my own code when I<br/>\n&gt;have<br/>\n&gt;no idea whether my code will actually work when used with the 3rd party<br/>\n&gt;API.<br/>\n&gt;I could end up wasting a lot time writing and testing code that is designed<br/>\n&gt;incorrectly.  In these cases, it seems more sensical to me to write<br/>\n&gt;integration tests which involve both my code and the 3rd party API.  How do<br/>\n&gt;people more familiar with unit testing handle such situations?<br/>\n<br/>\n </span></blockquote>Google &quot;Learning Tests&quot;.<br/>\n<br/>\nIn short, the idea is to formalize how you think the third-party API behaves in tests, then using that information with confidence to write your own objects. It&#39;s not something that one strictly follows, necessarily, but there is one definite advantage to writing Learning Tests.<br/>\n<br/>\nWhen I worked at IBM, my component used third-party software from HNC Software. I would typically test my code using my knowledge of how HNC&#39;s software works. Of course, my knowledge was imperfect, and occasionally the whole would not work even though the parts did. (Here I use &quot;work&quot; to mean &quot;behave as expected&quot;.) Obviously some expectation of mine was incorrect, so I began writing Learning Tests against HNC&#39;s product, which both verified my assumptions and codified them for the next poor sap who has to maintain my software. In the process, I wrote a failing test, which I shipped to HNC and which they used to fix the problem within two days. <br/>\n<br/>\nThe key here is that I gave them a failing test, rather than a vague description of the problem. That eliminated the cost figuring out just what I meant by &quot;Blah blah blah doesn&#39;t do fizzlefazzle.&quot; They commented that having the failing test allowed them to fix the problem in an hour and that the two-day turnaround was the result of their laborious release process.<br/>\n<br/>\nSo Learning Tests gave me a few things:<br/>\n<br/>\n* An unambiguous specification of the assumptions that underlie my code<br/>\n* A way to verify my assumptions against the product I&#39;m using<br/>\n* An unambiguous way to communicate problems to the company providing the software to me<br/>\n<br/>\nBased on that, I considered the technique a winner.<br/>\n<br/>\n<br/>\nJ. B. Rainsberger,<br/>\nPresident, Diaspar Software Services<br/>\nLet&#39;s write software that people understand.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com/\">http://www.diasparsoftware.com/</a><br/>\ntelephone: +1 416 791-8603</div>", 
    "prevInTime": 8445, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1056217901", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 8443, 
    "headers": {
        "inReplyToHeader": "PGJkMDFvMyRxczAkMUBtYWluLmdtYW5lLm9yZz4=", 
        "messageIdInHeader": "PDIwMDMwNjIxMTM1MTQxMDE2My4wMDM1NkFEQkBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDRDOURFMzdBQTFDNDM5NEU5NTMzRDdDRTg1RTBFN0I2MDJGRDIwQGNpdGF0aW9uLmNoYXJsc29uLmxvY2FsPiA8YmQwMW8zJHFzMCQxQG1haW4uZ21hbmUub3JnPg=="
    }
}