{
    "numMessagesInTopic": 1, 
    "nextInTime": 8475, 
    "senderId": "5MS1EfQ9CxnYGGuNyjEJU0EzXmJLQ65EukeAEo3z1dM82H-ZJMw1P256gWdCddxVEMvX9JznKvkOMAHYiGDGTnUcKycfuw", 
    "systemMessage": false, 
    "subject": "Junit/Jxunit network simulator", 
    "from": "&quot;syng0012&quot; &lt;syng0012@...&gt;", 
    "authorName": "syng0012", 
    "msgSnippet": "I am interested in using Junit and JXunit to create a network simulator. Being rather new to both Junit and JXunit I am not sure if this makes sense. I", 
    "msgId": 8474, 
    "profile": "syng0012", 
    "topicId": 8474, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 151704797, 
    "messageBody": "<div id=\"ygrps-yiv-520899175\">I am interested in using Junit and JXunit to create a network <br/>\nsimulator. Being rather new to both Junit and JXunit I am not sure if <br/>\nthis makes sense. I understand JUnit is used for unit testing but I <br/>\nwas wondering If I could use it along with JXunit in creating a <br/>\nsimulator.<br/>\n<br/>\nMy JUnit TC would interface with my api and allow me to enroll <br/>\nNetwork elements into my application. I would create my test case <br/>\nwith a loop to enroll x number of Network elements. JXunit would be <br/>\nused to contain the data necessary to call my api. ie Number of NE&#39;s <br/>\nto enroll as well Network Element attributes.<br/>\n<br/>\nDoes it make sense to use Junit and JXunit.<br/>\n<br/>\nI also want to raise alarms on my simulated NE&#39;s. But performance is <br/>\na concern. I would want my Alarm raising test case to be able to call <br/>\nmy API and raise alarms at a rate of 500 alarms per sec. Any idea how <br/>\nJunit and JXunit would handle this type of load.</div>", 
    "prevInTime": 8473, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1056478475", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGJkYTRlYitlNzc4QGVHcm91cHMuY29tPg=="
    }
}