{
    "numMessagesInTopic": 20, 
    "nextInTime": 8480, 
    "senderId": "0ybjkC6QYNGrB4_WCyT5fjOtW5NK8jcWdL3lBSOpfKb6i578fUrOLqsaay8vuVAimhjEgA-eVnFsjSAWsVGo18_xXlY", 
    "systemMessage": false, 
    "subject": "Re: testXXXX must return void?", 
    "from": "&quot;areider&quot; &lt;areider@...&gt;", 
    "authorName": "areider", 
    "msgSnippet": "... pass) is JUnit s job, not the tester s -- that s why it is an automated test. I think we are coming from different places. Maybe its my Smalltalk ", 
    "msgId": 8479, 
    "profile": "areider", 
    "topicId": 8456, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 64767473, 
    "messageBody": "<div id=\"ygrps-yiv-1728937393\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, Robert Wenner &lt;robert@p...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I am not sure if I got you right here.<br/>\n&gt; Why do you use that inspector? To /manually/ verify the /automated/ <br/>\n&gt; test did not fail? Collecting test results (whether tests fail or <br/>\n </span></blockquote>pass) is JUnit&#39;s job, not the tester&#39;s -- that&#39;s why it is an <br/>\nautomated test.  <br/>\n<br/>\nI think we are coming from different places. Maybe its my Smalltalk <br/>\nbackground. I dont want to get too OT but maybe a specific example <br/>\nwill help. I&#39;m now in early development of a mapping a business <br/>\nobject model in TOPLink. I want to evaluate expressions which read my <br/>\nobjects from the db to test my mappings. If that doesnt blow up (and <br/>\nit does, a LOT, right now), I want to play around with that instance <br/>\nin an inspector, send messages to it, fix the toString(), test lazy <br/>\ninstantiation of its parts, add some behavior, debug, etc, all in the <br/>\ncontext of a live instance. In short I want to _interact_ with the <br/>\nobject.<br/>\n<br/>\nHowever since I am going to the trouble to create this test code <br/>\nwhich produces those objects, I would like to institutionalize those <br/>\nsnippets into a test suite so I and other team members can reuse them <br/>\neasily in the same manner. That&#39;s why I dont want the code in a <br/>\nscrapbook window. I&#39;m less interested in the automated test aspect <br/>\nright now. <br/>\n<br/>\nFor other projects I have worked differently. For example, <br/>\nI built a Java parser and all I needed were automated tests <br/>\n(thousands of them). I didnt have to interact with any objects. I <br/>\nusually just asserted that the parsetree toString() looked like the <br/>\nsource string (actually this happened to be in Smalltalk with sUnit). <br/>\nSo I am familiar with that way of working as well.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t understand what you mean by cataloging.<br/>\n<br/>\n </span></blockquote>I mean I want to elevate my test artifacts from workspacewindow <br/>\nsnippets to code which is managed by the version control system (Envy <br/>\netc), available to team members, etc. And yes for automated testing <br/>\neventually. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Neither do I understand what bothers you about having tests in the <br/>\n&gt; development workspace. After all, tests belong to the development?<br/>\n<br/>\n </span></blockquote>I hope I clarified this above and also the premise that one might not <br/>\nonly or even primarily be interested in the automation aspect of <br/>\njunit for a given situation.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s in src.jar in the JUnit directory.<br/>\n<br/>\n </span></blockquote>Thanks very much.</div>", 
    "prevInTime": 8478, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1056481021", 
    "canDelete": false, 
    "nextInTopic": 8481, 
    "prevInTopic": 8475, 
    "headers": {
        "inReplyToHeader": "PDIwMDMwNjI0MTQxNi5oNU9FR2tBMjE4MDRAam9rZXIucG9ydDI1LmNvbT4=", 
        "messageIdInHeader": "PGJkYTZ0dCs0NW9lQGVHcm91cHMuY29tPg=="
    }
}