{
    "numMessagesInTopic": 20, 
    "nextInTime": 8536, 
    "senderId": "pI-Fqtw3EZPu575kr3M-tnWp7dlHYhlCovHHOmTV0m98o70UI4JMxghFk9K8O7WbwVYEp2wbu-WvtAXUqi8cb4yPFdc0RFcr2ic9gd6S5Q", 
    "systemMessage": false, 
    "subject": "RE: [junit] Testing super-class contracts (test case reuse)", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... [JBR] ... [JLT] ... If you have tried both ways and encountered this problem, then great; otherwise, I suggest you resist the temptation to keep the", 
    "msgId": 8535, 
    "profile": "nails762", 
    "topicId": 8411, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-1392290986\"><blockquote><span title=\"ireply\">&gt;So said Tharp, Joshua L, SOLGV on 2003-06-30 --------------------<br/>\n<br/>\n </span></blockquote>[JBR]<br/>\n<blockquote><span title=\"ireply\"> &gt;I don&#39;t understand why this is a problem. If your class implements three<br/>\n&gt;interfaces, then you have three test cases for that class, each a<br/>\n&gt;subclass of the corresponding abstract test for each interface. Run them<br/>\n&gt;all. No law says you must have one test case per production class, and<br/>\n&gt;in fact, you probably shouldn&#39;t!<br/>\n&gt;<br/>\n&gt;<br/>\n </span></blockquote>[JLT]<br/>\n<blockquote><span title=\"ireply\"> &gt;It&#39;s a simple matter of keeping the test tree as understandable as the<br/>\n&gt;source it is testing.<br/>\n<br/>\n </span></blockquote>If you have tried both ways and encountered this problem, then great; otherwise, I suggest you resist the temptation to &quot;keep the source simple&quot; at the cost of doing what you need to do. xUnit users often make their test fixtures too complex because they want to adhere to &quot;one test class per production class&quot;. The complex fixture with 50 tests is more difficult to navigate than five tests with simple fixtures and 10 tests each. This is my experience.<br/>\n<br/>\nFor the book I&#39;m working on, I have the following three test fixtures for testing Java&#39;s Collection interface.<br/>\n<br/>\n* BagTest<br/>\n* EmptyBagTest<br/>\n* HelloTwiceBagTest<br/>\n<br/>\nOther than the somewhat obscure &quot;hello twice bag&quot; (a bag with the object &quot;hello&quot; in it twice), I think this is pretty easy to read. Do you find anything in those names that makes it difficult to understand what&#39;s tested where? The alternative is a bunch of test methods like:<br/>\n<br/>\n* testEmpty_Empty<br/>\n* testEmpty_HelloTwice<br/>\n* testEmpty<br/>\n<br/>\nA group of these per behavior to test. Such duplication is truly unnecessary and having multiple test fixtures is just as easy (if not easier) to read and understand.<br/>\n<br/>\nUnderstand that I&#39;m talking about the fear I sense you have about making the test code complex, and not attacking you or your ideas. The way I see it: either way, it&#39;s complex; but I think having many fixtures is less complex than one big monolithic fixture. If you favor cohesive production classes (and probably you do), then why not cohesive test fixtures?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If there are too many test classes testing a<br/>\n&gt;single source class, it become difficult to look at a package for the<br/>\n&gt;first time and understand what is going on.<br/>\n<br/>\n </span></blockquote>It may become difficult, but not if the tests are well named. The same is true for any code: complex code with bad names is difficult to read; complex code with good names is often not-that-difficult to read. Since the complexity is there either way, why not go down the path that allows the best names?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The link that Paolo sent on<br/>\n&gt;an earlier post has a link showing the use of inner classes to organize<br/>\n&gt;the abstract test cases. The benefit is that I can enter a package, look<br/>\n&gt;for a single class WidgetTest.java and be able to track back all of the<br/>\n&gt;tests associated with Widget.java.<br/>\n<br/>\n </span></blockquote>Agreed, and so using nested classes for related fixtures is not a bad idea at all. I just don&#39;t think that it&#39;s necessarily any clearer: it&#39;s just all in one file rather than in three.<br/>\n<br/>\n[JLT]<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Also, only some objects implement the equals method. These<br/>\n&gt;&gt;I have a standard set of tests to ensure that null and a few other<br/>\n&gt;&gt;scenarios are handled correctly (as well as the hashcode / equals<br/>\n&gt;&gt;relationship). I would like to have these standard tests available for<br/>\n&gt;&gt;different objects without having to rewrite them all the time.<br/>\n&gt;<br/>\n </span></blockquote>[JBR]<br/>\n<blockquote><span title=\"ireply\"> &gt;GSBase&#39;s EqualsTester for testing equals(). JUnit-addons also has<br/>\n&gt;something, but I can&#39;t remember the name of it.<br/>\n&gt;<br/>\n </span></blockquote>[JLT]<br/>\n<blockquote><span title=\"ireply\"> &gt;Thanks, I&#39;ll check it out.<br/>\n<br/>\n </span></blockquote>Enjoy. There is talk of GSBase&#39;s testing utilities merging with JUnit-addons. That would be nice. :)<br/>\n<br/>\nTake care.<br/>\n<br/>\nJ. B. Rainsberger,<br/>\nPresident, Diaspar Software Services<br/>\nLet&#39;s write software that people understand.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com/\">http://www.diasparsoftware.com/</a><br/>\ntelephone: +1 416 791-8603</div>", 
    "prevInTime": 8534, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1056995992", 
    "canDelete": false, 
    "nextInTopic": 8540, 
    "prevInTopic": 8534, 
    "headers": {
        "inReplyToHeader": "PDEyNkM3N0QzOTkzREM2NDBCOEM5MDEyRDU0QTNDNDYwMDUwNjA3MDRAQUNDTFVTVDAyRVZTMS51Z2QuYXR0LmNvbT4=", 
        "messageIdInHeader": "PDIwMDMwNjMwMTM1OTUyMDAyMi4wMDYyODE1MEBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDEyNkM3N0QzOTkzREM2NDBCOEM5MDEyRDU0QTNDNDYwMDUwNjA3MDRAQUNDTFVTVDAyRVZTMS51Z2QuYXR0LmNvbT4="
    }
}