{
    "numMessagesInTopic": 20, 
    "nextInTime": 8541, 
    "senderId": "jNTGtdtn3V-b3Yp8IoAtSNhOQjptcOQHB8Zum9RXfJQsSe75tFe4JKpwquRHkR9v_jALz0ap8BtXvfIsRBi5bQ8VrtGetrLVB2LmMSE5YwaX", 
    "systemMessage": false, 
    "subject": "RE: [junit] Testing super-class contracts (test case reuse)", 
    "from": "&quot;Tharp, Joshua L, SOLGV&quot; &lt;jltharp@...&gt;", 
    "authorName": "Tharp, Joshua L, SOLGV", 
    "msgSnippet": "[JBR] ...Agreed, and so using nested classes for related fixtures is not a bad idea at all. I just don t think that it s necessarily any clearer: it s just all", 
    "msgId": 8540, 
    "profile": "joshua_tharp", 
    "topicId": 8411, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 151236639, 
    "messageBody": "<div id=\"ygrps-yiv-1970385074\">[JBR]<br/>\n...Agreed, and so using nested classes for related fixtures is not a bad<br/>\nidea at all. I just don&#39;t think that it&#39;s necessarily any clearer: it&#39;s<br/>\njust all in one file rather than in three.<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\nYour points are good, but they seem to boil down to having several<br/>\ndifferent classes with good names and all will be right with the world.<br/>\nWhile that may be true, the problem I have is more at the package scope.<br/>\nWhen looking at a directory, how do you know where to start looking? The<br/>\nreason I like the inner classes is that you can set up a test suite of<br/>\nsorts in an obviously named class. With those inner classes, you can<br/>\nstill have several test files that support that main one, but if you are<br/>\nentering a directory to investigate someone else&#39;s testing strategy,<br/>\nthen having a well-defined starting point is a great help. Don&#39;t get me<br/>\nwrong, you can still use several different files, so long as they are<br/>\nreferenced from within an obviously named one. Using your Bag examples,<br/>\nI would say that the BagTest should refer to the other two, and possibly<br/>\na third that actually has the run-of-the-mill type tests. That way, when<br/>\nentering a directory with tests for 20 or more classes (look at<br/>\njava.util for example), I could find BagTest.java quickly and from there<br/>\ndiscover the other test classes that are directly applicable.<br/>\n<br/>\n <br/>\n<br/>\nGranted, this is all beginning to sound like the student teaching the<br/>\nteacher, but while I lack some JUnit experience, the software<br/>\nengineering experience is there. One of the hardest things about<br/>\napproaching a body of source code (production or test) is figuring out<br/>\nwhere to start. To that end, it seems having a single, well-named<br/>\nstarting point makes great strides.<br/>\n<br/>\n <br/>\n<br/>\nJosh<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 8539, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1057008000", 
    "canDelete": false, 
    "nextInTopic": 8547, 
    "prevInTopic": 8535, 
    "headers": {
        "messageIdInHeader": "PDEyNkM3N0QzOTkzREM2NDBCOEM5MDEyRDU0QTNDNDYwMDUwNzlBMjBAQUNDTFVTVDAyRVZTMS51Z2QuYXR0LmNvbT4="
    }
}