{
    "numMessagesInTopic": 20, 
    "nextInTime": 8552, 
    "senderId": "P3c54OdS8BB8jap5PhDg8Ulh4V_Zm4tifiMemHRdwFzjBHZC82FV84z55VP7Q83ukitse3wzaQDrgQthoy4R1rM1I1KtvFnxfTb2GVdfeA", 
    "systemMessage": false, 
    "subject": "RE: [junit] Testing super-class contracts (test case reuse)", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... The names of the classes make that obvious. Returning to my example, if I want to see how Bag works, I look for anything that has BagTest in the name.", 
    "msgId": 8551, 
    "profile": "nails762", 
    "topicId": 8411, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-1118128633\"><blockquote><span title=\"ireply\">&gt;So said Tharp, Joshua L, SOLGV on 2003-06-30 --------------------<br/>\n&gt;[JBR]<br/>\n&gt;....Agreed, and so using nested classes for related fixtures is not a bad<br/>\n&gt;idea at all. I just don&#39;t think that it&#39;s necessarily any clearer: it&#39;s<br/>\n&gt;just all in one file rather than in three.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;Your points are good, but they seem to boil down to having several<br/>\n&gt;different classes with good names and all will be right with the world.<br/>\n&gt;While that may be true, the problem I have is more at the package scope.<br/>\n&gt;When looking at a directory, how do you know where to start looking? <br/>\n<br/>\n </span></blockquote>The names of the classes make that obvious. Returning to my example, if I want to see how Bag works, I look for anything that has &quot;BagTest&quot; in the name. The fact that there may be four classes matches those criteria shouldn&#39;t be a big problem.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;The<br/>\n&gt;reason I like the inner classes is that you can set up a test suite of<br/>\n&gt;sorts in an obviously named class. With those inner classes, you can<br/>\n&gt;still have several test files that support that main one, but if you are<br/>\n&gt;entering a directory to investigate someone else&#39;s testing strategy,<br/>\n&gt;then having a well-defined starting point is a great help. Don&#39;t get me<br/>\n&gt;wrong, you can still use several different files, so long as they are<br/>\n&gt;referenced from within an obviously named one. Using your Bag examples,<br/>\n&gt;I would say that the BagTest should refer to the other two, and possibly<br/>\n&gt;a third that actually has the run-of-the-mill type tests. That way, when<br/>\n&gt;entering a directory with tests for 20 or more classes (look at<br/>\n&gt;java.util for example), I could find BagTest.java quickly and from there<br/>\n&gt;discover the other test classes that are directly applicable.<br/>\n<br/>\n </span></blockquote>Some projects have used a different approach. They manage test suites manually. What you have called &quot;BagTest&quot; would be &quot;BagSuite&quot; for them, and in BagSuite you would find a hand-built test suite that refers to all the classes that contain tests for a Bag. BagSuite would refer to EmptyBagTest, HelloTwiceBagTest and OneItemBagTest, for example. This way you know immediately to look at BagSuite to find all the bag tests.<br/>\n<br/>\nWhen you open it, though, BagSuite does nothing more than say &quot;see EmptyBagTest, HelloTwiceBagTest and OneItemBagTest for details.&quot; I claim that seeing the three Java source files all named *BagTest.java does the same work without the extra source file.<br/>\n<br/>\nAs for a well-defined starting point, the set of test files *BagTest.java *is* a well-defined, obviously-named starting point. It is perhaps slightly less obvious than opening &quot;BagTest.java&quot;, but not so much that it poses a problem. If someone wants to write &quot;BagTest.java&quot;, then that&#39;s cool with me, but I wouldn&#39;t do it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Granted, this is all beginning to sound like the student teaching the<br/>\n&gt;teacher, but while I lack some JUnit experience, the software<br/>\n&gt;engineering experience is there. One of the hardest things about<br/>\n&gt;approaching a body of source code (production or test) is figuring out<br/>\n&gt;where to start. To that end, it seems having a single, well-named<br/>\n&gt;starting point makes great strides.<br/>\n<br/>\n </span></blockquote>It does. Another technique is talking to people: a close-knit team will agree to standards and uphold them, obviating the need for documentation masquerading as code. Another technique is a drawing on the wall, or a list on the corkboard.<br/>\n<br/>\nI have a general aversion to code that does nothing more than document something. That&#39;s why we have documentation. Code should be self-documenting, but it should also do something useful at runtime.<br/>\n<br/>\nAnd keep in mind: we&#39;ll all teachers and students here.<br/>\n<br/>\nTake care.<br/>\n<br/>\n[Conclusion: I don&#39;t think what you&#39;re doing is bad; but I wouldn&#39;t do it myself, because I would solve the same problem a different way.]<br/>\n<br/>\nJ. B. Rainsberger,<br/>\nPresident, Diaspar Software Services<br/>\nLet&#39;s write software that people understand.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com/\">http://www.diasparsoftware.com/</a><br/>\ntelephone: +1 416 791-8603</div>", 
    "prevInTime": 8550, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1057182861", 
    "canDelete": false, 
    "nextInTopic": 8554, 
    "prevInTopic": 8547, 
    "headers": {
        "inReplyToHeader": "PDEyNkM3N0QzOTkzREM2NDBCOEM5MDEyRDU0QTNDNDYwMDUwNzlBMjBAQUNDTFVTVDAyRVZTMS51Z2QuYXR0LmNvbT4=", 
        "messageIdInHeader": "PDIwMDMwNzAyMTc1NDIxMDc5Mi4wQjg1RTcwNkBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDEyNkM3N0QzOTkzREM2NDBCOEM5MDEyRDU0QTNDNDYwMDUwNzlBMjBAQUNDTFVTVDAyRVZTMS51Z2QuYXR0LmNvbT4="
    }
}