{
    "numMessagesInTopic": 31, 
    "nextInTime": 8582, 
    "senderId": "O0CdqnlThND3oTC8TkmR_eD5ksj-KsxWv7fhVigt7qytZxLAPEV8vsvEgxwcqdyVfelS5HhqeikB_s13llTNVCoK9pIBVDzq6ETQIcw", 
    "systemMessage": false, 
    "subject": "RE: [junit] Unit test java documentation", 
    "from": "&quot;Chip Dunning&quot; &lt;cdunning@...&gt;", 
    "authorName": "Chip Dunning", 
    "msgSnippet": "... [snip] ... I would agree that useless documentation is worse than clear code, but then useless documentation is probably worse than messy code (as long as", 
    "msgId": 8581, 
    "profile": "chipdunning", 
    "topicId": 8537, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 146967878, 
    "messageBody": "<div id=\"ygrps-yiv-356985961\"><blockquote><span title=\"ireply\">&gt; -----Original Message-----<br/>\n&gt; From: J. B. Rainsberger [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jbrains@...\">jbrains@...</a>]<br/>\n&gt; Sent: Thursday, July 03, 2003 11:29 AM<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\n&gt; Subject: Re: [junit] Unit test java documentation<br/>\n </span></blockquote>[snip]<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; A top time-waster on software projects is writing useless <br/>\n&gt; documentation instead of clear code.<br/>\n<br/>\n </span></blockquote>I would agree that useless documentation is worse than clear code, but then useless documentation is probably worse than messy code (as long as the code at least works). However, I disagree with the statement - unless you got something other than your own experience to back that statement up with.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; PS: Yes, I&#39;ve worked on a project where no external <br/>\n&gt; documentation was required. When a new employee came on board <br/>\n&gt; and began working with the code, he said, &quot;This code is so <br/>\n&gt; easy to read, I already understand what&#39;s going on.&quot; Since I <br/>\n&gt; also benefited from the easy-to-read code while I was <br/>\n&gt; building the system, the effort I put into making the code <br/>\n&gt; self-documenting was well worth it. In other words, if the <br/>\n&gt; code tells the story, then that is often enough.<br/>\n<br/>\n </span></blockquote>This paragraph I really disagree with. I have walked into far too many shops where the programmers produced code that they thought was easy to read, but in fact wasn&#39;t. Just because it is &quot;clear code&quot; to you and possibly your team - doesn&#39;t mean that it will be looked upon as &quot;clear code&quot; by the people that follow you.<br/>\n\tFrankly having a new employee walk in the door and comment how &quot;easy the code is too read&quot; isn&#39;t that amazing or even points to the fact that the code is in fact easy to read. He they know you favor &quot;easy to ready code&quot; they might have been just saying that to get a positive response or to push up their own capabilities in your eyes. Sure, your code could in fact be the most readable code in existence, but a new employee pushing a positive response is not a good indicator - its simply human nature.<br/>\n<br/>\n<br/>\n<br/>\nChip<br/>\n-----<br/>\nProgramming: Its not just a job - its an indenture</div>", 
    "prevInTime": 8580, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1057249637", 
    "canDelete": false, 
    "nextInTopic": 8582, 
    "prevInTopic": 8580, 
    "headers": {
        "messageIdInHeader": "PDRDOURFMzdBQTFDNDM5NEU5NTMzRDdDRTg1RTBFN0I2MDRGRjFBQGNpdGF0aW9uLmNoYXJsc29uLmxvY2FsPg=="
    }
}