{
    "numMessagesInTopic": 31, 
    "nextInTime": 8584, 
    "senderId": "pyGQ2pjbq_ZWmHCfsfgAvMy4d4-XOx3PUth2MDDz2q1V7c-qBAw1Vw2c2ndpCsGUlmh_cQmyyry-Xu1i0CNx5T_jOd2FCaddXhDZLFLckA", 
    "systemMessage": false, 
    "subject": "RE: [junit] Unit test java documentation", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... You disagree with what part: that it s a time waster or that it s a top time waster ? As for something other than your own experience to back that", 
    "msgId": 8583, 
    "profile": "nails762", 
    "topicId": 8537, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-617177670\"><blockquote><span title=\"ireply\">&gt;So said Chip Dunning on 2003-07-03 --------------------<br/>\n&gt;&gt; -----Original Message-----<br/>\n&gt;&gt; From: J. B. Rainsberger [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jbrains@...\">jbrains@...</a>]<br/>\n&gt;&gt; Sent: Thursday, July 03, 2003 11:29 AM<br/>\n&gt;&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\n&gt;&gt; Subject: Re: [junit] Unit test java documentation<br/>\n&gt;[snip]<br/>\n&gt;&gt; <br/>\n&gt;&gt; A top time-waster on software projects is writing useless <br/>\n&gt;&gt; documentation instead of clear code.<br/>\n&gt;<br/>\n&gt;I would agree that useless documentation is worse than clear code, but<br/>\n&gt;then useless documentation is probably worse than messy code (as long as<br/>\n&gt;the code at least works). However, I disagree with the statement - unless<br/>\n&gt;you got something other than your own experience to back that statement up<br/>\n&gt;with.<br/>\n<br/>\n </span></blockquote>You disagree with what part: that it&#39;s a time waster or that it&#39;s a &quot;top time waster&quot;?<br/>\n<br/>\nAs for &quot;something other than your own experience to back that statement up with&quot;, what on Earth is more important than one&#39;s experience?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; PS: Yes, I&#39;ve worked on a project where no external <br/>\n&gt;&gt; documentation was required. When a new employee came on board <br/>\n&gt;&gt; and began working with the code, he said, &quot;This code is so <br/>\n&gt;&gt; easy to read, I already understand what&#39;s going on.&quot; Since I <br/>\n&gt;&gt; also benefited from the easy-to-read code while I was <br/>\n&gt;&gt; building the system, the effort I put into making the code <br/>\n&gt;&gt; self-documenting was well worth it. In other words, if the <br/>\n&gt;&gt; code tells the story, then that is often enough.<br/>\n&gt;<br/>\n&gt;This paragraph I really disagree with.<br/>\n<br/>\n </span></blockquote>Since I documented my personal experience in this paragraph, I scarcely understand how you can disagree with it. How does one &quot;disagree&quot; with experience? Is that even defined?<br/>\n<br/>\nNow if you disagree with the final statement, then do you have something other than your own experience to back that statement up with?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have walked into far too many<br/>\n&gt;shops where the programmers produced code that they thought was easy to<br/>\n&gt;read, but in fact wasn&#39;t. Just because it is &quot;clear code&quot; to you and<br/>\n&gt;possibly your team - doesn&#39;t mean that it will be looked upon as &quot;clear<br/>\n&gt;code&quot; by the people that follow you.<br/>\n<br/>\n </span></blockquote>There are certain objective measures of code clarity. You cannot possibly argue that clarity is *entirely* subjective. We can even define clarity in terms of clarity to the general population, as opposed to clarity to an individual, if you like.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;      Frankly having a new employee walk in the door and comment how &quot;easy<br/>\n&gt;the code is too read&quot; isn&#39;t that amazing or even points to the fact that<br/>\n&gt;the code is in fact easy to read. He they know you favor &quot;easy to ready<br/>\n&gt;code&quot; they might have been just saying that to get a positive response or<br/>\n&gt;to push up their own capabilities in your eyes. <br/>\n<br/>\n </span></blockquote>Obviously there is no way for me to know whether this is the case; however, I have never seen anyone make that comment -- about anyone&#39;s code -- before or since, so I cannot believe that it is a common way for new employees to suck up to the old. I have not seen programmers suck up to one another at all -- it seems like a pretty stupid thing to do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Sure, your code could in<br/>\n&gt;fact be the most readable code in existence, but a new employee pushing a<br/>\n&gt;positive response is not a good indicator - its simply human nature.<br/>\n<br/>\n </span></blockquote>You sound like you have specific experience in this direction, so nothing I can say would persuade you one way or the other. Our experiences differ.<br/>\n<br/>\n----------<br/>\n<br/>\nGetting back to the point, though, (objectively) clear code beats (redundant) documentation. I think we can agree with that. We may disagree on the likelihood of producing objectively clear code, but I think we can agree that documentation ought to supplement code, and not just explain it. Code ought to be able to explain itself. The code is the most accurate record of what the code does, after all.<br/>\n<br/>\nI simply believe that documentation should be one level of abstraction higher than code; otherwise, the reader should read the code. Of course, if the team needs documentation to fill a void, then it should build that documentation; but I wouldn&#39;t build it until that need was felt. That&#39;s all I&#39;m trying to say here.<br/>\n<br/>\nTake care.<br/>\n<br/>\n<br/>\nJ. B. Rainsberger,<br/>\nPresident, Diaspar Software Services<br/>\nLet&#39;s write software that people understand.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com/\">http://www.diasparsoftware.com/</a><br/>\ntelephone: +1 416 791-8603</div>", 
    "prevInTime": 8582, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1057256618", 
    "canDelete": false, 
    "nextInTopic": 8584, 
    "prevInTopic": 8582, 
    "headers": {
        "inReplyToHeader": "PDRDOURFMzdBQTFDNDM5NEU5NTMzRDdDRTg1RTBFN0I2MDRGRjFBQGNpdGF0aW9uLmNoYXJsc29uLmxvY2FsPg==", 
        "messageIdInHeader": "PDIwMDMwNzAzMTQyMzM4MDM3OC4wMEQ3MTY2QUBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDRDOURFMzdBQTFDNDM5NEU5NTMzRDdDRTg1RTBFN0I2MDRGRjFBQGNpdGF0aW9uLmNoYXJsc29uLmxvY2FsPg=="
    }
}