{
    "numMessagesInTopic": 1, 
    "nextInTime": 8624, 
    "senderId": "85c0kQ0YXkJFn_KZsqZVIVpNXS6kpRistSO4LR1pwwUPViuuDJcGL4OYd8TgUDywWbVjblS5qb6weXHvSlLimk79mkv0v0sXr_1HnntI", 
    "systemMessage": false, 
    "subject": "Sr. Test Automation Engineer needed", 
    "from": "&quot;kelly_martin&quot; &lt;kelly_martin@...&gt;", 
    "authorName": "kelly_martin", 
    "msgSnippet": "This is a full-time position located in the SF bay area. My client is looking for a Senior Test Automation Engineer to be responsible for developing and", 
    "msgId": 8623, 
    "profile": "kelly_martin", 
    "topicId": 8623, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 103002336, 
    "messageBody": "<div id=\"ygrps-yiv-626114235\">This is a full-time position located in the SF bay area.<br/>\n<br/>\nMy client is looking for a Senior Test Automation Engineer to be <br/>\nresponsible for developing and maintaining an automated test <br/>\ninfrastructure, and creating white box tests that run within the test <br/>\ninfrastructure. This role works closely with development engineers to <br/>\nunderstand detailed designs and effective ways to test the product <br/>\nthrough test programs written in Java. The engineer must work in a <br/>\nteam environment and deliver to aggressive schedules in a fast-paced <br/>\nsetting. As a senior engineer, the position requires the ability to <br/>\ndrive projects, mentor more junior engineers, lead design efforts, <br/>\nadvanced skills and experience in Java programming. <br/>\n <br/>\nResponsibilities<br/>\nDesign, implement, and maintain an automated test infrastructure. <br/>\nDesign test strategies using technical design specifications and <br/>\nfunctional requirements documentation. Designs must be documented in <br/>\ntest plans and test specifications. Documents must pass peer and <br/>\nmanagement review for purpose, detail, and results. <br/>\nCode tests in Java to test Java-based servers and applications. <br/>\nPlan, schedule, and execute assignments to milestones. <br/>\nInteract and communicate effectively across the engineering <br/>\norganization. <br/>\nLead projects related to improving QA processes, developing QA tools, <br/>\nand QA efforts associated with development projects. <br/>\nUse bug-tracking system to report and track defects. <br/>\nTroubleshoot problems found through testing. <br/>\nMentor junior engineers. <br/>\n <br/>\nQualifications<br/>\n5 years of industry experience in software development or QA where <br/>\n3GL programming was a requirement. <br/>\nMust have solid grasp of testing principles and process. Extreme <br/>\nProgramming principles a plus. <br/>\nStrong programming experience in Java. <br/>\nExperienced in testing and delivering enterprise-level, distributed <br/>\napplications. <br/>\nStrong written and verbal communication skills. Must have experience <br/>\nin writing clear, detailed test plans and specifications. <br/>\nHardcore troubleshooting skills. <br/>\nGood understanding of relational databases and SQL. <br/>\nKnowledge of JTest, JUnit, JProbe, LoadRunner a plus. <br/>\nA proven ability to organize and prioritize tasks and to promote <br/>\nquality throughout the software development process. <br/>\nFamiliarity with B2B software a plus. <br/>\n <br/>\n<br/>\nEducation<br/>\nB. S. in Computer Science, or equivalent work experience.</div>", 
    "prevInTime": 8622, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1057694304", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGJlZjdwMCtoNnQ3QGVHcm91cHMuY29tPg=="
    }
}