{
    "numMessagesInTopic": 3, 
    "nextInTime": 8650, 
    "senderId": "3FdbvdhVIY52Xnw89TpdtUPsTq9IQm11mvQRI5mpoOOMNN1AboabUDmSgIKu-pB9WwegqnooHeokdyBL7nv-2k05TPSPW6vQFqs", 
    "systemMessage": false, 
    "subject": "Testing asynchronous calls", 
    "from": "&quot;lukatmyshu&quot; &lt;lukatmyshu@...&gt;", 
    "authorName": "lukatmyshu", 
    "msgSnippet": "I have an API that when I call it, puts an event on a queue somewhere.  Eventually the event is passed to an EventHandler object.  I d like to test the process", 
    "msgId": 8649, 
    "profile": "lukatmyshu", 
    "topicId": 8649, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 96397293, 
    "messageBody": "<div id=\"ygrps-yiv-1410250121\">I have an API that when I call it, puts an event on a queue <br/>\nsomewhere.  Eventually the event is passed to an EventHandler <br/>\nobject.  I&#39;d like to test the process of placing an event on the <br/>\nqueue and it being handled so I have a test method that posts the <br/>\nevent, I implement my EventHandler interface and in the method that <br/>\nthe interface provides I verify the data is what I posted.  The <br/>\nproblem I am getting is that even though the assertion is thrown, the <br/>\nTest failure is not included in the TestResult object.  In addition I <br/>\npass in a PrintStream to the JUNit TestRunner but in this case, the <br/>\nerror output appears on System.out not my PrintStream.  My feeling is <br/>\nthat what&#39;s happening is that my test method posts the Event, then <br/>\nthe flow of excution passes back to the TestRunner with no exceptions <br/>\nthrown.  Later the event is caught, and if it fails the exception is <br/>\nthrown but by this time the TestResult object has already been <br/>\ncreated.  Is there a prescribed way of testing such methods?</div>", 
    "prevInTime": 8648, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1057867941", 
    "canDelete": false, 
    "nextInTopic": 8659, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGJla2hiNStzcWJoQGVHcm91cHMuY29tPg=="
    }
}