{
    "numMessagesInTopic": 106, 
    "nextInTime": 8808, 
    "senderId": "UOa4UmQtIKxuh_Ggk_hqrU2ont9prAo3jV1Hk77Z0uOurEErRcJnBjnLaZgrwzrefQEBEPTcDUa-QX6BD0bYphZxV9xXwbIU", 
    "systemMessage": false, 
    "subject": "TestCase Dependency Hierarchy", 
    "from": "&quot;Adam Jack&quot; &lt;ajack@...&gt;", 
    "authorName": "Adam Jack", 
    "msgSnippet": "Hello, I ve search the archives but I can t find a thread that pertains to the topic I d like to discuss. [I am not saying it isn t there, I just couldn t find", 
    "msgId": 8807, 
    "profile": "arb_jack", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124707332, 
    "messageBody": "<div id=\"ygrps-yiv-1595915695\">Hello,<br/>\n<br/>\nI&#39;ve search the archives but I can&#39;t find a thread that pertains to the<br/>\ntopic I&#39;d like to discuss. [I am not saying it isn&#39;t there, I just couldn&#39;t<br/>\nfind it by my search criteria.]<br/>\n<br/>\nI have a lot of unit tests, I usually run them inside the Eclipse test<br/>\nrunner (that finds all my tests in a project) or the Ant test runner (which<br/>\nagain finds all). As such, I&#39;ve given up on test suites as unnecessary for<br/>\nmy purposes. [The effort to &quot;wire tests together&quot; is more than I need/want,<br/>\nand might even limit me from just adding new tests whenever needed.] This<br/>\n&quot;test suite&quot; part may be unimportant, or not...<br/>\n<br/>\nI write unit tests for the low level objects, and also for the higher level<br/>\naggregating objects that use them. This helps me track down the cause of<br/>\nhigh level failures much easier. When junit detects problems and things fail<br/>\nI get a (sometimes long) list of failures. Finding the &quot;root cause&quot; problem<br/>\nmeans sifting through all the failures (including the aggregating failures)<br/>\nin order to find the problem, perhaps down in a low level class test. Since<br/>\nI can&#39;t control the order of execution (it is likely package alphabetical or<br/>\nsomething), I can&#39;t tell what is the lowest level test. I&#39;d like to reduce<br/>\nthe effort invested here.<br/>\n<br/>\nI was wondering if jUnit could introduce the concept of &quot;optional test<br/>\ndependencies&quot;, test X depends upon Y -- i.e. test Y runs before test X, and<br/>\ntest X runs IFF test Y succeeds.<br/>\n<br/>\nI wouldn&#39;t want to do this for every test, and it ought be user optional,<br/>\nbut I could see it as being a big benefit. I am sure there is some fancier<br/>\nOO way to explain/implement this [or even a nicer introspection way to<br/>\ndetermine this], but something like a TestCase.setDependency(Class<br/>\ntestClass) so TestCase constructors mark what they&#39;d like to depend upon.<br/>\n[For introspection maybe a public Class[] getDependencies()<br/>\ninterface/method].<br/>\n<br/>\nThe test runner engine would need to &quot;sort&quot; the calling order be dependency<br/>\ntree, and would need to know when not to call something, perhaps introducing<br/>\na new state (&quot;deferred&quot; -- meaning not run due to a dependency<br/>\nfailure/error -- to add to &quot;fail&quot;, &quot;error&quot;.)<br/>\n<br/>\nI know this is some work, but it seems (to me, at least) a simple yet<br/>\npowerful addition to jUnit. [That said, maybe I am missing something, such<br/>\nas test suites or something. Hmm ... maybe this dependency information could<br/>\nbe used to create anonymous suites on the fly...]<br/>\n<br/>\nThoughts?<br/>\n<br/>\nregards,<br/>\n<br/>\nAdam<br/>\n<br/>\nP.S. The Eclipse junit plugin that search projects to find all tests, find<br/>\ntests in dependant project, but doesn&#39;t run them &quot;in the CWD of that<br/>\nproject&quot; (which matters for some tests). This considered a bug, or just the<br/>\nway it is? I know of no way to have the search exclude dependent projects,<br/>\nis there one?<br/>\n--<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.try.sybase.com\">http://www.try.sybase.com</a>&gt;<br/>\nExperience Sybase Technology ...</div>", 
    "prevInTime": 8806, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059149675", 
    "canDelete": false, 
    "nextInTopic": 8811, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDAwNWEwMWMzNTJjNyRkNzMyOGUxMCQ1OTc4MTYwYUBzeWJhc2UuY29tPg=="
    }
}