{
    "numMessagesInTopic": 106, 
    "nextInTime": 8833, 
    "senderId": "UselVbRaXOmt1vz3NamzElfLVXRMkah-K3dpwKzIpzcNpl9_Lv-8Iyedo9HnPb9AVAU0BGtxi-sLdWiq1aL1Ezpp5_e-Wc3Y", 
    "systemMessage": false, 
    "subject": "RE: [junit] TestCase Dependency Hierarchy", 
    "from": "&quot;Adam Jack&quot; &lt;ajack@...&gt;", 
    "authorName": "Adam Jack", 
    "msgSnippet": "... level ... So you have two main test suites. 1. Object-level tests. 2. Integration tests. This necessarily means that you do not have the benefit of one", 
    "msgId": 8832, 
    "profile": "arb_jack", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124707332, 
    "messageBody": "<div id=\"ygrps-yiv-1998815223\">J .B. wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;I write unit tests for the low level objects, and also for the higher<br/>\n </span></blockquote>level<br/>\n<blockquote><span title=\"ireply\">   &gt;aggregating objects that use them.  [...]<br/>\n<br/>\n </span></blockquote>  So you have two main test suites.<br/>\n<br/>\n  1. Object-level tests.<br/>\n  2. Integration tests.<br/>\n<br/>\n  This necessarily means that you do not have the benefit of &quot;one defect,<br/>\none failure&quot;, since likely you always have &quot;one defect, at least two<br/>\nfailures&quot;.<br/>\n<br/>\nNo, I have a complex hierarchy.<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;Since<br/>\n  &gt;I can&#39;t control the order of execution (it is likely package alphabetical<br/>\n  &gt;or<br/>\n  &gt;something), I can&#39;t tell what is the lowest level test. I&#39;d like to<br/>\n </span></blockquote>reduce<br/>\n<blockquote><span title=\"ireply\">   &gt;the effort invested here.<br/>\n<br/>\n </span></blockquote>  This is a myth. You *can* control the order of execution of test and of<br/>\ntest suites; you simply have to maintain suites.<br/>\n<br/>\nAs  I said above, I know I *probably* could do it with suites ... BUT. As I<br/>\nrefactor, as code grows, the suites (being separate from the tests) are .<br/>\nbut that seems a level of manual effort/management that is counter<br/>\nproductive -- and hence counter testing. IMHO anything that can be better<br/>\ndone by a computer ought be done by a computer.<br/>\n<br/>\nSay I have an object X that aggregates Y and Z I want X to depend upon Y<br/>\ntests and Z tests. What suite would I create? Also, say I have A that<br/>\naggregate B and C -- with finally an object aggregating X and A. What if A<br/>\nstarted using X? Trying to manage suites to represent this hierarchy seems<br/>\nnightmarish.<br/>\n<br/>\nI would like to be able to set X to depend upon Y/Z (almost a &quot;dynamic<br/>\nsuite&quot;) and set A on Y and Z. Then, if A started using X I&#39;d just have to<br/>\nset A to depend upon X to get the desire hierarchy. [Doing this in the<br/>\noriginal class might be nicer still, but I&#39;ve not yet thought how to tie<br/>\ntests with classes so tightly (and be efficient).]<br/>\n<br/>\nIs what I am discussing unreasonable? It seems an easy interface for users,<br/>\nand something that junit could manage behind the scenes.<br/>\n<br/>\n[Gosh, if the Eclipse junit wizard did this for me via class introspection,<br/>\nthat&#39;d be a beautiful thing...]<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;P.S. The Eclipse junit plugin that search projects to find all tests,<br/>\n </span></blockquote>find<br/>\n<blockquote><span title=\"ireply\">   &gt;tests in dependant project, but doesn&#39;t run them &quot;in the CWD of that<br/>\n  &gt;project&quot; (which matters for some tests).<br/>\n<br/>\n </span></blockquote>  It shouldn&#39;t. It is best to write your tests so that it doesn&#39;t. Or your<br/>\nproduction code; whichever. Pass the desired working directory into the<br/>\ntests as a JVM parameter or something.<br/>\n<br/>\n<br/>\nI might agree with you, but I am testing ant tasks -- that process XML<br/>\nfiles -- and it seems wholly reasonable that they read them from a file.<br/>\nSince I am subclassing from the test utility that ant provides for this, I<br/>\nhave to use the file mechanism they provide. Also, since I am not launching<br/>\nthe junit (Eclipse is) I don&#39;t have the JVM control you state -- especially<br/>\nwhen it is choosing to run tests from multiple projects.<br/>\n<br/>\nI guess I&#39;ll file a bug report/enhancement request and see what luck I get.<br/>\n<br/>\nregards,<br/>\n<br/>\nAdam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 8831, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059443832", 
    "canDelete": false, 
    "nextInTopic": 8835, 
    "prevInTopic": 8811, 
    "headers": {
        "inReplyToHeader": "PDIwMDMwNzI1MTYxNDQxMDQzMi4wNjQ3RjREM0Bzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PDAwMGIwMWMzNTU3NCRiYzdmNDMxMCQxYjc4MTYwYUBzeWJhc2UuY29tPg=="
    }
}