{
    "numMessagesInTopic": 4, 
    "nextInTime": 8834, 
    "senderId": "WPJr93c8TgaDL6J-oRbh5cmG3RW5fn8KtDzaULL-zb4LHoVp45bYpQ1NerMxBt4XGYpYdT7o3LddsKVVzVkDcyCBFm2nXxpXygWX", 
    "systemMessage": false, 
    "subject": "Converting the Team", 
    "from": "David Boyer &lt;mangr3n@...&gt;", 
    "authorName": "David Boyer", 
    "msgSnippet": "I ve almost got one of my team members convinced of the benefits of TDD vs. traditional development.  The rest of the team has zero interest in it.  But if I", 
    "msgId": 8833, 
    "profile": "mangr3n", 
    "topicId": 8833, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 138345974, 
    "messageBody": "<div id=\"ygrps-yiv-2136194103\">I&#39;ve almost got one of my team members convinced of the benefits of TDD <br/>\nvs. traditional development.  The rest of the team has zero interest in <br/>\nit.  But if I can get one, I might be able to topple the rest.  My <br/>\narguments to him consist of the following main points:<br/>\n<br/>\n1. The test&#39;s created aren&#39;t verification of functionality (like QA <br/>\nTesting) they are specification of functionality.  They are the design <br/>\nrequirements.  Therefore they are a fun and precise communication of <br/>\nsoftware intent.  This reduces confusion about the results expected by <br/>\nmanagers, co-workers, customers.  This makes it easy to communicate <br/>\nabout the software&#39;s behavior.<br/>\n2. The TDD paradigm leads to that holy grail of OO, decoupled code.  <br/>\nThis is the Nirvana that seems to be impossible to achieve using <br/>\nstandard development practices.   Decoupled code is testable, but it&#39;s <br/>\nalso extremely flexible.  Optimization is easy, algorithm replacement is <br/>\neasy, all change is easy when it&#39;s decoupled.<br/>\n<br/>\nObviously, we will also have less bugs.  But I can&#39;t seem to get him <br/>\nover the hump.  I think part of it is the resistance to the overwhelming <br/>\nparadigm shift.  The other part is convincing him that the traditional <br/>\nmindset has no built in checks and balances against the bad programming <br/>\npractice of spaghetti code or of forcing attention to code smells.  We <br/>\ndo refactor, but there is no pattern of refactoring as a method to <br/>\nremove TechnicalDebt.<br/>\n<br/>\nI&#39;ve as yet been unable to completely give myself over to this mindset.  <br/>\nIt&#39;s so radical a departure from the standard model.    Part of the <br/>\nissue is institutional(meaning the culture at work), but the rest is <br/>\njust the sheer inertia of making a change of this magnitude. <br/>\n<br/>\nI&#39;d appreciate any suggestions for arguments or examples to bring to the <br/>\ntable:<br/>\n<br/>\nThanks,<br/>\n<br/>\nDavid B.</div>", 
    "prevInTime": 8832, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059490594", 
    "canDelete": false, 
    "nextInTopic": 8837, 
    "prevInTopic": 0, 
    "headers": {
        "inReplyToHeader": "PDEwNTk0NzkxNzMuMTQ3LjMxNTYubTEyQHlhaG9vZ3JvdXBzLmNvbT4=", 
        "messageIdInHeader": "PDNGMjY4QjIyLjYwMDA1QHRlYW1kZWthZGUuY29tPg==", 
        "referencesHeader": "PDEwNTk0NzkxNzMuMTQ3LjMxNTYubTEyQHlhaG9vZ3JvdXBzLmNvbT4="
    }
}