{
    "numMessagesInTopic": 106, 
    "nextInTime": 8836, 
    "senderId": "tPZNQvg4sC0T2N-xVtElqovrJ1fN4R6jZyblfQ65w806mZc85GZk95UtDuldp-7kUUWFAf9_igTvEge3MZxb5X1RaHDTrDDKk5nuvHKg3g", 
    "systemMessage": false, 
    "subject": "RE: [junit] TestCase Dependency Hierarchy", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... Don t we all. Your complex hierarchy, I imagine, boils down to a set of object-level tests (unit tests -- focus on a single object) and a set of", 
    "msgId": 8835, 
    "profile": "nails762", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-1454592347\"><blockquote><span title=\"ireply\">&gt;So said Adam Jack on 2003-07-28 --------------------<br/>\n&gt;J .B. wrote:<br/>\n&gt;<br/>\n&gt;  &gt;I write unit tests for the low level objects, and also for the higher<br/>\n&gt;level<br/>\n&gt;  &gt;aggregating objects that use them.  [...]<br/>\n&gt;<br/>\n&gt;  So you have two main test suites.<br/>\n&gt;<br/>\n&gt;  1. Object-level tests.<br/>\n&gt;  2. Integration tests.<br/>\n&gt;<br/>\n&gt;  This necessarily means that you do not have the benefit of &quot;one defect,<br/>\n&gt;one failure&quot;, since likely you always have &quot;one defect, at least two<br/>\n&gt;failures&quot;.<br/>\n&gt;<br/>\n&gt;No, I have a complex hierarchy.<br/>\n<br/>\n </span></blockquote>Don&#39;t we all.<br/>\n<br/>\nYour complex hierarchy, I imagine, boils down to a set of object-level tests (unit tests -- focus on a single object) and a set of integration tests (involve many objects, possibly one package at a time).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt;Since<br/>\n&gt;  &gt;I can&#39;t control the order of execution (it is likely package<br/>\n&gt;alphabetical<br/>\n&gt;  &gt;or<br/>\n&gt;  &gt;something), I can&#39;t tell what is the lowest level test. I&#39;d like to<br/>\n&gt;reduce<br/>\n&gt;  &gt;the effort invested here.<br/>\n&gt;<br/>\n&gt;  This is a myth. You *can* control the order of execution of test and of<br/>\n&gt;test suites; you simply have to maintain suites.<br/>\n&gt;<br/>\n&gt;As  I said above, I know I *probably* could do it with suites ... <br/>\n<br/>\n </span></blockquote>Not &quot;probably&quot;. Definitely.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;BUT. As I<br/>\n&gt;refactor, as code grows, the suites (being separate from the tests) are .<br/>\n&gt;but that seems a level of manual effort/management that is counter<br/>\n&gt;productive -- and hence counter testing. IMHO anything that can be better<br/>\n&gt;done by a computer ought be done by a computer.<br/>\n<br/>\n </span></blockquote>Maintaining test suites is not counterproductive if you have a need to maintain test suites. If you need to maintain test suites to do your work, then maintaining test suites is, by definition, productive.<br/>\n<br/>\nI don&#39;t see how a computer can do what you&#39;re suggesting. If I understood correctly, you want to identify tests that depend on one another. What I suggested was a way to do that with what JUnit already provides. Obviously, you can take that scheme, factor out a little engine and make it data-driven; but my point remains: it&#39;s not an addition to JUnit you seek, but another way of building suites.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Say I have an object X that aggregates Y and Z I want X to depend upon Y<br/>\n&gt;tests and Z tests. <br/>\n<br/>\n </span></blockquote>For object-level tests, I agree that object X maps to a suite of tests, possibly all implemented as a single TestCase class. That would be mechanical enough that you may be able to write a script to determine that mapping.<br/>\n<br/>\nFor integration tests, as you say you have, how do you map object X to the integration tests containing object X? I wonder how you&#39;d script determining that mapping? Note that objects X, Y and Z would all map to the intersection of all integration tests containing X, integration tests containing Y and integration tests containing Z. I cannot begin to imagine how to determine that mapping without having a human maintain it somehow.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;What suite would I create?<br/>\n<br/>\n </span></blockquote>I would create the suite I know I need. But then, I don&#39;t view integration tests by the objects they test: I view them by the features they support.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Also, say I have A that<br/>\n&gt;aggregate B and C -- with finally an object aggregating X and A. What if A<br/>\n&gt;started using X? Trying to manage suites to represent this hierarchy seems<br/>\n&gt;nightmarish.<br/>\n<br/>\n </span></blockquote>That&#39;s why there are object-level tests and customer tests. The customer tests generally test the system from end to end and the object-level tests generally test one object at a time. Anything in between is written as needed and thrown away when no longer needed, in my opinion.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I would like to be able to set X to depend upon Y/Z (almost a &quot;dynamic<br/>\n&gt;suite&quot;) and set A on Y and Z<br/>\n<br/>\n </span></blockquote>If *you* are setting it, then how is that different from what I suggest? Either a computer program determines the mapping, or you determine the mapping. How you EXPRESS the mapping is just a matter of implementation details. Start by maintaining the suite by hand, notice the patterns in the way you do things, then script it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Is what I am discussing unreasonable? It seems an easy interface for users,<br/>\n&gt;and something that junit could manage behind the scenes.<br/>\n<br/>\n </span></blockquote>I just don&#39;t think it&#39;s part of JUnit. It&#39;s a new Test Runner, perhaps. It&#39;s a specialized Test Suite Builder. But the framework already supports what you want; someone just has to do the work of building it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;[Gosh, if the Eclipse junit wizard did this for me via class introspection,<br/>\n&gt;that&#39;d be a beautiful thing...]<br/>\n<br/>\n </span></blockquote>I&#39;m not sure about that myself....<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt;P.S. The Eclipse junit plugin that search projects to find all tests,<br/>\n&gt;find<br/>\n&gt;  &gt;tests in dependant project, but doesn&#39;t run them &quot;in the CWD of that<br/>\n&gt;  &gt;project&quot; (which matters for some tests).<br/>\n&gt;<br/>\n&gt;  It shouldn&#39;t. It is best to write your tests so that it doesn&#39;t. Or your<br/>\n&gt;production code; whichever. Pass the desired working directory into the<br/>\n&gt;tests as a JVM parameter or something.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;I might agree with you, but I am testing ant tasks -- that process XML<br/>\n&gt;files -- and it seems wholly reasonable that they read them from a file.<br/>\n<br/>\n </span></blockquote>Read from all the files you want; but don&#39;t depend on the CWD: pass that into the system as a parameter.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Since I am subclassing from the test utility that ant provides for this, I<br/>\n&gt;have to use the file mechanism they provide. <br/>\n<br/>\n </span></blockquote>No argument there.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Also, since I am not launching<br/>\n&gt;the junit (Eclipse is) I don&#39;t have the JVM control you state -- especially<br/>\n&gt;when it is choosing to run tests from multiple projects.<br/>\n<br/>\n </span></blockquote>What?! The JUnit test runner *I* know allows you to configure JVM properties. Certainly the Ant runner does. Did I miss a meeting?<br/>\n<br/>\n<br/>\nJ. B. Rainsberger,<br/>\nPresident, Diaspar Software Services<br/>\nLet&#39;s write software that people understand.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com/\">http://www.diasparsoftware.com/</a><br/>\ntelephone: +1 416 791-8603</div>", 
    "prevInTime": 8834, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059492466", 
    "canDelete": false, 
    "nextInTopic": 8841, 
    "prevInTopic": 8832, 
    "headers": {
        "inReplyToHeader": "PDAwMGIwMWMzNTU3NCRiYzdmNDMxMCQxYjc4MTYwYUBzeWJhc2UuY29tPg==", 
        "messageIdInHeader": "PDIwMDMwNzI5MTEyNzQ2MDUwOS4wMDg3RUQ0REBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDAwMGIwMWMzNTU3NCRiYzdmNDMxMCQxYjc4MTYwYUBzeWJhc2UuY29tPg=="
    }
}