{
    "numMessagesInTopic": 106, 
    "nextInTime": 8847, 
    "senderId": "D0IWYtUUEuk9otrnLN07RXQ1_RpYAwYdmNgy1pm4wRyGuOp9q9ORrToPxGOpGc_MH_cc0Vxxlw4R_iHlS2a7oO8YuDhWMTKR", 
    "systemMessage": false, 
    "subject": "RE: [junit] TestCase Dependency Hierarchy", 
    "from": "&quot;Adam Jack&quot; &lt;ajack@...&gt;", 
    "authorName": "Adam Jack", 
    "msgSnippet": "... Not probably . Definitely. But probably NOT within my desired effort level. ;-) ... Maintaining test suites is not counterproductive if you have a need to", 
    "msgId": 8846, 
    "profile": "arb_jack", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124707332, 
    "messageBody": "<div id=\"ygrps-yiv-1274368288\">R.B Rainsberger wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;As  I said above, I know I *probably* could do it with suites ...<br/>\n<br/>\n </span></blockquote>  Not &quot;probably&quot;. Definitely.<br/>\n<br/>\nBut probably NOT within my desired effort level. ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;BUT. As I<br/>\n  &gt;refactor, as code grows, the suites (being separate from the tests) are .<br/>\n  &gt;but that seems a level of manual effort/management that is counter<br/>\n  &gt;productive -- and hence counter testing. IMHO anything that can be better<br/>\n  &gt;done by a computer ought be done by a computer.<br/>\n<br/>\n </span></blockquote>  Maintaining test suites is not counterproductive if you have a need to<br/>\nmaintain test suites. If you need to maintain test suites to do your work,<br/>\nthen maintaining test suites is, by definition, productive.<br/>\n<br/>\nWe are failing to communicate. Either I am wrong and stubbornly failing to<br/>\nsee your point (not impossible), or I am not explaining my issues w/ suites<br/>\nwell enough...<br/>\n<br/>\nI agree that suites are a way to group tests and manage test group<br/>\nhierarchy, however they aren&#39;t (IMHO) a good tool for managing test<br/>\nhierarchies. Arrogant as that statement sounds, I honestly wonder if there<br/>\nis &quot;a better way&quot; [for my use case, and hopefully for others]. I guess I<br/>\nfigure that if there is an easier way for developers to maintain test<br/>\ndependencies, one that improves test results failure analysis, then testing<br/>\nwill be more effective/efficient. That seems nicely &quot;test infecting&quot; and<br/>\nhence junit-like, to me.<br/>\n<br/>\nSure, I may be re-inventing the wheel -- and dumbly thinking I have<br/>\nsomething new -- but I am attempting to pressure test that here. I&#39;m making<br/>\none more step at explaining (see next reply to yours below). Please keep an<br/>\nopen mind to this as an optional addition/alternative to suites. If you just<br/>\ncan&#39;t see it, then so be it. I think the problem with the example I&#39;ve given<br/>\nare that they are too small & simple. Perhaps the difference can&#39;t be<br/>\nexplained by simple example.<br/>\n<br/>\nIf the method I am proposing makes sense for a decent chunk of the user<br/>\ncommunity, and makes junit more productive for that use case, then I see it<br/>\nas a good alternative to test suites (which I feel are becoming obsolete by<br/>\ntest collectors). No reason why both couldn&#39;t be available.<br/>\n<br/>\n       I don&#39;t see how a computer can do what you&#39;re suggesting. If I<br/>\nunderstood     correctly, you want to identify tests that depend on one<br/>\nanother. What I suggested was a way to do that with what JUnit already<br/>\nprovides. Obviously, you can take that scheme, factor out a little engine<br/>\nand make it data-driven; but my point remains: it&#39;s not an addition to JUnit<br/>\nyou seek, but another way of building suites.<br/>\n<br/>\n<br/>\nI  believe I am saying/seeing a different between a human maintaining<br/>\ndisjointed groupings (suites) and a human maintaining simple assertions of<br/>\ndependency of a testcase on other testcases (or suites, I guess), and the<br/>\nengine (runner) calculating the dependency order. I guess I am describing a<br/>\ndeclarative mechanism (like ant) verses .. what would one call it ...<br/>\nprocedural?<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;What suite would I create?<br/>\n<br/>\n </span></blockquote>  I would create the suite I know I need. But then, I don&#39;t view integration<br/>\ntests by the objects they test: I view them by the features they support.<br/>\n<br/>\n<br/>\nMy examples were just simple ones. Dependency can be in the eye of the<br/>\nbeholder... :-)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;I would like to be able to set X to depend upon Y/Z (almost a &quot;dynamic<br/>\n  &gt;suite&quot;) and set A on Y and Z<br/>\n<br/>\n </span></blockquote>  If *you* are setting it, then how is that different from what I suggest?<br/>\nEither a computer program determines the mapping, or you determine the<br/>\nmapping. How you EXPRESS the mapping is just a matter of implementation<br/>\ndetails. Start by maintaining the suite by hand, notice the patterns in the<br/>\nway you do things, then script it.<br/>\n<br/>\nDeclarative verses &quot;procedural&quot;.<br/>\n<br/>\nGak, why script it? That isn&#39;t going to fit into my eclipse, or ant tasks,<br/>\nusage w/o some pain. Some things aren&#39;t worth doing unless they are accepted<br/>\nby the core.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;Is what I am discussing unreasonable? It seems an easy interface for<br/>\n </span></blockquote>users,<br/>\n<blockquote><span title=\"ireply\">   &gt;and something that junit could manage behind the scenes.<br/>\n<br/>\n </span></blockquote>  I just don&#39;t think it&#39;s part of JUnit. It&#39;s a new Test Runner, perhaps.<br/>\nIt&#39;s a specialized Test Suite Builder. But the framework already supports<br/>\nwhat you want; someone just has to do the work of building it.<br/>\n<br/>\n<br/>\nWhy not? Suites serve a purpose, why couldn&#39;t declarative. I agree, it means<br/>\nchanges to the runner, but maybe that is warranted in this age of<br/>\nant/eclipse test collectors...<br/>\n<br/>\nregards<br/>\n<br/>\nAdam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 8845, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059503978", 
    "canDelete": false, 
    "nextInTopic": 8848, 
    "prevInTopic": 8841, 
    "headers": {
        "inReplyToHeader": "PDIwMDMwNzI5MTEyNzQ2MDUwOS4wMDg3RUQ0REBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PDAwYTAwMWMzNTYwMCRjNTE2MDgxMCQzMTc4MTYwYUBzeWJhc2UuY29tPg=="
    }
}