{
    "numMessagesInTopic": 106, 
    "nextInTime": 8849, 
    "senderId": "d7O6bkaNfbKLrdZkdq31TrShEA_oVaMAiOZWKmfH6eZHJg2_-I81OjRsUXx1DhYv970SD0YUZ5wR8ZCOtTEbjC7pavJkWtyNPy_VEvN1wA", 
    "systemMessage": false, 
    "subject": "RE: [junit] TestCase Dependency Hierarchy", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... Understood, but if it has to be done, then it has to be done.... ... Perhaps a concrete example would be best here, if you are interested in getting to the", 
    "msgId": 8848, 
    "profile": "nails762", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-453054765\"><blockquote><span title=\"ireply\">&gt;So said Adam Jack on 2003-07-29 --------------------<br/>\n&gt;J.B Rainsberger wrote:<br/>\n&gt;<br/>\n&gt;  &gt;As  I said above, I know I *probably* could do it with suites ...<br/>\n&gt;<br/>\n&gt;  Not &quot;probably&quot;. Definitely.<br/>\n&gt;<br/>\n&gt;But probably NOT within my desired effort level. ;-)<br/>\n<br/>\n </span></blockquote>Understood, but if it has to be done, then it has to be done....<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt;BUT. As I<br/>\n&gt;  &gt;refactor, as code grows, the suites (being separate from the tests) are<br/>\n&gt;.<br/>\n&gt;  &gt;but that seems a level of manual effort/management that is counter<br/>\n&gt;  &gt;productive -- and hence counter testing. IMHO anything that can be<br/>\n&gt;better<br/>\n&gt;  &gt;done by a computer ought be done by a computer.<br/>\n&gt;<br/>\n&gt;  Maintaining test suites is not counterproductive if you have a need to<br/>\n&gt;maintain test suites. If you need to maintain test suites to do your work,<br/>\n&gt;then maintaining test suites is, by definition, productive.<br/>\n&gt;<br/>\n&gt;We are failing to communicate. Either I am wrong and stubbornly failing to<br/>\n&gt;see your point (not impossible), or I am not explaining my issues w/ suites<br/>\n&gt;well enough...<br/>\n<br/>\n </span></blockquote>Perhaps a concrete example would be best here, if you are interested in getting to the bottom of things, as it were.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I agree that suites are a way to group tests and manage test group<br/>\n&gt;hierarchy, however they aren&#39;t (IMHO) a good tool for managing test<br/>\n&gt;hierarchies. <br/>\n<br/>\n </span></blockquote>Agree. They aren&#39;t a tool for managing test hierarchies at all -- they *are* the test hierarchies.<br/>\n<br/>\nJUnit provides a simple, default way to build a test suite from a TestCase subclass. Beyond that, it&#39;s your job to build the suite you want. My point is simple -- and I think you keep missing it -- do whatever you need to build a test suite, but don&#39;t mistake those custom building process for something that belongs in the framework. Don&#39;t confuse TestSuite, which is part of the framework, with creating instances of TestSuite, which is your job. To make it simpler, JUnit provides one way to do it....<br/>\n<br/>\n&lt;snip /&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I guess I<br/>\n&gt;figure that if there is an easier way for developers to maintain test<br/>\n&gt;dependencies, one that improves test results failure analysis, then testing<br/>\n&gt;will be more effective/efficient. That seems nicely &quot;test infecting&quot; and<br/>\n&gt;hence junit-like, to me.<br/>\n<br/>\n </span></blockquote>Build the suites however you need to.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Sure, I may be re-inventing the wheel -- and dumbly thinking I have<br/>\n&gt;something new -- but I am attempting to pressure test that here. I&#39;m making<br/>\n&gt;one more step at explaining (see next reply to yours below). Please keep an<br/>\n&gt;open mind to this as an optional addition/alternative to suites. <br/>\n<br/>\n </span></blockquote>It&#39;s not an addition to suites. It&#39;s a way to build suites.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If you<br/>\n&gt;just<br/>\n&gt;can&#39;t see it, then so be it. I think the problem with the example I&#39;ve<br/>\n&gt;given<br/>\n&gt;are that they are too small & simple. Perhaps the difference can&#39;t be<br/>\n&gt;explained by simple example.<br/>\n<br/>\n </span></blockquote>I invite you to provide a larger example, if you like.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If the method I am proposing makes sense for a decent chunk of the user<br/>\n&gt;community, and makes junit more productive for that use case, then I see it<br/>\n&gt;as a good alternative to test suites (which I feel are becoming obsolete by<br/>\n&gt;test collectors). <br/>\n<br/>\n </span></blockquote>From what I understand, a Test Collector is a way to build a TestSuite. JUnit executes TestSuite objects. It appears that you are talking about a new kind of Test Collector that uses some dependency metadata about tests. That&#39;s very cool stuff, but it&#39;s not an extension to JUnit: it is a particular use of JUnit.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;No reason why both couldn&#39;t be available.<br/>\n<br/>\n </span></blockquote>Indeed.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I  believe I am saying/seeing a different between a human maintaining<br/>\n&gt;disjointed groupings (suites) and a human maintaining simple assertions of<br/>\n&gt;dependency of a testcase on other testcases (or suites, I guess), and the<br/>\n&gt;engine (runner) calculating the dependency order. I guess I am describing a<br/>\n&gt;declarative mechanism (like ant) verses .. what would one call it ...<br/>\n&gt;procedural?<br/>\n<br/>\n </span></blockquote>Then it *is* what I think it is. You&#39;re just talking about a TestSuite factory that uses markup to create TestSuite objects. Again, it does not belong in the JUnit framework, but rather as an add-on tool.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt;What suite would I create?<br/>\n&gt;<br/>\n&gt;  I would create the suite I know I need. But then, I don&#39;t view<br/>\n&gt;integration<br/>\n&gt;tests by the objects they test: I view them by the features they support.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;My examples were just simple ones. Dependency can be in the eye of the<br/>\n&gt;beholder... :-)<br/>\n<br/>\n </span></blockquote>I don&#39;t know that it can be: dependency is or is not.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt;I would like to be able to set X to depend upon Y/Z (almost a &quot;dynamic<br/>\n&gt;  &gt;suite&quot;) and set A on Y and Z<br/>\n&gt;<br/>\n&gt;  If *you* are setting it, then how is that different from what I suggest?<br/>\n&gt;Either a computer program determines the mapping, or you determine the<br/>\n&gt;mapping. How you EXPRESS the mapping is just a matter of implementation<br/>\n&gt;details. Start by maintaining the suite by hand, notice the patterns in the<br/>\n&gt;way you do things, then script it.<br/>\n&gt;<br/>\n&gt;Declarative verses &quot;procedural&quot;.<br/>\n<br/>\n </span></blockquote>Implementation details.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Gak, why script it? That isn&#39;t going to fit into my eclipse, or ant tasks,<br/>\n&gt;usage w/o some pain. Some things aren&#39;t worth doing unless they are<br/>\n&gt;accepted<br/>\n&gt;by the core.<br/>\n<br/>\n </span></blockquote>Very well, automate it however you please.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt;Is what I am discussing unreasonable? It seems an easy interface for<br/>\n&gt;users,<br/>\n&gt;  &gt;and something that junit could manage behind the scenes.<br/>\n&gt;<br/>\n&gt;  I just don&#39;t think it&#39;s part of JUnit. It&#39;s a new Test Runner, perhaps.<br/>\n&gt;It&#39;s a specialized Test Suite Builder. But the framework already supports<br/>\n&gt;what you want; someone just has to do the work of building it.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;Why not? Suites serve a purpose, why couldn&#39;t declarative. I agree, it<br/>\n&gt;means<br/>\n&gt;changes to the runner, but maybe that is warranted in this age of<br/>\n&gt;ant/eclipse test collectors...<br/>\n<br/>\n </span></blockquote>Maybe I misunderstand Test Collectors -- point me to something to learn more, if you don&#39;t mind -- but don&#39;t they just create TestSuite objects?<br/>\n<br/>\nYour way to declare a test suite is already supported by JUnit and a little cute refactoring.<br/>\n<br/>\nConsider the AllTests pattern. I can reduce it to a collection of AllTests or TestCase class names with a little neat refactoring. Then I can use that little engine to store AllTests as text. The next step is to generate that text by doing a directory scan. Now I have a TestSuite builder that build tests from a part of the file system.<br/>\n<br/>\nI did nothing to change JUnit. I just decorated it. Does it belong in the framework? I don&#39;t think so. That&#39;s a question of taste, in my opinion.<br/>\n<br/>\nSo I think we understand each other quite well -- I just don&#39;t understand why you think this feature you suggest should be part of the framework? Why isn&#39;t it a candidate for JUnit-addons or something like that?<br/>\n<br/>\nRemember that my goal -- Kent&#39;s goal, too -- is to keep JUnit very tight and small. It should provide just enough for everyone, rather than a glut of features that have limited use. The less to learn, the better. If you need more, grab add-on package X, add-on package Y and add-on package Z.<br/>\n<br/>\nAlso, the more magic in the package, the less the users need to learn to use it. I want them to know what they&#39;re doing.<br/>\n<br/>\nTake care.<br/>\n<br/>\n<br/>\nJ. B. Rainsberger,<br/>\nPresident, Diaspar Software Services<br/>\nLet&#39;s write software that people understand.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com/\">http://www.diasparsoftware.com/</a><br/>\ntelephone: +1 416 791-8603</div>", 
    "prevInTime": 8847, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059595064", 
    "canDelete": false, 
    "nextInTopic": 8857, 
    "prevInTopic": 8846, 
    "headers": {
        "inReplyToHeader": "PDAwYTAwMWMzNTYwMCRjNTE2MDgxMCQzMTc4MTYwYUBzeWJhc2UuY29tPg==", 
        "messageIdInHeader": "PDIwMDMwNzMwMTU1NzQ0MDk0OS4wMDRBNDVGMUBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDAwYTAwMWMzNTYwMCRjNTE2MDgxMCQzMTc4MTYwYUBzeWJhc2UuY29tPg=="
    }
}