{
    "numMessagesInTopic": 8, 
    "nextInTime": 886, 
    "senderId": "ubvirINGIf1fRXWJ88CsWJ8CZ5LSYaCe6Ksqetp5KSJi-LG_3G-U9AwcaHfpSUO1UNbfL2Oxzei9APd0Hwk4H60", 
    "systemMessage": false, 
    "subject": "Re: [junit] Ordering Test  _Output_ ?", 
    "from": "Joi Ellis &lt;joi@...&gt;", 
    "authorName": "Joi Ellis", 
    "msgSnippet": "... Ah, so you mean the ability to, say, run all basic tests only or something like that? ... I typically create one test method per app method, and that", 
    "msgId": 885, 
    "topicId": 874, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1539846974\">On Tue, 3 Apr 2001, Vitezslav Stejskal wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; Joi Ellis wrote:<br/>\n&gt; <br/>\n&gt; I like the idea of test cases classified by their complexity and<br/>\n&gt; definitely it is not good to rely on some undocumented features,<br/>\n&gt; thus I would appreciate some support in JUnit framework.<br/>\n&gt; <br/>\n&gt; Morover ordering test functions by their complexity restricts<br/>\n&gt; you to the class boundaries. Suite, generally, can include tests<br/>\n&gt; from several classes and then it would be nice to have *basic*<br/>\n&gt; tests from all classes grouped together.<br/>\n<br/>\n </span></blockquote>Ah, so you mean the ability to, say, &quot;run all &#39;basic&#39; tests only&quot;<br/>\nor something like that?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Now maybe some core XP funs will curicify me, but I see<br/>\n&gt; it useful to have a possibility to define dependencies between<br/>\n&gt; those above metnioned groups of tests with the same complexity level.<br/>\n&gt; I like the TestRunner which will skip more complex tests, when<br/>\n&gt; some basic tests fail. Note, that for testing some large products<br/>\n&gt; the test can take 1 hour or more. Why should I wait for<br/>\n&gt; such a long time just to know that some basic test failed and<br/>\n&gt; thus all others depending on it failed too.<br/>\n<br/>\n </span></blockquote>I typically create one test method per app method, and that test method<br/>\ncontains a number of asserts, rising in complexity.  The first one that<br/>\nfails causes the rest of the test to be bypassed.<br/>\n<br/>\nI avoid writing tests that are order-dependent to the point that #2<br/>\nfails if #1 is run after instead of before.  IE database tests where<br/>\ntest 1 adds stuff and test 2 deletes it.  I&#39;d have test 1 add stuff,<br/>\nthen leave it, and have test 2 add new stuff, delete the new stuff.<br/>\nThe tearDown() method would delete #1&#39;s leftovers, or #1 could do it<br/>\nitself within a try/catch block so that a failure here doesn&#39;t false-fail<br/>\nthe add test but prints the exception to stdout or stderr for reference.  <br/>\n<br/>\nI just try to order by complexity so that if a pile of stuff fails, I can<br/>\nstart working from the top of the list downwards, and dependent failures<br/>\ndisappear in the next test run.<br/>\n-- <br/>\nJoi Ellis                    Software Engineer<br/>\nAravox Technologies          <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joi@...\">joi@...</a>, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gyles19@...\">gyles19@...</a><br/>\n<br/>\nNo matter what we think of Linux versus FreeBSD, etc., the one thing I<br/>\nreally like about Linux is that it has Microsoft worried.  Anything<br/>\nthat kicks a monopoly in the pants has got to be good for something.<br/>\n           - Chris Johnson</div>", 
    "prevInTime": 884, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "986321092", 
    "canDelete": false, 
    "nextInTopic": 886, 
    "prevInTopic": 884, 
    "headers": {
        "inReplyToHeader": "PDNBQzlCRjM3LjcwQkYzNUUzQGN6ZWNoLnN1bi5jb20+", 
        "messageIdInHeader": "PFBpbmUuTE5YLjQuMjEuMDEwNDAzMTI1OTI2MC4yNTk0Mi0xMDAwMDBAam9pLmFyYXZveC5jb20+"
    }
}