{
    "numMessagesInTopic": 1, 
    "nextInTime": 8861, 
    "senderId": "EI7mqCiJlXe-lCE6BpnZuXRjo2RYku5RhemRUnMPW2XDnI-amMfHKwAo_g1NofqNaF6nXDap4MU5kACawT7JEJY9ECqSet6j", 
    "systemMessage": false, 
    "subject": "FW: [junit] TestCase Dependency Hierarchy", 
    "from": "&quot;Adam Jack&quot; &lt;ajack@...&gt;", 
    "authorName": "Adam Jack", 
    "msgSnippet": "I can t see this on the mailing list, did it not get there? Adam ... From: Adam Jack [mailto:ajack@trysybase.com] Sent: Tuesday, July 29, 2003 3:46 PM To:", 
    "msgId": 8860, 
    "profile": "arb_jack", 
    "topicId": 8860, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124707332, 
    "messageBody": "<div id=\"ygrps-yiv-994620878\">I can&#39;t see this on the mailing list, did it not get there?<br/>\nAdam<br/>\n-----Original Message-----<br/>\nFrom: Adam Jack [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ajack@...\">ajack@...</a>]<br/>\nSent: Tuesday, July 29, 2003 3:46 PM<br/>\nTo: &#39;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>&#39;<br/>\nSubject: RE: [junit] TestCase Dependency Hierarchy<br/>\n<br/>\n<br/>\nJ. B. Rainsberger [<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jbrains@...\">jbrains@...</a>] replied:<br/>\n<blockquote><span title=\"ireply\">   &gt;But probably NOT within my desired effort level. ;-)<br/>\n<br/>\n </span></blockquote>  Understood, but if it has to be done, then it has to be done....<br/>\n<br/>\nBut I don&#39;t think it should have to be done. I think it is a perfectly fair<br/>\nthing to see removed from manual maintenance.<br/>\n<br/>\n  JUnit provides a simple, default way to build a test suite from a TestCase<br/>\nsubclass. Beyond that, it&#39;s your job to build the suite you want. My point<br/>\nis simple -- and I think you keep missing it -- do whatever you need to<br/>\nbuild a test suite, but don&#39;t mistake those custom building process for<br/>\nsomething that belongs in the framework. Don&#39;t confuse TestSuite, which is<br/>\npart of the framework, with creating instances of TestSuite, which is your<br/>\njob. To make it simpler, JUnit provides one way to do it....<br/>\n<br/>\nI&#39;ve not been missing your point (not completely, although I get it more<br/>\neach time) but this is the crux of my argument: If (big IF) suites are<br/>\ntestcase dependencies, then I don&#39;t think it ought be the user&#39;s job to<br/>\nmanage them -- I think the framework should. It is easy for me (outside the<br/>\ncode) to say this, but I think they were a useful construct before, but they<br/>\nmay have outlived their usefulness. I posit that suites are the existing<br/>\nhammer, so they are making things seem like a nail.<br/>\n<br/>\n<blockquote><span title=\"ireply\">     &gt;My examples were just simple ones. Dependency can be in the eye of the<br/>\n    &gt;beholder... :-)<br/>\n<br/>\n </span></blockquote>    I don&#39;t know that it can be: dependency is or is not.<br/>\n<br/>\nI was saying dependency due to aggregation, you were saying dependency due<br/>\nto feature. I was agreeing that users could set dependency for whatever<br/>\nreason they chose.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">       &gt;Declarative verses &quot;procedural&quot;.<br/>\n<br/>\n </span></blockquote>      Implementation details.<br/>\n<br/>\nI disagree, I believe it is usability, if not plain functionality.<br/>\n<br/>\n<br/>\n      Maybe I misunderstand Test Collectors -- point me to something to<br/>\nlearn more, if you don&#39;t mind<br/>\n     -- but don&#39;t they just       create TestSuite objects?<br/>\n<br/>\nUnfortunately I don&#39;t have that information, I know they scan classpaths and<br/>\nmatch class patterns (e.g. *Test*). I assume they build a testsuite (or<br/>\ncollection of such) but I don&#39;t know, sorry. Taking a brief look at some ant<br/>\ncode they may even use an array/enumeration of testcases & their own runner,<br/>\nbut I can&#39;t be sure.<br/>\n<br/>\n      Your way to declare a test suite is already supported by JUnit and a<br/>\nlittle    cute refactoring.<br/>\n<br/>\n      Consider the AllTests pattern. I can reduce it to a collection of<br/>\nAllTests or  TestCase class names with a little neat refactoring. Then I can<br/>\nuse that little engine to store AllTests as text. The next step is to<br/>\ngenerate that text by doing a directory scan. Now I have a TestSuite builder<br/>\nthat build tests from a part of the file system.<br/>\n<br/>\n      I did nothing to change JUnit. I just decorated it. Does it belong in<br/>\nthe framework? I don&#39;t think so. That&#39;s a question of taste, in my opinion.<br/>\n<br/>\nGreat explanation of your position, and good summary of the crux of this<br/>\ndiscussion as it stands. My views to follow.<br/>\n<br/>\nSo I think we understand each other quite well -- I just don&#39;t understand<br/>\nwhy you think this feature you suggest should be part of the framework? Why<br/>\nisn&#39;t it a candidate for JUnit-addons or something like that?<br/>\n<br/>\nA few responses:<br/>\n<br/>\n1) Perhaps set the clock back. What say the original implementation had test<br/>\ncase dependency, not test suites. Who is to say that suites warrant<br/>\ninclusion but dependencies do not? Maybe suites must stay  for backwards<br/>\ncompatibility (although I feel they are declining in usage) but why oughtn&#39;t<br/>\ndependency be there?<br/>\n<br/>\n2) I think dependency needs to be managed on the testcase, hence be an<br/>\noptional aspect of that class. I think separating this out into a separate<br/>\nstructure (like suite) is a recipe for rust. ***This is why I think it needs<br/>\nto be part of the framework, not an add on.***<br/>\n<br/>\n3) Given test collectors (classpath/directory scanners) -- and given things<br/>\nlike Eclipse testcase wizards --- I believe suites are fading out of<br/>\nconsciousness. As such, I think it is less to learn to say &quot;my testcase<br/>\ndepends upon these testcases&quot; than learn a the testsuite concept.<br/>\n<br/>\n4) I believe (IMHO -- w/ no market research, just based on projects I know)<br/>\nthat dependency has great user benefit than manual test suite. As such, I&#39;d<br/>\nlike it in the framework to aid the most users.<br/>\n<br/>\nRemember that my goal -- Kent&#39;s goal, too -- is to keep JUnit very tight and<br/>\nsmall. It should provide just enough for everyone, rather than a glut of<br/>\nfeatures that have limited use. The less to learn, the better. If you need<br/>\nmore, grab add-on package X, add-on package Y and add-on package Z.<br/>\n<br/>\nI can understand that goal, and I might agree w/ it academically. That said,<br/>\nI think product purity comes (a close) second to usability. And even with<br/>\nthat said, I don&#39;t see how your goal counters what I suggested & doesn&#39;t fit<br/>\nit.<br/>\n<br/>\n      Also, the more magic in the package, the less the users need to learn<br/>\nto use it. I want them to know what they&#39;re doing.<br/>\n<br/>\nMy goal is better testing through easier test management, easier test result<br/>\nanalysis. That said, I don&#39;t see how the approach I am suggesting doesn&#39;t<br/>\nfit this.<br/>\n<br/>\n<br/>\nBTW: Long before the end of this mail I&#39;ve started to realize that this<br/>\nwhole e-mail chain is an academic exercise, unlikely to result in change.<br/>\nJUnit still rocks, and I use it fervently, this was just a random thought<br/>\nthat seemed to feel like an epiphany so I posted it...<br/>\n<br/>\nregards,<br/>\n<br/>\nAdam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 8859, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059571307", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDAwMzYwMWMzNTY5ZCQ4ODIzMTJjMCQ1ZTc4MTYwYUBzeWJhc2UuY29tPg=="
    }
}