{
    "numMessagesInTopic": 106, 
    "nextInTime": 8864, 
    "senderId": "zpRa8uhZdhr7Le-XuxGemIabWVYPoxJxzN2UX1TJDEftdwSSIkuvaxi0TkUln4PW2qM7JWyY0PYCYGOCdfn2bHAfjx8oYqXB-kFkpYvL7w", 
    "systemMessage": false, 
    "subject": "RE: [junit] TestCase Dependency Hierarchy", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... As we are slowly converging on the fact, no-one stops you from automating this maintenance to the degree that you can. ... They absolutely, positively are", 
    "msgId": 8863, 
    "rawEmail": "Return-Path: &lt;jbrains@...&gt;\r\nX-Sender: jbrains@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 43057 invoked from network); 30 Jul 2003 17:09:17 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m11.grp.scd.yahoo.com with QMQP; 30 Jul 2003 17:09:17 -0000\r\nReceived: from unknown (HELO fep02-mail.bloor.is.net.cable.rogers.com) (66.185.86.72)\n  by mta3.grp.scd.yahoo.com with SMTP; 30 Jul 2003 17:09:16 -0000\r\nReceived: from barney ([24.156.43.226])\n          by fep02-mail.bloor.is.net.cable.rogers.com\n          (InterMail vM.5.01.05.12 201-253-122-126-112-20020820) with ESMTP\n          id &lt;20030730170833.JADQ155741.fep02-mail.bloor.is.net.cable.rogers.com@barney&gt;\n          for &lt;junit@yahoogroups.com&gt;; Wed, 30 Jul 2003 13:08:33 -0400\r\nMessage-ID: &lt;200307311309120022.0374FD69@...&gt;\r\nIn-Reply-To: &lt;001901c3561a$d2dca5c0$7778160a@...&gt;\r\nReferences: &lt;001901c3561a$d2dca5c0$7778160a@...&gt;\r\nX-Mailer: Calypso Version 3.30.00.00 (4)\r\nDate: Thu, 31 Jul 2003 13:09:12 -0400\r\nTo: junit@yahoogroups.com\r\nSubject: RE: [junit] TestCase Dependency Hierarchy\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Authentication-Info: Submitted using SMTP AUTH LOGIN at fep02-mail.bloor.is.net.cable.rogers.com from [24.156.43.226] using ID &lt;jbrains@...&gt; at Wed, 30 Jul 2003 13:08:33 -0400\r\nFrom: &quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;\r\nReply-To: jbr@...\r\nX-Yahoo-Group-Post: member; u=127224993\r\nX-Yahoo-Profile: nails762\r\n\r\n\n&gt;So said Adam Jack on 2003-07-29 --------------------\n&gt;J. B. Rainsberger [=\r\njbrains@...] replied:\n&gt;  &gt;But probably NOT within my desired effort =\r\nlevel. ;-)\n&gt;\n&gt;  Understood, but if it has to be done, then it has to be don=\r\ne....\n&gt;\n&gt;But I don&#39;t think it should have to be done. I think it is a perfe=\r\nctly fair\n&gt;thing to see removed from manual maintenance.\n\nAs we are slowly =\r\nconverging on the fact, no-one stops you from automating this maintenance t=\r\no the degree that you can.\n\n&gt;  JUnit provides a simple, default way to buil=\r\nd a test suite from a\n&gt;TestCase\n&gt;subclass. Beyond that, it&#39;s your job to bu=\r\nild the suite you want. My point\n&gt;is simple -- and I think you keep missing=\r\n it -- do whatever you need to\n&gt;build a test suite, but don&#39;t mistake those=\r\n custom building process for\n&gt;something that belongs in the framework. Don&#39;=\r\nt confuse TestSuite, which is\n&gt;part of the framework, with creating instanc=\r\nes of TestSuite, which is your\n&gt;job. To make it simpler, JUnit provides one=\r\n way to do it....\n&gt;\n&gt;I&#39;ve not been missing your point (not completely, alth=\r\nough I get it more\n&gt;each time) but this is the crux of my argument: If (big=\r\n IF) suites are\n&gt;testcase dependencies, \n\nThey absolutely, positively are N=\r\nOT. I cannot stress this enough. A TestSuite is an arbitrary collection of =\r\nTest objects, and nothing more.\n\n&gt;then I don&#39;t think it ought be the user&#39;s=\r\n job to\n&gt;manage them -- I think the framework should.\n\nSince your hypothesi=\r\ns is wrong, your conclusion is not meaningful. :) (That&#39;s logic&#39;s fault, no=\r\nt mine.)\n\n&gt; It is easy for me (outside the\n&gt;code) to say this, but I think =\r\nthey were a useful construct before, but\n&gt;they\n&gt;may have outlived their use=\r\nfulness. I posit that suites are the existing\n&gt;hammer, so they are making t=\r\nhings seem like a nail.\n\nI don&#39;t understand this statement at all. A TestSu=\r\nite is just a composite collection of tests. What else do you propose to us=\r\ne?\n\n&gt;    &gt;My examples were just simple ones. Dependency can be in the eye o=\r\nf the\n&gt;    &gt;beholder... :-)\n&gt;\n&gt;    I don&#39;t know that it can be: dependency =\r\nis or is not.\n&gt;\n&gt;I was saying dependency due to aggregation, you were sayin=\r\ng dependency due\n&gt;to feature. I was agreeing that users could set dependenc=\r\ny for whatever\n&gt;reason they chose.\n\nI see, yes.\n\n&lt;snip /&gt;\n&gt;\n&gt;      Maybe I =\r\nmisunderstand Test Collectors -- point me to something to\n&gt;learn more, if y=\r\nou don&#39;t mind\n&gt;     -- but don&#39;t they just       create TestSuite objects?\n=\r\n&gt;\n&gt;Unfortunately I don&#39;t have that information, I know they scan classpaths=\r\n\n&gt;and\n&gt;match class patterns (e.g. *Test*). I assume they build a testsuite =\r\n(or\n&gt;collection of such) but I don&#39;t know, sorry. Taking a brief look at so=\r\nme\n&gt;ant\n&gt;code they may even use an array/enumeration of testcases & their o=\r\nwn\n&gt;runner,\n&gt;but I can&#39;t be sure.\n\nThe bottom line is that the mechanism is=\r\n essentially the same as a TestSuite, and a TestSuite is just a collection!=\r\n\n\n&gt;      Your way to declare a test suite is already supported by JUnit and=\r\n a\n&gt;little    cute refactoring.\n&gt;\n&gt;      Consider the AllTests pattern. I c=\r\nan reduce it to a collection of\n&gt;AllTests or  TestCase class names with a l=\r\nittle neat refactoring. Then I\n&gt;can\n&gt;use that little engine to store AllTes=\r\nts as text. The next step is to\n&gt;generate that text by doing a directory sc=\r\nan. Now I have a TestSuite\n&gt;builder\n&gt;that build tests from a part of the fi=\r\nle system.\n&gt;\n&gt;      I did nothing to change JUnit. I just decorated it. Doe=\r\ns it belong in\n&gt;the framework? I don&#39;t think so. That&#39;s a question of taste=\r\n, in my opinion.\n&gt;\n&gt;Great explanation of your position, and good summary of=\r\n the crux of this\n&gt;discussion as it stands. My views to follow.\n&gt;\n&gt;So I thi=\r\nnk we understand each other quite well -- I just don&#39;t understand\n&gt;why you =\r\nthink this feature you suggest should be part of the framework? Why\n&gt;isn&#39;t =\r\nit a candidate for JUnit-addons or something like that?\n&gt;\n&gt;A few responses:=\r\n\n&gt;\n&gt;1) Perhaps set the clock back. What say the original implementation had=\r\n\n&gt;test\n&gt;case dependency, not test suites. Who is to say that suites warrant=\r\n\n&gt;inclusion but dependencies do not? Maybe suites must stay  for backwards\n=\r\n&gt;compatibility (although I feel they are declining in usage) but why\n&gt;ought=\r\nn&#39;t\n&gt;dependency be there?\n\nIf you haven&#39;t already, read Kent Beck&#39;s origina=\r\nl paper where he develops SUnit. Perhaps some insight from there will help.=\r\n\n\nYour underlying hypothesis appears to be this:\n\nIf class A depends on B, =\r\nthen there exist tests T(A) that test A and tests T(B) that test B such tha=\r\nt T(A) depends on T(B).\n\nIt is on this basis that you want JUnit to manage =\r\nthose dependencies. I claim first that JUnit can&#39;t, and second that JUnit s=\r\nhouldn&#39;t.\n\n1. JUnit can&#39;t manage the dependencies without human interventio=\r\nn.\n2. JUnit shouldn&#39;t manage the dependencies because they are not universa=\r\nl.\n\nI do not view dependencies the way you do. What we have in common, thou=\r\ngh, is that we each need to be able to execute different collections of tes=\r\nts at different times. This is why the former is not a part of the framewor=\r\nk and the latter is. That is the essence of framework. What you want to bui=\r\nld is a tool. So build it.\n\n&gt;2) I think dependency needs to be managed on t=\r\nhe testcase, hence be an\n&gt;optional aspect of that class. I think separating=\r\n this out into a separate\n&gt;structure (like suite) is a recipe for rust. ***=\r\nThis is why I think it\n&gt;needs\n&gt;to be part of the framework, not an add on.*=\r\n**\n\nDisagree. I don&#39;t want that feature. I&#39;m sure I&#39;m not alone (Dave?). Fo=\r\nr that reason, adding it to the framework makes the framework noisy. A fram=\r\nework ought to include what&#39;s needed for universal solutions and nothing mo=\r\nre. Everything else is a tool.\n\n&gt;3) Given test collectors (classpath/direct=\r\nory scanners) -- and given things\n&gt;like Eclipse testcase wizards --- I beli=\r\neve suites are fading out of\n&gt;consciousness. As such, I think it is less to=\r\n learn to say &quot;my testcase\n&gt;depends upon these testcases&quot; than learn a the =\r\ntestsuite concept.\n\nGet this straight: TEST CASE DEPENDENCY IS EVIL. Test c=\r\nases should be as independent as possible. It should be possible to select =\r\na number of tests and just run them. JUnit supports that. You can build you=\r\nr TestSuite however you want. The fact that there aren&#39;t better tools for t=\r\nhis surprises me.\n\nThis mailing list has several messages showing people sc=\r\nratching their heads over which tests to run instead of just creating a Tes=\r\ntSuite with the tests they want. It&#39;s like THEY DON&#39;T REALIZE that a TestSu=\r\nite can contain any tests they want -- even if they belong to completely di=\r\nfferent TestCase objects, and so on. They are in jail: their view is narrow=\r\ned artificially by not seeing the simplicity of TestSuite: it&#39;s just a coll=\r\nection of tests. Collect &#39;em however you want.\n\nYou want to collect &#39;em by =\r\ntest case dependency -- however *YOU* define it -- then go write the code t=\r\no do it. It ain&#39;t that hard. It still doesn&#39;t belong in the framework, beca=\r\nuse IT IS NOT UNIVERSAL USAGE. It is a narrow view of how to put tests toge=\r\nther.\n\nYou see Test Collectors as a replacement for TestSuite objects. With=\r\n respect, that&#39;s absurd, unless the JUnit test runner is not adequate for t=\r\nheir task. Still, why they decide to reinvent the wheel, I can&#39;t imagine.\n\n=\r\n&gt;4) I believe (IMHO -- w/ no market research, just based on projects I know=\r\n)\n&gt;that dependency has great user benefit than manual test suite. As such, =\r\nI&#39;d\n&gt;like it in the framework to aid the most users.\n\nIf you need to collec=\r\nt tests based on your notion of dependency, then you would be a complete id=\r\niot to continue maintaining test suites manually. Eventually you should aut=\r\nomate that work. Why do you insist on comparing automated tasks to manual o=\r\nnes?\n\n&gt;Remember that my goal -- Kent&#39;s goal, too -- is to keep JUnit very t=\r\night\n&gt;and\n&gt;small. It should provide just enough for everyone, rather than a=\r\n glut of\n&gt;features that have limited use. The less to learn, the better. If=\r\n you need\n&gt;more, grab add-on package X, add-on package Y and add-on package=\r\n Z.\n&gt;\n&gt;I can understand that goal, and I might agree w/ it academically. Th=\r\nat\n&gt;said,\n&gt;I think product purity comes (a close) second to usability. And =\r\neven with\n&gt;that said, I don&#39;t see how your goal counters what I suggested &=\r\n doesn&#39;t\n&gt;fit\n&gt;it.\n\nBecause your need is not my need, so don&#39;t pollute JUni=\r\nt with things that only some people need. That&#39;s not a framework.\n\n&gt;      A=\r\nlso, the more magic in the package, the less the users need to learn\n&gt;to us=\r\ne it. I want them to know what they&#39;re doing.\n&gt;\n&gt;My goal is better testing =\r\nthrough easier test management, easier test\n&gt;result\n&gt;analysis. That said, I=\r\n don&#39;t see how the approach I am suggesting doesn&#39;t\n&gt;fit this.\n\nSo build it=\r\n. I&#39;m sure people will use it. It doesn&#39;t belong in the framework.\n\n&gt;BTW: L=\r\nong before the end of this mail I&#39;ve started to realize that this\n&gt;whole e-=\r\nmail chain is an academic exercise, unlikely to result in change.\n&gt;JUnit st=\r\nill rocks, and I use it fervently, this was just a random thought\n&gt;that see=\r\nmed to feel like an epiphany so I posted it...\n\nWell, in general, JUnit doe=\r\nsn&#39;t change much. That&#39;s intentional. That&#39;s why we have projects like JUni=\r\nt-addons, GSBase and so on.\n\nYou feel a need. If no-one has implemented it,=\r\n then it&#39;s up to you. Either way, it does not have universal appeal, so it =\r\ndoes not belong in the framework. That&#39;s all. It&#39;s very, very simple.\n\nTake=\r\n care. I think we&#39;re done here. :)\n\n\n\n&gt;\n&gt;regards,\n&gt;\n&gt;Adam\n&gt;\n&gt;\n&gt;\n&gt;[Non-text =\r\nportions of this message have been removed]\n&gt;\n&gt;\n&gt;Yahoo! Groups Sponsor\n&gt;ADV=\r\nERTISEMENT\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;To unsubscribe from this group, send an email to:\n&gt;juni=\r\nt-unsubscribe@yahoogroups.com\n&gt;\n&gt;\n&gt;Your use of Yahoo! Groups is subject to =\r\nthe Yahoo! Terms of Service.\nJ. B. Rainsberger,\nPresident, Diaspar Software=\r\n Services\nLet&#39;s write software that people understand.\nhttp://www.diasparso=\r\nftware.com/\ntelephone: +1 416 791-8603\n\n\n", 
    "profile": "nails762", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "prevInTime": 8862, 
    "contentTrasformed": false, 
    "postDate": "1059671352", 
    "canDelete": false, 
    "nextInTopic": 8868, 
    "prevInTopic": 8857, 
    "headers": {
        "inReplyToHeader": "PDAwMTkwMWMzNTYxYSRkMmRjYTVjMCQ3Nzc4MTYwYUBzeWJhc2UuY29tPg==", 
        "messageIdInHeader": "PDIwMDMwNzMxMTMwOTEyMDAyMi4wMzc0RkQ2OUBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDAwMTkwMWMzNTYxYSRkMmRjYTVjMCQ3Nzc4MTYwYUBzeWJhc2UuY29tPg=="
    }
}