{
    "numMessagesInTopic": 106, 
    "nextInTime": 8864, 
    "senderId": "TN8fwZ1VnO0h3W1glM91oM6CV6onmYpaF29UL2vroufS7_nELHHBoT21m6TUzJ2l9JIjpIhah-K5Hy_OhnPH-ABTuVNik1eoZOH_uFXu-Q", 
    "systemMessage": false, 
    "subject": "RE: [junit] TestCase Dependency Hierarchy", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... As we are slowly converging on the fact, no-one stops you from automating this maintenance to the degree that you can. ... They absolutely, positively are", 
    "msgId": 8863, 
    "profile": "nails762", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-558452754\"><blockquote><span title=\"ireply\">&gt;So said Adam Jack on 2003-07-29 --------------------<br/>\n&gt;J. B. Rainsberger [<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jbrains@...\">jbrains@...</a>] replied:<br/>\n&gt;  &gt;But probably NOT within my desired effort level. ;-)<br/>\n&gt;<br/>\n&gt;  Understood, but if it has to be done, then it has to be done....<br/>\n&gt;<br/>\n&gt;But I don&#39;t think it should have to be done. I think it is a perfectly fair<br/>\n&gt;thing to see removed from manual maintenance.<br/>\n<br/>\n </span></blockquote>As we are slowly converging on the fact, no-one stops you from automating this maintenance to the degree that you can.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  JUnit provides a simple, default way to build a test suite from a<br/>\n&gt;TestCase<br/>\n&gt;subclass. Beyond that, it&#39;s your job to build the suite you want. My point<br/>\n&gt;is simple -- and I think you keep missing it -- do whatever you need to<br/>\n&gt;build a test suite, but don&#39;t mistake those custom building process for<br/>\n&gt;something that belongs in the framework. Don&#39;t confuse TestSuite, which is<br/>\n&gt;part of the framework, with creating instances of TestSuite, which is your<br/>\n&gt;job. To make it simpler, JUnit provides one way to do it....<br/>\n&gt;<br/>\n&gt;I&#39;ve not been missing your point (not completely, although I get it more<br/>\n&gt;each time) but this is the crux of my argument: If (big IF) suites are<br/>\n&gt;testcase dependencies, <br/>\n<br/>\n </span></blockquote>They absolutely, positively are NOT. I cannot stress this enough. A TestSuite is an arbitrary collection of Test objects, and nothing more.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;then I don&#39;t think it ought be the user&#39;s job to<br/>\n&gt;manage them -- I think the framework should.<br/>\n<br/>\n </span></blockquote>Since your hypothesis is wrong, your conclusion is not meaningful. :) (That&#39;s logic&#39;s fault, not mine.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It is easy for me (outside the<br/>\n&gt;code) to say this, but I think they were a useful construct before, but<br/>\n&gt;they<br/>\n&gt;may have outlived their usefulness. I posit that suites are the existing<br/>\n&gt;hammer, so they are making things seem like a nail.<br/>\n<br/>\n </span></blockquote>I don&#39;t understand this statement at all. A TestSuite is just a composite collection of tests. What else do you propose to use?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;    &gt;My examples were just simple ones. Dependency can be in the eye of the<br/>\n&gt;    &gt;beholder... :-)<br/>\n&gt;<br/>\n&gt;    I don&#39;t know that it can be: dependency is or is not.<br/>\n&gt;<br/>\n&gt;I was saying dependency due to aggregation, you were saying dependency due<br/>\n&gt;to feature. I was agreeing that users could set dependency for whatever<br/>\n&gt;reason they chose.<br/>\n<br/>\n </span></blockquote>I see, yes.<br/>\n<br/>\n&lt;snip /&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;      Maybe I misunderstand Test Collectors -- point me to something to<br/>\n&gt;learn more, if you don&#39;t mind<br/>\n&gt;     -- but don&#39;t they just       create TestSuite objects?<br/>\n&gt;<br/>\n&gt;Unfortunately I don&#39;t have that information, I know they scan classpaths<br/>\n&gt;and<br/>\n&gt;match class patterns (e.g. *Test*). I assume they build a testsuite (or<br/>\n&gt;collection of such) but I don&#39;t know, sorry. Taking a brief look at some<br/>\n&gt;ant<br/>\n&gt;code they may even use an array/enumeration of testcases & their own<br/>\n&gt;runner,<br/>\n&gt;but I can&#39;t be sure.<br/>\n<br/>\n </span></blockquote>The bottom line is that the mechanism is essentially the same as a TestSuite, and a TestSuite is just a collection!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;      Your way to declare a test suite is already supported by JUnit and a<br/>\n&gt;little    cute refactoring.<br/>\n&gt;<br/>\n&gt;      Consider the AllTests pattern. I can reduce it to a collection of<br/>\n&gt;AllTests or  TestCase class names with a little neat refactoring. Then I<br/>\n&gt;can<br/>\n&gt;use that little engine to store AllTests as text. The next step is to<br/>\n&gt;generate that text by doing a directory scan. Now I have a TestSuite<br/>\n&gt;builder<br/>\n&gt;that build tests from a part of the file system.<br/>\n&gt;<br/>\n&gt;      I did nothing to change JUnit. I just decorated it. Does it belong in<br/>\n&gt;the framework? I don&#39;t think so. That&#39;s a question of taste, in my opinion.<br/>\n&gt;<br/>\n&gt;Great explanation of your position, and good summary of the crux of this<br/>\n&gt;discussion as it stands. My views to follow.<br/>\n&gt;<br/>\n&gt;So I think we understand each other quite well -- I just don&#39;t understand<br/>\n&gt;why you think this feature you suggest should be part of the framework? Why<br/>\n&gt;isn&#39;t it a candidate for JUnit-addons or something like that?<br/>\n&gt;<br/>\n&gt;A few responses:<br/>\n&gt;<br/>\n&gt;1) Perhaps set the clock back. What say the original implementation had<br/>\n&gt;test<br/>\n&gt;case dependency, not test suites. Who is to say that suites warrant<br/>\n&gt;inclusion but dependencies do not? Maybe suites must stay  for backwards<br/>\n&gt;compatibility (although I feel they are declining in usage) but why<br/>\n&gt;oughtn&#39;t<br/>\n&gt;dependency be there?<br/>\n<br/>\n </span></blockquote>If you haven&#39;t already, read Kent Beck&#39;s original paper where he develops SUnit. Perhaps some insight from there will help.<br/>\n<br/>\nYour underlying hypothesis appears to be this:<br/>\n<br/>\nIf class A depends on B, then there exist tests T(A) that test A and tests T(B) that test B such that T(A) depends on T(B).<br/>\n<br/>\nIt is on this basis that you want JUnit to manage those dependencies. I claim first that JUnit can&#39;t, and second that JUnit shouldn&#39;t.<br/>\n<br/>\n1. JUnit can&#39;t manage the dependencies without human intervention.<br/>\n2. JUnit shouldn&#39;t manage the dependencies because they are not universal.<br/>\n<br/>\nI do not view dependencies the way you do. What we have in common, though, is that we each need to be able to execute different collections of tests at different times. This is why the former is not a part of the framework and the latter is. That is the essence of framework. What you want to build is a tool. So build it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;2) I think dependency needs to be managed on the testcase, hence be an<br/>\n&gt;optional aspect of that class. I think separating this out into a separate<br/>\n&gt;structure (like suite) is a recipe for rust. ***This is why I think it<br/>\n&gt;needs<br/>\n&gt;to be part of the framework, not an add on.***<br/>\n<br/>\n </span></blockquote>Disagree. I don&#39;t want that feature. I&#39;m sure I&#39;m not alone (Dave?). For that reason, adding it to the framework makes the framework noisy. A framework ought to include what&#39;s needed for universal solutions and nothing more. Everything else is a tool.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;3) Given test collectors (classpath/directory scanners) -- and given things<br/>\n&gt;like Eclipse testcase wizards --- I believe suites are fading out of<br/>\n&gt;consciousness. As such, I think it is less to learn to say &quot;my testcase<br/>\n&gt;depends upon these testcases&quot; than learn a the testsuite concept.<br/>\n<br/>\n </span></blockquote>Get this straight: TEST CASE DEPENDENCY IS EVIL. Test cases should be as independent as possible. It should be possible to select a number of tests and just run them. JUnit supports that. You can build your TestSuite however you want. The fact that there aren&#39;t better tools for this surprises me.<br/>\n<br/>\nThis mailing list has several messages showing people scratching their heads over which tests to run instead of just creating a TestSuite with the tests they want. It&#39;s like THEY DON&#39;T REALIZE that a TestSuite can contain any tests they want -- even if they belong to completely different TestCase objects, and so on. They are in jail: their view is narrowed artificially by not seeing the simplicity of TestSuite: it&#39;s just a collection of tests. Collect &#39;em however you want.<br/>\n<br/>\nYou want to collect &#39;em by test case dependency -- however *YOU* define it -- then go write the code to do it. It ain&#39;t that hard. It still doesn&#39;t belong in the framework, because IT IS NOT UNIVERSAL USAGE. It is a narrow view of how to put tests together.<br/>\n<br/>\nYou see Test Collectors as a replacement for TestSuite objects. With respect, that&#39;s absurd, unless the JUnit test runner is not adequate for their task. Still, why they decide to reinvent the wheel, I can&#39;t imagine.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;4) I believe (IMHO -- w/ no market research, just based on projects I know)<br/>\n&gt;that dependency has great user benefit than manual test suite. As such, I&#39;d<br/>\n&gt;like it in the framework to aid the most users.<br/>\n<br/>\n </span></blockquote>If you need to collect tests based on your notion of dependency, then you would be a complete idiot to continue maintaining test suites manually. Eventually you should automate that work. Why do you insist on comparing automated tasks to manual ones?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Remember that my goal -- Kent&#39;s goal, too -- is to keep JUnit very tight<br/>\n&gt;and<br/>\n&gt;small. It should provide just enough for everyone, rather than a glut of<br/>\n&gt;features that have limited use. The less to learn, the better. If you need<br/>\n&gt;more, grab add-on package X, add-on package Y and add-on package Z.<br/>\n&gt;<br/>\n&gt;I can understand that goal, and I might agree w/ it academically. That<br/>\n&gt;said,<br/>\n&gt;I think product purity comes (a close) second to usability. And even with<br/>\n&gt;that said, I don&#39;t see how your goal counters what I suggested & doesn&#39;t<br/>\n&gt;fit<br/>\n&gt;it.<br/>\n<br/>\n </span></blockquote>Because your need is not my need, so don&#39;t pollute JUnit with things that only some people need. That&#39;s not a framework.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;      Also, the more magic in the package, the less the users need to learn<br/>\n&gt;to use it. I want them to know what they&#39;re doing.<br/>\n&gt;<br/>\n&gt;My goal is better testing through easier test management, easier test<br/>\n&gt;result<br/>\n&gt;analysis. That said, I don&#39;t see how the approach I am suggesting doesn&#39;t<br/>\n&gt;fit this.<br/>\n<br/>\n </span></blockquote>So build it. I&#39;m sure people will use it. It doesn&#39;t belong in the framework.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;BTW: Long before the end of this mail I&#39;ve started to realize that this<br/>\n&gt;whole e-mail chain is an academic exercise, unlikely to result in change.<br/>\n&gt;JUnit still rocks, and I use it fervently, this was just a random thought<br/>\n&gt;that seemed to feel like an epiphany so I posted it...<br/>\n<br/>\n </span></blockquote>Well, in general, JUnit doesn&#39;t change much. That&#39;s intentional. That&#39;s why we have projects like JUnit-addons, GSBase and so on.<br/>\n<br/>\nYou feel a need. If no-one has implemented it, then it&#39;s up to you. Either way, it does not have universal appeal, so it does not belong in the framework. That&#39;s all. It&#39;s very, very simple.<br/>\n<br/>\nTake care. I think we&#39;re done here. :)<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;regards,<br/>\n&gt;<br/>\n&gt;Adam<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;[Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;Yahoo! Groups Sponsor<br/>\n&gt;ADVERTISEMENT<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;To unsubscribe from this group, send an email to:<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n </span></blockquote>J. B. Rainsberger,<br/>\nPresident, Diaspar Software Services<br/>\nLet&#39;s write software that people understand.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com/\">http://www.diasparsoftware.com/</a><br/>\ntelephone: +1 416 791-8603</div>", 
    "prevInTime": 8862, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059671352", 
    "canDelete": false, 
    "nextInTopic": 8868, 
    "prevInTopic": 8857, 
    "headers": {
        "inReplyToHeader": "PDAwMTkwMWMzNTYxYSRkMmRjYTVjMCQ3Nzc4MTYwYUBzeWJhc2UuY29tPg==", 
        "messageIdInHeader": "PDIwMDMwNzMxMTMwOTEyMDAyMi4wMzc0RkQ2OUBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDAwMTkwMWMzNTYxYSRkMmRjYTVjMCQ3Nzc4MTYwYUBzeWJhc2UuY29tPg=="
    }
}