{
    "numMessagesInTopic": 106, 
    "nextInTime": 8869, 
    "senderId": "1pXmuCiC-FYv2hg84R0r1aafaAr1UlVDJlEBKY7uhsZC5Qhsjebj22tvynGJc1bhMpyc0Sx_BfxD8QNP6nfZxIY_d84zjySc", 
    "systemMessage": false, 
    "subject": "RE: [junit] TestCase Dependency Hierarchy", 
    "from": "&quot;Adam Jack&quot; &lt;ajack@...&gt;", 
    "authorName": "Adam Jack", 
    "msgSnippet": "I can t let this drop, not because I care if I am right or not (that is subjective) but because I feel that discussion is failing. I feel we are getting", 
    "msgId": 8868, 
    "profile": "arb_jack", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124707332, 
    "messageBody": "<div id=\"ygrps-yiv-18610477\">I can&#39;t let this drop, not because I care if I am &quot;right&quot; or not (that is subjective) but because I feel that discussion is failing. I feel we are getting circular and not progressing to a valid conclusion. I feel it would be letting down the idea to not give it my best shot. Also, I&#39;d really like to hear from others also, maybe this needs a new perspective.<br/>\n<br/>\n<br/>\nJ. B. Rainsberger [<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jbrains@...\">jbrains@...</a>] replied:<br/>\n<br/>\n  As we are slowly converging on the fact, no-one stops you from automating this maintenance to the degree   that you can.<br/>\n<br/>\nI do not beleive we are converging on that. You&#39;ve made that point, but I&#39;ve tried to counterpoint it, that isn&#39;t converging. I think this need to be in the framework for this to work with all environments & add ons.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;I&#39;ve not been missing your point (not completely, although I get it more<br/>\n &gt;each time) but this is the crux of my argument: If (big IF) suites are<br/>\n &gt;testcase dependencies, <br/>\n<br/>\n </span></blockquote> They absolutely, positively are NOT. I cannot stress this enough. A TestSuite is an arbitrary collection of Test objects, and nothing more.<br/>\n<br/>\n<br/>\nYou&#39;ve been having your cake and eating it, between e-mails -- not a good diet for thought. ;-)<br/>\n<br/>\nOne time you tell me to create hierarchies of suites to control run order (what I&#39;d like as dependency) and now you say this. Right now suites (and hierarchies of suiteS) are the closes thing to dependencies. That we agree upon, right?<br/>\n<br/>\nPersonally I&#39;d like to leave suites as collections of test cases, and I&#39;d like a separate concept for dependency. That said, I&#39;ll discuss it either way, please pick one.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;then I don&#39;t think it ought be the user&#39;s job to<br/>\n &gt;manage them -- I think the framework should.<br/>\n<br/>\n </span></blockquote> Since your hypothesis is wrong, your conclusion is not meaningful. :) (That&#39;s logic&#39;s fault, not mine.)<br/>\n<br/>\nActually, Bertrand Russell contended that from an incorrect hypothesis any conclusion can be proven, which has corrolary that all conclusions are therefore invalid. Hey, my conclusion could be the right one irrespective. ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt; It is easy for me (outside the<br/>\n &gt;code) to say this, but I think they were a useful construct before, but<br/>\n &gt;they<br/>\n &gt;may have outlived their usefulness. I posit that suites are the existing<br/>\n &gt;hammer, so they are making things seem like a nail.<br/>\n<br/>\n </span></blockquote> I don&#39;t understand this statement at all. A TestSuite is just a composite collection of tests. What else do you propose to use?<br/>\n<br/>\nAs I&#39;ve stated Eclipse users (plenty) and ant users (plenty) quite probably use none, their &quot;collection&quot; is &quot;all the test cases in my project that match *Test.class&quot;. Once I moved to these tools I deleted all my test suites.<br/>\n<br/>\nI could be wrong, but I suspect this is a growing trend.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;      Maybe I misunderstand Test Collectors <br/>\n </span></blockquote> The bottom line is that the mechanism is essentially the same as a TestSuite, and a TestSuite is just a collection!<br/>\n<br/>\nThe bottom line is that we have a single colelction w/o hierarchy, yes. The collectors seems to collect (perhaps by chance) by package/classname alphabetic order, i.e. effectively random. I am hoping to allow some order from that chaos.<br/>\n<br/>\n<br/>\n If you haven&#39;t already, read Kent Beck&#39;s original paper where he develops SUnit. Perhaps some insight from there will help.<br/>\n<br/>\nIs SUnit something new? Sorry, I have not -- can you point me to a link?<br/>\n<br/>\nI assume (from context) that Kent is the original auther, and that is fine (I am not knocking suites of old, they, like much of junit has been incredibly clever) and I think historically suites have been useful. That said, I just think that since collectors are more and more common that suites are obolete & we need a change.<br/>\n<br/>\n Your underlying hypothesis appears to be this:<br/>\n<br/>\n If class A depends on B, then there exist tests T(A) that test A and tests T(B) that test B such that T(A) depends on T(B).<br/>\n<br/>\nActaully, no (although it isn&#39;t something I object to for many use cases).<br/>\n<br/>\nI am merely asking that I can assert that T(A) depends on T(B) [for whatever reason] and I do so in T(A) [somehow] not in some separate suite(A).<br/>\n<br/>\n<br/>\n It is on this basis that you want JUnit to manage those dependencies. I claim first that JUnit can&#39;t, and second that JUnit shouldn&#39;t.<br/>\n<br/>\n 1. JUnit can&#39;t manage the dependencies without human intervention.<br/>\n<br/>\nAgreed, but how much? I am asking for simple assertions, not manualy managing separate files. Managing anything in two places is a recipe for error.<br/>\n<br/>\n 2. JUnit shouldn&#39;t manage the dependencies because they are not universal.<br/>\n<br/>\n I do not view dependencies the way you do. What we have in common, though, is that we each need to be able to execute different collections of tests at different times. This is why the former is not a part of the framework and the latter is. That is the essence of framework. What you want to build is a tool. So build it.<br/>\n<br/>\nActually, here you are wrong -- and I think here is where things are changng. I no long run groups of tests at once, I run 1 or I run ALL --- I no longer run groups. We do not have that in common. (CPU is cheap, I don&#39;t care to try to figure out which code effects what tests, I run all tests before I check in changes. If one breaks, I might re-run it.)<br/>\n<br/>\nSo, since I don&#39;t uses suites -- are they a tool? Ought you remove them from junit in order to make it tighter? ;-) [Jokng aside, why not?]<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;2) I think dependency needs to be managed on the testcase, hence be an<br/>\n &gt;optional aspect of that class. I think separating this out into a separate<br/>\n &gt;structure (like suite) is a recipe for rust. ***This is why I think it<br/>\n &gt;needs<br/>\n &gt;to be part of the framework, not an add on.***<br/>\n<br/>\n </span></blockquote> Disagree. I don&#39;t want that feature. I&#39;m sure I&#39;m not alone (Dave?). For that reason, adding it to the framework makes the framework noisy. A framework ought to include what&#39;s needed for universal solutions and nothing more. Everything else is a tool.<br/>\n<br/>\nI&#39;d like to have other inputs to this discussion. I think a lot of this comes down to user choice, how one works, what environment one works in, and so we need more than two people to make it valuable...<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;3) Given test collectors (classpath/directory scanners) -- and given things<br/>\n &gt;like Eclipse testcase wizards --- I believe suites are fading out of<br/>\n &gt;consciousness. As such, I think it is less to learn to say &quot;my testcase<br/>\n &gt;depends upon these testcases&quot; than learn a the testsuite concept.<br/>\n<br/>\n </span></blockquote> Get this straight: TEST CASE DEPENDENCY IS EVIL. Test cases should be as independent as possible. It should be possible to select a number of tests and just run them. JUnit supports that. You can build your TestSuite however you want. The fact that there aren&#39;t better tools for this surprises me.<br/>\n<br/>\nNo, here .... you are wrong. I beleive you mean that test cases ought have no &quot;results&quot; or &quot;side effects&quot; that other test cases depended upon. That is EVIL!!! Agreed, 100%.<br/>\n<br/>\nRun order (call it dependency order or whatever) that is not evil. If my collection object fails, why run the test of things that use it & waste time debugging their failures? Even if by chance they worked, so what, trim down the results a human has to think over.<br/>\n<br/>\n<br/>\n You want to collect &#39;em by test case dependency -- however *YOU* define it -- then go write the code to do it. It ain&#39;t that hard. It still doesn&#39;t belong in the framework, because IT IS NOT UNIVERSAL USAGE. It is a narrow view of how to put tests together.<br/>\n<br/>\nI am saying introduce dependency as a concept, then allow folks to use it however they chose.<br/>\n<br/>\n You see Test Collectors as a replacement for TestSuite objects. With respect, that&#39;s absurd, unless the JUnit test runner is not adequate for their task. Still, why they decide to reinvent the wheel, I can&#39;t imagine.<br/>\n<br/>\n<br/>\nIt may be absurd, it may be correct, only time (and a lot more view points that our two) will tell. If it is re-inventing te whell, perhaps it is going from a stiff wooden cart wheel to one with spokes and rubber tires. ;-) Change can lead to improvements...<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;4) I believe (IMHO -- w/ no market research, just based on projects I know)<br/>\n &gt;that dependency has great user benefit than manual test suite. As such, I&#39;d<br/>\n &gt;like it in the framework to aid the most users.<br/>\n<br/>\n </span></blockquote> If you need to collect tests based on your notion of dependency, then you would be a complete idiot to continue maintaining test suites manually. Eventually you should automate that work. Why do you insist on comparing automated tasks to manual ones?<br/>\n<br/>\nI am saying create the mechanism (it needs to be in the framework in order to be implementable, you never address that comment I made) and let tool be on top. I agree -- some wizard to introspect A to see it aggregates B to set T(A) dpendent upon T(B) ought be some outside tool, that is fine. However, I do not beleive that dependency ought be a tool, it does not need to be automated, it is just a facility that users or scripts could use.<br/>\n<br/>\n Because your need is not my need, so don&#39;t pollute JUnit with things that only some people need. That&#39;s not a framework.<br/>\n<br/>\nThen (again) take suites out. ;-)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;BTW: Long before the end of this mail I&#39;ve started to realize that this<br/>\n &gt;whole e-mail chain is an academic exercise, unlikely to result in change.<br/>\n &gt;JUnit still rocks, and I use it fervently, this was just a random thought<br/>\n &gt;that seemed to feel like an epiphany so I posted it...<br/>\n<br/>\n </span></blockquote> Well, in general, JUnit doesn&#39;t change much. That&#39;s intentional. That&#39;s why we have projects like JUnit-addons, GSBase and so on.<br/>\n<br/>\nI agree with the goal, but some things are worth change. Although I&#39;ve followed your arguments (and support them) about keeping frameworks simple/pure & add-ons outside, (respectfully) I don&#39;t beleive you are fully opening you mind to that option. Lack of change is not an argument in itself. Sometimes the further you are from something the easier it is to see something, and I feel you are too close to junit and the goal of keeping it simple to see this does not break that. Thaa said, maybe I&#39;ve just failed to explain it. Want me to start again?<br/>\n<br/>\nPerhaps others have a point of view, I really do think a lot of this comes down to user choice and use cases.<br/>\n<br/>\nregards<br/>\n<br/>\nAdam<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 8867, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059597478", 
    "canDelete": false, 
    "nextInTopic": 8871, 
    "prevInTopic": 8863, 
    "headers": {
        "messageIdInHeader": "PDAwMGQwMWMzNTZkYSQ3Njc4NzE5MCRmMTI5MTQwYUB0c2MuY29tPg=="
    }
}