{
    "numMessagesInTopic": 106, 
    "nextInTime": 8872, 
    "senderId": "va8IK98TuU8Cyry6V1_Xk3bm0EWPGyT3hAfiECGb2bl1OcFjZPJp4xflPxNyHtN105fcRjY04pSvTWGmQbhWWej91lcwQx8BvLevWLbjtw", 
    "systemMessage": false, 
    "subject": "RE: [junit] TestCase Dependency Hierarchy", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... That is precisely the reason that I want to stop.  ... Believe it all you want, but it is crystal clear to me that this statement is not true. ", 
    "msgId": 8871, 
    "profile": "nails762", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-1904142353\"><blockquote><span title=\"ireply\">&gt;So said Adam Jack on 2003-07-30 --------------------<br/>\n&gt;<br/>\n&gt;I can&#39;t let this drop, not because I care if I am &quot;right&quot; or not (that is<br/>\n&gt;subjective) but because I feel that discussion is failing. I feel we are<br/>\n&gt;getting circular and not progressing to a valid conclusion. <br/>\n<br/>\n </span></blockquote>That is precisely the reason that I want to stop.<br/>\n<br/>\n&lt;snip /&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt;J. B. Rainsberger [<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jbrains@...\">jbrains@...</a>] replied:<br/>\n&gt;<br/>\n&gt;  As we are slowly converging on the fact, no-one stops you from<br/>\n&gt;automating this maintenance to the degree   that you can.<br/>\n&gt;<br/>\n&gt;I do not beleive we are converging on that. You&#39;ve made that point, but<br/>\n&gt;I&#39;ve tried to counterpoint it, that isn&#39;t converging. I think this need to<br/>\n&gt;be in the framework for this to work with all environments & add ons.<br/>\n<br/>\n </span></blockquote>Believe it all you want, but it is crystal clear to me that this statement is not true.<br/>\n<br/>\nSuppose you write a test collector that uses metadata from, say, Javadoc comments to compute a dependency graph, from which an object creates the corresponding TestSuite object. Under what cirucmstance will this *not* work?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I&#39;ve not been missing your point (not completely, although I get it more<br/>\n&gt;&gt;each time) but this is the crux of my argument: If (big IF) suites are<br/>\n&gt;&gt;testcase dependencies, <br/>\n&gt;<br/>\n&gt;They absolutely, positively are NOT. I cannot stress this enough. A<br/>\n&gt;TestSuite is an arbitrary collection of Test objects, and nothing more.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;You&#39;ve been having your cake and eating it, between e-mails -- not a good<br/>\n&gt;diet for thought. ;-)<br/>\n&gt;<br/>\n&gt;One time you tell me to create hierarchies of suites to control run order<br/>\n&gt;(what I&#39;d like as dependency) and now you say this. Right now suites (and<br/>\n&gt;hierarchies of suiteS) are the closes thing to dependencies. That we agree<br/>\n&gt;upon, right?<br/>\n<br/>\n </span></blockquote>You can use TestSuite objects to control run order. That is a specific case of using a TestSuite object to store an arbitrary collection of tests. There is no discrepancy there. Show me why the statements are mutually contradictory.<br/>\n<br/>\nGranted, we in the Test-Driven Development world advise against enforcing run order, but JUnit permits it because it&#39;s a general case. The fact that we do not intentionally rely on the order in which JUnit places our tests is merely a detail.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Personally I&#39;d like to leave suites as collections of test cases, and I&#39;d<br/>\n&gt;like a separate concept for dependency. That said, I&#39;ll discuss it either<br/>\n&gt;way, please pick one.<br/>\n<br/>\n </span></blockquote>Have all the searate concepts you want. If by dependency you simply mean &quot;run order&quot;, then it is simple to build a test suite from a desired run order. Express your desired run order any way you want. This solution is fully compatible with JUnit. Case closed.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;then I don&#39;t think it ought be the user&#39;s job to<br/>\n&gt;&gt;manage them -- I think the framework should.<br/>\n&gt;<br/>\n&gt;Since your hypothesis is wrong, your conclusion is not meaningful. :)<br/>\n&gt;(That&#39;s logic&#39;s fault, not mine.)<br/>\n&gt;<br/>\n&gt;Actually, Bertrand Russell contended that from an incorrect hypothesis any<br/>\n&gt;conclusion can be proven, which has corrolary that all conclusions are<br/>\n&gt;therefore invalid. Hey, my conclusion could be the right one irrespective.<br/>\n&gt;;-)<br/>\n<br/>\n </span></blockquote>How is that different from what I wrote?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; It is easy for me (outside the<br/>\n&gt;&gt;code) to say this, but I think they were a useful construct before, but<br/>\n&gt;&gt;they<br/>\n&gt;&gt;may have outlived their usefulness. I posit that suites are the existing<br/>\n&gt;&gt;hammer, so they are making things seem like a nail.<br/>\n&gt;<br/>\n&gt;I don&#39;t understand this statement at all. A TestSuite is just a composite<br/>\n&gt;collection of tests. What else do you propose to use?<br/>\n&gt;<br/>\n&gt;As I&#39;ve stated Eclipse users (plenty) and ant users (plenty) quite<br/>\n&gt;probably use none, their &quot;collection&quot; is &quot;all the test cases in my project<br/>\n&gt;that match *Test.class&quot;. Once I moved to these tools I deleted all my test<br/>\n&gt;suites.<br/>\n&gt;<br/>\n&gt;I could be wrong, but I suspect this is a growing trend.<br/>\n<br/>\n </span></blockquote>WRONG WRONG WRONG WRONG WRONG! Here is the basis of our divergence.<br/>\n<br/>\nYou deleted manually-maintained TestSuite objects. Ant builds TestSuite objects in the manner you describe. Eclipse builds TestSuite objects in the manner you describe. The only difference is that they build TestSuite objects on the fly instead of the manual mechanism of writing a custom TestSuite builder class every time.<br/>\n<br/>\nSee GSBase&#39;s RecursiveTestSuite or JUnit-addons&#39; DirectorySuiteBuilder for examples of the mechanism that Ant and Eclipse use.<br/>\n<br/>\nI have never suggested that you abandon these automated TestSuite builders and go back to building them by hand. All I have said is that everyone needs to build test suites differently, therefore do not hammer your particular needs into the framework. &quot;Particular needs&quot; do not belong in framework. That is precisely why they are frameworks and not tools.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;      Maybe I misunderstand Test Collectors <br/>\n&gt;The bottom line is that the mechanism is essentially the same as a<br/>\n&gt;TestSuite, and a TestSuite is just a collection!<br/>\n&gt;<br/>\n&gt;The bottom line is that we have a single colelction w/o hierarchy, yes.<br/>\n&gt;The collectors seems to collect (perhaps by chance) by package/classname<br/>\n&gt;alphabetic order, i.e. effectively random. I am hoping to allow some order<br/>\n&gt;from that chaos.<br/>\n<br/>\n </span></blockquote>It seems that Eclipse and Ant already do that effectively.<br/>\n<br/>\nIt sounds to me that you want to augment Eclipse or Ant&#39;s TestSuite building mechanisms. Nothing to do with JUnit itself.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If you haven&#39;t already, read Kent Beck&#39;s original paper where he develops<br/>\n&gt;SUnit. Perhaps some insight from there will help.<br/>\n&gt;<br/>\n&gt;Is SUnit something new? Sorry, I have not -- can you point me to a link?<br/>\n<br/>\n </span></blockquote>Good God, no: it is the Smalltalk-based predecessor of JUnit. Just Google &quot;Kent Beck Smalltalk Testing&quot;. You&#39;ll find it. (I remember keywords, not links.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I assume (from context) that Kent is the original auther, and that is fine<br/>\n&gt;(I am not knocking suites of old, they, like much of junit has been<br/>\n&gt;incredibly clever) and I think historically suites have been useful. That<br/>\n&gt;said, I just think that since collectors are more and more common that<br/>\n&gt;suites are obolete & we need a change.<br/>\n&gt;<br/>\n&gt;Your underlying hypothesis appears to be this:<br/>\n&gt;<br/>\n&gt;If class A depends on B, then there exist tests T(A) that test A and tests<br/>\n&gt;T(B) that test B such that T(A) depends on T(B).<br/>\n&gt;<br/>\n&gt;Actaully, no (although it isn&#39;t something I object to for many use cases).<br/>\n&gt;<br/>\n&gt;I am merely asking that I can assert that T(A) depends on T(B) [for<br/>\n&gt;whatever reason] and I do so in T(A) [somehow] not in some separate<br/>\n&gt;suite(A).<br/>\n<br/>\n </span></blockquote>So build it. Who stops you?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;It is on this basis that you want JUnit to manage those dependencies. I<br/>\n&gt;claim first that JUnit can&#39;t, and second that JUnit shouldn&#39;t.<br/>\n&gt;<br/>\n&gt;1. JUnit can&#39;t manage the dependencies without human intervention.<br/>\n&gt;<br/>\n&gt;Agreed, but how much? I am asking for simple assertions, not manualy<br/>\n&gt;managing separate files. Managing anything in two places is a recipe for<br/>\n&gt;error.<br/>\n<br/>\n </span></blockquote>How the hell did assertions get in here? What do assertions have to do with it?<br/>\n<br/>\nYou appear to want to express (not assert) dependencies as metadata and build dynamic test suites based on that data. Excellent goal. So build it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;2. JUnit shouldn&#39;t manage the dependencies because they are not universal.<br/>\n&gt;<br/>\n&gt;I do not view dependencies the way you do. What we have in common, though,<br/>\n&gt;is that we each need to be able to execute different collections of tests<br/>\n&gt;at different times. This is why the former is not a part of the framework<br/>\n&gt;and the latter is. That is the essence of framework. What you want to<br/>\n&gt;build is a tool. So build it.<br/>\n&gt;<br/>\n&gt;Actually, here you are wrong -- and I think here is where things are<br/>\n&gt;changng. I no long run groups of tests at once, I run 1 or I run ALL --- I<br/>\n&gt;no longer run groups. We do not have that in common. (CPU is cheap, I<br/>\n&gt;don&#39;t care to try to figure out which code effects what tests, I run all<br/>\n&gt;tests before I check in changes. If one breaks, I might re-run it.)<br/>\n&gt;<br/>\n&gt;So, since I don&#39;t uses suites -- are they a tool? Ought you remove them<br/>\n&gt;from junit in order to make it tighter? ;-) [Jokng aside, why not?]<br/>\n<br/>\n </span></blockquote>You are using suites; you&#39;re just not maintaining them by hand. Eclipse or Ant are using suites, but dynamic ones.<br/>\n<br/>\nYou appear to be confusing a TestSuite object with a custom-made, manually-maintained block of code that creates a TestSuite object. The AllTests pattern is an example of the latter. The latter creates the former. Surely you are not suggesting JUnit do away with the former.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;2) I think dependency needs to be managed on the testcase, hence be an<br/>\n&gt;&gt;optional aspect of that class. I think separating this out into a separate<br/>\n&gt;&gt;structure (like suite) is a recipe for rust. ***This is why I think it<br/>\n&gt;&gt;needs<br/>\n&gt;&gt;to be part of the framework, not an add on.***<br/>\n&gt;<br/>\n&gt;Disagree. I don&#39;t want that feature. I&#39;m sure I&#39;m not alone (Dave?). For<br/>\n&gt;that reason, adding it to the framework makes the framework noisy. A<br/>\n&gt;framework ought to include what&#39;s needed for universal solutions and<br/>\n&gt;nothing more. Everything else is a tool.<br/>\n&gt;<br/>\n&gt;I&#39;d like to have other inputs to this discussion. I think a lot of this<br/>\n&gt;comes down to user choice, how one works, what environment one works in,<br/>\n&gt;and so we need more than two people to make it valuable...<br/>\n<br/>\n </span></blockquote>EXACTLY! That&#39;s why the framework is the wrong place for it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;3) Given test collectors (classpath/directory scanners) -- and given<br/>\n&gt;things<br/>\n&gt;&gt;like Eclipse testcase wizards --- I believe suites are fading out of<br/>\n&gt;&gt;consciousness. As such, I think it is less to learn to say &quot;my testcase<br/>\n&gt;&gt;depends upon these testcases&quot; than learn a the testsuite concept.<br/>\n&gt;<br/>\n&gt;Get this straight: TEST CASE DEPENDENCY IS EVIL. Test cases should be as<br/>\n&gt;independent as possible. It should be possible to select a number of tests<br/>\n&gt;and just run them. JUnit supports that. You can build your TestSuite<br/>\n&gt;however you want. The fact that there aren&#39;t better tools for this<br/>\n&gt;surprises me.<br/>\n&gt;<br/>\n&gt;No, here .... you are wrong. I beleive you mean that test cases ought have<br/>\n&gt;no &quot;results&quot; or &quot;side effects&quot; that other test cases depended upon. That<br/>\n&gt;is EVIL!!! Agreed, 100%.<br/>\n&gt;<br/>\n&gt;Run order (call it dependency order or whatever) that is not evil. If my<br/>\n&gt;collection object fails, why run the test of things that use it & waste<br/>\n&gt;time debugging their failures? Even if by chance they worked, so what,<br/>\n&gt;trim down the results a human has to think over.<br/>\n<br/>\n </span></blockquote>OK, you&#39;re talking about orthogonality: one problem, one failure. Your tests are not orthogonal (which is common -- it&#39;s tough to do) and you&#39;d like to avoid running tests that object A when another test has proven that object A is currently broken.<br/>\n<br/>\nThat&#39;s an awfully tough problem, in general.<br/>\n<br/>\nTo reduce it to a simpler problem, consider this:<br/>\n<br/>\nYou have three tests. Tests 2 and 3 depends on Test 1, meaning that if Test 1 fails, then Tests 2 and 3 will certainly fail. Moreover, the failure of Tests 2 and 3 are meaningless in the context of the failure of Test 1.<br/>\n<br/>\nYou want Test 2 and 3 not to execute if Test 1 fails.<br/>\n<br/>\nYou have two choices:<br/>\n<br/>\n1. Build a custom test runner that understands your test dependency graph and fails later tests that depend on earlier tests that have already failed. Make it open source and the world will love you. It may even already exist.<br/>\n<br/>\n2. Wrap the three &quot;tests&quot; in a larger test (not test suite!) to take advantage of the way that JUnit&#39;s built-in test runner works.<br/>\n<br/>\nYour goal is incompatible with JUnit&#39;s test runners (but not the framework!!) in one key way: JUnit&#39;s test runners run all tests independently, so that one test&#39;s failure does not affect other tests.<br/>\n<br/>\nYou can continue to use the framework to solve your problem, but you want a customized test runner that understands your dependencies and fails test B if B depends on A and A already failed. That wouldn&#39;t be so tough, really. Javadoc-style metadata would be enough to express the dependency graph, I think.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt;You want to collect &#39;em by test case dependency -- however *YOU* define it<br/>\n&gt;-- then go write the code to do it. It ain&#39;t that hard. It still doesn&#39;t<br/>\n&gt;belong in the framework, because IT IS NOT UNIVERSAL USAGE. It is a narrow<br/>\n&gt;view of how to put tests together.<br/>\n&gt;<br/>\n&gt;I am saying introduce dependency as a concept, then allow folks to use it<br/>\n&gt;however they chose.<br/>\n&gt;<br/>\n&gt;You see Test Collectors as a replacement for TestSuite objects. With<br/>\n&gt;respect, that&#39;s absurd, unless the JUnit test runner is not adequate for<br/>\n&gt;their task. Still, why they decide to reinvent the wheel, I can&#39;t imagine.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;It may be absurd, it may be correct, only time (and a lot more view points<br/>\n&gt;that our two) will tell. If it is re-inventing te whell, perhaps it is<br/>\n&gt;going from a stiff wooden cart wheel to one with spokes and rubber tires.<br/>\n&gt;;-) Change can lead to improvements...<br/>\n<br/>\n </span></blockquote>In light of the insight I have gained in writing this e-mail, please disregard this part. I was wrong.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;4) I believe (IMHO -- w/ no market research, just based on projects I<br/>\n&gt;know)<br/>\n&gt;&gt;that dependency has great user benefit than manual test suite. As such,<br/>\n&gt;I&#39;d<br/>\n&gt;&gt;like it in the framework to aid the most users.<br/>\n&gt;<br/>\n&gt;If you need to collect tests based on your notion of dependency, then you<br/>\n&gt;would be a complete idiot to continue maintaining test suites manually.<br/>\n&gt;Eventually you should automate that work. Why do you insist on comparing<br/>\n&gt;automated tasks to manual ones?<br/>\n&gt;<br/>\n&gt;I am saying create the mechanism (it needs to be in the framework in order<br/>\n&gt;to be implementable, you never address that comment I made) and let tool<br/>\n&gt;be on top. I agree -- some wizard to introspect A to see it aggregates B<br/>\n&gt;to set T(A) dpendent upon T(B) ought be some outside tool, that is fine.<br/>\n&gt;However, I do not beleive that dependency ought be a tool, it does not<br/>\n&gt;need to be automated, it is just a facility that users or scripts could<br/>\n&gt;use.<br/>\n&gt;<br/>\n&gt;Because your need is not my need, so don&#39;t pollute JUnit with things that<br/>\n&gt;only some people need. That&#39;s not a framework.<br/>\n&gt;<br/>\n&gt;Then (again) take suites out. ;-)<br/>\n<br/>\n </span></blockquote>See above. Nope.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;BTW: Long before the end of this mail I&#39;ve started to realize that this<br/>\n&gt;&gt;whole e-mail chain is an academic exercise, unlikely to result in change.<br/>\n&gt;&gt;JUnit still rocks, and I use it fervently, this was just a random thought<br/>\n&gt;&gt;that seemed to feel like an epiphany so I posted it...<br/>\n&gt;<br/>\n&gt;Well, in general, JUnit doesn&#39;t change much. That&#39;s intentional. That&#39;s<br/>\n&gt;why we have projects like JUnit-addons, GSBase and so on.<br/>\n&gt;<br/>\n&gt;I agree with the goal, but some things are worth change. Although I&#39;ve<br/>\n&gt;followed your arguments (and support them) about keeping frameworks<br/>\n&gt;simple/pure & add-ons outside, (respectfully) I don&#39;t beleive you are<br/>\n&gt;fully opening you mind to that option.<br/>\n<br/>\n </span></blockquote>Like hell. I&#39;ve proposed a solution to you a number of times. Why don&#39;t you listen to it?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Lack of change is not an argument<br/>\n&gt;in itself.<br/>\n<br/>\n </span></blockquote>Practically speaking it is. :) Argue all you want. If it never changes, it never changes. :)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Sometimes the further you are from something the easier it is<br/>\n&gt;to see something, and I feel you are too close to junit and the goal of<br/>\n&gt;keeping it simple to see this does not break that. Thaa said, maybe I&#39;ve<br/>\n&gt;just failed to explain it. Want me to start again?<br/>\n<br/>\n </span></blockquote>No. I understand perfectly now. You want a custom test runner and a way to express test case dependency in the sense of &quot;if A fails, then don&#39;t bother running B and C, because they&#39;ll fail too.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Perhaps others have a point of view, I really do think a lot of this comes<br/>\n&gt;down to user choice and use cases.<br/>\n<br/>\n </span></blockquote>Agreed. By definition, that&#39;s why it doesn&#39;t belong in the framework.<br/>\n<br/>\n<br/>\nJ. B. Rainsberger,<br/>\nPresident, Diaspar Software Services<br/>\nLet&#39;s write software that people understand.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com/\">http://www.diasparsoftware.com/</a><br/>\ntelephone: +1 416 791-8603</div>", 
    "prevInTime": 8870, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059688489", 
    "canDelete": false, 
    "nextInTopic": 8872, 
    "prevInTopic": 8868, 
    "headers": {
        "inReplyToHeader": "PDAwMGQwMWMzNTZkYSQ3Njc4NzE5MCRmMTI5MTQwYUB0c2MuY29tPg==", 
        "messageIdInHeader": "PDIwMDMwNzMxMTc1NDQ5MDYxOS4wMEU5OEUwOUBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDAwMGQwMWMzNTZkYSQ3Njc4NzE5MCRmMTI5MTQwYUB0c2MuY29tPg=="
    }
}