{
    "numMessagesInTopic": 106, 
    "nextInTime": 8872, 
    "senderId": "H6jv0t2M2k4I2YaZbj7E_7zaOKV89cohMmXCRrzdyuJx9OKoGSddUE3QWGxRTCpVkoL1GPWghwmOKJdPZOpwLaU0F5Nvjg4xsPSCb-vuRQ", 
    "systemMessage": false, 
    "subject": "RE: [junit] TestCase Dependency Hierarchy", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... That is precisely the reason that I want to stop.  ... Believe it all you want, but it is crystal clear to me that this statement is not true. ", 
    "msgId": 8871, 
    "rawEmail": "Return-Path: &lt;jbrains@...&gt;\r\nX-Sender: jbrains@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 60755 invoked from network); 30 Jul 2003 21:54:55 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m18.grp.scd.yahoo.com with QMQP; 30 Jul 2003 21:54:55 -0000\r\nReceived: from unknown (HELO fep01-mail.bloor.is.net.cable.rogers.com) (66.185.86.71)\n  by mta3.grp.scd.yahoo.com with SMTP; 30 Jul 2003 21:54:54 -0000\r\nReceived: from barney ([24.156.43.226])\n          by fep01-mail.bloor.is.net.cable.rogers.com\n          (InterMail vM.5.01.05.12 201-253-122-126-112-20020820) with ESMTP\n          id &lt;20030730215412.LYBL268566.fep01-mail.bloor.is.net.cable.rogers.com@barney&gt;\n          for &lt;junit@yahoogroups.com&gt;; Wed, 30 Jul 2003 17:54:12 -0400\r\nMessage-ID: &lt;200307311754490619.00E98E09@...&gt;\r\nIn-Reply-To: &lt;000d01c356da$76787190$f129140a@...&gt;\r\nReferences: &lt;000d01c356da$76787190$f129140a@...&gt;\r\nX-Mailer: Calypso Version 3.30.00.00 (4)\r\nDate: Thu, 31 Jul 2003 17:54:49 -0400\r\nTo: junit@yahoogroups.com\r\nSubject: RE: [junit] TestCase Dependency Hierarchy\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Authentication-Info: Submitted using SMTP AUTH LOGIN at fep01-mail.bloor.is.net.cable.rogers.com from [24.156.43.226] using ID &lt;jbrains@...&gt; at Wed, 30 Jul 2003 17:54:12 -0400\r\nFrom: &quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;\r\nReply-To: jbr@...\r\nX-Yahoo-Group-Post: member; u=127224993\r\nX-Yahoo-Profile: nails762\r\n\r\n&gt;So said Adam Jack on 2003-07-30 --------------------\n&gt;\n&gt;I can&#39;t let this d=\r\nrop, not because I care if I am &quot;right&quot; or not (that is\n&gt;subjective) but be=\r\ncause I feel that discussion is failing. I feel we are\n&gt;getting circular an=\r\nd not progressing to a valid conclusion. \n\nThat is precisely the reason tha=\r\nt I want to stop.\n\n&lt;snip /&gt;\n&gt;\n&gt;\n&gt;J. B. Rainsberger [jbrains@...] rep=\r\nlied:\n&gt;\n&gt;  As we are slowly converging on the fact, no-one stops you from\n&gt;=\r\nautomating this maintenance to the degree   that you can.\n&gt;\n&gt;I do not belei=\r\nve we are converging on that. You&#39;ve made that point, but\n&gt;I&#39;ve tried to co=\r\nunterpoint it, that isn&#39;t converging. I think this need to\n&gt;be in the frame=\r\nwork for this to work with all environments & add ons.\n\nBelieve it all you =\r\nwant, but it is crystal clear to me that this statement is not true.\n\nSuppo=\r\nse you write a test collector that uses metadata from, say, Javadoc comment=\r\ns to compute a dependency graph, from which an object creates the correspon=\r\nding TestSuite object. Under what cirucmstance will this *not* work?\n\n&gt;&gt;I&#39;v=\r\ne not been missing your point (not completely, although I get it more\n&gt;&gt;eac=\r\nh time) but this is the crux of my argument: If (big IF) suites are\n&gt;&gt;testc=\r\nase dependencies, \n&gt;\n&gt;They absolutely, positively are NOT. I cannot stress =\r\nthis enough. A\n&gt;TestSuite is an arbitrary collection of Test objects, and n=\r\nothing more.\n&gt;\n&gt;\n&gt;You&#39;ve been having your cake and eating it, between e-mai=\r\nls -- not a good\n&gt;diet for thought. ;-)\n&gt;\n&gt;One time you tell me to create h=\r\nierarchies of suites to control run order\n&gt;(what I&#39;d like as dependency) an=\r\nd now you say this. Right now suites (and\n&gt;hierarchies of suiteS) are the c=\r\nloses thing to dependencies. That we agree\n&gt;upon, right?\n\nYou can use TestS=\r\nuite objects to control run order. That is a specific case of using a TestS=\r\nuite object to store an arbitrary collection of tests. There is no discrepa=\r\nncy there. Show me why the statements are mutually contradictory.\n\nGranted,=\r\n we in the Test-Driven Development world advise against enforcing run order=\r\n, but JUnit permits it because it&#39;s a general case. The fact that we do not=\r\n intentionally rely on the order in which JUnit places our tests is merely =\r\na detail.\n\n&gt;Personally I&#39;d like to leave suites as collections of test case=\r\ns, and I&#39;d\n&gt;like a separate concept for dependency. That said, I&#39;ll discuss=\r\n it either\n&gt;way, please pick one.\n\nHave all the searate concepts you want. =\r\nIf by dependency you simply mean &quot;run order&quot;, then it is simple to build a =\r\ntest suite from a desired run order. Express your desired run order any way=\r\n you want. This solution is fully compatible with JUnit. Case closed.\n\n&gt;&gt;th=\r\nen I don&#39;t think it ought be the user&#39;s job to\n&gt;&gt;manage them -- I think the=\r\n framework should.\n&gt;\n&gt;Since your hypothesis is wrong, your conclusion is no=\r\nt meaningful. :)\n&gt;(That&#39;s logic&#39;s fault, not mine.)\n&gt;\n&gt;Actually, Bertrand R=\r\nussell contended that from an incorrect hypothesis any\n&gt;conclusion can be p=\r\nroven, which has corrolary that all conclusions are\n&gt;therefore invalid. Hey=\r\n, my conclusion could be the right one irrespective.\n&gt;;-)\n\nHow is that diff=\r\nerent from what I wrote?\n\n&gt;&gt; It is easy for me (outside the\n&gt;&gt;code) to say =\r\nthis, but I think they were a useful construct before, but\n&gt;&gt;they\n&gt;&gt;may hav=\r\ne outlived their usefulness. I posit that suites are the existing\n&gt;&gt;hammer,=\r\n so they are making things seem like a nail.\n&gt;\n&gt;I don&#39;t understand this sta=\r\ntement at all. A TestSuite is just a composite\n&gt;collection of tests. What e=\r\nlse do you propose to use?\n&gt;\n&gt;As I&#39;ve stated Eclipse users (plenty) and ant=\r\n users (plenty) quite\n&gt;probably use none, their &quot;collection&quot; is &quot;all the te=\r\nst cases in my project\n&gt;that match *Test.class&quot;. Once I moved to these tool=\r\ns I deleted all my test\n&gt;suites.\n&gt;\n&gt;I could be wrong, but I suspect this is=\r\n a growing trend.\n\nWRONG WRONG WRONG WRONG WRONG! Here is the basis of our =\r\ndivergence.\n\nYou deleted manually-maintained TestSuite objects. Ant builds =\r\nTestSuite objects in the manner you describe. Eclipse builds TestSuite obje=\r\ncts in the manner you describe. The only difference is that they build Test=\r\nSuite objects on the fly instead of the manual mechanism of writing a custo=\r\nm TestSuite builder class every time.\n\nSee GSBase&#39;s RecursiveTestSuite or J=\r\nUnit-addons&#39; DirectorySuiteBuilder for examples of the mechanism that Ant a=\r\nnd Eclipse use.\n\nI have never suggested that you abandon these automated Te=\r\nstSuite builders and go back to building them by hand. All I have said is t=\r\nhat everyone needs to build test suites differently, therefore do not hamme=\r\nr your particular needs into the framework. &quot;Particular needs&quot; do not belon=\r\ng in framework. That is precisely why they are frameworks and not tools.\n\n&gt;=\r\n&gt;      Maybe I misunderstand Test Collectors \n&gt;The bottom line is that the =\r\nmechanism is essentially the same as a\n&gt;TestSuite, and a TestSuite is just =\r\na collection!\n&gt;\n&gt;The bottom line is that we have a single colelction w/o hi=\r\nerarchy, yes.\n&gt;The collectors seems to collect (perhaps by chance) by packa=\r\nge/classname\n&gt;alphabetic order, i.e. effectively random. I am hoping to all=\r\now some order\n&gt;from that chaos.\n\nIt seems that Eclipse and Ant already do t=\r\nhat effectively.\n\nIt sounds to me that you want to augment Eclipse or Ant&#39;s=\r\n TestSuite building mechanisms. Nothing to do with JUnit itself.\n\n&gt;If you h=\r\naven&#39;t already, read Kent Beck&#39;s original paper where he develops\n&gt;SUnit. P=\r\nerhaps some insight from there will help.\n&gt;\n&gt;Is SUnit something new? Sorry,=\r\n I have not -- can you point me to a link?\n\nGood God, no: it is the Smallta=\r\nlk-based predecessor of JUnit. Just Google &quot;Kent Beck Smalltalk Testing&quot;. Y=\r\nou&#39;ll find it. (I remember keywords, not links.)\n\n&gt;I assume (from context) =\r\nthat Kent is the original auther, and that is fine\n&gt;(I am not knocking suit=\r\nes of old, they, like much of junit has been\n&gt;incredibly clever) and I thin=\r\nk historically suites have been useful. That\n&gt;said, I just think that since=\r\n collectors are more and more common that\n&gt;suites are obolete & we need a c=\r\nhange.\n&gt;\n&gt;Your underlying hypothesis appears to be this:\n&gt;\n&gt;If class A depe=\r\nnds on B, then there exist tests T(A) that test A and tests\n&gt;T(B) that test=\r\n B such that T(A) depends on T(B).\n&gt;\n&gt;Actaully, no (although it isn&#39;t somet=\r\nhing I object to for many use cases).\n&gt;\n&gt;I am merely asking that I can asse=\r\nrt that T(A) depends on T(B) [for\n&gt;whatever reason] and I do so in T(A) [so=\r\nmehow] not in some separate\n&gt;suite(A).\n\nSo build it. Who stops you?\n\n&gt;It is=\r\n on this basis that you want JUnit to manage those dependencies. I\n&gt;claim f=\r\nirst that JUnit can&#39;t, and second that JUnit shouldn&#39;t.\n&gt;\n&gt;1. JUnit can&#39;t m=\r\nanage the dependencies without human intervention.\n&gt;\n&gt;Agreed, but how much?=\r\n I am asking for simple assertions, not manualy\n&gt;managing separate files. M=\r\nanaging anything in two places is a recipe for\n&gt;error.\n\nHow the hell did as=\r\nsertions get in here? What do assertions have to do with it?\n\nYou appear to=\r\n want to express (not assert) dependencies as metadata and build dynamic te=\r\nst suites based on that data. Excellent goal. So build it.\n\n&gt;2. JUnit shoul=\r\ndn&#39;t manage the dependencies because they are not universal.\n&gt;\n&gt;I do not vi=\r\new dependencies the way you do. What we have in common, though,\n&gt;is that we=\r\n each need to be able to execute different collections of tests\n&gt;at differe=\r\nnt times. This is why the former is not a part of the framework\n&gt;and the la=\r\ntter is. That is the essence of framework. What you want to\n&gt;build is a too=\r\nl. So build it.\n&gt;\n&gt;Actually, here you are wrong -- and I think here is wher=\r\ne things are\n&gt;changng. I no long run groups of tests at once, I run 1 or I =\r\nrun ALL --- I\n&gt;no longer run groups. We do not have that in common. (CPU is=\r\n cheap, I\n&gt;don&#39;t care to try to figure out which code effects what tests, I=\r\n run all\n&gt;tests before I check in changes. If one breaks, I might re-run it=\r\n.)\n&gt;\n&gt;So, since I don&#39;t uses suites -- are they a tool? Ought you remove th=\r\nem\n&gt;from junit in order to make it tighter? ;-) [Jokng aside, why not?]\n\nYo=\r\nu are using suites; you&#39;re just not maintaining them by hand. Eclipse or An=\r\nt are using suites, but dynamic ones.\n\nYou appear to be confusing a TestSui=\r\nte object with a custom-made, manually-maintained block of code that create=\r\ns a TestSuite object. The AllTests pattern is an example of the latter. The=\r\n latter creates the former. Surely you are not suggesting JUnit do away wit=\r\nh the former.\n\n&gt;&gt;2) I think dependency needs to be managed on the testcase,=\r\n hence be an\n&gt;&gt;optional aspect of that class. I think separating this out i=\r\nnto a separate\n&gt;&gt;structure (like suite) is a recipe for rust. ***This is wh=\r\ny I think it\n&gt;&gt;needs\n&gt;&gt;to be part of the framework, not an add on.***\n&gt;\n&gt;Di=\r\nsagree. I don&#39;t want that feature. I&#39;m sure I&#39;m not alone (Dave?). For\n&gt;tha=\r\nt reason, adding it to the framework makes the framework noisy. A\n&gt;framewor=\r\nk ought to include what&#39;s needed for universal solutions and\n&gt;nothing more.=\r\n Everything else is a tool.\n&gt;\n&gt;I&#39;d like to have other inputs to this discus=\r\nsion. I think a lot of this\n&gt;comes down to user choice, how one works, what=\r\n environment one works in,\n&gt;and so we need more than two people to make it =\r\nvaluable...\n\nEXACTLY! That&#39;s why the framework is the wrong place for it.\n\n=\r\n&gt;&gt;3) Given test collectors (classpath/directory scanners) -- and given\n&gt;thi=\r\nngs\n&gt;&gt;like Eclipse testcase wizards --- I believe suites are fading out of\n=\r\n&gt;&gt;consciousness. As such, I think it is less to learn to say &quot;my testcase\n&gt;=\r\n&gt;depends upon these testcases&quot; than learn a the testsuite concept.\n&gt;\n&gt;Get t=\r\nhis straight: TEST CASE DEPENDENCY IS EVIL. Test cases should be as\n&gt;indepe=\r\nndent as possible. It should be possible to select a number of tests\n&gt;and j=\r\nust run them. JUnit supports that. You can build your TestSuite\n&gt;however yo=\r\nu want. The fact that there aren&#39;t better tools for this\n&gt;surprises me.\n&gt;\n&gt;=\r\nNo, here .... you are wrong. I beleive you mean that test cases ought have\n=\r\n&gt;no &quot;results&quot; or &quot;side effects&quot; that other test cases depended upon. That\n&gt;=\r\nis EVIL!!! Agreed, 100%.\n&gt;\n&gt;Run order (call it dependency order or whatever=\r\n) that is not evil. If my\n&gt;collection object fails, why run the test of thi=\r\nngs that use it & waste\n&gt;time debugging their failures? Even if by chance t=\r\nhey worked, so what,\n&gt;trim down the results a human has to think over.\n\nOK,=\r\n you&#39;re talking about orthogonality: one problem, one failure. Your tests a=\r\nre not orthogonal (which is common -- it&#39;s tough to do) and you&#39;d like to a=\r\nvoid running tests that object A when another test has proven that object A=\r\n is currently broken.\n\nThat&#39;s an awfully tough problem, in general.\n\nTo red=\r\nuce it to a simpler problem, consider this:\n\nYou have three tests. Tests 2 =\r\nand 3 depends on Test 1, meaning that if Test 1 fails, then Tests 2 and 3 w=\r\nill certainly fail. Moreover, the failure of Tests 2 and 3 are meaningless =\r\nin the context of the failure of Test 1.\n\nYou want Test 2 and 3 not to exec=\r\nute if Test 1 fails.\n\nYou have two choices:\n\n1. Build a custom test runner =\r\nthat understands your test dependency graph and fails later tests that depe=\r\nnd on earlier tests that have already failed. Make it open source and the w=\r\norld will love you. It may even already exist.\n\n2. Wrap the three &quot;tests&quot; i=\r\nn a larger test (not test suite!) to take advantage of the way that JUnit&#39;s=\r\n built-in test runner works.\n\nYour goal is incompatible with JUnit&#39;s test r=\r\nunners (but not the framework!!) in one key way: JUnit&#39;s test runners run a=\r\nll tests independently, so that one test&#39;s failure does not affect other te=\r\nsts.\n\nYou can continue to use the framework to solve your problem, but you =\r\nwant a customized test runner that understands your dependencies and fails =\r\ntest B if B depends on A and A already failed. That wouldn&#39;t be so tough, r=\r\neally. Javadoc-style metadata would be enough to express the dependency gra=\r\nph, I think.\n\n\n&gt;\n&gt;\n&gt;You want to collect &#39;em by test case dependency -- howe=\r\nver *YOU* define it\n&gt;-- then go write the code to do it. It ain&#39;t that hard=\r\n. It still doesn&#39;t\n&gt;belong in the framework, because IT IS NOT UNIVERSAL US=\r\nAGE. It is a narrow\n&gt;view of how to put tests together.\n&gt;\n&gt;I am saying intr=\r\noduce dependency as a concept, then allow folks to use it\n&gt;however they cho=\r\nse.\n&gt;\n&gt;You see Test Collectors as a replacement for TestSuite objects. With=\r\n\n&gt;respect, that&#39;s absurd, unless the JUnit test runner is not adequate for\n=\r\n&gt;their task. Still, why they decide to reinvent the wheel, I can&#39;t imagine.=\r\n\n&gt;\n&gt;\n&gt;It may be absurd, it may be correct, only time (and a lot more view p=\r\noints\n&gt;that our two) will tell. If it is re-inventing te whell, perhaps it =\r\nis\n&gt;going from a stiff wooden cart wheel to one with spokes and rubber tire=\r\ns.\n&gt;;-) Change can lead to improvements...\n\nIn light of the insight I have =\r\ngained in writing this e-mail, please disregard this part. I was wrong.\n\n&gt;&gt;=\r\n4) I believe (IMHO -- w/ no market research, just based on projects I\n&gt;know=\r\n)\n&gt;&gt;that dependency has great user benefit than manual test suite. As such,=\r\n\n&gt;I&#39;d\n&gt;&gt;like it in the framework to aid the most users.\n&gt;\n&gt;If you need to c=\r\nollect tests based on your notion of dependency, then you\n&gt;would be a compl=\r\nete idiot to continue maintaining test suites manually.\n&gt;Eventually you sho=\r\nuld automate that work. Why do you insist on comparing\n&gt;automated tasks to =\r\nmanual ones?\n&gt;\n&gt;I am saying create the mechanism (it needs to be in the fra=\r\nmework in order\n&gt;to be implementable, you never address that comment I made=\r\n) and let tool\n&gt;be on top. I agree -- some wizard to introspect A to see it=\r\n aggregates B\n&gt;to set T(A) dpendent upon T(B) ought be some outside tool, t=\r\nhat is fine.\n&gt;However, I do not beleive that dependency ought be a tool, it=\r\n does not\n&gt;need to be automated, it is just a facility that users or script=\r\ns could\n&gt;use.\n&gt;\n&gt;Because your need is not my need, so don&#39;t pollute JUnit w=\r\nith things that\n&gt;only some people need. That&#39;s not a framework.\n&gt;\n&gt;Then (ag=\r\nain) take suites out. ;-)\n\nSee above. Nope.\n\n&gt;&gt;BTW: Long before the end of =\r\nthis mail I&#39;ve started to realize that this\n&gt;&gt;whole e-mail chain is an acad=\r\nemic exercise, unlikely to result in change.\n&gt;&gt;JUnit still rocks, and I use=\r\n it fervently, this was just a random thought\n&gt;&gt;that seemed to feel like an=\r\n epiphany so I posted it...\n&gt;\n&gt;Well, in general, JUnit doesn&#39;t change much.=\r\n That&#39;s intentional. That&#39;s\n&gt;why we have projects like JUnit-addons, GSBase=\r\n and so on.\n&gt;\n&gt;I agree with the goal, but some things are worth change. Alt=\r\nhough I&#39;ve\n&gt;followed your arguments (and support them) about keeping framew=\r\norks\n&gt;simple/pure & add-ons outside, (respectfully) I don&#39;t beleive you are=\r\n\n&gt;fully opening you mind to that option.\n\nLike hell. I&#39;ve proposed a soluti=\r\non to you a number of times. Why don&#39;t you listen to it?\n\n&gt;Lack of change i=\r\ns not an argument\n&gt;in itself.\n\nPractically speaking it is. :) Argue all you=\r\n want. If it never changes, it never changes. :)\n\n&gt;Sometimes the further yo=\r\nu are from something the easier it is\n&gt;to see something, and I feel you are=\r\n too close to junit and the goal of\n&gt;keeping it simple to see this does not=\r\n break that. Thaa said, maybe I&#39;ve\n&gt;just failed to explain it. Want me to s=\r\ntart again?\n\nNo. I understand perfectly now. You want a custom test runner =\r\nand a way to express test case dependency in the sense of &quot;if A fails, then=\r\n don&#39;t bother running B and C, because they&#39;ll fail too.&quot;\n\n&gt;Perhaps others =\r\nhave a point of view, I really do think a lot of this comes\n&gt;down to user c=\r\nhoice and use cases.\n\nAgreed. By definition, that&#39;s why it doesn&#39;t belong i=\r\nn the framework.\n\n\nJ. B. Rainsberger,\nPresident, Diaspar Software Services\n=\r\nLet&#39;s write software that people understand.\nhttp://www.diasparsoftware.com=\r\n/\ntelephone: +1 416 791-8603\n\n\n", 
    "profile": "nails762", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "prevInTime": 8870, 
    "contentTrasformed": false, 
    "postDate": "1059688489", 
    "canDelete": false, 
    "nextInTopic": 8872, 
    "prevInTopic": 8868, 
    "headers": {
        "inReplyToHeader": "PDAwMGQwMWMzNTZkYSQ3Njc4NzE5MCRmMTI5MTQwYUB0c2MuY29tPg==", 
        "messageIdInHeader": "PDIwMDMwNzMxMTc1NDQ5MDYxOS4wMEU5OEUwOUBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDAwMGQwMWMzNTZkYSQ3Njc4NzE5MCRmMTI5MTQwYUB0c2MuY29tPg=="
    }
}