{
    "numMessagesInTopic": 106, 
    "nextInTime": 8873, 
    "senderId": "TjUbHgpO_DoK-X9-cadCY5mhNdeczwrnI7Z3dppFaF50DXKc0b23oPUG11IJ1QIqu3HzxwpYel5I6Mvvh5dqs8W2uncC9_5D6C2v", 
    "systemMessage": false, 
    "subject": "Re: [junit] TestCase Dependency Hierarchy", 
    "from": "David Boyer &lt;mangr3n@...&gt;", 
    "authorName": "David Boyer", 
    "msgSnippet": "... Here is the crux of the problem with your argument.  As far as I understand unit testing using an xUnit framework and as part of the XP process.  The", 
    "msgId": 8872, 
    "rawEmail": "Return-Path: &lt;mangr3n@...&gt;\r\nReceived: (qmail 61012 invoked by uid 7800); 30 Jul 2003 21:55:06 -0000\r\nX-Sender: mangr3n@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 53533 invoked from network); 30 Jul 2003 21:54:20 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m16.grp.scd.yahoo.com with QMQP; 30 Jul 2003 21:54:20 -0000\r\nReceived: from unknown (HELO mail.chipware.com) (66.160.47.7)\n  by mta1.grp.scd.yahoo.com with SMTP; 30 Jul 2003 21:54:19 -0000\r\nReceived: from teamdekade.com (orion.chipware.com [172.16.8.48])\n\tby mail.chipware.com (8.9.3/8.9.3) with ESMTP id RAA32745\n\tfor &lt;junit@yahoogroups.com&gt;; Wed, 30 Jul 2003 17:54:16 -0400\r\nMessage-ID: &lt;3F283E8A.4030309@...&gt;\r\nDate: Wed, 30 Jul 2003 17:54:18 -0400\r\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US; rv:1.4b) Gecko/20030416 Thunderbird/0.1a\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] TestCase Dependency Hierarchy\r\nReferences: &lt;000d01c356da$76787190$f129140a@...&gt;\r\nIn-Reply-To: &lt;000d01c356da$76787190$f129140a@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nFrom: David Boyer &lt;mangr3n@...&gt;\r\nX-Yahoo-Group-Post: member; u=138345974\r\nX-Yahoo-Profile: mangr3n\r\nX-eGroups-Approved-By: nails762 &lt;jbrains@...&gt; via email; 30 Jul 2003 21:55:06 -0000\r\n\r\nAdam Jack wrote:\n\n&gt;I can&#39;t let this drop, not because I care if I am &quot;right&quot; or not (that is subjective) but because I feel that discussion is failing. I feel we are getting circular and not progressing to a valid conclusion. I feel it would be letting down the idea to not give it my best shot. Also, I&#39;d really like to hear from others also, maybe this needs a new perspective.\n&gt;\n&gt;\n&gt;J. B. Rainsberger [jbrains@...] replied:\n&gt;\n&gt;  As we are slowly converging on the fact, no-one stops you from automating this maintenance to the degree   that you can.\n&gt;\n&gt;I do not beleive we are converging on that. You&#39;ve made that point, but I&#39;ve tried to counterpoint it, that isn&#39;t converging. I think this need to be in the framework for this to work with all environments & add ons.\n&gt;\n&gt;\n&gt; &gt;I&#39;ve not been missing your point (not completely, although I get it more\n&gt; &gt;each time) but this is the crux of my argument: If (big IF) suites are\n&gt; &gt;testcase dependencies, \n&gt;\n&gt; They absolutely, positively are NOT. I cannot stress this enough. A TestSuite is an arbitrary collection of Test objects, and nothing more.\n&gt;\n&gt;\n&gt;You&#39;ve been having your cake and eating it, between e-mails -- not a good diet for thought. ;-)\n&gt;\n&gt;One time you tell me to create hierarchies of suites to control run order (what I&#39;d like as dependency) and now you say this. Right now suites (and hierarchies of suiteS) are the closes thing to dependencies. That we agree upon, right?\n&gt;  \n&gt;\n&gt;Personally I&#39;d like to leave suites as collections of test cases, and I&#39;d like a separate concept for dependency. That said, I&#39;ll discuss it either way, please pick one.\n&gt;\n\nHere is the crux of the problem with your argument.  As far as I \nunderstand unit testing using an xUnit framework and as part of the XP \nprocess.  The existence of test interdependencies (outside of thread \ntesting) is a code smell which is avoided.  If the xUnit framework were \nto support the concept of dependencies it would be promoting a specific \ncode smell which it is intende to avoid. \n\nIn Kent Beck&#39;s book Test Driven Development by Example one of the TDD \npatterns is called Isolated Test,  he asks the question: &quot;How should the \nrunning of your tests affect one another?&quot; and answers himself: &quot;Not at \nall.&quot;  If you have to test a series of functions as a group which have \nto all be completed to constitute success, then do those all in one \ntestFunction.\n\nThat really is it.  No dependency concept exists, because it is \nsomething to discourage.  Dependencies are a sign that the code needs \nmore decoupling and more refactoring.\n\nThis is one of the most significant issues with my current work \nenvironment.  I have so much work to do to decouple each piece I work on \nfrom our testing database, which I have no control over.  I have to \ndecouple of I want to have tests that can be run in a reasonable amount \nof time, with a minimum of coding effort and that I can be assured won&#39;t \nbe broken by changes in the data in the database.\n\nMy boss keeps saying to me, why can&#39;t we just test in the database, and \nforce the tests to run in a specific order.  I resist, though I can&#39;t \nconvince him.\n\nIn the example, in Kent&#39;s book he relays the experience of having a test \nsuite that would run overnight, and sometimes nothing would break and \nother times he&#39;d get a printout of many pages with all of his bugs.  It \nturned out that the large printout usually meant one test failed and \ncaused cascading failures through the rest of the tests due to \ndependencies. \n\nDavid B.\nmangr3n@...\n\n\n", 
    "profile": "mangr3n", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 138345974, 
    "prevInTime": 8871, 
    "contentTrasformed": false, 
    "postDate": "1059602058", 
    "canDelete": false, 
    "nextInTopic": 8874, 
    "prevInTopic": 8871, 
    "headers": {
        "inReplyToHeader": "PDAwMGQwMWMzNTZkYSQ3Njc4NzE5MCRmMTI5MTQwYUB0c2MuY29tPg==", 
        "messageIdInHeader": "PDNGMjgzRThBLjQwMzAzMDlAdGVhbWRla2FkZS5jb20+", 
        "referencesHeader": "PDAwMGQwMWMzNTZkYSQ3Njc4NzE5MCRmMTI5MTQwYUB0c2MuY29tPg=="
    }
}