{
    "numMessagesInTopic": 106, 
    "nextInTime": 8875, 
    "senderId": "6ymNuAM14OLT0Png15lF8-VIf1eU4vQnUu8u2DeJzR4A8G-yrs-_5O1v1jNTZNWEhivRbDF5Nl8", 
    "systemMessage": false, 
    "subject": "RE: [junit] TestCase Dependency Hierarchy", 
    "from": "john.link@...", 
    "authorName": "john.link@gmx.net", 
    "msgSnippet": "Since other people s view was explicitely requested, here comes mine... BTW, your posting style makes it very hard for me to see what s a quote and what s your", 
    "msgId": 8874, 
    "profile": "jlinkyh", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 34183400, 
    "messageBody": "<div id=\"ygrps-yiv-2090716764\">Since other people&#39;s view was explicitely requested, here comes mine...<br/>\n<br/>\nBTW, your posting style makes it very hard for me to see what&#39;s a quote and<br/>\nwhat&#39;s your comment. But maybe that&#39;s just my configuration of yahoogroups. I<br/>\nhave been trying to sort it out by adding another &#39;&gt;&#39; in lines I suppose you<br/>\nquoted.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;  Your underlying hypothesis appears to be this:<br/>\n&gt;&gt; <br/>\n&gt;&gt;  If class A depends on B, then there exist tests T(A) that test A and<br/>\n&gt;&gt; tests T(B) that test B such that T(A) depends on T(B).<br/>\n&gt; <br/>\n&gt; Actaully, no (although it isn&#39;t something I object to for many use cases).<br/>\n&gt; <br/>\n&gt; I am merely asking that I can assert that T(A) depends on T(B) [for<br/>\n&gt; whatever reason] and I do so in T(A) [somehow] not in some separate<br/>\n </span></blockquote>suite(A).<br/>\n<br/>\nThis seems to me to be the crucial point. IF you don&#39;t have side effects and<br/>\nIF you have decoupled code then I cannot see where dependencies between T(A)<br/>\nand T(B) make sense. A usually does not depend directly on B but on an<br/>\nabstract interface - B just being an implementation of that interface.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;  Get this straight: TEST CASE DEPENDENCY IS EVIL. Test cases should be as<br/>\n&gt;&gt; independent as possible. It should be possible to select a number of<br/>\n </span></blockquote>tests<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; and just run them. JUnit supports that. You can build your TestSuite<br/>\n&gt;&gt; however you want. The fact that there aren&#39;t better tools for this<br/>\n </span></blockquote>surprises me.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; No, here .... you are wrong. I beleive you mean that test cases ought have<br/>\n&gt; no &quot;results&quot; or &quot;side effects&quot; that other test cases depended upon. That<br/>\n&gt; is EVIL!!! Agreed, 100%.<br/>\n&gt; <br/>\n&gt; Run order (call it dependency order or whatever) that is not evil. If my<br/>\n&gt; collection object fails, why run the test of things that use it & waste<br/>\n </span></blockquote>time<br/>\n<blockquote><span title=\"ireply\"> &gt; debugging their failures? Even if by chance they worked, so what, trim<br/>\n&gt; down the results a human has to think over.<br/>\n<br/>\n </span></blockquote>Maybe the direct dependency on the collection object is the problem in the<br/>\nfirst place. You could take your problem with many test cases failing at once<br/>\nas a strong hint to remove this direct dependency. If your collection object,<br/>\nhowever, is so low level that a direct dependency does not hurt then it<br/>\nshould be very very stable; the probability that it fails in a fundamental way,<br/>\nwhich makes lots of other tests fail too, is very low. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;  Well, in general, JUnit doesn&#39;t change much. That&#39;s intentional. That&#39;s<br/>\n&gt;&gt; why we have projects like JUnit-addons, GSBase and so on.<br/>\n&gt; <br/>\n&gt; I agree with the goal, but some things are worth change. Although I&#39;ve<br/>\n&gt; followed your arguments (and support them) about keeping frameworks<br/>\n&gt; simple/pure & add-ons outside, (respectfully) I don&#39;t beleive you are<br/>\n </span></blockquote>fully opening<br/>\n<blockquote><span title=\"ireply\"> &gt; you mind to that option. Lack of change is not an argument in itself.<br/>\n&gt; Sometimes the further you are from something the easier it is to see<br/>\n </span></blockquote>something,<br/>\n<blockquote><span title=\"ireply\"> &gt; and I feel you are too close to junit and the goal of keeping it simple to<br/>\n&gt; see this does not break that. Thaa said, maybe I&#39;ve just failed to explain<br/>\n&gt; it. Want me to start again?<br/>\n&gt; <br/>\n&gt; Perhaps others have a point of view, I really do think a lot of this comes<br/>\n&gt; down to user choice and use cases.<br/>\n<br/>\n </span></blockquote>You haven&#39;t convinced me (yet) about two points:<br/>\n- Why is the dependency between tests a FUNDAMENTAL concept and not just<br/>\nyour very personal way to sort out which test cases to run?<br/>\n- Why can&#39;t this concept be implemented without changing the core of JUnit?<br/>\n<br/>\nBut of course you&#39;re right stati8ng that many of us here are too involved in<br/>\nJUnit and thus have a hard time giving up on &quot;invariants&quot; we consider to be<br/>\n&quot;everlasting&quot;.<br/>\n<br/>\nJohannes<br/>\n<br/>\n-- <br/>\nCOMPUTERBILD 15/03: Premium-e-mail-Dienste im Test<br/>\n--------------------------------------------------<br/>\n1. GMX TopMail - Platz 1 und Testsieger!<br/>\n2. GMX ProMail - Platz 2 und Preis-Qualitätssieger!<br/>\n3. Arcor - 4. web.de - 5. T-Online - 6. freenet.de - 7. daybyday - 8. e-Post</div>", 
    "prevInTime": 8873, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059638326", 
    "canDelete": false, 
    "nextInTopic": 8876, 
    "prevInTopic": 8872, 
    "headers": {
        "messageIdInHeader": "PDEwODY4LjEwNTk2MzgzMjZAd3d3NjcuZ214Lm5ldD4=", 
        "referencesHeader": "PDAwMGQwMWMzNTZkYSQ3Njc4NzE5MCRmMTI5MTQwYUB0c2MuY29tPg=="
    }
}