{
    "numMessagesInTopic": 106, 
    "nextInTime": 8888, 
    "senderId": "zOFaTNnjxRbdPmVTGuwprp3r3vb_lnKZRGb97cED29OLz3_0efQsOWdP44flPoPLSvzZe5h418a0U8Ph33UnVdTHHsJJ6UY6", 
    "systemMessage": false, 
    "subject": "RE: [junit] TestCase Dependency Hierarchy", 
    "from": "&quot;Adam Jack&quot; &lt;ajack@...&gt;", 
    "authorName": "Adam Jack", 
    "msgSnippet": "David wrote: Here is the crux of the problem with your argument.  As far as I understand unit testing using an xUnit framework and as part of the XP process.", 
    "msgId": 8887, 
    "profile": "arb_jack", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124707332, 
    "messageBody": "<div id=\"ygrps-yiv-1077597869\">David wrote:<br/>\n<br/>\n      Here is the crux of the problem with your argument.  As far as I<br/>\n      understand unit testing using an xUnit framework and as part of the XP<br/>\n      process.  The existence of test interdependencies (outside of thread<br/>\n      testing) is a code smell which is avoided.  If the xUnit framework<br/>\nwere<br/>\n      to support the concept of dependencies it would be promoting a<br/>\nspecific<br/>\n      code smell which it is intende to avoid.<br/>\n<br/>\nI don&#39;t think a truer word has been spoken in this thread.  I think you are<br/>\nspot on. I think I trod in some &quot;test *content* dependency&quot; stigma, when I<br/>\nwas discussing run order &quot;test dependency order&quot;, which I don&#39;t feel is the<br/>\nsame.<br/>\n<br/>\nI am not saying my tests depends upon the run of another, no side effects, I<br/>\nam saying &quot;if my fruit class fails why bother testing my apple class? It has<br/>\na rotten core.&quot; It kinda goes back to Bertrand Russell... If I know fruit is<br/>\nbad, then the fact that apple succeeds doesn&#39;t make it a healthy apple, it<br/>\nis unknown.<br/>\n<br/>\nStill, I don&#39;t think the idea has a chance of a fair hearing.<br/>\n<br/>\n          In Kent Beck&#39;s book Test Driven Development by Example one of the<br/>\nTDD<br/>\n          patterns is called Isolated Test,  he asks the question: &quot;How<br/>\nshould the<br/>\n          running of your tests affect one another?&quot; and answers himself:<br/>\n&quot;Not at<br/>\n          all.&quot;  If you have to test a series of functions as a group which<br/>\nhave<br/>\n          to all be completed to constitute success, then do those all in<br/>\none<br/>\n          testFunction.<br/>\n<br/>\nI agree in principle. That said, I tests in layers, building on each other.<br/>\nI can&#39;t put 1000 tests in one testcase, just as I would put 1000 class in<br/>\none package. I just wanted to bring run order through simple statements of<br/>\ndependency. I think you see what I was saying, and you&#39;ve explained why I am<br/>\ngetting nowhere.<br/>\n<br/>\n      That really is it.  No dependency concept exists, because it is<br/>\n      something to discourage.  Dependencies are a sign that the code needs<br/>\n      more decoupling and more refactoring.<br/>\n<br/>\nPoint taken on discouragement, and boy -- yes -- I&#39;ve felt that. ;-)<br/>\n<br/>\nI think test content dependency is wrong, but not what I am saying. Either<br/>\nthat, or you decouple yourself from everything you do, a purist goal of no<br/>\nreal world value. Code used code, that is a dependency.<br/>\n<br/>\n      In the example, in Kent&#39;s book he relays the experience of having a<br/>\ntest<br/>\n      suite that would run overnight, and sometimes nothing would break and<br/>\n      other times he&#39;d get a printout of many pages with all of his bugs.<br/>\nIt<br/>\n      turned out that the large printout usually meant one test failed and<br/>\n      caused cascading failures through the rest of the tests due to<br/>\n      dependencies.<br/>\n<br/>\nThis is all about test content dependency -- side effects -- and I never<br/>\nmeant that. Why get a fruit basket full of errors when fruit is bad? I was<br/>\nactually trying to reduce this mess of an output to &quot;the *possible* root<br/>\ncause -- and if nothing else, a place to start cleaning up&quot;.<br/>\n<br/>\nThanks, you saved me from trying further...<br/>\n<br/>\nregards<br/>\n<br/>\nAdam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 8886, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059613691", 
    "canDelete": false, 
    "nextInTopic": 8889, 
    "prevInTopic": 8881, 
    "headers": {
        "inReplyToHeader": "PDNGMjgzRThBLjQwMzAzMDlAdGVhbWRla2FkZS5jb20+", 
        "messageIdInHeader": "PDAwM2QwMWMzNTcwMCQzNjlhM2M0MCQxOTc4MTYwYUBzeWJhc2UuY29tPg=="
    }
}