{
    "numMessagesInTopic": 106, 
    "nextInTime": 8893, 
    "senderId": "CTdNj8h-uICQZvQPapyyFQfihC55naxfw9AmQxVBfm6hyP2827yR6CtUbulgK8ZOcZSyv3qfkYpLsD80sYNwS-059DXhYNOQ", 
    "systemMessage": false, 
    "subject": "RE: [junit] TestCase Dependency Hierarchy", 
    "from": "&quot;Adam Jack&quot; &lt;ajack@...&gt;", 
    "authorName": "Adam Jack", 
    "msgSnippet": "... quote and ... yahoogroups. ... suppose you ... Yes, I am sorry about that. I think that the HTML (probably added by Yahoo groups so it could add a graphic", 
    "msgId": 8892, 
    "rawEmail": "Return-Path: &lt;ajack@...&gt;\r\nReceived: (qmail 87820 invoked by uid 7800); 31 Jul 2003 23:58:35 -0000\r\nX-Sender: ajack@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 43706 invoked from network); 31 Jul 2003 17:24:48 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m14.grp.scd.yahoo.com with QMQP; 31 Jul 2003 17:24:48 -0000\r\nReceived: from unknown (HELO mx1.try.sybase.com) (130.214.10.19)\n  by mta2.grp.scd.yahoo.com with SMTP; 31 Jul 2003 17:24:46 -0000\r\nReceived: from mail.try.sybase.com (mail.try.sybase.com [130.214.10.18])\n\tby mx1.try.sybase.com (8.11.6/8.11.0) with ESMTP id h6VGEn223549\n\tfor &lt;junit@yahoogroups.com&gt;; Thu, 31 Jul 2003 10:14:49 -0600\r\nReceived: from vpnlinux ([10.22.120.40])\n\tby mail.try.sybase.com (8.11.6/8.11.6) with SMTP id h6VHFDK24059\n\tfor &lt;junit@yahoogroups.com&gt;; Thu, 31 Jul 2003 11:15:14 -0600\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nSubject: RE: [junit] TestCase Dependency Hierarchy\r\nDate: Thu, 31 Jul 2003 07:47:28 -0600\r\nMessage-ID: &lt;000001c35788$6d5c9a60$2878160a@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: 7bit\r\nX-Priority: 3 (Normal)\r\nX-MSMail-Priority: Normal\r\nX-Mailer: Microsoft Outlook CWS, Build 9.0.2416 (9.0.2910.0)\r\nImportance: Normal\r\nIn-Reply-To: &lt;10868.1059638326@...&gt;\r\nX-MimeOLE: Produced By Microsoft MimeOLE V5.50.4910.0300\r\nFrom: &quot;Adam Jack&quot; &lt;ajack@...&gt;\r\nReply-To: &lt;ajack@...&gt;\r\nX-Yahoo-Group-Post: member; u=124707332\r\nX-Yahoo-Profile: arb_jack\r\nX-eGroups-Approved-By: nails762 &lt;jbrains@...&gt; via email; 31 Jul 2003 23:58:35 -0000\r\n\r\n\n&gt;      \tBTW, your posting style makes it very hard for me to see what&#39;s a\nquote and\n&gt;      \twhat&#39;s your comment. But maybe that&#39;s just my configuration of\nyahoogroups.\n&gt;  \tI have been trying to sort it out by adding another &#39;&gt;&#39; in lines I\nsuppose you\n&gt;\tquoted.\n\nYes, I am sorry about that. I think that the HTML (probably added by Yahoo\ngroups so it could add a graphic advertisement) was just too much for me to\novercome. I struggled to get control of the &quot;text&quot; I hoped I was\nediting/formatting but just fought the tool more than I won. I&#39;d try to\nindent and paragraphs would just bounce all over the place out of my\ncontrol. So much for &quot;progress&quot;. I&#39;ve zapped this one to be plain text and I\nwill manually insert the &gt;&#39;s.\n\n&gt;      This seems to me to be the crucial point. IF you don&#39;t have side\neffects and\n&gt;      IF you have decoupled code then I cannot see where dependencies\nbetween T(A)\n&gt;      and T(B) make sense. A usually does not depend directly on B but on\nan\n&gt;      abstract interface - B just being an implementation of that\ninterface.\n\nI have been sending mail and for some reason they takes hours (maybe up to a\nday) to arrive, and I don&#39;t think it is my server (I have our admin check.)\nSorry, there is an explanation in the mail. ;-)\n\nYou guys all seem very caught up on decoupling, and I&#39;ll acknowledge I am\nfar from an OO purist, I have a job to do & I write code. I attempt to write\nstandalone (decoupled) classes, I attempt to make them have well structed\n&quot;APIs&quot; but at the end of the day, if A uses B (however implemented, and\nhowever used -- aggregation, subclassing, command/messaging paradigms,\nwhatever) *for whatever reason* then surely for A to work, B ought work? If\nB fail a test then it has broken the contracts the tests assert, so it&#39;s\nbehaviours must be deemed unknown. I B is unknown, I could argue (a user\nchoice, on a per case basis) that it isn&#39;t worth knowing what the outcome of\nA&#39;s results test are. If they pass, then perhaps those tests don&#39;t cover\nenough. If they fail, isn&#39;t quite likely because B failed and what A relied\nupon is bogus?\n\n&gt;\tMaybe the direct dependency on the collection object is the problem in the\n&gt;\tfirst place. You could take your problem with many test cases failing at\nonce\n&gt;\tas a strong hint to remove this direct dependency. If your collection\nobject,\n&gt;\thowever, is so low level that a direct dependency does not hurt then it\n&gt;\tshould be very very stable; the probability that it fails in a fundamental\nway,\n&gt;\twhich makes lots of other tests fail too, is very low.\n\nThere might be gold in that statement. You are saying that failures can\npropagate (as I say) but that as you go up the stack the chance for\ncatastrophic failure ought not be there. I wonder if the result I am looking\nfor is better suited in the case of catastrophic failure, not just &quot;some\nobscure failure&quot;. That is possible.\n\nWith this observation, maybe what I am asking for is too fuzzy. I think that\ncode uses code (however you structure it) and much as there ought not be\ndependency on internal, if code breaks is &quot;API agreement&quot; then anything that\nuses that API is in doubt, and not worth testing. Trouble is, I&#39;d not want\nto do this on a &quot;method by method&quot; or &quot;test by test&quot; basics, so I was\nproposing doing it on TestCases. At this level, I can see how it is not fine\ngrained enough, and perhaps too fuzzy.\n\nBTW: I use junit to assert behaviours/contracts for the very reason that I\ncan change anything (at any level) any time. I like a good refactor that\n(after a while) brings all the tests back to working. I worry t hat the\nassumption of &quot;low level stability&quot; is counter that. It is likely right, but\nit oughtn&#39;t be relied upon (IMHO).\n\n&gt;\tYou haven&#39;t convinced me (yet) about two points:\n&gt;\t- Why is the dependency between tests a FUNDAMENTAL concept and not just\n&gt;\tyour very personal way to sort out which test cases to run?\n&gt;\t- Why can&#39;t this concept be implemented without changing the core of\nJUnit?\n\nI don&#39;t think we ever gave these fair hearing because (I feel) we spent all\nthe time on why the idea was bad. To be frank, I didn&#39;t think anybody was\nlistening, and since I was struggling to make the base points I saw no\nreason to try to build on the implementation issue.\n\nI think the points (one by one) that need to get agreed or dismissed are:\n\n1) Are test suites (as collections of tests, which have some\nhierarchical/run order effect) are a &quot;second place&quot; to manage relationship\nbetween testcases? Since managing in two places is always flawed, are suites\nflawed? [If I refactor testcases I might forget to refactor the suites, and\nthat is where errors creep in.]\n2) Are test suites becoming obsoleted by &quot;brute force collectors&quot;? How would\nwe know other than a user survey?\n3) If &quot;suites&quot; have outlived their purpose, why are they the &quot;framework&quot; way\nto manage run order?\n4) Does &quot;run order/dependency&quot; (not side-effect dependency) have any\nvalue -- despite it&#39;s smell?\n5) Is &quot;run order&quot; something that ought be in the framework, however it is\nimplemented.\n\nAs agree w/ David, in a mail I sent yesterday but haven&#39;t seen list exploded\nyet, I *may* be right about some of this, but I don&#39;t think dependency will\nget an open hearing &#39;cos of the stench of side-effect dependency. So be it.\n\n&gt;\tBut of course you&#39;re right stati8ng that many of us here are too involved\nin\n&gt;\tJUnit and thus have a hard time giving up on &quot;invariants&quot; we consider to\nbe\n&gt;\t&quot;everlasting&quot;.\n\nThanks for that, at least.\n\nregards\n\nAdam\n\n\n", 
    "profile": "arb_jack", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124707332, 
    "prevInTime": 8891, 
    "contentTrasformed": false, 
    "postDate": "1059659248", 
    "canDelete": false, 
    "nextInTopic": 8893, 
    "prevInTopic": 8889, 
    "headers": {
        "inReplyToHeader": "PDEwODY4LjEwNTk2MzgzMjZAd3d3NjcuZ214Lm5ldD4=", 
        "messageIdInHeader": "PDAwMDAwMWMzNTc4OCQ2ZDVjOWE2MCQyODc4MTYwYUBzeWJhc2UuY29tPg=="
    }
}