{
    "numMessagesInTopic": 106, 
    "nextInTime": 8924, 
    "senderId": "xA9dkoOt4yrYtNhNpjYR7oVit5FCwHtcy_IMltOVIYIyBFVOsGXj3bswgCNOZWijCLN4yiLG5h-Chb3s2dY3dn9Q2uHysw", 
    "systemMessage": false, 
    "subject": "RE: [junit] TestCase Dependency Hierarchy", 
    "from": "&quot;Ilja Preuss&quot; &lt;preuss@...&gt;", 
    "authorName": "Ilja Preuss", 
    "msgSnippet": "... Perhaps you would be more successfull in getting a fair hearing by providing - more details on how the problem actually hurts you instead of just being", 
    "msgId": 8923, 
    "profile": "ipreussde", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 96623270, 
    "messageBody": "<div id=\"ygrps-yiv-1022540456\">Adam Jack wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am not saying my tests depends upon the run of another, no<br/>\n&gt; side effects, I am saying &quot;if my fruit class fails why bother<br/>\n&gt; testing my apple class? It has a rotten core.&quot; It kinda goes<br/>\n&gt; back to Bertrand Russell... If I know fruit is bad, then the<br/>\n&gt; fact that apple succeeds doesn&#39;t make it a healthy apple, it is<br/>\n&gt; unknown. <br/>\n&gt; <br/>\n&gt; Still, I don&#39;t think the idea has a chance of a fair hearing.<br/>\n<br/>\n </span></blockquote>Perhaps you would be more successfull in getting a &quot;fair hearing&quot; by<br/>\nproviding<br/>\n<br/>\n- more details on how the problem actually hurts you instead of just<br/>\nbeing an academic, presumed one<br/>\n- more evidence on actually having tried suggestions of experienced<br/>\nJunit users without success<br/>\n<br/>\nFrom the current discussion it is my perception that you seem to be more<br/>\ninterested in proposing your solution instead of solving your problem.<br/>\nPerhaps I just don&#39;t understand you. If so I would ask you to change the<br/>\nway you speak to me, as I currently don&#39;t know how to change the way I<br/>\nlisten.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;       That really is it.  No dependency concept exists, because it is<br/>\n&gt;       something to discourage.  Dependencies are a sign that the code<br/>\n&gt;       needs more decoupling and more refactoring.<br/>\n&gt; <br/>\n&gt; Point taken on discouragement, and boy -- yes -- I&#39;ve felt that. ;-)<br/>\n&gt; <br/>\n&gt; I think test content dependency is wrong, but not what I am<br/>\n&gt; saying. Either that, or you decouple yourself from everything<br/>\n&gt; you do, a purist goal of no real world value. Code used code, that is<br/>\n&gt; a dependency. <br/>\n<br/>\n </span></blockquote>My experience is different. But this is already tackled by other posts.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;       In the example, in Kent&#39;s book he relays the experience of<br/>\n&gt;       having a test suite that would run overnight, and sometimes<br/>\n&gt;       nothing would break and other times he&#39;d get a printout of many<br/>\n&gt;       pages with all of his bugs. It turned out that the large<br/>\n&gt;       printout usually meant one test failed and caused cascading<br/>\n&gt; failures through the rest of the tests due to       dependencies. <br/>\n&gt; <br/>\n&gt; This is all about test content dependency -- side effects --<br/>\n&gt; and I never meant that.<br/>\n<br/>\n </span></blockquote>Is it? How is it different from what you experience/imagine?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Why get a fruit basket full of errors<br/>\n&gt; when fruit is bad? I was actually trying to reduce this mess<br/>\n&gt; of an output to &quot;the *possible* root cause -- and if nothing<br/>\n&gt; else, a place to start cleaning up&quot;.<br/>\n<br/>\n </span></blockquote>Yes. You can do this by not letting the basket depend on the<br/>\nimplementation of fruit. It&#39;s possible, even valuable to strive for this<br/>\ndecoupling.<br/>\n<br/>\nRegards, Ilja</div>", 
    "prevInTime": 8922, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059740806", 
    "canDelete": false, 
    "nextInTopic": 8924, 
    "prevInTopic": 8922, 
    "headers": {
        "inReplyToHeader": "PDAwM2QwMWMzNTcwMCQzNjlhM2M0MCQxOTc4MTYwYUBzeWJhc2UuY29tPg==", 
        "messageIdInHeader": "PDAwMWMwMWMzNTgyOCQyY2M4ZDA0MCQ3MDY0YThjMEBkaXN5Lm5ldD4="
    }
}