{
    "numMessagesInTopic": 106, 
    "nextInTime": 8927, 
    "senderId": "30v_z6hgxBKSBc4ADS52uMc9CFb2fK4MRB-ACoOVceEVLFWLLrHGsaioItPpk-wO5bSlijGu-inXWIvfJbKkAUIYxqVWUn_D", 
    "systemMessage": false, 
    "subject": "JUnit for folks who need good testing (was RE: [junit] TestCase Dependency Hierarchy)", 
    "from": "&quot;Adam Jack&quot; &lt;ajack@...&gt;", 
    "authorName": "Adam Jack", 
    "msgSnippet": "... Ilja, ... Ilja, I was attempting to use sarcasm to make a point, and the wink was intended to convey that. I know e-mail is so tone flat, so maybe I", 
    "msgId": 8926, 
    "profile": "arb_jack", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124707332, 
    "messageBody": "<div id=\"ygrps-yiv-986762601\"><blockquote><span title=\"ireply\">&gt;&gt;       If your project has a big problem with core classes failing on a<br/>\n\t&gt;&gt;       regular basis, then maybe you have a process/people problem, as<br/>\n\t&gt; \topposed to a  technical problem.<br/>\n\t&gt;<br/>\n\t&gt; So junit is for folks who don&#39;t really need good testing? ;-)<br/>\n<br/>\n </span></blockquote>Ilja,<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;\tAdam, I don&#39;t fully understand your intent here, but your sentence does<br/>\n&gt;\tfeel overly rude to me. The smiley really doesn&#39;t change much.<br/>\n<br/>\n </span></blockquote>Ilja, I was attempting to use sarcasm to make a point, and the wink was<br/>\nintended to convey that. I know e-mail is so tone flat, so maybe I shouldn&#39;t<br/>\nhave taken the risk, but I was not meaning to be rude. I apologize if that<br/>\nis how it came off.<br/>\n<br/>\nAlso -- if you interpreted this as &quot;junit isn&#39;t good&quot;, please don&#39;t. I was<br/>\nreplying to J.B saying if I had lots of core failures then I had other<br/>\nproblems, and I was saying --- don&#39;t folks w/ problems need good testing? I<br/>\nhope the words in the sentence I wrote didn&#39;t come off as &quot;junit is not<br/>\ngood&quot;.<br/>\n<br/>\nThat all said, please give me a break. I&#39;ve praised jUnit, I&#39;ve tolerated<br/>\njibes (so as not to start a flame war) and on the whole I&#39;ve tried very hard<br/>\nto be very level -- not try to score too many cheap points -- and keep a<br/>\nhealthy sense of humour, despite a lot of contentious comments.<br/>\n<br/>\n\tI also think that the whole xJunit<br/>\n\tcommunity has done very much for the better regarding unit testing - it<br/>\n\tdoesn&#39;t deserve such comments.<br/>\n<br/>\n\tBut perhaps I am overreacting because I strongly feel as part of the<br/>\n\tcommunity you attacked with above sentence. I also don&#39;t understand at<br/>\n\tall how it connects to J.B.&#39;s suggestion (which I think probably isn&#39;t<br/>\n\ttotally misguided). Would you like to elaborate?<br/>\n<br/>\nI didn&#39;t attack it at all. I think jUnit is awesome for helping me in the<br/>\nearly phase of rapid application development, and (once things grow) in the<br/>\nretaining of contract knowledge. I use it most when I am refactoring a lot,<br/>\nand when my code is breaking a lot. I was trying to make the point that that<br/>\nis exactly when folks need junit the most...<br/>\n<br/>\nAgain, please forgive me if my choice of words failed to convey the correct<br/>\npoint.<br/>\n<br/>\nregards,<br/>\n<br/>\nAdam</div>", 
    "prevInTime": 8925, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059744467", 
    "canDelete": false, 
    "nextInTopic": 8927, 
    "prevInTopic": 8925, 
    "headers": {
        "inReplyToHeader": "PDAwMTIwMWMzNTgwNiQ3ZjAxZDM2MCQ3MDY0YThjMEBkaXN5Lm5ldD4=", 
        "messageIdInHeader": "PDAwNDYwMWMzNTgzMCRiMzhjZjVlMCQ1Mjc4MTYwYUBzeWJhc2UuY29tPg=="
    }
}