{
    "numMessagesInTopic": 106, 
    "nextInTime": 8929, 
    "senderId": "-c_C0f8o28tVmvgXP46XXYvX9l-KnRlAomfFHP_hp2v8OCHgnhJ1Csy8pOgzUiXVhBn07Ss2g04-lBiN1GN0POwb_yc7Ukqi", 
    "systemMessage": false, 
    "subject": "Logic (RE: [junit] TestCase Dependency Hierarchy)", 
    "from": "&quot;Adam Jack&quot; &lt;ajack@...&gt;", 
    "authorName": "Adam Jack", 
    "msgSnippet": "I will admit, I was put off by the whole focus on logic as opposed to the point I was trying to discuss. I feel that a first time poster ought be given a", 
    "msgId": 8928, 
    "profile": "arb_jack", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124707332, 
    "messageBody": "<div id=\"ygrps-yiv-1151507444\">I will admit, I was put off by the whole focus on logic as opposed to the<br/>\npoint I was trying to discuss. I feel that a first time poster ought be<br/>\ngiven a little more leeway before being picked apart on distraction issues.<br/>\nIf a mailing list is only for those with total intimate knowledge of the<br/>\nproduct/terminology/concepts, then I find that a closed list. As I tried<br/>\nsaying with humour, forget logic steps -- try to discuss my point, if might<br/>\nbe right. Forget logic steps, I was trying to says &quot;if suites are the<br/>\ninternal representation of testcase collections, with hierarchy, then help<br/>\nthe user mange them&quot;.<br/>\n<br/>\nThat said, maybe my approach/point was too contentious off the bat, and got<br/>\nwhat it (unintentionally) deserved.<br/>\n<br/>\nPerhaps I should have said:<br/>\n<br/>\n    &quot;If suites are testcase hierarchy, then I don&#39;t think it is the users<br/>\njob to manage them&quot;.<br/>\n<br/>\nor better yet:<br/>\n<br/>\n    &quot;If we accept that suites can represent dependency, then I don&#39;t think<br/>\nit is the users job  to manage them&quot;.<br/>\n<br/>\nJust because I used my word not yours, doesn&#39;t mean my point was absurd.<br/>\nAlso, this is hardly a logical conclusion. I was attempting to establish<br/>\ncommon ground to communicate, and then make a point.<br/>\n<br/>\nI think this highlights much of the problem I&#39;ve had communicating with<br/>\nfolks on this list. I think it is the &quot;list experts&quot; job to attempt to<br/>\nunderstand the well intentioned ramblings of the newbies, not rip them<br/>\napart...<br/>\n<br/>\nAll in all, I need to find a way to communicate better. Clearly, what I<br/>\nwrite is not what you read. However, I wish we could have spent the time<br/>\nwhittling through that rather than side issues...<br/>\n<br/>\nregards,<br/>\n<br/>\nAdam<br/>\n<br/>\n<blockquote><span title=\"ireply\">    &gt;each time) but this is the crux of my argument: If (big IF) suites are<br/>\n  &gt;testcase dependencies,<br/>\n<br/>\n </span></blockquote>  They absolutely, positively are NOT. I cannot stress this enough. A<br/>\nTestSuite is an arbitrary collection of Test objects, and nothing more.<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;then I don&#39;t think it ought be the user&#39;s job to<br/>\n  &gt;manage them -- I think the framework should.<br/>\n<br/>\n </span></blockquote>  Since your hypothesis is wrong, your conclusion is not meaningful. :)<br/>\n(That&#39;s logic&#39;s fault, not mine.)<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt; It is easy for me (outside the<br/>\n  &gt;code) to say this, but I think they were a useful construct before, but<br/>\n  &gt;they<br/>\n  &gt;may have outlived their usefulness. I posit that suites are the existing<br/>\n  &gt;hammer, so they are making things seem like a nail.<br/>\n<br/>\n </span></blockquote>  I don&#39;t understand this statement at all. A TestSuite is just a composite<br/>\ncollection of tests. What else do you propose to use?<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;    &gt;My examples were just simple ones. Dependency can be in the eye of<br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\">   &gt;    &gt;beholder... :-)<br/>\n  &gt;<br/>\n  &gt;    I don&#39;t know that it can be: dependency is or is not.<br/>\n  &gt;<br/>\n  &gt;I was saying dependency due to aggregation, you were saying dependency<br/>\n </span></blockquote>due<br/>\n<blockquote><span title=\"ireply\">   &gt;to feature. I was agreeing that users could set dependency for whatever<br/>\n  &gt;reason they chose.<br/>\n<br/>\n </span></blockquote>  I see, yes.<br/>\n<br/>\n  &lt;snip /&gt;<br/>\n<blockquote><span title=\"ireply\">   &gt;<br/>\n  &gt;      Maybe I misunderstand Test Collectors -- point me to something to<br/>\n  &gt;learn more, if you don&#39;t mind<br/>\n  &gt;     -- but don&#39;t they just       create TestSuite objects?<br/>\n  &gt;<br/>\n  &gt;Unfortunately I don&#39;t have that information, I know they scan classpaths<br/>\n  &gt;and<br/>\n  &gt;match class patterns (e.g. *Test*). I assume they build a testsuite (or<br/>\n  &gt;collection of such) but I don&#39;t know, sorry. Taking a brief look at some<br/>\n  &gt;ant<br/>\n  &gt;code they may even use an array/enumeration of testcases & their own<br/>\n  &gt;runner,<br/>\n  &gt;but I can&#39;t be sure.<br/>\n<br/>\n </span></blockquote>  The bottom line is that the mechanism is essentially the same as a<br/>\nTestSuite, and a TestSuite is just a collection!<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;      Your way to declare a test suite is already supported by JUnit and<br/>\n </span></blockquote>a<br/>\n<blockquote><span title=\"ireply\">   &gt;little    cute refactoring.<br/>\n  &gt;<br/>\n  &gt;      Consider the AllTests pattern. I can reduce it to a collection of<br/>\n  &gt;AllTests or  TestCase class names with a little neat refactoring. Then I<br/>\n  &gt;can<br/>\n  &gt;use that little engine to store AllTests as text. The next step is to<br/>\n  &gt;generate that text by doing a directory scan. Now I have a TestSuite<br/>\n  &gt;builder<br/>\n  &gt;that build tests from a part of the file system.<br/>\n  &gt;<br/>\n  &gt;      I did nothing to change JUnit. I just decorated it. Does it belong<br/>\n </span></blockquote>in<br/>\n<blockquote><span title=\"ireply\">   &gt;the framework? I don&#39;t think so. That&#39;s a question of taste, in my<br/>\n </span></blockquote>opinion.<br/>\n<blockquote><span title=\"ireply\">   &gt;<br/>\n  &gt;Great explanation of your position, and good summary of the crux of this<br/>\n  &gt;discussion as it stands. My views to follow.<br/>\n  &gt;<br/>\n  &gt;So I think we understand each other quite well -- I just don&#39;t understand<br/>\n  &gt;why you think this feature you suggest should be part of the framework?<br/>\n </span></blockquote>Why<br/>\n<blockquote><span title=\"ireply\">   &gt;isn&#39;t it a candidate for JUnit-addons or something like that?<br/>\n  &gt;<br/>\n  &gt;A few responses:<br/>\n  &gt;<br/>\n  &gt;1) Perhaps set the clock back. What say the original implementation had<br/>\n  &gt;test<br/>\n  &gt;case dependency, not test suites. Who is to say that suites warrant<br/>\n  &gt;inclusion but dependencies do not? Maybe suites must stay  for backwards<br/>\n  &gt;compatibility (although I feel they are declining in usage) but why<br/>\n  &gt;oughtn&#39;t<br/>\n  &gt;dependency be there?<br/>\n<br/>\n </span></blockquote>  If you haven&#39;t already, read Kent Beck&#39;s original paper where he develops<br/>\nSUnit. Perhaps some insight from there will help.<br/>\n<br/>\n  Your underlying hypothesis appears to be this:<br/>\n<br/>\n  If class A depends on B, then there exist tests T(A) that test A and tests<br/>\nT(B) that test B such that T(A) depends on T(B).<br/>\n<br/>\n  It is on this basis that you want JUnit to manage those dependencies. I<br/>\nclaim first that JUnit can&#39;t, and second that JUnit shouldn&#39;t.<br/>\n<br/>\n  1. JUnit can&#39;t manage the dependencies without human intervention.<br/>\n  2. JUnit shouldn&#39;t manage the dependencies because they are not universal.<br/>\n<br/>\n  I do not view dependencies the way you do. What we have in common, though,<br/>\nis that we each need to be able to execute different collections of tests at<br/>\ndifferent times. This is why the former is not a part of the framework and<br/>\nthe latter is. That is the essence of framework. What you want to build is a<br/>\ntool. So build it.<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;2) I think dependency needs to be managed on the testcase, hence be an<br/>\n  &gt;optional aspect of that class. I think separating this out into a<br/>\n </span></blockquote>separate<br/>\n<blockquote><span title=\"ireply\">   &gt;structure (like suite) is a recipe for rust. ***This is why I think it<br/>\n  &gt;needs<br/>\n  &gt;to be part of the framework, not an add on.***<br/>\n<br/>\n </span></blockquote>  Disagree. I don&#39;t want that feature. I&#39;m sure I&#39;m not alone (Dave?). For<br/>\nthat reason, adding it to the framework makes the framework noisy. A<br/>\nframework ought to include what&#39;s needed for universal solutions and nothing<br/>\nmore. Everything else is a tool.<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;3) Given test collectors (classpath/directory scanners) -- and given<br/>\n </span></blockquote>things<br/>\n<blockquote><span title=\"ireply\">   &gt;like Eclipse testcase wizards --- I believe suites are fading out of<br/>\n  &gt;consciousness. As such, I think it is less to learn to say &quot;my testcase<br/>\n  &gt;depends upon these testcases&quot; than learn a the testsuite concept.<br/>\n<br/>\n </span></blockquote>  Get this straight: TEST CASE DEPENDENCY IS EVIL. Test cases should be as<br/>\nindependent as possible. It should be possible to select a number of tests<br/>\nand just run them. JUnit supports that. You can build your TestSuite however<br/>\nyou want. The fact that there aren&#39;t better tools for this surprises me.<br/>\n<br/>\n  This mailing list has several messages showing people scratching their<br/>\nheads over which tests to run instead of just creating a TestSuite with the<br/>\ntests they want. It&#39;s like THEY DON&#39;T REALIZE that a TestSuite can contain<br/>\nany tests they want -- even if they belong to completely different TestCase<br/>\nobjects, and so on. They are in jail: their view is narrowed artificially by<br/>\nnot seeing the simplicity of TestSuite: it&#39;s just a collection of tests.<br/>\nCollect &#39;em however you want.<br/>\n<br/>\n  You want to collect &#39;em by test case dependency -- however *YOU* define<br/>\nit -- then go write the code to do it. It ain&#39;t that hard. It still doesn&#39;t<br/>\nbelong in the framework, because IT IS NOT UNIVERSAL USAGE. It is a narrow<br/>\nview of how to put tests together.<br/>\n<br/>\n  You see Test Collectors as a replacement for TestSuite objects. With<br/>\nrespect, that&#39;s absurd, unless the JUnit test runner is not adequate for<br/>\ntheir task. Still, why they decide to reinvent the wheel, I can&#39;t imagine.<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;4) I believe (IMHO -- w/ no market research, just based on projects I<br/>\n </span></blockquote>know)<br/>\n<blockquote><span title=\"ireply\">   &gt;that dependency has great user benefit than manual test suite. As such,<br/>\n </span></blockquote>I&#39;d<br/>\n<blockquote><span title=\"ireply\">   &gt;like it in the framework to aid the most users.<br/>\n<br/>\n </span></blockquote>  If you need to collect tests based on your notion of dependency, then you<br/>\nwould be a complete idiot to continue maintaining test suites manually.<br/>\nEventually you should automate that work. Why do you insist on comparing<br/>\nautomated tasks to manual ones?<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;Remember that my goal -- Kent&#39;s goal, too -- is to keep JUnit very tight<br/>\n  &gt;and<br/>\n  &gt;small. It should provide just enough for everyone, rather than a glut of<br/>\n  &gt;features that have limited use. The less to learn, the better. If you<br/>\n </span></blockquote>need<br/>\n<blockquote><span title=\"ireply\">   &gt;more, grab add-on package X, add-on package Y and add-on package Z.<br/>\n  &gt;<br/>\n  &gt;I can understand that goal, and I might agree w/ it academically. That<br/>\n  &gt;said,<br/>\n  &gt;I think product purity comes (a close) second to usability. And even with<br/>\n  &gt;that said, I don&#39;t see how your goal counters what I suggested & doesn&#39;t<br/>\n  &gt;fit<br/>\n  &gt;it.<br/>\n<br/>\n </span></blockquote>  Because your need is not my need, so don&#39;t pollute JUnit with things that<br/>\nonly some people need. That&#39;s not a framework.<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;      Also, the more magic in the package, the less the users need to<br/>\n </span></blockquote>learn<br/>\n<blockquote><span title=\"ireply\">   &gt;to use it. I want them to know what they&#39;re doing.<br/>\n  &gt;<br/>\n  &gt;My goal is better testing through easier test management, easier test<br/>\n  &gt;result<br/>\n  &gt;analysis. That said, I don&#39;t see how the approach I am suggesting doesn&#39;t<br/>\n  &gt;fit this.<br/>\n<br/>\n </span></blockquote>  So build it. I&#39;m sure people will use it. It doesn&#39;t belong in the<br/>\nframework.<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;BTW: Long before the end of this mail I&#39;ve started to realize that this<br/>\n  &gt;whole e-mail chain is an academic exercise, unlikely to result in change.<br/>\n  &gt;JUnit still rocks, and I use it fervently, this was just a random thought<br/>\n  &gt;that seemed to feel like an epiphany so I posted it...<br/>\n<br/>\n </span></blockquote>  Well, in general, JUnit doesn&#39;t change much. That&#39;s intentional. That&#39;s<br/>\nwhy we have projects like JUnit-addons, GSBase and so on.<br/>\n<br/>\n  You feel a need. If no-one has implemented it, then it&#39;s up to you. Either<br/>\nway, it does not have universal appeal, so it does not belong in the<br/>\nframework. That&#39;s all. It&#39;s very, very simple.<br/>\n<br/>\n  Take care. I think we&#39;re done here. :)<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;<br/>\n  &gt;regards,<br/>\n  &gt;<br/>\n  &gt;Adam<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;[Non-text portions of this message have been removed]<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;Yahoo! Groups Sponsor<br/>\n  &gt;ADVERTISEMENT<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;To unsubscribe from this group, send an email to:<br/>\n  &gt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n </span></blockquote>  J. B. Rainsberger,<br/>\n  President, Diaspar Software Services<br/>\n  Let&#39;s write software that people understand.<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com/\">http://www.diasparsoftware.com/</a><br/>\n  telephone: +1 416 791-8603<br/>\n<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor<br/>\n              ADVERTISEMENT<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  To unsubscribe from this group, send an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 8927, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059747668", 
    "canDelete": false, 
    "nextInTopic": 8929, 
    "prevInTopic": 8927, 
    "headers": {
        "inReplyToHeader": "PDIwMDMwNzMxMTMwOTEyMDAyMi4wMzc0RkQ2OUBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PDAwNGUwMWMzNTgzOCQyNzU0NjEwMCQ1Mjc4MTYwYUBzeWJhc2UuY29tPg=="
    }
}