{
    "numMessagesInTopic": 106, 
    "nextInTime": 8935, 
    "senderId": "gFlEsEZB1DVUw94GHsfcOwjxW0KzNK9DKdDzpHlyOBYHmKEpd8iePtRtwxczNSWKvVF5On7IwNYIhWgJdnlvPXSNuTuBjgDA", 
    "systemMessage": false, 
    "subject": "Major refactoring & JUnit (was RE: [junit] TestCase Dependency Hierarchy)", 
    "from": "&quot;Adam Jack&quot; &lt;ajack@...&gt;", 
    "authorName": "Adam Jack", 
    "msgSnippet": "... I can see that, for some more stable situations. The situation I had was that I was undertaking a major (major) refactor of some core things that I didn t", 
    "msgId": 8934, 
    "profile": "arb_jack", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124707332, 
    "messageBody": "<div id=\"ygrps-yiv-6050081\">Ilja wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;\t*If* you do have a process/people problem, though, I don&#39;t think that<br/>\n&gt;\ttinkering with Junit is the best solution. The mass of failing tests is<br/>\n&gt;\tonly a symptom, and by trying to fix it with Junit, you will only cure<br/>\n&gt;\tthe symptom, not the real problem. By solving the real problem, the need<br/>\n&gt;\tto change the way Junit works will vanish. In fact, aggravating the<br/>\n&gt;\tproblem by letting more tests fail due to a single problem might<br/>\n&gt;\tactually *help* you solve the real problem (by making it more visible).<br/>\n&gt;\t*If* you do have a process/people problem.<br/>\n<br/>\n </span></blockquote>I can see that, for some more stable situations. The situation I had was<br/>\nthat I was undertaking a major (major) refactor of some core things that I<br/>\ndidn&#39;t consider clean & couldn&#39;t live with. I knew I was going to break some<br/>\nmajor things, and was *very glad* I had a large working test suite before I<br/>\nstarted it. Being test infected I felt empowered to make the huge change &<br/>\nthat junit would help me do it quickly, with damage control, and a<br/>\nconfidence at the end that my contracts with the outside world wouldn&#39;t have<br/>\nbeen broken.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;\tSo, tell us more about those failing tests?<br/>\n<br/>\n </span></blockquote>I broke my core, re-designed it, re-wrote it -- no holds bars I dived in.<br/>\nLoved it, felt much better for the refactor. Then it was &quot;clean-up time&quot;,<br/>\ntime to put my tests back in order. I waded through the mass of failed tests<br/>\n... and where to start, which first? Basically I tried working &quot;bottom up&quot;,<br/>\nensuring a stabilizing foundation. I realized I was having to figure this<br/>\nout from knowing the code, knowing the packages. TestCases &quot;store&quot; my<br/>\ncontract knowledge, but not more -- they don&#39;t help this part of the major<br/>\nrefactor.<br/>\n<br/>\nAs such, I had my little epiphany on dependency. Why can&#39;t testcases express<br/>\ntheir own dependencies also & give &quot;starting places&quot; after a major refactor.<br/>\nHence I posted here...<br/>\n<br/>\nregards<br/>\n<br/>\nAdam</div>", 
    "prevInTime": 8933, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059749093", 
    "canDelete": false, 
    "nextInTopic": 8935, 
    "prevInTopic": 8933, 
    "headers": {
        "inReplyToHeader": "PDAwMjYwMWMzNTgzOCQ2YzBmYmYxMCQ3MDY0YThjMEBkaXN5Lm5ldD4=", 
        "messageIdInHeader": "PDAwNTcwMWMzNTgzYiQ3YWE1YjIyMCQ1Mjc4MTYwYUBzeWJhc2UuY29tPg=="
    }
}