{
    "numMessagesInTopic": 106, 
    "nextInTime": 8936, 
    "senderId": "BuQisfsVot2iVMKXW_LRVSwik1YVsThtxC5-Ia33Se-zqMc1p5a615K7dPULAHN7MTdAe1jEzPnIXp1zcSz1rPX_MIVDmG61Q6SkjJVQru0_clXeGles", 
    "systemMessage": false, 
    "subject": "RE: Automated Collectors and Suites (was RE: [junit] TestCase Dependency Hierarchy)", 
    "from": "&quot;Stirling, Scott&quot; &lt;scott.stirling@...&gt;", 
    "authorName": "Stirling, Scott", 
    "msgSnippet": "... Ant doesn t leverage much of anything from JUnit except the TestListener interface, which it even extends because the TestListener interface doesn t", 
    "msgId": 8935, 
    "profile": "stirlingdev", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 150177187, 
    "messageBody": "<div id=\"ygrps-yiv-224108727\"><blockquote><span title=\"ireply\">&gt; -----Original Message-----<br/>\n&gt; From: Adam Jack [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ajack@...\">ajack@...</a>]<br/>\n&gt; <br/>\n&gt; What I consider a shame is the amount of stuff used in order <br/>\n&gt; to &quot;leverage the framework&quot;. I&#39;m sorry, but it seems to me <br/>\n&gt; that there is little or no use of the framework, ant has <br/>\n&gt; effectively re-written it. Sure, it is nice that a<br/>\n&gt; framework can have extension points, but it seems a shame to need to<br/>\n&gt; leverage so many. It seems (from reading this) that ant leverages the<br/>\n&gt; testcase class &quot;assert&quot; helper methods & little else.<br/>\n<br/>\n </span></blockquote>Ant doesn&#39;t &quot;leverage&quot; much of anything from JUnit except the TestListener interface, which it even extends because the TestListener interface doesn&#39;t specify event handlers for suite starts and ends.  This is as it should be, I think, although JUnit&#39;s junit.runner.* package could be vastly improved with a small amount of work so that it&#39;s contribution to the world of test runners was a little more useful.<br/>\n<br/>\nThe way to look at it is that Ant and other tools built on and around JUnit like JUnitPerf, Eclipse and Artima SuiteRunner *support* what has become the de facto standard API for writing unit tests in Java.  Funny, perhaps, that JUnit helped achieve this by shipping with what I consider &quot;reference implementation&quot; test runners.  Think of them that way and maybe your perspective will change.<br/>\n<br/>\nJUnit&#39;s most important contribution (IMHO) are the interfaces in junit.framework.* -- not the test runners, which for some reason have become the focus here.  Think of it like the Servlet API or EJB or whatever.  The JCP provides an API, some tech specs, and a reference implementation which allow vendors to provide containers that support the API, add extra features and basically build a cottage industry around it.<br/>\n<br/>\nScott Stirling<br/>\nFramingham, MA</div>", 
    "prevInTime": 8934, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059749189", 
    "canDelete": false, 
    "nextInTopic": 8937, 
    "prevInTopic": 8934, 
    "headers": {
        "messageIdInHeader": "PDcyMDY4Mjk4Q0Q5OTEwNEFBRURFMkZERjg5QUMxNjBEMDdGRjc5QGF2YW50aS5jb3JwLndvcmtzY2FwZS5uZXQ+"
    }
}