{
    "numMessagesInTopic": 106, 
    "nextInTime": 8939, 
    "senderId": "84FYy07ajVCCqZYCCDcWrG-rvMVyR4hFm291pSQNa-PkEnmsqYLm4_jDBtZ-HdelKr2VtYdRn_jHoEoiGh7b6Wi7umCBskksHQ9-S4YUKQ", 
    "systemMessage": false, 
    "subject": "RE: [junit] TestCase Dependency Hierarchy", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... OK, I think I m clear on your definition. ... Let me parrot back so that I understand: Test A verifies that you can successfully walk a classpath and", 
    "msgId": 8938, 
    "profile": "nails762", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-942796447\"><blockquote><span title=\"ireply\">&gt;So said Adam Jack on 2003-07-31 --------------------<br/>\n&gt;<br/>\n&gt;&gt;      A quick question: how do you have test dependency (in your sense)<br/>\n&gt;without<br/>\n&gt;test content dependency?<br/>\n&gt;<br/>\n&gt;No side effects, that was my differentiation. A test doesn&#39;t depend upon<br/>\n&gt;the<br/>\n&gt;side effects of a run of another, but (at some user determined level) the<br/>\n&gt;run of one test ought depend upon the completion of and success of another.<br/>\n<br/>\n </span></blockquote>OK, I think I&#39;m clear on your definition.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;      When I wrote a few examples, I found that when one test depends on<br/>\n&gt;another<br/>\n&gt;(in your sense) there is<br/>\n&gt;&gt;      duplication in the tests. At a minimum, the two tests make the same<br/>\n&gt;assertions.<br/>\n&gt;<br/>\n&gt;Ok, another example. I have a class that walks a classpath and generates<br/>\n&gt;listener events on things found, I test that. I have a class that listens<br/>\n&gt;to<br/>\n&gt;such events to &quot;find&quot; things that match a certain criterion, I test that.<br/>\n&gt;If<br/>\n&gt;the first class fails to send events, then I ought not blame (or dig into)<br/>\n&gt;the second for not finding anything. The tests are (I believe) unit tests<br/>\n&gt;of<br/>\n&gt;each, without duplication.<br/>\n<br/>\n </span></blockquote>Let me parrot back so that I understand:<br/>\n<br/>\nTest A verifies that you can successfully walk a classpath and decide whether to generate an event based on the contents of the classpath.<br/>\n<br/>\nTest B verifies that on receiving an event, something happens.<br/>\n<br/>\nThese tests are totally isolated from one another, as far as I can see. Why would you label Test B as dependent on Test A?<br/>\n<br/>\nIf I were writing the tests, I would write Test A this way:<br/>\n<br/>\ntestGenerateEvents<br/>\n    classpathInfo = new ClasspathInfo();    // a description of what&#39;s on the classpath, without talking to a classpath to get it<br/>\n    eventGenerator = new EventGenerator(classpathInfo);<br/>\n    eventCollector = new EventCollector();    // implements your listener interface and just collects the events<br/>\n    eventGenerator.addListener(eventCollector);<br/>\n    eventGenerator.go();    // generate events<br/>\n<br/>\n    expectedEvents = ....;    // a list of the events you expect to generate for the above classpathInfo<br/>\n    assertEquals(expectedEvents, eventCollector.events());<br/>\n<br/>\nIn other words, verify the expected events are generated from a given classpathInfo. This is an excellent candidate for a parameterized test case.<br/>\n<br/>\nI would write Test B this way:<br/>\n<br/>\ntestHandleEvents<br/>\n    eventHandler = new EventHandler();    // your &quot;thing finder&quot;, whatever it does<br/>\n<br/>\n    anEvent = new SomethingOnTheClasspathEvent();    // an event your event generator might generate<br/>\n<br/>\n    eventHandler.onEvent(anEvent);<br/>\n    // assert something about what your event handler did with the event<br/>\n<br/>\nIn this case, handling the events and generating the events are tested in isolation. The failure of one has nothing at all to do with the other.<br/>\n<br/>\nSo, either:<br/>\n<br/>\n* I misunderstand your requirements, or<br/>\n* There is no dependency between these tests and we need a different example<br/>\n<br/>\nYou tell me. :)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;      The closer an object is to the core of your application, the more<br/>\n&gt;important (I think) that failures in that &gt;      object yell loudly and<br/>\n&gt;annoyingly.<br/>\n&gt;<br/>\n&gt;If one is goign to test, then any single test failing is loud enough. Why<br/>\n&gt;get 50 random reports when one focused one would do?<br/>\n<br/>\n </span></blockquote>If you&#39;re getting random reports then the design has big problems: bigger than the issue we&#39;re discussing here. In this case, I can see temporarily disabling doomed tests as a great refactoring aid, but it falls into the same category as something like GSBase&#39;s OrderedTestSuite: I use it to refactor myself out of a corner, but I&#39;m glad when I don&#39;t need it anymore.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;      If your project has a big problem with core classes failing on a<br/>\n&gt;regular<br/>\n&gt;&gt;      basis, then maybe you have a process/people problem, as opposed to a<br/>\n&gt;technical problem.<br/>\n&gt;<br/>\n&gt;So junit is for folks who don&#39;t really need good testing? ;-)<br/>\n<br/>\n </span></blockquote>I realize you&#39;re joking, but I honestly don&#39;t see how this follows. Let me clarify: if your core classes are failing on a regular basis, then you need to concentrate on testing them and stop building new code. (People problem: don&#39;t realize the core is rotten.) In this case, I would suggest zeroing in on tests for the core classes and working on just those for a while. Once this is done and the core classes work, your dependency issue goes from serious problem to mild annoyance *and* your system is more stable.<br/>\n<br/>\nTake care.<br/>\n<br/>\n<br/>\nJ. B. Rainsberger,<br/>\nPresident, Diaspar Software Services<br/>\nLet&#39;s write software that people understand.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com/\">http://www.diasparsoftware.com/</a><br/>\ntelephone: +1 416 791-8603</div>", 
    "prevInTime": 8937, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059836572", 
    "canDelete": false, 
    "nextInTopic": 8939, 
    "prevInTopic": 8937, 
    "headers": {
        "inReplyToHeader": "PDAwN2UwMWMzNTdjYiQxZDU2YzdmMCQyODc4MTYwYUBzeWJhc2UuY29tPg==", 
        "messageIdInHeader": "PDIwMDMwODAyMTEwMjUyMDExNC4wMDQ0QjREOEBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDAwN2UwMWMzNTdjYiQxZDU2YzdmMCQyODc4MTYwYUBzeWJhc2UuY29tPg=="
    }
}