{
    "numMessagesInTopic": 106, 
    "nextInTime": 8943, 
    "senderId": "Gt59VbVP2s5BBh0GIDaAbUjkqwlvTvfl92rHrdBOz1ueSS6IDx-y1rTiyKm4hAGFWLpVYWmIGK5P6m0whqQa_F_v1D9MXW3S", 
    "systemMessage": false, 
    "subject": "Writing code (was RE: [junit] TestCase Dependency Hierarchy)", 
    "from": "&quot;Adam Jack&quot; &lt;ajack@...&gt;", 
    "authorName": "Adam Jack", 
    "msgSnippet": "... Why, right is right however one arrives at it. Just cos it isn t proven, doesn t make it not right. Why not accept good fortune occasionally? ... I have", 
    "msgId": 8942, 
    "profile": "arb_jack", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124707332, 
    "messageBody": "<div id=\"ygrps-yiv-570539392\">Ilja wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> \t&gt;      To me a conclusion which might be right out of plain luck *is*<br/>\n\t&gt;      irrelevant.<br/>\n<br/>\n </span></blockquote>Why, right is right however one arrives at it. Just &#39;cos it isn&#39;t proven,<br/>\ndoesn&#39;t make it not right. Why not accept good fortune occasionally?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> \t&gt; I write code, I test my code, I debug my code when tests fail<br/>\n\t&gt; by trying to analyse the output. I was hoping for it to be<br/>\n\t&gt; easier to analyse, w/o a lot of manual effort, but I don&#39;t<br/>\n\t&gt; have an itch big enough to attempt to write such a tool --<br/>\n\t&gt; especially when it&#39;d be cheap/clean to do it in the<br/>\n\t&gt; framework.<br/>\n<br/>\n&gt;\tSo you are actually concerned about who will be writing the code to make<br/>\n&gt;\tit work?<br/>\n<br/>\n </span></blockquote>I have open source projects I help out with, I think the bigger test is the<br/>\ncommunity of folk you work with. If I am this out of synch with you all it<br/>\nisn&#39;t a good start. There are many reason why software projects fail, and I<br/>\ndon&#39;t need to start one that appears so unwelcomed by the development team<br/>\nfor the product (that I like/use so much) that I was hoping to assist  w/<br/>\n&quot;my little epiphany&quot;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> \t&gt; Also, much as I could craft some sort of add on<br/>\n\t&gt; (perhaps leverage my own sub-class from TestCase) I think it<br/>\n\t&gt; needs too much of what is in the framework in order to work<br/>\n\t&gt; well, and I don&#39;t fancy re-writing the thing.<br/>\n<br/>\n&gt;\tI don&#39;t think you&#39;d need to rewrite anything.<br/>\n<br/>\n </span></blockquote>But I do, and if I am writing it that matters more. Few people here have<br/>\neven accepted the need for the concept, and other than &quot;go write you own<br/>\ncollectors&quot; not offered help, so why would I waste time on the<br/>\nimplementation?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> \t&gt; I use eclipse, I use ant -- I like the integration into those<br/>\n\t&gt; tools more than I like my idea. If I can&#39;t get you to<br/>\n\t&gt; contemplate the concept, then I probably have little chance<br/>\n\t&gt; of persuading them. If they don&#39;t use it, I won&#39;t benefit. Another<br/>\n\t&gt; reason not to start.<br/>\n<br/>\n </span></blockquote>\tYou wouldn&#39;t need to persuade anyone. Both Eclipse and Ant are open<br/>\n\tsource and have a quite mature plugin concept.<br/>\n<br/>\nYes, I know, I&#39;ve written for both. I&#39;m hardly going to try to replicate all<br/>\nthe work for both plugins just to try to get this point over.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> \t&gt; This was my first topic on this mailing list, and much as you<br/>\n\t&gt; were pretty measured/polite (at least at the start) I don&#39;t<br/>\n\t&gt; think I&#39;ll be back for more. Open Source is (IMHO) about open<br/>\n\t&gt; minded discussion of ideas, and I don&#39;t think I found that<br/>\n\t&gt; here. No worries, have fun w/ what you do.<br/>\n<br/>\n&gt;\tIt is also about contribution. I think we would all be pleased to see<br/>\n&gt;\tyou write your tool and happy to help you where we can. If it proves to<br/>\n&gt;\tbe valuable to many people, the best way to distribute it could be<br/>\n&gt;\treconsidered.<br/>\n<br/>\n </span></blockquote>Sorry, I&#39;ve heard that too many times before. Sure, it is a filter of who<br/>\nwants to put skin in the game, but it can also be used as an easy barrier.<br/>\nYes, I know it is &quot;part of OSS the process -- the trial by code production&quot;,<br/>\nbut it doesn&#39;t make it always right & I am not sure it is right here.<br/>\n<br/>\nIf the community of developers/users on a project isn&#39;t open to accepting a<br/>\ncore change [and I feel that is the default reaction here -- right or wrong]<br/>\nthen it doesn&#39;t making it a welcoming environment to want to invest to much<br/>\neffort. As such, what could be done as an internal change gets relegated to<br/>\na large external development. Sorry, as I&#39;ve stated before -- I wanted to<br/>\nclean up some ugly reporting mess, not re-write a testing tool.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;\tNo hard feelings,<br/>\n<br/>\n </span></blockquote>Glad you feel that way.<br/>\n<br/>\nregards<br/>\n<br/>\nAdam</div>", 
    "prevInTime": 8941, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059746118", 
    "canDelete": false, 
    "nextInTopic": 8944, 
    "prevInTopic": 8939, 
    "headers": {
        "inReplyToHeader": "PDAwMTcwMWMzNTgwYiRmNGZkOTU5MCQ3MDY0YThjMEBkaXN5Lm5ldD4=", 
        "messageIdInHeader": "PDAwNGQwMWMzNTgzNCQ4YjY0ODQzMCQ1Mjc4MTYwYUBzeWJhc2UuY29tPg=="
    }
}