{
    "numMessagesInTopic": 106, 
    "nextInTime": 8947, 
    "senderId": "iYwh4QQvh50FCn-yclppsjbSycjS7TK3cFo0fyEgMmjVF_EKFC9_8Vaqrw9_uJc4-rqBYrLofXXgq6W95I71XLG0q5wVX59HPzUn", 
    "systemMessage": false, 
    "subject": "RE: [junit] TestCase Dependency Hierarchy", 
    "from": "David Boyer &lt;mangr3n@...&gt;", 
    "authorName": "David Boyer", 
    "msgSnippet": "... I hope that you don t feel that everyone s contentious, there is a spirit of the free exchange of ideas.  (I m referring to your previous post.)  By the", 
    "msgId": 8946, 
    "rawEmail": "Return-Path: &lt;mangr3n@...&gt;\r\nReceived: (qmail 33805 invoked from network); 1 Aug 2003 15:07:13 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m18.grp.scd.yahoo.com with QMQP; 1 Aug 2003 15:07:13 -0000\r\nReceived: from unknown (HELO n2.grp.scd.yahoo.com) (66.218.66.75)\n  by mta1.grp.scd.yahoo.com with SMTP; 1 Aug 2003 15:07:13 -0000\r\nX-eGroups-Return: mangr3n@...\r\nReceived: from [66.218.66.119] by n2.grp.scd.yahoo.com with NNFMP; 01 Aug 2003 15:07:12 -0000\r\nX-Sender: mangr3n@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 24956 invoked from network); 1 Aug 2003 06:16:31 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m17.grp.scd.yahoo.com with QMQP; 1 Aug 2003 06:16:31 -0000\r\nReceived: from unknown (HELO nomad.teamdekade.com) (4.60.219.51)\n  by mta2.grp.scd.yahoo.com with SMTP; 1 Aug 2003 06:16:30 -0000\r\nReceived: from [172.30.30.129] (unknown [172.30.30.129])\n\tby nomad.teamdekade.com (Postfix) with ESMTP id DC85E1783D\n\tfor &lt;junit@yahoogroups.com&gt;; Fri,  1 Aug 2003 02:17:15 -0400 (EDT)\r\nSubject: RE: [junit] TestCase Dependency Hierarchy\r\nTo: junit@yahoogroups.com\r\nIn-Reply-To: &lt;003d01c35700$369a3c40$1978160a@...&gt;\r\nReferences: &lt;003d01c35700$369a3c40$1978160a@...&gt;\r\nContent-Type: text/plain\r\nOrganization: \r\nMessage-Id: &lt;1059741413.2162.67.camel@localhost&gt;\r\nMime-Version: 1.0\r\nX-Mailer: Ximian Evolution 1.2.4- \r\nDate: 01 Aug 2003 08:36:53 -0400\r\nContent-Transfer-Encoding: 7bit\r\nFrom: David Boyer &lt;mangr3n@...&gt;\r\nX-Yahoo-Group-Post: member; u=138345974\r\nX-Yahoo-Profile: mangr3n\r\nX-eGroups-Approved-By: nails762 &lt;jbrains@...&gt; via web; 01 Aug 2003 15:07:12 -0000\r\n\r\nOn Wed, 2003-07-30 at 21:08, Adam Jack wrote:\n&gt; David wrote:\n&gt; \n&gt;       Here is the crux of the problem with your argument.  As far as I\n&gt;       understand unit testing using an xUnit framework and as part of the XP\n&gt;       process.  The existence of test interdependencies (outside of thread\n&gt;       testing) is a code smell which is avoided.  If the xUnit framework\n&gt; were\n&gt;       to support the concept of dependencies it would be promoting a\n&gt; specific\n&gt;       code smell which it is intende to avoid.\n&gt; \n&gt; I don&#39;t think a truer word has been spoken in this thread.  I think you are\n&gt; spot on. I think I trod in some &quot;test *content* dependency&quot; stigma, when I\n&gt; was discussing run order &quot;test dependency order&quot;, which I don&#39;t feel is the\n&gt; same.\n\nI hope that you don&#39;t feel that everyone&#39;s contentious, there is a\nspirit of the free exchange of ideas.  (I&#39;m referring to your previous\npost.)  By the way what language are you working in?\n\n&gt; \n&gt; I am not saying my tests depends upon the run of another, no side effects, I\n&gt; am saying &quot;if my fruit class fails why bother testing my apple class? It has\n&gt; a rotten core.&quot; It kinda goes back to Bertrand Russell... If I know fruit is\n&gt; bad, then the fact that apple succeeds doesn&#39;t make it a healthy apple, it\n&gt; is unknown.\n&gt; \n\nThe way I understand this type of situation with testing in XP.\n\n1. I only test one or two classes relative to the one I&#39;m currently\nworking on.  Periodically (rarely) I run all tests.  A little more often\nI will run a suite that&#39;s a little bigger, specific to my module.\n\n2.  I only test functionality at it&#39;s source.  Meaning that subclasses\ndon&#39;t test inherited behavior.  \n\nIs this what you&#39;re referring to?  Inherited behavior?  I tend to only\nrun tests on the code I&#39;m working on.  Before I start working I run all\ntests.  I run all tests when I pull updates from CVS into my source\ntree.  And I run all tests when I&#39;m done making code changes before I\ncheck my code in.  But I don&#39;t run all the tests all the time.  I hear\nwhat you&#39;re saying, however I can&#39;t see it coming up for me during real\ndevelopment cycles.\n\n\n\n&gt; Still, I don&#39;t think the idea has a chance of a fair hearing.\n\nWell, ask Ron Jeffries or Kent Beck directly what they think.  Provide\nan example in code.  We may be missing something, it does happen. I\ndon&#39;t think any of us is fool enough to think we aren&#39;t.\n\n&gt; I agree in principle. That said, I tests in layers, building on each other.\n&gt; I can&#39;t put 1000 tests in one testcase, just as I would put 1000 class in\n&gt; one package. I just wanted to bring run order through simple statements of\n&gt; dependency. I think you see what I was saying, and you&#39;ve explained why I am\n&gt; getting nowhere.\n\nWhen we talk about testing here, are you talking about Unit Testing as a\ntool to write code?  Or are you talking about QA and/or Acceptance\nTesting?\n\n&gt; Point taken on discouragement, and boy -- yes -- I&#39;ve felt that. ;-)\n\nHehe, it&#39;s not personal.  \n\n&gt; I think test content dependency is wrong, but not what I am saying. Either\n&gt; that, or you decouple yourself from everything you do, a purist goal of no\n&gt; real world value. Code used code, that is a dependency.\n\nNow, this decoupling point is I think the key.  I think you&#39;d find some\nreally healthy discussion about decoupling here.  Decoupling is to me\nthe holy grail for healthy code.  And these people prove daily that unit\ntesting helps get you there.\n\n\n&gt; This is all about test content dependency -- side effects -- and I never\n&gt; meant that. Why get a fruit basket full of errors when fruit is bad? I was\n&gt; actually trying to reduce this mess of an output to &quot;the *possible* root\n&gt; cause -- and if nothing else, a place to start cleaning up&quot;.\n\nOh this is what you want...  Well, that may be a reasonable thing. \n\nAre all of your test running everynight?  Are all other tests working at\nall times other than the one you&#39;re working on?  They should be.  Are\nall tests working before you begin coding?  Do you break and fix you&#39;re\ntests repeatedly?\n\nCheers,\n\nDavid B\n\n\n\n", 
    "profile": "mangr3n", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 138345974, 
    "prevInTime": 8945, 
    "contentTrasformed": false, 
    "postDate": "1059741413", 
    "canDelete": false, 
    "nextInTopic": 8948, 
    "prevInTopic": 8945, 
    "headers": {
        "inReplyToHeader": "PDAwM2QwMWMzNTcwMCQzNjlhM2M0MCQxOTc4MTYwYUBzeWJhc2UuY29tPg==", 
        "messageIdInHeader": "PDEwNTk3NDE0MTMuMjE2Mi42Ny5jYW1lbEBsb2NhbGhvc3Q+", 
        "referencesHeader": "PDAwM2QwMWMzNTcwMCQzNjlhM2M0MCQxOTc4MTYwYUBzeWJhc2UuY29tPg=="
    }
}