{
    "numMessagesInTopic": 106, 
    "nextInTime": 8964, 
    "senderId": "QLCt2HSaQivUHS0MFJUUjiDlN5gsaTeaM_kGIRimtd66sOcjdl5Eyh6pQAPv43z8xuQfBCvFeuj53GpcKPt-0U8tLvIV9XCw", 
    "systemMessage": false, 
    "subject": "RE: Writing code (was RE: [junit] TestCase Dependency  Hierarchy)", 
    "from": "&quot;Adam Jack&quot; &lt;ajack@...&gt;", 
    "authorName": "Adam Jack", 
    "msgSnippet": "... distorted what we have written. J.B. you ve said this to me more than once. Hopefully it is clear that I am trying, but there is a lot to read & mistakes", 
    "msgId": 8963, 
    "profile": "arb_jack", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124707332, 
    "messageBody": "<div id=\"ygrps-yiv-2143510024\">J.B. wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;\t Adam, please read more closely. This is the second time that you have<br/>\n </span></blockquote>distorted what we have written.<br/>\n<br/>\nJ.B. you&#39;ve said this to me more than once. Hopefully it is clear that I am<br/>\ntrying, but there is a lot to read & mistakes will be made. I feel you&#39;ve<br/>\ndistorted what I&#39;ve said a number of times, I think it is an unfortunate<br/>\naspect of communication, on both our parts. Hopefully with us both trying we<br/>\nare getting past that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;\tYour idea is not unwelcome. I have stated -- a few times -- that what you<br/>\n </span></blockquote>propose (the ability to<br/>\n<blockquote><span title=\"ireply\"> &gt;\tmanage dependencies of the sort you describe) is a good idea and would<br/>\n </span></blockquote>likely be welcome to others. All &gt;\tI have said is that I do not believe it<br/>\nbelongs at the core of JUnit.<br/>\n<br/>\nYou never communicated that to me. Your e-mails made me think otherwise.<br/>\nComments like:<br/>\n<br/>\n\t&quot;Get this straight: TEST CASE DEPENDENCY IS EVIL.&quot;<br/>\n<br/>\n... kinda made me think otherwise.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;\tAs for hoping that the JUnit team will assist you, I guess you don&#39;t know<br/>\n </span></blockquote>the JUnit team very well. Kent &gt;\tand Erich are nice folks, but they are not<br/>\nactive contributors to JUnit these days. Just look at the gulfs &gt;\tin time<br/>\nbetween releases to convince yourself. Kent and Erich are not going to jump<br/>\non board and help<br/>\n<blockquote><span title=\"ireply\"> &gt;\tyou with this. They don&#39;t have the time or energy. The real activity is in<br/>\n </span></blockquote>add-on projects like<br/>\n<blockquote><span title=\"ireply\"> &gt;\tJUnit-addons.<br/>\n<br/>\n </span></blockquote>Don&#39;t know them? Never heard of them, sorry and all. That is no insult, and<br/>\nno measure of my gratitude for what they&#39;ve produced and how I and the<br/>\ncommunity have benefited from their work. I also happen to have always been<br/>\nimpressed w/ the internals/design concepts in junit. That all said, none of<br/>\nthis is relevant .... I wasn&#39;t talking to them, I was talking to this list.<br/>\n<br/>\nOSS is (IMHO) a facet of the current community. I don&#39;t want help, I wanted<br/>\nto share/discuss a thought. If at the end of the day I write some code, then<br/>\ngreat, but I feel the idea needs better pressure testing & don&#39;t wish to<br/>\nrush to code.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;\t&lt;snip/&gt;<br/>\n&gt;\tA good solution to your problem is the second: a custom test runner with a<br/>\n </span></blockquote>dependency graph collector/analyzer.<br/>\n<br/>\nOk, so have we moved off &quot;I can do it with suites&quot;. I agree, a runner is<br/>\nalso needed. I also think I need a way (on the TestCase) to express<br/>\ndependency. But, if I write collector plus runner and add to testcase, how<br/>\nmuch of the framework have I replicated? How much benefited in my<br/>\nenvironment of ant and eclipse? Not much. I also don&#39;t want to take the ant<br/>\nroute and do an effective re-write.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;\tExcuse me: did you expect that we would suspend our lives and help you<br/>\n </span></blockquote>write what you need?<br/>\n<br/>\nActually, yes. Why not? Folks hack into junit out of love for it, out of a<br/>\ndesire to improve it. If something is a good idea, why not?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> \t&gt; That&#39;s not how open source works.<br/>\n<br/>\n </span></blockquote>Actually, I feel it is. Convince the development team it is a good idea, and<br/>\nimportant, and they (closer to the implementation) are more than likely to<br/>\ndo the work, and should &#39;cos they know the bigger picture. Well, that is how<br/>\nI feel if folks come to me for something.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> \t&gt; I didn&#39;t see you handing out invitations; but rather asking, &quot;Why don&#39;t<br/>\n </span></blockquote>you<br/>\n<blockquote><span title=\"ireply\"> \t&gt;\tpeople add this to JUnit?&quot; That we don&#39;t need, thanks.<br/>\n<br/>\n </span></blockquote>Your interpretation, not mine. I said -- is it a good thing for junit, I<br/>\nnever said I&#39;d not try to help write it.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> \t&gt;Yes, I know, I&#39;ve written for both. I&#39;m hardly going to try to replicate<br/>\n\t&gt; all the work for both plugins just to try to get this point over.<br/>\n<br/>\n&gt;\tThen I guess you don&#39;t need it that badly.<br/>\n<br/>\n </span></blockquote>Correct, but is that a measure of the idea, or the hurdle put in it&#39;s way?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;\tYou conclude that the community of developers is not open to accepting a<br/>\n </span></blockquote>core change.<br/>\n<blockquote><span title=\"ireply\"> &gt; \tThe alternate conclusion is that the community of developers does not<br/>\n </span></blockquote>believe your particular proposed<br/>\n<blockquote><span title=\"ireply\"> &gt;\tchange is a good idea.<br/>\n&gt;\tOn what basis did you choose your conclusion over the alternative?<br/>\n<br/>\n </span></blockquote>From the fact that I only heard your voice, and (perhaps incorrectly, it was<br/>\nmy first posting) I felt that maybe you spoke for the community. Nobody else<br/>\nwas doing so back then. For all I knew you could&#39;ve been &quot;the original<br/>\nauthor&quot;. Whatever, the ideas presented on the mailing list give newbies like<br/>\nme feeling for the community. A community is what it posts...<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;\tWhen you are ready to accept the possibility that we merely disagree with<br/>\n </span></blockquote>you, rather than are<br/>\n<blockquote><span title=\"ireply\"> &gt;\tnefariously blocking your proposal, please come back and discuss this with<br/>\n </span></blockquote>us again.<br/>\n<br/>\nNice try, but wrong. I am often wrong, numerous times -- and more than I am<br/>\nright. Honestly, I love it when somebody proves me wrong on something, I<br/>\nfeel I&#39;ve learned something. But, I can&#39;t quit a discussion because it<br/>\nbecomes an argument, I couldn&#39;t let this idea die because of distractions.<br/>\nIt didn&#39;t get a fair hearing (back then) and I&#39;m glad the rest of the list<br/>\nhas stepped in and opened things up. I was ready to quit, but now am<br/>\nlearning more & benefiting from the comments.<br/>\n<br/>\nregards<br/>\n<br/>\nAdam</div>", 
    "prevInTime": 8962, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059753977", 
    "canDelete": false, 
    "nextInTopic": 8964, 
    "prevInTopic": 8962, 
    "headers": {
        "inReplyToHeader": "PDIwMDMwODAyMTEzODMwMDU5OS4wMDY1NTY0REBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PDAwNzEwMWMzNTg0NiRkOTUyNzI4MCQ1Mjc4MTYwYUBzeWJhc2UuY29tPg=="
    }
}