{
    "numMessagesInTopic": 106, 
    "nextInTime": 8969, 
    "senderId": "kysNUO_-SzbdDzj0FLoaepN9IP7PJVg8VZ3qNT3c2sJlhDre4u_D1N4GDKGMeKdp_MjNWoWMvnbvKbfD4vUdL-wPYWjek3uYhlAE0f4fLw", 
    "systemMessage": false, 
    "subject": "RE: Writing code (was RE: [junit] TestCase Dependency   Hierarchy)", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... I m not telling you do be perfect; I m asking you to take your time and be sure of what you read. ... I have not claimed that you said something that you", 
    "msgId": 8968, 
    "profile": "nails762", 
    "topicId": 8807, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-1307126146\"><blockquote><span title=\"ireply\">&gt;So said Adam Jack on 2003-08-01 --------------------<br/>\n&gt;J.B. wrote:<br/>\n&gt;<br/>\n&gt;&gt;      Adam, please read more closely. This is the second time that you<br/>\n&gt;have<br/>\n&gt;distorted what we have written.<br/>\n&gt;<br/>\n&gt;J.B. you&#39;ve said this to me more than once. Hopefully it is clear that I am<br/>\n&gt;trying, but there is a lot to read & mistakes will be made.<br/>\n<br/>\n </span></blockquote>I&#39;m not telling you do be perfect; I&#39;m asking you to take your time and be sure of what you read.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I feel you&#39;ve<br/>\n&gt;distorted what I&#39;ve said a number of times, I think it is an unfortunate<br/>\n&gt;aspect of communication, on both our parts. <br/>\n<br/>\n </span></blockquote>I have not claimed that you said something that you did not say. You have done that to me.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Hopefully with us both trying<br/>\n&gt;we<br/>\n&gt;are getting past that.<br/>\n<br/>\n </span></blockquote>I&#39;m still here.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;      Your idea is not unwelcome. I have stated -- a few times -- that<br/>\n&gt;what you<br/>\n&gt;propose (the ability to<br/>\n&gt;&gt;      manage dependencies of the sort you describe) is a good idea and<br/>\n&gt;would<br/>\n&gt;likely be welcome to others. All &gt;      I have said is that I do not<br/>\n&gt;believe it<br/>\n&gt;belongs at the core of JUnit.<br/>\n&gt;<br/>\n&gt;You never communicated that to me.<br/>\n<br/>\n </span></blockquote>Do I really have to go back and quote myself again? Come on.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Your e-mails made me think otherwise.<br/>\n&gt;Comments like:<br/>\n&gt;<br/>\n&gt;      &quot;Get this straight: TEST CASE DEPENDENCY IS EVIL.&quot;<br/>\n&gt;<br/>\n&gt;.... kinda made me think otherwise.<br/>\n<br/>\n </span></blockquote>That was before I understood what you meant by &quot;dependency&quot;. Once we clarified that, I kept saying, &quot;Yes, yes; this is good, but it just doesn&#39;t belong in the framework.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;&gt;      As for hoping that the JUnit team will assist you, I guess you<br/>\n&gt;don&#39;t know<br/>\n&gt;the JUnit team very well. Kent &gt;      and Erich are nice folks, but they<br/>\n&gt;are not<br/>\n&gt;active contributors to JUnit these days. Just look at the gulfs &gt;      in<br/>\n&gt;time<br/>\n&gt;between releases to convince yourself. Kent and Erich are not going to jump<br/>\n&gt;on board and help<br/>\n&gt;&gt;      you with this. They don&#39;t have the time or energy. The real<br/>\n&gt;activity is in<br/>\n&gt;add-on projects like<br/>\n&gt;&gt;      JUnit-addons.<br/>\n&gt;<br/>\n&gt;Don&#39;t know them? Never heard of them, sorry and all. That is no insult, and<br/>\n&gt;no measure of my gratitude for what they&#39;ve produced and how I and the<br/>\n&gt;community have benefited from their work. I also happen to have always been<br/>\n&gt;impressed w/ the internals/design concepts in junit. That all said, none of<br/>\n&gt;this is relevant .... I wasn&#39;t talking to them, I was talking to this list.<br/>\n<br/>\n </span></blockquote>They are the JUnit team; not us. I think it&#39;s entirely relevant. We do not build JUnit; they do.<br/>\n<br/>\nYou wrote: There are many reason why software projects fail, and I<br/>\n<blockquote><span title=\"ireply\"> &gt;don&#39;t need to start one that appears so unwelcomed by the development team<br/>\n&gt;for the product (that I like/use so much) that I was hoping to assist  w/<br/>\n&gt;&quot;my little epiphany&quot;.<br/>\n<br/>\n </span></blockquote>The development team for the product is Kent and Erich; not the rest of us.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;OSS is (IMHO) a facet of the current community. I don&#39;t want help, I wanted<br/>\n&gt;to share/discuss a thought. If at the end of the day I write some code,<br/>\n&gt;then<br/>\n&gt;great, but I feel the idea needs better pressure testing & don&#39;t wish to<br/>\n&gt;rush to code.<br/>\n<br/>\n </span></blockquote>But you appeared to conclude that we are closed-minded based on the fact that we don&#39;t think your proposal belongs in the framework. Did you allow for the possiblity that we considered your proposal within the context of our collective experience with JUnit and other JUnit-related projects and our judgment simply led us to the decision that your proposal does not belong in the framework?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;&gt;      &lt;snip/&gt;<br/>\n&gt;&gt;      A good solution to your problem is the second: a custom test runner<br/>\n&gt;with a<br/>\n&gt;dependency graph collector/analyzer.<br/>\n&gt;<br/>\n&gt;Ok, so have we moved off &quot;I can do it with suites&quot;. I agree, a runner is<br/>\n&gt;also needed. I also think I need a way (on the TestCase) to express<br/>\n&gt;dependency. But, if I write collector plus runner and add to testcase, how<br/>\n&gt;much of the framework have I replicated? How much benefited in my<br/>\n&gt;environment of ant and eclipse? Not much. I also don&#39;t want to take the ant<br/>\n&gt;route and do an effective re-write.<br/>\n<br/>\n </span></blockquote>You have replicated none of the framework; you have built on top of the framework. I don&#39;t know why you don&#39;t see this.<br/>\n<br/>\nYou extend (not rewrite) TestCase. You provide an extra implementation of TestListener. You extend BaseTestRunner or use JUnit-addons&#39; Test Runner. I admit that sorting the dependency graph is a tough one: I don&#39;t know what to d there.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;      Excuse me: did you expect that we would suspend our lives and help<br/>\n&gt;you<br/>\n&gt;write what you need?<br/>\n&gt;<br/>\n&gt;Actually, yes. Why not? Folks hack into junit out of love for it, out of a<br/>\n&gt;desire to improve it. If something is a good idea, why not?<br/>\n<br/>\n </span></blockquote>I want to clarify your answer: you *expect* us to do this? Are you sure you know what you&#39;re saying here?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;      &gt; That&#39;s not how open source works.<br/>\n&gt;<br/>\n&gt;Actually, I feel it is. Convince the development team it is a good idea,<br/>\n&gt;and<br/>\n&gt;important, and they (closer to the implementation) are more than likely to<br/>\n&gt;do the work, and should &#39;cos they know the bigger picture. Well, that is<br/>\n&gt;how<br/>\n&gt;I feel if folks come to me for something.<br/>\n<br/>\n </span></blockquote>It&#39;s a fine idea; it does not belong in the framework. No convincing required.<br/>\n<br/>\nWhat is the difference between your view of open source and the student who is too lazy to do his own homework and complains that others do not volunteer to do it for him? Serious question.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;      &gt; I didn&#39;t see you handing out invitations; but rather asking, &quot;Why<br/>\n&gt;don&#39;t<br/>\n&gt;you<br/>\n&gt;      &gt;      people add this to JUnit?&quot; That we don&#39;t need, thanks.<br/>\n&gt;<br/>\n&gt;Your interpretation, not mine. I said -- is it a good thing for junit, I<br/>\n&gt;never said I&#39;d not try to help write it.<br/>\n<br/>\n </span></blockquote>OK. You asked, &quot;Is it a good thing for JUnit?&quot;<br/>\n<br/>\nMy answer (once again): it sounds like a valuable tool; it is not a good candidate to disrupt the framework for, since (except for sorting the dependency graph) it is easy to implement without changing JUnit.<br/>\n<br/>\nIt sounds to me like your beef is with Ant and Eclipse and not JUnit: their particular test runner implementations stop you from integrating your idea with the environment you want to use. So change the tools.<br/>\n<br/>\nOne does not change a framework to support limited tools. One expands the tools.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;      &gt;Yes, I know, I&#39;ve written for both. I&#39;m hardly going to try to<br/>\n&gt;replicate<br/>\n&gt;      &gt; all the work for both plugins just to try to get this point over.<br/>\n&gt;<br/>\n&gt;&gt;      Then I guess you don&#39;t need it that badly.<br/>\n&gt;<br/>\n&gt;Correct, but is that a measure of the idea, or the hurdle put in it&#39;s way?<br/>\n<br/>\n </span></blockquote>I think you have the wrong picture of the size of the hurdle in the way. The way I see it, except for sorting the dependency graph, this doesn&#39;t require more than about 50 lines of code. Perhaps there is some open source topographical sort package we can add on.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;      You conclude that the community of developers is not open to<br/>\n&gt;accepting a<br/>\n&gt;core change.<br/>\n&gt;&gt;       The alternate conclusion is that the community of developers does<br/>\n&gt;not<br/>\n&gt;believe your particular proposed<br/>\n&gt;&gt;      change is a good idea.<br/>\n&gt;&gt;      On what basis did you choose your conclusion over the alternative?<br/>\n&gt;<br/>\n&gt;From the fact that I only heard your voice, and (perhaps incorrectly, it<br/>\n&gt;was<br/>\n&gt;my first posting) I felt that maybe you spoke for the community.<br/>\n<br/>\n </span></blockquote>I speak for me. You choose to believe that or you don&#39;t. I don&#39;t much care either way, but if you continue to posit that I speak for others, then you will continue under an unnecessary misapprehension.<br/>\n<br/>\nBy the way, others have chimed in and agreed that the framework need not be disrupted. I don&#39;t care that they agree with me from an ego perspective; but I would hope you realize that it&#39;s not just me in the discussion anymore.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Nobody<br/>\n&gt;else<br/>\n&gt;was doing so back then. For all I knew you could&#39;ve been &quot;the original<br/>\n&gt;author&quot;. Whatever, the ideas presented on the mailing list give newbies<br/>\n&gt;like<br/>\n&gt;me feeling for the community. A community is what it posts...<br/>\n<br/>\n </span></blockquote>If you&#39;re going to conclude about a community from one person&#39;s writing, then you&#39;re going to fool yourself regularly.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;      When you are ready to accept the possibility that we merely<br/>\n&gt;disagree with<br/>\n&gt;you, rather than are<br/>\n&gt;&gt;      nefariously blocking your proposal, please come back and discuss<br/>\n&gt;this with<br/>\n&gt;us again.<br/>\n&gt;<br/>\n&gt;Nice try, but wrong. I am often wrong, numerous times -- and more than I am<br/>\n&gt;right. Honestly, I love it when somebody proves me wrong on something, I<br/>\n&gt;feel I&#39;ve learned something. But, I can&#39;t quit a discussion because it<br/>\n&gt;becomes an argument, I couldn&#39;t let this idea die because of distractions.<br/>\n&gt;It didn&#39;t get a fair hearing (back then) and I&#39;m glad the rest of the list<br/>\n&gt;has stepped in and opened things up. I was ready to quit, but now am<br/>\n&gt;learning more & benefiting from the comments.<br/>\n<br/>\n </span></blockquote>OK, so we&#39;re past &quot;you people aren&#39;t listening to me&quot; and into &quot;you people just don&#39;t agree with me&quot;. Good. When we do get to &quot;let&#39;s just try to do this&quot;?<br/>\n<br/>\nTake care.<br/>\n<br/>\nJ. B. Rainsberger,<br/>\nPresident, Diaspar Software Services<br/>\nLet&#39;s write software that people understand.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com/\">http://www.diasparsoftware.com/</a><br/>\ntelephone: +1 416 791-8603</div>", 
    "prevInTime": 8967, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1059842532", 
    "canDelete": false, 
    "nextInTopic": 8969, 
    "prevInTopic": 8967, 
    "headers": {
        "inReplyToHeader": "PDAwNzEwMWMzNTg0NiRkOTUyNzI4MCQ1Mjc4MTYwYUBzeWJhc2UuY29tPg==", 
        "messageIdInHeader": "PDIwMDMwODAyMTI0MjEyMDYzNS4wMDlGQTgyMUBzc210cC5ibG9vci5pcy5uZXQuY2FibGUucm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDAwNzEwMWMzNTg0NiRkOTUyNzI4MCQ1Mjc4MTYwYUBzeWJhc2UuY29tPg=="
    }
}