{
    "numMessagesInTopic": 8, 
    "nextInTime": 9069, 
    "senderId": "pIoz4qxLDFjL_lUfluMVODP6eTsoGA8AX4QfVBkijvD0Lh5xxM2pnuukg_DdmroDVJp7X8IMPcogA52aB86VhfwRVQgeO86sgwJeD19OAqU6fPYmtuZmc3PN", 
    "systemMessage": false, 
    "subject": "A method for estimating number of junit test cases using Cyclomatic complexity", 
    "from": "&quot;Selvakumar Ganesan&quot; &lt;selvakumar.ganesan@...&gt;", 
    "authorName": "Selvakumar Ganesan", 
    "msgSnippet": "Hi, I am trying to estimate effort for writing a regression test suite based on Junit for an existing system. The method used for estimation is very simple", 
    "msgId": 9068, 
    "profile": "webaesthet", 
    "topicId": 9068, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 126832352, 
    "messageBody": "<div id=\"ygrps-yiv-718466487\">Hi,<br/>\nI am trying to estimate effort for writing a regression test suite based<br/>\non Junit for an existing system. <br/>\nThe method used for estimation is very simple (and possibly very wrong<br/>\ntoo) as described below. I greatly appreciate all inputs and thoughts on<br/>\nthis. I googled and found no past or present precedent to estimating<br/>\nJunit test efforts based on Code complexity measures. I may have missed<br/>\nsomething important due to my ignorance and relative newness to Junit<br/>\nand estimation. I shall gladly stand corrected by more knowledgeable<br/>\nfolks.<br/>\n<br/>\n---------------------------------------------<br/>\n*Hypotheses<br/>\nThe working hypothesis for the effort estimation was &quot;a strong<br/>\ncorelation between cyclomatic complexity of existing code and the effort<br/>\nto write junit tests for the code&quot;.<br/>\n<br/>\nAs a consequence of this hypothesis it is further purported that &quot;the<br/>\nnumber of independent execution paths (Cyclomatic complexity) is equal<br/>\nto the number of test methods&quot;. This dictates some nasty terms to how<br/>\nthe junit tests must be structured but it is believed to be a *resonable<br/>\nthing* for estimation purposes.<br/>\n<br/>\n<br/>\n*The estimation method<br/>\nWeighted Methods Per Class (WMPC) was used as a measure of complexity.<br/>\nWMPC is defined to be &quot;the sum of the complexity of all methods for a<br/>\nclass, where each method is weighted by its cyclomatic complexity. The<br/>\nnumber of methods and the complexity of the methods involved is a<br/>\npredictor of how much time and effort is required to develop and<br/>\nmaintain the class. Only methods specified in a class are included, that<br/>\nis, any methods inherited from a parent are excluded.&quot;<br/>\n<br/>\nThe WMPC measured from the existing codebase was normalized for trivial<br/>\nmethods like getter and setters. <br/>\n<br/>\nThe effort was estimated using a simple formula:<br/>\nTotal Effort = Total number of test methods * Average effort for one<br/>\ntest method<br/>\n<br/>\nThe Total number of test methods is calculated as follows:-<br/>\nTotal test methods = Average WMPC of all classes * Number of classes<br/>\n<br/>\nThe Average effort for one test method (note that this is test method<br/>\nand not test case class) was estimated from actual efforts.<br/>\n<br/>\n*Sample calculation<br/>\nNumber of Classes = 973<br/>\nAverage WMPC ~= 9 (normalized for getter and setter methods. I used<br/>\nTogether ControlCenter-&gt;Metrics for all these measures)<br/>\nAverage effort per test method = 2 hours (It is upto the developer to<br/>\ndistribute the test methods in a test case classes)<br/>\n<br/>\nTotal effort for writing Junit tests = (9 * 973) * 2 hrs = 17, 514 hours<br/>\n= 2189 Person Days. <br/>\n(*huh..hmm*. Let the beatings begin. I can&#39;t adequaltely express in<br/>\nwords my manager&#39;s bewildered expression on seeing this number. But,<br/>\nthat&#39;s another story.)<br/>\n---------------------------------------------<br/>\n<br/>\nIf the general direction of the estimation is correct I would want to<br/>\nspend some time on refining the method to include all those important<br/>\nfactors I am sure I have missed out above. Suggestions and pointers<br/>\ntowards places I should look more closely to get a better grip is more<br/>\nthan welcome. Thank you your time and valuable feedback.<br/>\n<br/>\n<br/>\nRegards,<br/>\nSelva.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thescian.blogspot.com\">http://thescian.blogspot.com</a></div>", 
    "prevInTime": 9067, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1060331251", 
    "canDelete": false, 
    "nextInTopic": 9070, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PEJCMjIzRDEzRjI3QzJGNDJCNEY0NjBGQzkyNjc0MDgwNTI1MjNGQGJsci1pdHAtbXNnLndpcHJvLmNvbT4="
    }
}