{
    "numMessagesInTopic": 4, 
    "nextInTime": 9074, 
    "senderId": "nPuXtV79lZD1v0scKW9DYqmZQL6idJvbJPbVuTSMrFA1icFWScj9-gOtL_WxrkcGuiJBp9ybQgfn8PZb0PIRfFd_CahfoDQVXNiNtXB3yas", 
    "systemMessage": false, 
    "subject": "unit test metrics", 
    "from": "Christian Pekeler &lt;christian@...&gt;", 
    "authorName": "Christian Pekeler", 
    "msgSnippet": "I m unhappy about the small number of unit tests being written here and would like my colleagues to write more tests. Now I m considering creating a big", 
    "msgId": 9073, 
    "profile": "pekeler", 
    "topicId": 9073, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 63615397, 
    "messageBody": "<div id=\"ygrps-yiv-1428143347\">I&#39;m unhappy about the small number of unit tests being written here and <br/>\nwould like my colleagues to write more tests. Now I&#39;m considering <br/>\ncreating a big visible diagram showing the test coverage over time and <br/>\nupdating it every week to see if that will incite the team.<br/>\n<br/>\nI&#39;m thinking of creating a script that will count all public non-test <br/>\nmethods with more than 3 lines of code, and all test methods. The <br/>\ndiagram would show either the quotient (numberOfTestMethods divided by <br/>\nnumberOfBigProductionMethods) over time, or two graphs on top of each <br/>\nother, one for each number over time (any suggestions which one would <br/>\nbe better?). I would update the diagram every week. The diagram will be <br/>\nself explanatory, so I&#39;m not intending to introduce it to the team or <br/>\nexplain my motivations unless asked.<br/>\n<br/>\nReplacing the diagram after a while with a new one with different <br/>\ndimensions (longer time period on the x-axis, higher number on the <br/>\ny-axis) is probably confusing to observers of the diagram. So I&#39;m <br/>\nconsidering checking out older versions from our revision control <br/>\nsystem to see how fast the numbers grow and creating a big enough <br/>\ndiagram from the start.<br/>\n<br/>\nDoes anyone have any thoughts or suggestions about doing this any <br/>\ndifferent? Is this even a good idea considering that there isn&#39;t an <br/>\nabsolute ideal number or quotient (like bug-count where the ideal would <br/>\nbe zero)?<br/>\n<br/>\nDoes anyone already have a script (in sed, Io, Python, or whatever) <br/>\nthat will do something like this for Java source code and JUnit tests <br/>\nand is willing to share that with me?<br/>\n<br/>\n<br/>\nThanks,<br/>\nChristian</div>", 
    "prevInTime": 9072, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1060358410", 
    "canDelete": false, 
    "nextInTopic": 9074, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDYzNThBRjVDLUM5QjktMTFENy1BNEE3LTAwMDM5MzdDMERDQ0BwZWtlbGVyLm9yZz4="
    }
}