{
    "numMessagesInTopic": 8, 
    "nextInTime": 9077, 
    "senderId": "LopDpqGrj272j7HjX-LqOOa4gYlpB98dEaC4fvdALKrJvE0Bubh0rd0QKA-QHK5yNiEKNYZEYJC20Mt-ABmhYP4a2evep6SlSqjCgdeQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: A method for estimating number of junit test cases\tusing Cyclomatic complexi", 
    "from": "Jason Rogers &lt;jacaetevha@...&gt;", 
    "authorName": "Jason Rogers", 
    "msgSnippet": "... Along these lines... When a bug is found first write a test that captures the bug behavior, then fix the code.  That may be a significant investment,", 
    "msgId": 9076, 
    "profile": "jacaetev", 
    "topicId": 9068, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 109352929, 
    "messageBody": "<div id=\"ygrps-yiv-1841809944\">On Fri, 2003-08-08 at 11:58, Dave Astels wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>, &quot;Selvakumar Ganesan&quot;<br/>\n&gt; &lt;selvakumar.ganesan@w...&gt; wrote:<br/>\n&gt; &gt; Hi,<br/>\n&gt; &gt; I am trying to estimate effort for writing a regression test suite <br/>\n&gt; &gt; based on Junit for an existing system. <br/>\n&gt; <br/>\n&gt; Our approach/view is that you do not want to strive to build a fully<br/>\n&gt; comprehensive test suite from the beginning.. for just the reason you<br/>\n&gt; discovered.. it&#39;s a BIG time investment.  What you want to do is<br/>\n&gt; maximize the ROI of the time spent writing tests (i.e. get the biggest<br/>\n&gt; bang for the buck).  You need to find places in the codebase that<br/>\n&gt; would benefit the most from adding tests and go after those first. <br/>\n&gt; You just keep plugging away at it.. What&#39;s the worst problem?  Deal<br/>\n&gt; with it.  Now what&#39;s the worst problem.  Deal with it.. etc.  Also,<br/>\n&gt; when you work on a piece of code, wrap it in some tests first.  As you<br/>\n&gt; have more & more tests in place, you&#39;ll be better able to refactor<br/>\n&gt; into something that is more testable.. so you can add more & better<br/>\n&gt; tests.  Getting a legacy codebase under test (and under control!)<br/>\n&gt; isn&#39;t a big bang effort... it&#39;s gradual... part of everyone&#39;s daily work.<br/>\n<br/>\n </span></blockquote>Along these lines... When a bug is found first write a test that<br/>\ncaptures the bug behavior, then fix the code.  That may be a significant<br/>\ninvestment, depending on the complexity of the bug.  But, it will be<br/>\nwell worth it to have the TestFixture that catches it to make sure it<br/>\ndoesn&#39;t happen again.<br/>\n<br/>\nAlthough I agree with Dave (above) I will say this about the metrics<br/>\nthemselves, I think 2 hours is pretty high, especially if the code is at<br/>\na reasonably well-factored state (which it may not be, unless you had<br/>\n*_really_* disciplined developers).  Even if it isn&#39;t at that state, I<br/>\nstill think two hours as the average is too high.  I would estimate .75<br/>\nhours max as the average which would put you at 6567.75 hours (approx.<br/>\n821 person days).<br/>\n<br/>\n=jason</div>", 
    "prevInTime": 9075, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1060362705", 
    "canDelete": false, 
    "nextInTopic": 9078, 
    "prevInTopic": 9072, 
    "headers": {
        "inReplyToHeader": "PGJoMGhibyt0OGFkQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDEwNjAzNjI3MDYuMTU3NS45LmNhbWVsQFJoaW5vPg==", 
        "referencesHeader": "PGJoMGhibyt0OGFkQGVHcm91cHMuY29tPg=="
    }
}