{
    "numMessagesInTopic": 8, 
    "nextInTime": 9086, 
    "senderId": "6jZE0TROseZbCEcSR1_NW4YD8dJHacXkkTPRmRE07TJ_cMaui19I8e9wvHRVLJ-cajU3WQPNy0EsjHNArv8z1gwUtila438H6Sjrp75wt6zqMuXGloEOeSrm", 
    "systemMessage": false, 
    "subject": "RE:  Re: A method for estimating number of junit test cases using Cyclomatic complexi", 
    "from": "&quot;Selvakumar Ganesan&quot; &lt;selvakumar.ganesan@...&gt;", 
    "authorName": "Selvakumar Ganesan", 
    "msgSnippet": "Hi, The responses were invaluable. Thank you all. My manager hasn t shot me (yet). If I don t post again you can guess what would have happened to me. A few", 
    "msgId": 9085, 
    "profile": "webaesthet", 
    "topicId": 9068, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 126832352, 
    "messageBody": "<div id=\"ygrps-yiv-2076808974\">Hi,<br/>\nThe responses were invaluable. Thank you all. <br/>\nMy manager hasn&#39;t shot me (yet). If I don&#39;t post again you can guess<br/>\nwhat would have happened to me. <br/>\n<br/>\nA few observations<br/>\n2 hours is quite high.<br/>\nI agree it looks quite high. Some initial experiments at actually<br/>\nfinding out how much time it takes to write a test method gave those<br/>\nnumbers. And, as mentioned by JBR, it is true that the existing code<br/>\nwill need to be refactored for meaningful junit tests. So 2 hours may be<br/>\nthe closer to actuals. One of the implicit ideas was to provide a<br/>\nbaseline model with 100% code coverage and reasonably accurate<br/>\ncomplexity measures for classes, so that classes can be test infected<br/>\ndepending on the complexity and code coverage required. <br/>\nAs Bossicard pointed out, the final consensus in our team is to start<br/>\nwith Integration tests and write unit tests for those classes/packages<br/>\nthat throw up during integration testing. And, possibly use the<br/>\ncomplexity measures to find which classes need to be tested and how much<br/>\nthey should be tested. <br/>\nDave is spot on. Dave, we are trying to do what you have said. [You need<br/>\nto find places in the codebase that<br/>\nwould benefit the most from adding tests and go after those first.]<br/>\n<br/>\nBest regards,<br/>\nSelva.<br/>\n&quot;As small as possible. As soon as possible.&quot;</div>", 
    "prevInTime": 9084, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1060578656", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 9079, 
    "headers": {
        "messageIdInHeader": "PEJCMjIzRDEzRjI3QzJGNDJCNEY0NjBGQzkyNjc0MDgwNTI1MzFEQGJsci1pdHAtbXNnLndpcHJvLmNvbT4="
    }
}