{
    "numMessagesInTopic": 2, 
    "nextInTime": 9114, 
    "senderId": "K7XUgQZvGxjVEVEUh85Xz-9q1bmH26nrOGugHmJjCCcZnbGBcNqCjA6p8EzoC0Vn0XltmjDeWpQwh07uyWbmnsMbMwiH8bLyWznsxUjtiRWe", 
    "systemMessage": false, 
    "subject": "Recording test output for comparison in subsequent tests", 
    "from": "&quot;Graham Fitter&quot; &lt;grahamfitter@...&gt;", 
    "authorName": "Graham Fitter", 
    "msgSnippet": "Folks, I m wondering if anyone has invented (or abandoned!) a JUnit extension or other framework that covers this scenario: The code I m inventing generates", 
    "msgId": 9113, 
    "profile": "grahamfitter", 
    "topicId": 9113, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 152325483, 
    "messageBody": "<div id=\"ygrps-yiv-1886793585\">Folks,<br/>\n<br/>\nI&#39;m wondering if anyone has invented (or abandoned!) a JUnit extension<br/>\nor other framework that covers this scenario:<br/>\n<br/>\nThe code I&#39;m inventing generates text reports, which is fairly<br/>\ncumbersome to write asserts for. However its reasonably<br/>\nstraightforward to verify that a generated report is correct by manual<br/>\nexamination of the text.<br/>\n<br/>\nIt would be nice to be able to do this once, and store the actual<br/>\nresults in a file for verification. On subsequent test runs, the<br/>\ngenerated reports could be compared with the previously verified<br/>\nreports using asserts.<br/>\n<br/>\nI&#39;m sure it is possible to write a JUnit extension with a new<br/>\nassertSameAsLastTime() method that has two modes of operation: record<br/>\nthe results in a file, and compare the results with those in the file.<br/>\nThe mode could be controlled by a system property or something. The<br/>\nfile would need some sort of structure to associate results with test<br/>\ncases and the like.<br/>\n<br/>\nIf you&#39;ve got any experience, ideas or other opinions about this,<br/>\nplease speak up :-)<br/>\n<br/>\nCheers,<br/>\nGraham</div>", 
    "prevInTime": 9112, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1060892577", 
    "canDelete": false, 
    "nextInTopic": 9115, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PGJoZ3IzMSttYjBzQGVHcm91cHMuY29tPg=="
    }
}