{
    "numMessagesInTopic": 38, 
    "nextInTime": 9175, 
    "senderId": "GVCaRP6Yj88nRbC5k-uKqAQ6nJVrf7D4n1SX-O4IV_t-MzxlErlBVJezkXhDPwxbmIFc04zpRSUA8suCoVP8Y-Yj4rUua8gpW4wEKKOFu-Hv4nlWF3W7", 
    "systemMessage": false, 
    "subject": "RE: The goals of CMM (Re: [junit] wanted Junit professionals urgently)", 
    "from": "&quot;Stirling, Scott&quot; &lt;scott.stirling@...&gt;", 
    "authorName": "Stirling, Scott", 
    "msgSnippet": "... I m kinda straddling the middle.  I can see Michael Holly s point and JB s.   There s a lot of room for equivocation with the term customer, so I ll be", 
    "msgId": 9174, 
    "profile": "stirlingdev", 
    "topicId": 9148, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 150177187, 
    "messageBody": "<div id=\"ygrps-yiv-1131632496\"><blockquote><span title=\"ireply\">&gt; -----Original Message----- \r<br/>\n&gt; From: J. B. Rainsberger [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jbrains@...\">jbrains@...</a>] \r<br/>\n&gt; \r<br/>\n&gt; On the contrary: it admits the single most important \r<br/>\n&gt; quantitative analysis. \r<br/>\n&gt; \r<br/>\n&gt;      How many dollars are my clients willing to pay \r<br/>\n&gt;      me to continue building their software? \r<br/>\n&gt; \r<br/>\n&gt; &gt; How fast? How much value? What is business value? Unless \r<br/>\n&gt; &gt; your definition contains definable \r<br/>\n&gt; &gt; quantities then your definition is vague and ambiguous.  \r<br/>\n&gt; \r<br/>\n&gt; Fast enough so that my client is willing to keep paying me.* \r<br/>\n&gt; They decide how fast that is based -- one hopes -- on their ROI analysis, \r<br/>\n&gt; which they quantify. \r<br/>\n\r<br/>\n </span></blockquote>I&#39;m kinda straddling the middle.  I can see Michael Holly&#39;s point and JB&#39;s.   There&#39;s a lot of room for equivocation with the term &#39;customer,&#39; so I&#39;ll be brief. \r<br/>\n\r<br/>\nIn recent years I&#39;ve worked for two commercial J2EE app server vendors and now for an HRMS vendor targeting companies with employee counts &gt;= 10,000.  I&#39;ve never worked in product management, but have worked with them.  I&#39;ve only worked with actual money-on-the-table &quot;customers&quot; when I worked in tech support or went to user conferences.  But these guys were usually senior developers and recommenders, not C-level execs or mid-level managers.\r<br/>\n\r<br/>\nIn my experience, &quot;the customer&quot; is usually either product management, some heavyweight cloud-hidden investors or board members in your product or company, and to a lesser extent your power users who know your product or domain really well.  Power users may be actual customers or they may be internal QA engineers or tech support.  The idea of commercial software is to keep existing customers and get new ones.  If you only develop your software based on what your existing customers want, you won&#39;t be able to grow out of your existing market space and probably not within it either.\r<br/>\n\r<br/>\nGetting an actual &quot;customer&quot; by the collar is hard to do.  Many decisions in commercial enterprise software development (for good or ill) are based on speculation, past success/failure, domain knowledge within your staff, market trends and analysis, and what competitors are or are not doing.  Sometimes development is way ahead of project management in terms of defining feature requirements because the technology is, frankly, beyond them.  This is bad, but real.\r<br/>\n\r<br/>\nI think M. Holly&#39;s point might be made clearer by saying that software quality needs appropriate objective measures whether you are your own customer, whether you have actual customers (or their proxies, as in product management) or whether you are working on some new secret product that takes input partly select, NDA-bound potential customers or partners.  XP&#39;s insistence on frequent interaction with the customer, small incremental releases with feedback rolled back in frequently, is great and works to a certain extent.   Maybe it works better on smaller team projects (&quot;like it says on the box,&quot; as Steve Freeman likes to say).\r<br/>\n\r<br/>\nIn my experience, the customer (maybe &quot;paying consumer&quot; is less equivocal for what I mean here) has a reasonable expectation that the vendor will quantify, track and ensure good software quality with little or no involvement of the customer, just like there is an implicit expectation to have managers and team leads, build automation, source control and a QA process.  I mean nothing other than the same expectation we have that food at the grocery is not poisoned or rotten.\r<br/>\n\r<br/>\nPersonally, I think there are many ways to quantify &quot;better&quot; software and development and design processes.  Business value is hard to quantify, especially with predictive power.  Customer willingness and satisfaction are relative and qualitative.  I at least think CMM/CMMI has some value, but the bureaucratic weight of it is inhuman, in my little experience with it at a consulting firm a few years back.  There I am in agreement with JB.  I think the truth must be somewhere in between, but the larger your software engineering organization, the more likely you need something like CMM.  The smaller and better skilled and experienced your team is, the more they will probably benefit from agile methodolgies and practices.  Most places I have seen use some of both, with a lean toward process and documentation simply because so much money is at stake all the time. \r<br/>\n\r<br/>\nScott Stirling \r<br/>\nFramingham, MA</div>", 
    "prevInTime": 9173, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1061596004", 
    "canDelete": false, 
    "nextInTopic": 9176, 
    "prevInTopic": 9173, 
    "headers": {
        "messageIdInHeader": "PDcyMDY4Mjk4Q0Q5OTEwNEFBRURFMkZERjg5QUMxNjBEMDdGRkUxQGF2YW50aS5jb3JwLndvcmtzY2FwZS5uZXQ+"
    }
}