{
    "numMessagesInTopic": 38, 
    "nextInTime": 9177, 
    "senderId": "H7ByTNr7HcdfT9A9b7DSS5HcScPFZfAh9QsNRQ9zSxnsveVOiQDpFQEBJDjIANKZPAl7gzOzxyK3zOBnYfDkOrYFC-DJ9lXyC1F1RtQuCg", 
    "systemMessage": false, 
    "subject": "Re: The goals of CMM (Re: [junit] wanted Junit professionals urgently)", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "Stirling, Scott wrote:  ... Objective measures of software quality: * return on investment, including ancillary benefits such as the ability to", 
    "msgId": 9176, 
    "profile": "nails762", 
    "topicId": 9148, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-563562166\">Stirling, Scott wrote:<br/>\n<br/>\n&lt;snip /&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt; I think M. Holly&#39;s point might be made clearer by saying that software <br/>\n&gt; quality needs appropriate objective measures whether you are your own <br/>\n&gt; customer, whether you have actual customers (or their proxies, as in <br/>\n&gt; product management) or whether you are working on some new secret <br/>\n&gt; product that takes input partly select, NDA-bound potential customers or <br/>\n&gt; partners.  XP&#39;s insistence on frequent interaction with the customer, <br/>\n&gt; small incremental releases with feedback rolled back in frequently, is <br/>\n&gt; great and works to a certain extent.   Maybe it works better on smaller <br/>\n&gt; team projects (&quot;like it says on the box,&quot; as Steve Freeman likes to say).<br/>\n<br/>\n </span></blockquote>Objective measures of software quality:<br/>\n  * return on investment, including ancillary benefits such as the <br/>\nability to capitalize (literally) on more market opportunities<br/>\n  * defect reports from outside the development organization<br/>\n  * customer/user satisfaction<br/>\n<br/>\nI&#39;m sure there are more.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In my experience, the customer (maybe &quot;paying consumer&quot; is less <br/>\n&gt; equivocal for what I mean here) has a reasonable expectation that the <br/>\n&gt; vendor will quantify, track and ensure good software quality with little <br/>\n&gt; or no involvement of the customer, just like there is an implicit <br/>\n&gt; expectation to have managers and team leads, build automation, source <br/>\n&gt; control and a QA process.  I mean nothing other than the same <br/>\n&gt; expectation we have that food at the grocery is not poisoned or rotten.<br/>\n<br/>\n </span></blockquote>Of course we have to build software that works -- that&#39;s is a certain <br/>\npart of quality and we programmers manage that. We also have to build <br/>\nsoftware that solves problems, which is the more important part of <br/>\nquality and the customer has to be involved in managing that, otherwise <br/>\nwe don&#39;t know what problems to solve.<br/>\n<br/>\nDon&#39;t forget that we also have a certain expectation that the grocery <br/>\nstore also have a wide selection of products. High-quality apples alone <br/>\nisn&#39;t enough for the produce section. Gotta have oranges, too.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Personally, I think there are many ways to quantify &quot;better&quot; software <br/>\n&gt; and development and design processes.  Business value is hard to <br/>\n&gt; quantify, especially with predictive power.<br/>\n<br/>\n </span></blockquote>It&#39;s essentially impossible, isn&#39;t it? Even the projections are wonky at <br/>\nbest. In the end, someone trusts his gut.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Customer willingness and <br/>\n&gt; satisfaction are relative and qualitative.  <br/>\n<br/>\n </span></blockquote>Agreed, but cashflow is quantitative. The continuing flow of cash from <br/>\nthe paying customer to the programmers is a quantitative measure of the <br/>\nquality of products and services the programmers provide. It is <br/>\ntherefore a quantitative measure of the quality of their work and by <br/>\nextension the software itself. It&#39;s still relative, but everything&#39;s <br/>\nrelative.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt; I at least think CMM/CMMI<br/>\n&gt; has some value, but the bureaucratic weight of it is inhuman, in my <br/>\n&gt; little experience with it at a consulting firm a few years back.  There <br/>\n&gt; I am in agreement with JB.<br/>\n<br/>\n </span></blockquote>I&#39;m sure CMM/CMMI has value to someone somewhere, but not to me now and <br/>\nlikely never to me.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think the truth must be somewhere in <br/>\n&gt; between, but the larger your software engineering organization, the more <br/>\n&gt; likely you need something like CMM.  The smaller and better skilled and <br/>\n&gt; experienced your team is, the more they will probably benefit from agile <br/>\n&gt; methodolgies and practices.  Most places I have seen use some of both, <br/>\n&gt; with a lean toward process and documentation simply because so much <br/>\n&gt; money is at stake all the time.<br/>\n<br/>\n </span></blockquote>I don&#39;t understand why one prefers waste (process definition and <br/>\ndocumentation) when money is at stake. I would expect the opposite. Here <br/>\nI use the word &quot;waste&quot; is its clinical sense, as the Poppendiecks define it.<br/>\n<br/>\n-- <br/>\nJ. B. Rainsberger,<br/>\nDiaspar Software Services<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com\">http://www.diasparsoftware.com</a> :: +1 416 791-8603<br/>\nLet&#39;s write software that people understand</div>", 
    "prevInTime": 9175, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1061609110", 
    "canDelete": false, 
    "nextInTopic": 9177, 
    "prevInTopic": 9174, 
    "headers": {
        "inReplyToHeader": "PDcyMDY4Mjk4Q0Q5OTEwNEFBRURFMkZERjg5QUMxNjBEMDdGRkUxQGF2YW50aS5jb3JwLndvcmtzY2FwZS5uZXQ+", 
        "messageIdInHeader": "PDNGNDZERTk2LjcwMTAzMDVAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDcyMDY4Mjk4Q0Q5OTEwNEFBRURFMkZERjg5QUMxNjBEMDdGRkUxQGF2YW50aS5jb3JwLndvcmtzY2FwZS5uZXQ+"
    }
}