{
    "numMessagesInTopic": 38, 
    "nextInTime": 9210, 
    "senderId": "b6iSlf_BL0nBuJsMAtO6WGYyg-kXfkLp0jJ2LhiRT6vkQfG4TJWJ0ColEye416idTrWsPcPExamJiY6m6w64wtMr1Md5_XUjI2rZc6G1CneeJxDlKuLjYbmv", 
    "systemMessage": false, 
    "subject": "RE: The goals of CMM (Re: [junit] wanted Junit professionals urgently)", 
    "from": "&quot;Michael Silverstein&quot; &lt;msilverstein@...&gt;", 
    "authorName": "Michael Silverstein", 
    "msgSnippet": "... Almost. Its more like a somewhat informed walk through an application. The direction you take on the walk is guided by a combination of some general goal", 
    "msgId": 9209, 
    "topicId": 9148, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 62742148, 
    "messageBody": "<div id=\"ygrps-yiv-1889195848\"><blockquote><span title=\"ireply\">&gt; -----Original Message-----<br/>\n&gt; From: Curt Sampson [mailto:yahoo_sucks@...] <br/>\n&gt; On Mon, 25 Aug 2003, J. B. Rainsberger wrote:<br/>\n&gt; <br/>\n&gt;&gt; Google &quot;What is exploratory testing?&quot;<br/>\n&gt; <br/>\n&gt; Interesting. Does this quote really describe exploratory testing?<br/>\n&gt; <br/>\n&gt;      To the extent that the next test we do is influenced by <br/>\n&gt; the result<br/>\n&gt;      of the last test we did, we are doing exploratory testing.<br/>\n&gt; <br/>\n&gt;      (http://www.satisfice.com/articles/what_is_et.htm)<br/>\n&gt; This seems to me that it could just as well describe <br/>\n&gt; test-first programming; I often decide what my next test will <br/>\n&gt; be based on the previous tests I&#39;ve just produced. (&quot;Hmmm. We <br/>\n&gt; just saw and fixed a failure like such-and-such, does that <br/>\n&gt; mean that this other thing might be able to fail like that, <br/>\n&gt; too? Let&#39;s write a test and find out.&quot;)<br/>\n<br/>\n </span></blockquote>Almost. Its more like a somewhat informed walk through an application.<br/>\nThe direction you take on the walk is guided by a combination of some<br/>\ngeneral goal for the testing session, where you are in the application<br/>\nand what you&#39;ve observed about the application so far. <br/>\n<br/>\nExploratory testing is usually performed on an application&#39;s end-user<br/>\ninterface, although I suppose you could do it at the unit level with a<br/>\ndebugger and interactive development environment.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It sounds to me like the &quot;scripted testing&quot; he&#39;s talking <br/>\n&gt; about in that article is not XP-style testing, where you run <br/>\n&gt; the tests as you come up with them, but instead one where you <br/>\n&gt; create a whole series of tests before you take them to the <br/>\n&gt; code. Especially where he says:<br/>\n&gt; <br/>\n&gt;     Scripting has its place. I can imagine testing situations where<br/>\n&gt;     efficiency and repeatability are so important that we <br/>\n&gt; should script<br/>\n&gt;     or automate them.<br/>\n&gt; <br/>\n&gt; I can&#39;t imagine a situation where efficiency and repeatability are<br/>\n&gt; *not* important enough to script the tests! <br/>\n&gt; But if you can <br/>\n&gt; somehow manipulate the system quickly enough to do <br/>\n&gt; exploratory testing, you can probably come up with a way for <br/>\n&gt; the script to manipulate the system even more quickly, and <br/>\n&gt; then just add your tests to the script, rather than throwing <br/>\n&gt; them away as soon as you&#39;ve tried them out.<br/>\n&gt; <br/>\n&gt; cjs<br/>\n<br/>\n </span></blockquote>The good part of ET is that you spend less time coming up with scripts<br/>\nand automating and more time testing, so you have a greater liklihood of<br/>\ngoing down a path you might not otherwise have tested. The bad part,<br/>\nobviously, is that because there is no automation some paths may only<br/>\nget hit once, possibly before a defect is ever inserted there.<br/>\n<br/>\nI&#39;ve seen demonstrations of Exploratory testing by experts in that<br/>\nparticular field. When they did find defects using this technique, they<br/>\nwere usually unable to reproduce them because they couldn&#39;t remember the<br/>\nexact steps they had followed to get where they were. Some get around<br/>\nthis with a video recorder, with mixed success. Ultimately it is a<br/>\ntechnique to consider whether to use, given your own particular context.<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.510 / Virus Database: 307 - Release Date: 8/14/2003</div>", 
    "prevInTime": 9208, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1061912673", 
    "canDelete": false, 
    "nextInTopic": 9210, 
    "prevInTopic": 9208, 
    "headers": {
        "inReplyToHeader": "PFBpbmUuTkVCLjQuNTEuMDMwODI2MjI0ODA5MC4zMzA1QGFuZ2VsaWMtdnRmdy5jdnBuLmN5bmljLm5ldD4=", 
        "messageIdInHeader": "PDA1MTIwMWMzNmJlOCRmMjA1MTU3MCQ2NjAxYThjMEBsYXRpdHVkZTAxPg=="
    }
}