{
    "numMessagesInTopic": 38, 
    "nextInTime": 9217, 
    "senderId": "TlkMWAvK7oKgh0sGZkpZioosG4cY-BDxuZ0IH1se0znPIg-3mXQgS041WEbeh6nPCW7_Z_MLn5rDfCUjG-2wCXDI27J0zadzGIBo2c2n7Q", 
    "systemMessage": false, 
    "subject": "Re: The goals of CMM (Re: [junit] wanted Junit professionals urgently)", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... Agreed. ... So it costs less to spend more? Great. Just when I think I begin to understand business people.... ... Let me offer: Everyone is a member of", 
    "msgId": 9216, 
    "profile": "nails762", 
    "topicId": 9148, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-970985565\">Curt Sampson wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; On Mon, 25 Aug 2003, J. B. Rainsberger wrote:<br/>\n&gt; <br/>\n&gt;  &gt; One talented programmer does the work of five not-so-talented<br/>\n&gt;  &gt; ones at 60% of the price (of the five).<br/>\n&gt; <br/>\n&gt; Actually, one talented programmer often does things that no number of<br/>\n&gt; non-talented programmers can do. For example, produce a system that is<br/>\n&gt; ready to roll out into production at any time at all, given at most a<br/>\n&gt; few hours notice. Or create a system such that a full production release<br/>\n&gt; of a huge system can be done in a couple of hours.<br/>\n<br/>\n </span></blockquote>Agreed.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unfortuantely, it can be a lot easier to hire five, or even twenty,<br/>\n&gt; not-so-talented programmers than one talented one.<br/>\n<br/>\n </span></blockquote>So it costs less to spend more? Great. Just when I think I begin to <br/>\nunderstand business people....<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; &gt;  &gt; In my current project, we don&#39;t even have any dedicated QA people...<br/>\n&gt; <br/>\n&gt;  &gt; Hm. Do you mean that you don&#39;t have people who test full time? or you<br/>\n&gt;  &gt; don&#39;t have people will formal testing experience and/or raw testing <br/>\n&gt; skill?<br/>\n&gt; <br/>\n&gt; We don&#39;t have people who test full time, in the sense of someone devoted<br/>\n&gt; to writing customer and functional tests. Everybody helps out a bit with<br/>\n&gt; the customer tests, though some more than others, and the functional<br/>\n&gt; tests are done by the programmers as they work on somethign that needs<br/>\n&gt; functional testing.<br/>\n&gt; <br/>\n&gt; But another point of view would be that &quot;everyone is a full-time tester&quot;<br/>\n&gt; in that everyone is expected to make sure the code has reasonable test<br/>\n&gt; coverage, and not just for the programmers&#39; unit tests.<br/>\n<br/>\n </span></blockquote>Let me offer: Everyone is a member of the team, many of which are better <br/>\nat testing and therefore execute/write tests more often than others.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;  &gt; Google &quot;What is exploratory testing?&quot;<br/>\n&gt; <br/>\n&gt; Interesting. Does this quote really describe exploratory testing?<br/>\n&gt; <br/>\n&gt;      To the extent that the next test we do is influenced by the result<br/>\n&gt;      of the last test we did, we are doing exploratory testing.<br/>\n&gt; <br/>\n&gt;      (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.satisfice.com/articles/what_is_et.htm)\">http://www.satisfice.com/articles/what_is_et.htm)</a><br/>\n&gt; <br/>\n&gt; This seems to me that it could just as well describe test-first<br/>\n&gt; programming; I often decide what my next test will be based on the<br/>\n&gt; previous tests I&#39;ve just produced. (&quot;Hmmm. We just saw and fixed a<br/>\n&gt; failure like such-and-such, does that mean that this other thing might<br/>\n&gt; be able to fail like that, too? Let&#39;s write a test and find out.&quot;)<br/>\n<br/>\n </span></blockquote>Yes, that&#39;s accurate. When James came to XP/AU 2002 we discussed it in <br/>\nsome detail. I wish I understood ET as well then as I do now, because I <br/>\nwould have got more out of the conversations we had.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It sounds to me like the &quot;scripted testing&quot; he&#39;s talking about in that<br/>\n&gt; article is not XP-style testing, where you run the tests as you come<br/>\n&gt; up with them, but instead one where you create a whole series of tests<br/>\n&gt; before you take them to the code. Especially where he says:<br/>\n&gt; <br/>\n&gt;     Scripting has its place. I can imagine testing situations where<br/>\n&gt;     efficiency and repeatability are so important that we should script<br/>\n&gt;     or automate them.<br/>\n&gt; <br/>\n&gt; I can&#39;t imagine a situation where efficiency and repeatability are<br/>\n&gt; *not* important enough to script the tests! But if you can somehow<br/>\n&gt; manipulate the system quickly enough to do exploratory testing, you can<br/>\n&gt; probably come up with a way for the script to manipulate the system even<br/>\n&gt; more quickly, and then just add your tests to the script, rather than<br/>\n&gt; throwing them away as soon as you&#39;ve tried them out.<br/>\n<br/>\n </span></blockquote>I view testing in the XP/Agile context from two perspectives.<br/>\n<br/>\n  * Test-Driven Development<br/>\n  * Continuous Regression Testing<br/>\n<br/>\nTDD is about using tests to drive the design. CRT is about capturing the <br/>\nknowledge we gain from ET to avoid reintroducing problems. CRT supports <br/>\nrefactoring by providing the safety net. Programmers and Customers alike <br/>\ncan do ET.<br/>\n<br/>\nJames and his associates worry that we focus on automating tests, rather <br/>\nthan learning from them. To that extent, they had something to worry <br/>\nabout. I am learning to remember to learn from tests and I am learning <br/>\nto view that as perhaps the most important aspect of testing, followed <br/>\nby verifying features and enabling design improvement.<br/>\n<br/>\nTake care.<br/>\n-- <br/>\nJ. B. Rainsberger,<br/>\nDiaspar Software Services<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com\">http://www.diasparsoftware.com</a> :: +1 416 791-8603<br/>\nLet&#39;s write software that people understand</div>", 
    "prevInTime": 9215, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1061963179", 
    "canDelete": false, 
    "nextInTopic": 9229, 
    "prevInTopic": 9212, 
    "headers": {
        "inReplyToHeader": "PFBpbmUuTkVCLjQuNTEuMDMwODI2MjI0ODA5MC4zMzA1QGFuZ2VsaWMtdnRmdy5jdnBuLmN5bmljLm5ldD4=", 
        "messageIdInHeader": "PDNGNEM0NUFCLjMwMTA4MDRAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDcyMDY4Mjk4Q0Q5OTEwNEFBRURFMkZERjg5QUMxNjBEMDdGRkUyQGF2YW50aS5jb3JwLndvcmtzY2FwZS5uZXQ+IDwzRjRBMzI3RC41MDgwN0Byb2dlcnMuY29tPiA8UGluZS5ORUIuNC41MS4wMzA4MjYyMjQ4MDkwLjMzMDVAYW5nZWxpYy12dGZ3LmN2cG4uY3luaWMubmV0Pg=="
    }
}