{
    "numMessagesInTopic": 1, 
    "nextInTime": 9245, 
    "senderId": "15-Kqhp3pki0Dg2p-x_pm21qrqnzdkd4Cdch_FqPe8piXfP_cGP-HT5hWWIXnLkJBc2wSnTiOC8HRnu4lXfoMFdvM-iTVRIr280", 
    "systemMessage": false, 
    "subject": "GUI test automation, was: The goals of CMM (Re: [junit] wanted Junit professionals urgently)", 
    "from": "Thomas L Roche &lt;tlroche@...&gt;", 
    "authorName": "Thomas L Roche", 
    "msgSnippet": "Curt Sampson Tue Aug 26, 2003  2:04 pm ... interesting ... s/script/suite This is why, to me, GUI test automation based on JUnit is the way to go: * good tool", 
    "msgId": 9244, 
    "profile": "tlroche", 
    "topicId": 9244, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 112010592, 
    "messageBody": "<div id=\"ygrps-yiv-1894198968\">Curt Sampson Tue Aug 26, 2003  2:04 pm<br/>\n<blockquote><span title=\"ireply\"> &gt;  To the extent that the next test we do is influenced by the result<br/>\n&gt; of the last test we did, we are doing exploratory testing.<br/>\n<br/>\n&gt; (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.satisfice.com/articles/what_is_et.htm)\">http://www.satisfice.com/articles/what_is_et.htm)</a><br/>\n<br/>\n </span></blockquote>interesting<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This seems to me that it could just as well describe test-first<br/>\n&gt; programming; I often decide what my next test will be based on the<br/>\n&gt; previous tests I&#39;ve just produced. (&quot;Hmmm. We just saw and fixed a<br/>\n&gt; failure like such-and-such, does that mean that this other thing<br/>\n&gt; might be able to fail like that, too? Let&#39;s write a test and find<br/>\n&gt; out.&quot;)<br/>\n<br/>\n&gt; It sounds to me like the &quot;scripted testing&quot; he&#39;s talking about in<br/>\n&gt; that article is not XP-style testing, where you run the tests as you<br/>\n&gt; come up with them, but instead one where you create a whole series<br/>\n&gt; of tests before you take them to the code. Especially where he says:<br/>\n<br/>\n&gt; Scripting has its place. I can imagine testing situations where<br/>\n&gt; efficiency and repeatability are so important that we should script<br/>\n&gt; or automate them.<br/>\n<br/>\n&gt; I can&#39;t imagine a situation where efficiency and repeatability are<br/>\n&gt; *not* important enough to script the tests! But if you can somehow<br/>\n&gt; manipulate the system quickly enough to do exploratory testing, you<br/>\n&gt; can probably come up with a way for the script to manipulate the<br/>\n&gt; system even more quickly, and then just add your tests to the<br/>\n&gt; script, rather than throwing them away as soon as you&#39;ve tried them<br/>\n&gt; out.<br/>\n<br/>\n </span></blockquote>s/script/suite<br/>\n<br/>\nThis is why, to me, GUI test automation based on JUnit is the way to<br/>\ngo:<br/>\n<br/>\n* good tool support<br/>\n<br/>\n* standard framework<br/>\n<br/>\n* lotsa mindshare among coders<br/>\n<br/>\n* tests can be refactored with code<br/>\n<br/>\n* tests can be easily saved for regression<br/>\n<br/>\nMichael Silverstein Tue Aug 26, 2003  3:44 pm<br/>\n<blockquote><span title=\"ireply\"> &gt; The good part of ET is that you spend less time coming up with<br/>\n&gt; scripts and automating and more time testing, so you have a greater<br/>\n&gt; liklihood of going down a path you might not otherwise have tested.<br/>\n&gt; The bad part, obviously, is that because there is no automation some<br/>\n&gt; paths may only get hit once, possibly before a defect is ever<br/>\n&gt; inserted there.<br/>\n<br/>\n </span></blockquote>And regression testing remains tedious, unless you throw your tests<br/>\nback in the bucket. Why not do that? (&quot;2 words: test maintenance&quot; :-)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, 28 Aug 2003, Michael Silverstein wrote:<br/>\n&gt; For a better defense of ET and discussion of the limitation of<br/>\n&gt; automation than I could ever provide, you should read some of Cem<br/>\n&gt; Kaner&#39;s articles on <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.kaner.com/.\">http://www.kaner.com/.</a> Note that I don&#39;t agree<br/>\n&gt; with a lot of it.<br/>\n<br/>\nMichael Silverstein Thu Aug 28, 2003  7:15 pm<br/>\n&gt; To clarify my sentence above, the last word &quot;it&quot; equates to things<br/>\n&gt; written on the site about exploratory testing, as well as a lot of<br/>\n&gt; negatives about test automation. I already mentioned what I don&#39;t<br/>\n&gt; like about ET in my previous append and this group/XP/agile people<br/>\n&gt; can articulate the advantages of automation better than I. If you<br/>\n&gt; want to dig, Mr. Kaner and I went back and forth a bit in on this<br/>\n&gt; subject in January of this year on the software-testing group. Of<br/>\n&gt; course there&#39;s always more to be said but not enough time. Anyway,<br/>\n&gt; to reiterate a different append of mine, if you want to have a<br/>\n&gt; good/fun/heated conversation on these subjects with peple who have<br/>\n&gt; very strong, well earned opinions you should take this subject to<br/>\n&gt; the sodtware-testing group.<br/>\n<br/>\nand for similarly insightful debate regarding GUI test automation,<br/>\nconsider <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/java-gui-testing/\">http://groups.yahoo.com/group/java-gui-testing/</a><br/>\n<br/>\nCurt Sampson Fri Aug 29, 2003  3:50 am<br/>\n&gt; Funny, you know I am in general agreement with all he&#39;s saying about<br/>\n&gt; GUI test automation, and how it&#39;s not much use. His problem is that<br/>\n&gt; he&#39;s testing in the wrong place. He wants to test if the printer<br/>\n&gt; driver gets the margins correct, and he ends up testing the entire<br/>\n&gt; GUI, too. He&#39;s a victim of the &quot;separate the testers and the<br/>\n&gt; programmers&quot; method of development.<br/>\n<br/>\n&gt; If you replace ten difficult GUI tests with one difficult GUI test<br/>\n&gt; and ten easier tests at a lower level, suddenly you find your test<br/>\n&gt; automation has become much easier.<br/>\n<br/>\nYes. By all means, have a thin GUI, and test your backend, but then<br/>\nautomate a &quot;real&quot; scenario driving your GUI, to make _sure_ that the V<br/>\nreally goes with the M and the C the way you think it does :-) Plus,<br/>\nthe GUI automation is documentation, possibly even a deliverable (who<br/>\nneeds Flash ?-) </span></blockquote></div>", 
    "prevInTime": 9243, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1062195624", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PE9GNUEzMkVEOEYuMDRCQkNGNzktT044NTI1NkQ5MS4wMDdBMEQ2RC04NTI1NkQ5MS4wMDdBQjgxMUB1cy5pYm0uY29tPg=="
    }
}