{
    "numMessagesInTopic": 11, 
    "nextInTime": 9277, 
    "senderId": "brskwE2Npc90yFDbuu5dW3iBpssdl1T6cnICfo9_madDaFpxng_8TNaRHTLwtUgLnV0eqj3KRFsrFD7d8grVMjm7TtqZr6t5b-bvg9RHHPQt1Atkbmm5rBK3", 
    "systemMessage": false, 
    "subject": "Re: Domain specific question", 
    "from": "Venkatesh Prasad Ranganath &lt;java-junit@...&gt;", 
    "authorName": "Venkatesh Prasad Ranganath", 
    "msgSnippet": "... No, the question is when you have many phases that setup the data on which an analysis works, how do you unit test the analysis efficiently?  It may take a", 
    "msgId": 9276, 
    "topicId": 9274, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 106325759, 
    "messageBody": "<div id=\"ygrps-yiv-1641108258\">J. B. Rainsberger wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Venkatesh Prasad Ranganath wrote:<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;&gt;Hi,<br/>\n&gt;&gt;<br/>\n&gt;&gt;I have read about JUnit and TDD and the mailing list about using these <br/>\n&gt;&gt;in real world.  However I am still not convinced how<br/>\n&gt;&gt;would one apply these in large systems.  In particular, in compilers and <br/>\n&gt;&gt;related topics.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; How to apply them to large systems is something that&#39;s well-worn by this <br/>\n&gt; point. Large systems are just larger collections of objects, so not much <br/>\n&gt; is different.<br/>\n&gt; <br/>\n&gt; As for compilers, your message seems to claim that building a compiler <br/>\n&gt; incrementally is not possible, or perhaps just not feasible. The way to <br/>\n&gt; build a compiler incrementally -- assuming you do not use any existing <br/>\n&gt; tools like parser generators -- is to pick one language feature and <br/>\n&gt; support it, then another, then another until you support the entire <br/>\n&gt; language.<br/>\n&gt; <br/>\n&gt; Another approach is to start by implementing an interpreter, work to <br/>\n&gt; support the entire language, then use the interpreter as a test <br/>\n&gt; environment to write the corresponding compiler. That&#39;s just an idea <br/>\n&gt; that comes off the top of my head and I have no idea whether it&#39;s feasible.<br/>\n&gt; <br/>\n&gt; Your question, it seems to me, is about incremental development and not <br/>\n&gt; TDD and not JUnit. Is that accurate? I only mention that because it&#39;s <br/>\n&gt; easier to answer a question once I understand the question.<br/>\n<br/>\n </span></blockquote>No, the question is when you have many phases that setup the data on which an analysis works, how do you unit test the <br/>\nanalysis efficiently?  It may take a long time to setup the data, hence, the code-test-refactor cycle will prove rather costly.<br/>\n<br/>\nTo make things simple, consider a report generation application which adds some interesting facts to the report based on the <br/>\ndata being reported.  Now the nature of the report per say is dictated by the data, however, the data being generated may <br/>\ndepend on relation between various pieces of the data.  In the example, the report generator has a strong coupling with the <br/>\ndata generator but this is purely restricted to input data and no more (I am just clearing things in case people start saying <br/>\n&quot;reduce the coupling&quot;).  Now the information about input data (call it meta-data) which is also of relevance to report <br/>\ngenerator and this is not captured as a programmable software entity. How does one use TDD and/or JUnit in such cases is my <br/>\nquestion?<br/>\n<br/>\nAll examples of JUnit or TDD I have seen are Money and things on those lines which are stand alone classes.  However, things <br/>\nchange radically when you move to frameworks.  Referring to my first posting, in my opinion, a compiler is more of a framework <br/>\nrather than a single large application.  It is put together from peices and not grown from a single blob.  The Type checker is <br/>\ndependent on the AST and the AST is dependent on the Parser Tree which is dependent on parsing and the Parser.  Given this <br/>\nchain, how do you unit test each link in the chain?<br/>\n<br/>\nI hope I am making sense.  If not then may be someone can present a plausible solution to the above problem or something <br/>\nsimilar?  I would really appreciate it as I want to use TDD and JUnit, but somehow I cannot see a way to make it fit into my <br/>\nwork/application model.<br/>\n<br/>\nwaiting for reply,<br/>\n<br/>\n  - Venkatesh</div>", 
    "prevInTime": 9275, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1062712657", 
    "canDelete": false, 
    "nextInTopic": 9277, 
    "prevInTopic": 9275, 
    "headers": {
        "inReplyToHeader": "PDNGNTdBRUYzLjkwNjAyMDZAcm9nZXJzLmNvbT4=", 
        "messageIdInHeader": "PGJqOGNqNCRiNTMkMUBzZWEuZ21hbmUub3JnPg==", 
        "referencesHeader": "PGJqODAzZSRuMTkkMUBzZWEuZ21hbmUub3JnPiA8M0Y1N0FFRjMuOTA2MDIwNkByb2dlcnMuY29tPg=="
    }
}