{
    "numMessagesInTopic": 11, 
    "nextInTime": 9278, 
    "senderId": "2VA7k8x26HeL92OciBypjrTiA3YdtCs5acXmYePLs-ueJjWvZRFtPHDpNsrGmuZCLWSv3hO1AxbsTMLGAiP1vel34cTTLqmEg2o6KtUkyEnF7mE1YX3KB1ci", 
    "systemMessage": false, 
    "subject": "RE: [junit] Domain specific question", 
    "from": "&quot;Selvakumar Ganesan&quot; &lt;selvakumar.ganesan@...&gt;", 
    "authorName": "Selvakumar Ganesan", 
    "msgSnippet": "It is an interesting question:  So, would one code that up into the test case?  If so, at what cost?  A more simple question would be that how much effort", 
    "msgId": 9277, 
    "rawEmail": "Return-Path: &lt;selvakumar.ganesan@...&gt;\r\nReceived: (qmail 91931 invoked by uid 7800); 5 Sep 2003 12:09:27 -0000\r\nX-Sender: selvakumar.ganesan@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 22954 invoked from network); 5 Sep 2003 04:09:07 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m12.grp.scd.yahoo.com with QMQP; 5 Sep 2003 04:09:07 -0000\r\nReceived: from unknown (HELO wiprom2mx1.wipro.com) (203.197.164.41)\n  by mta6.grp.scd.yahoo.com with SMTP; 5 Sep 2003 04:09:06 -0000\r\nReceived: from m2vwall5.wipro.com (m2vwall5.wipro.com [10.115.50.5])\n\tby wiprom2mx1.wipro.com (8.12.9/8.12.9) with SMTP id h8548qOf020693\n\tfor &lt;junit@yahoogroups.com&gt;; Fri, 5 Sep 2003 09:38:57 +0530 (IST)\r\nReceived: from blr-ec-msg04.wipro.com ([10.200.53.99]) by blr-ec-bh1.wipro.com with Microsoft SMTPSVC(5.0.2195.5329);\n\t Fri, 5 Sep 2003 09:38:35 +0530\r\nMIME-Version: 1.0\r\nX-MimeOLE: Produced By Microsoft Exchange V6.0.6470.0\r\ncontent-class: urn:content-classes:message\r\nSubject: RE: [junit] Domain specific question\r\nDate: Fri, 5 Sep 2003 09:38:34 +0530\r\nMessage-ID: &lt;9C814AF757367B4E81DC0ED5BA5A0C986AE3F1@...&gt;\r\nX-MS-Has-Attach: \r\nX-MS-TNEF-Correlator: &lt;9C814AF757367B4E81DC0ED5BA5A0C986AE3F1@...&gt;\r\nThread-Topic: [junit] Digest Number 978\r\nThread-Index: AcNzIpVQWBoUlnaTTpmxf1qdKtAVrAAPXHt/\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nX-OriginalArrivalTime: 05 Sep 2003 04:08:35.0038 (UTC) FILETIME=[6041AFE0:01C37363]\r\nFrom: &quot;Selvakumar Ganesan&quot; &lt;selvakumar.ganesan@...&gt;\r\nX-Yahoo-Group-Post: member; u=126832352\r\nX-Yahoo-Profile: webaesthet\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Approved-By: nails762 &lt;jbrains@...&gt; via email; 5 Sep 2003 12:09:27 -0000\r\n\r\nIt is an interesting question: \n&quot; So, would one code that up into the test case?  If so, at what cost?  A more simple question would be that how much effort should go into setting up the environment for object to be tested and test object \nitself?&quot;\n\nWe had a similar experience in a project recently. The team found JUnit (tests at class level)to be too restrictive. So, it ended up creating a test framework extended from JUnit and mocking all external components. This extended framework tested all the interfaces and also simulated the - quite complex - multi-threaded runtime environment. Developers were then on their own to write Unit tests for classes using the extended test framework. The effort investment is quite large for building such complex test frameworks. \nThe final word must come from answering &quot;what makes sense?&quot; (and, of course, from the client&#39;s pockets).\n\nI agree with your reasonable scepticism. JUnit is not The Hammer and not everything is a nail.\n\nregards,\nSelva.\n\n\n   Date: Thu, 04 Sep 2003 13:24:27 -0500\n   From: Venkatesh Prasad Ranganath &lt;java-junit@...&gt;\nSubject: Domain specific question\n\nHi,\n\nI have read about JUnit and TDD and the mailing list about using these in real world.  However I am still not convinced how \nwould one apply these in large systems.  In particular, in compilers and related topics.\n\nA concrete instance would be an analysis that works on say some IR. The analysis can usually be cast as a single class and the \ntest of the &quot;unit&quot; is that each of the methods function as specified in the given scenarios.  The analysis works on the \nintermediate representation (IR) of a program.  The IR is dependent on the input program/source code.\n\nTo test the analysis class you need to provide it an IR which means we need the whole machinery to setup the IR on which the \nanalysis works and then drive the analysis with the test object while probing it correctness.  Generally, the machinery to \nsetup the IR is complex or large.  So, would one code that up into the test case?  If so, at what cost?  A more simple \nquestion would be that how much effort should go into setting up the environment for object to be tested and test object \nitself?  Also, say if the analysis provides information say relation between 2 entities in the IR, then how do you test for \nthis relation while unit testing the analysis (may be this is into another form of testing but anyways...)?\n\nFor people who have read &quot;Unit Testing in Java&quot; the above is a case of Object Under Test scenario.\n\nIn simple words, if a chunk of logic embedded in a class requires large pieces of information to be setup, then how would one \nuse JUnit or any unit testing framework in such cases?  Even more, when instances of such classes go through state changes \ndepending on interaction with other objects how do you instrument the test and run the test?\n\nThe reason I am posting this question is that I have heard a lot about JUnit and how Unit Testing is the &quot;magic bullet&quot; (of \ncourse I have heard people say otherwise about the latter too).  However, I am not convinced as to if it is applicable in all \nsituations and scenarios.  Even more, are there documents or studies that indicate the impact of Unit Testing on projects say \nin terms of shift in timelines, # of bugs, and such?  I am trying to find evidence of usage of JUnit is situations similar to \nones explained above.\n\nwaiting for reply,\n\n- Venkatesh\n\n\n\n\n[Non-text portions of this message have been removed]\n\n\n", 
    "profile": "webaesthet", 
    "topicId": 9274, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 126832352, 
    "prevInTime": 9276, 
    "contentTrasformed": false, 
    "postDate": "1062734914", 
    "canDelete": false, 
    "nextInTopic": 9279, 
    "prevInTopic": 9276, 
    "headers": {
        "messageIdInHeader": "PDlDODE0QUY3NTczNjdCNEU4MURDMEVENUJBNUEwQzk4NkFFM0YxQGJsci1lYy1tc2cwNC53aXByby5jb20+"
    }
}