{
    "numMessagesInTopic": 11, 
    "nextInTime": 9280, 
    "senderId": "aqUF6YHZtvPp_ezoEqSs7X8EVkJvBx-bBvbsxTIqh-Nf7e6W9DSUebpmKBf4vkj9dLVk_WGqcjIrfAO_ZBi9xryV8B1M-BIlwhmkHRqV4Q", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Domain specific question", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... You test each link in isolation by verifying the contracts of each interface, then subtituting simpler collaborators as needed in tests. My experience is", 
    "msgId": 9279, 
    "rawEmail": "Return-Path: &lt;jbrains@...&gt;\r\nX-Sender: jbrains@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 23531 invoked from network); 5 Sep 2003 12:39:42 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m15.grp.scd.yahoo.com with QMQP; 5 Sep 2003 12:39:42 -0000\r\nReceived: from unknown (HELO fep01-mail.bloor.is.net.cable.rogers.com) (66.185.86.71)\n  by mta3.grp.scd.yahoo.com with SMTP; 5 Sep 2003 12:39:41 -0000\r\nReceived: from rogers.com ([24.156.43.226])\n          by fep01-mail.bloor.is.net.cable.rogers.com\n          (InterMail vM.5.01.05.12 201-253-122-126-112-20020820) with ESMTP\n          id &lt;20030905123937.WUGK83282.fep01-mail.bloor.is.net.cable.rogers.com@...&gt;\n          for &lt;junit@yahoogroups.com&gt;; Fri, 5 Sep 2003 08:39:37 -0400\r\nMessage-ID: &lt;3F5883E0.6060102@...&gt;\r\nDate: Fri, 05 Sep 2003 08:38:56 -0400\r\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 5.0; en-US; rv:1.5b) Gecko/20030723 Thunderbird/0.1\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] Re: Domain specific question\r\nReferences: &lt;bj803e$n19$1@...&gt; &lt;3F57AEF3.9060206@...&gt; &lt;bj8cj4$b53$1@...&gt;\r\nIn-Reply-To: &lt;bj8cj4$b53$1@...&gt;\r\nContent-Type: text/plain; charset=us-ascii; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-Authentication-Info: Submitted using SMTP AUTH PLAIN at fep01-mail.bloor.is.net.cable.rogers.com from [24.156.43.226] using ID &lt;jbrains@...&gt; at Fri, 5 Sep 2003 08:39:37 -0400\r\nFrom: &quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;\r\nX-Yahoo-Group-Post: member; u=127224993\r\nX-Yahoo-Profile: nails762\r\n\r\nVenkatesh Prasad Ranganath wrote:\n\n&gt; J. B. Rainsberger wrote:\n&gt;  &gt; Venkatesh Prasad Ranganath wrote:\n&gt;  &gt;\n&gt;  &gt;\n&gt;  &gt;&gt;Hi,\n&gt;  &gt;&gt;\n&gt;  &gt;&gt;I have read about JUnit and TDD and the mailing list about using these\n&gt;  &gt;&gt;in real world.  However I am still not convinced how\n&gt;  &gt;&gt;would one apply these in large systems.  In particular, in compilers and\n&gt;  &gt;&gt;related topics.\n&gt;  &gt;\n&gt;  &gt;\n&gt;  &gt; How to apply them to large systems is something that&#39;s well-worn by this\n&gt;  &gt; point. Large systems are just larger collections of objects, so not much\n&gt;  &gt; is different.\n&gt;  &gt;\n&gt;  &gt; As for compilers, your message seems to claim that building a compiler\n&gt;  &gt; incrementally is not possible, or perhaps just not feasible. The way to\n&gt;  &gt; build a compiler incrementally -- assuming you do not use any existing\n&gt;  &gt; tools like parser generators -- is to pick one language feature and\n&gt;  &gt; support it, then another, then another until you support the entire\n&gt;  &gt; language.\n&gt;  &gt;\n&gt;  &gt; Another approach is to start by implementing an interpreter, work to\n&gt;  &gt; support the entire language, then use the interpreter as a test\n&gt;  &gt; environment to write the corresponding compiler. That&#39;s just an idea\n&gt;  &gt; that comes off the top of my head and I have no idea whether it&#39;s \n&gt; feasible.\n&gt;  &gt;\n&gt;  &gt; Your question, it seems to me, is about incremental development and not\n&gt;  &gt; TDD and not JUnit. Is that accurate? I only mention that because it&#39;s\n&gt;  &gt; easier to answer a question once I understand the question.\n&gt; \n&gt; No, the question is when you have many phases that setup the data on \n&gt; which an analysis works, how do you unit test the\n&gt; analysis efficiently?  It may take a long time to setup the data, hence, \n&gt; the code-test-refactor cycle will prove rather costly.\n&gt; \n&gt; To make things simple, consider a report generation application which \n&gt; adds some interesting facts to the report based on the\n&gt; data being reported.  Now the nature of the report per say is dictated \n&gt; by the data, however, the data being generated may\n&gt; depend on relation between various pieces of the data.  In the example, \n&gt; the report generator has a strong coupling with the\n&gt; data generator but this is purely restricted to input data and no more \n&gt; (I am just clearing things in case people start saying\n&gt; &quot;reduce the coupling&quot;).  Now the information about input data (call it \n&gt; meta-data) which is also of relevance to report\n&gt; generator and this is not captured as a programmable software entity. \n&gt; How does one use TDD and/or JUnit in such cases is my\n&gt; question?\n&gt; \n&gt; All examples of JUnit or TDD I have seen are Money and things on those \n&gt; lines which are stand alone classes.  However, things\n&gt; change radically when you move to frameworks.  Referring to my first \n&gt; posting, in my opinion, a compiler is more of a framework\n&gt; rather than a single large application.  It is put together from peices \n&gt; and not grown from a single blob.  The Type checker is\n&gt; dependent on the AST and the AST is dependent on the Parser Tree which \n&gt; is dependent on parsing and the Parser.  Given this\n&gt; chain, how do you unit test each link in the chain?\n\nYou test each link in isolation by verifying the contracts of each \ninterface, then subtituting simpler collaborators as needed in tests.\n\nMy experience is in J2EE, so I can best describe it there. The short \nversion follows. The long version will be published this winter and in \nbookstores early next year.\n\nMy web application consists of a controller (Servlet), presentation \nlayer (JavaBeans and Velocity templates), business layer (POJOs) and \ndata access layer (JDBC). It has several key behaviors:\n\n  * control navigation from one page to another\n  * select business logic based on a request\n  * update data based on business logic\n  * display data on a web page\n\nThere are others. Each behavior, like your compiler example, is \nimplemented by collaborations of objects, which gives you pause. Well, \nhow do I test the navigation rules? Simple, really: for each \naction/outcome pair, decide which page should come next and with which \ndata. Now simulate that action/outcome pair as simply as you can, then \ninvoke the Navigator (usually part of the controller) and verify the \nnext page the Navigator chooses.\n\nUsually this is as simple as sending a URL (the action) and a single \nvalue (the outcome) with perhaps some data (an object, such as a Map) to \na Navigator object invoking a method called &quot;getForwardUri()&quot;, which \nanswers a URI (a String). The controller can use this information to \nforward the request to that URI.\n\nI can verify that the controller actually does forward to a URI I give \nit with a single ServletUnit test.\n\nNotice that we are not performing the action. We are simulating the \naction and forcing it to a specific outcome for the purposes of \nanswering the question, &quot;Where does the Navigator want to go if I tell \nit that Action XXX ends with outcome YYY?&quot; For testing the Navigator, \nthat&#39;s all we need to do.\n\nOnce you apply this technique everywhere, all that is left -- and it&#39;s \nstill a fair amount of work -- is to verify that the Application \nconfigures the pieces correctly. A run of end-to-end tests shows that we \nhave put correctly-working pieces together correctly.\n\nNow let me see whether I can apply this to your domain.\n\n &gt; The Type checker is\n &gt; dependent on the AST and the AST is dependent on the Parser Tree which\n &gt; is dependent on parsing and the Parser.\n\nOK. I assume that the Parser turns source code into a ParserTree, then \nthe ParserTree transforms itself into an AbstractSyntaxTree, then the \nTypeChecker analyzes the AbstractSyntaxTree and generators errors if \nany. Even if that&#39;s not entirely correct, it&#39;s close enough for this \ndiscussion. Feel free to correct me, but read what I write below anyway, \nbecause I think it&#39;ll help.\n\nSo to test the Parser, give it bits of source code. Not big bits; small \nbits. A few statements. Single constructs. Since its output is a Tree, \nas long as the Parser spits out the expected Tree for each atomic \nconstruct *and* can put those AtomicConstructTree objects in the right \nplace in a big ParserTree (for big source code), you&#39;re done. The \nrecursive nature of tree structures makes this particularly easy to \nreduce to smaller problems. In other words, verify that the Parser \norders constructs correctly in a Tree *and* knows how to translate each \nkind of construct. I don&#39;t know how many tests that is, but my guess is \nroughly 3 tests per construct plus perhaps 5 tests for the tree. 3n+5, \nthen, for n different kinds of constructs.\n\nWhen I read &quot;All the TDD examples are so simple,&quot; I think of arithmetic.\n\nThere is no such thing as a complex arithmetic question (+, -, *, /). I \nam amazed when a young person -- say 15 years old -- is impressed when I \nadd a couple of five-digit numbers in my head. (Wow! That&#39;s hard!) But \nthere is no such things as a &quot;hard&quot; arithmetic question; only a long \none. Every arithmetic question reduces to single-digit addition. The \nonly question is, &quot;How many single-digit addition operations do I need \nto do?&quot; Sometimes the answer is in the thousands. That may make it \ntime-consuming, but it isn&#39;t complex.\n\nThe good news is that as we practise single-digit addition, and then \nsingle-digit multiplication, and so on... we come to do it very quickly, \nso then adding a column for four-digit numbers is no longer so \ntime-consuming.\n\nSo I&#39;ll say this: there are no complex TDD problems; only long ones.\n\n&gt; I hope I am making sense.  If not then may be someone can present a \n&gt; plausible solution to the above problem or something\n&gt; similar?  I would really appreciate it as I want to use TDD and JUnit, \n&gt; but somehow I cannot see a way to make it fit into my\n&gt; work/application model.\n\nOne piece at a time. The tricky part is decoupling the application, and \nthat takes practise.\n-- \nJ. B. Rainsberger,\nDiaspar Software Services\nhttp://www.diasparsoftware.com :: +1 416 791-8603\nLet&#39;s write software that people understand\n\n\n", 
    "profile": "nails762", 
    "topicId": 9274, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "prevInTime": 9278, 
    "contentTrasformed": false, 
    "postDate": "1062765536", 
    "canDelete": false, 
    "nextInTopic": 9280, 
    "prevInTopic": 9277, 
    "headers": {
        "inReplyToHeader": "PGJqOGNqNCRiNTMkMUBzZWEuZ21hbmUub3JnPg==", 
        "messageIdInHeader": "PDNGNTg4M0UwLjYwNjAxMDJAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PGJqODAzZSRuMTkkMUBzZWEuZ21hbmUub3JnPiA8M0Y1N0FFRjMuOTA2MDIwNkByb2dlcnMuY29tPiA8Ymo4Y2o0JGI1MyQxQHNlYS5nbWFuZS5vcmc+"
    }
}