{
    "numMessagesInTopic": 4, 
    "nextInTime": 9289, 
    "senderId": "J3hoUECQQk10blb41WkG582Dfsk_YaRepLsULPttlR1EUmaZQnBATR8JO9-xcZgMUj-f_8w9hc9R7KyYyXiA", 
    "systemMessage": false, 
    "subject": "Problem with configuration classes", 
    "from": "trz &lt;lbolzani@...&gt;", 
    "authorName": "trz", 
    "msgSnippet": "Hi all. I m trying to understand how to handle some configuration problems. This is the current example, but I found this same problem other times. I have a", 
    "msgId": 9288, 
    "profile": "trzmud", 
    "topicId": 9288, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 114143989, 
    "messageBody": "<div id=\"ygrps-yiv-1517346260\">Hi all.<br/>\nI&#39;m trying to understand how to handle some &quot;configuration&quot; problems.<br/>\n<br/>\nThis is the current example, but I found this same problem other times.<br/>\n<br/>\nI have a class that receive events. Depending on the event type the <br/>\nevent is dispatched (using a map lookup) to the registered handler.<br/>\nNothing more.<br/>\n<br/>\nTo test this I started populating the event-&gt;handler map in the <br/>\nEventListener constructor (looking for the simplest possibile...).<br/>\nThis made the tests hard: I cannot test just the EventListener class <br/>\nbecause it was already filled with app specific handlers and was not <br/>\npossible to add other handlers.<br/>\nSo I moved the configuration of the EventListener outside.<br/>\nNow I have<br/>\n- EventListener: just receive the events, lookup handler and activate <br/>\nhandler<br/>\n- EventListenerFactory: create an EventListener configuring it for this app<br/>\n- a lot of single EventHandler<br/>\n<br/>\nNow I can test EventListener and each EventHandler without problems, but <br/>\nI cannot find any useful test for EventListenerFactory.<br/>\nThe only test I could write is to check that each of the Handler was <br/>\nregistered with the correct type, but so the test code would be <br/>\n&quot;identical&quot; to the Factory code and I don&#39;t see it very useful.<br/>\nAt the same time I do not like to have this class with no test at all.<br/>\nIf tomorrow I would move the type-&gt;handler configuration infos to a file <br/>\nI think the problems would disappears: I&#39;d write the test just for the <br/>\nfile reading code and I&#39;d have not code without tests.<br/>\nThe configuration check would clearly move to the functional test side.<br/>\n<br/>\nThe problem is that I&#39;m using that class just to configure the app. I <br/>\nthink it&#39;s a good thing to have some startup classes to contain all app <br/>\nspecific infos.<br/>\n<br/>\nDo you have a similar problem? How do you handle it?<br/>\n<br/>\nThanks<br/>\n<br/>\n<br/>\nLorenzo</div>", 
    "prevInTime": 9287, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1062846302", 
    "canDelete": false, 
    "nextInTopic": 9290, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDNGNTlCRjVFLjMwMjA0MDJAbGliZXJvLml0Pg=="
    }
}