{
    "numMessagesInTopic": 11, 
    "nextInTime": 9296, 
    "senderId": "Gt9-fH-BKYt6rYlzRihgmXXNUr9JR91TnpI3vcsqrtZzodoE17SqFGydXVVRJoEQX7xnFOJzlfmEZRavm7SMl_o", 
    "systemMessage": false, 
    "subject": "Re: [junit] Domain specific question", 
    "from": "Jim Dixon &lt;jdd@...&gt;", 
    "authorName": "Jim Dixon", 
    "msgSnippet": "... You don t.  You need to be able to generate test data sets of the requisite size and complexity.  In fact you need these same data sets to prove that the", 
    "msgId": 9295, 
    "profile": "jddbristol", 
    "topicId": 9274, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 92667225, 
    "messageBody": "<div id=\"ygrps-yiv-882195246\">On Thu, 4 Sep 2003, Venkatesh Prasad Ranganath wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; To test the analysis class you need to provide it an IR which means we<br/>\n&gt; need the whole machinery to setup the IR on which the analysis works<br/>\n<br/>\n </span></blockquote>You don&#39;t.  You need to be able to generate test data sets of the<br/>\nrequisite size and complexity.  In fact you need these same data<br/>\nsets to prove that the output of the preceding stage is correct.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and then drive the analysis with the test object while probing it<br/>\n&gt; correctness.  Generally, the machinery to setup the IR is complex or<br/>\n&gt; large.  So, would one code that up into the test case?  If so, at what<br/>\n&gt; cost?<br/>\n<br/>\n </span></blockquote>Personally I expect the test apparatus to be roughly 1/3 the size of<br/>\nwhatever is being tested.  In my experience, the man-hours involved<br/>\nin writing the test code are more than offset by the time saved in<br/>\ndeveloping code.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;        A more simple question would be that how much effort should go<br/>\n&gt; into setting up the environment for object to be tested and test<br/>\n&gt; object itself?  Also, say if the analysis provides information say<br/>\n&gt; relation between 2 entities in the IR, then how do you test for this<br/>\n&gt; relation while unit testing the analysis (may be this is into another<br/>\n&gt; form of testing but anyways...)?<br/>\n<br/>\n </span></blockquote>In reality, if your code is this big and unwieldy, you need a big test<br/>\nrig.<br/>\n<br/>\nOne way to get this is to just release the code on the world, using it<br/>\nas that huge test rig.  We all know people who do that ;-)<br/>\n<br/>\nAnother way is to grit your teeth and build the huge test rig.<br/>\n<br/>\nA third way is to take a long hard look at your code and see how it can<br/>\nbe split into testable chunks.<br/>\n<br/>\nThe third way is the right way to go.<br/>\n<br/>\nIf your code is so big that it&#39;s untestable, it&#39;s too big to be<br/>\ncomprehensible.  It&#39;s going to be buggy, and as we all know,<br/>\nthe cost of fixing them goes up exponentially as you progress into<br/>\nthe design cycle.<br/>\n<br/>\n--<br/>\nJim Dixon  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jdd@...\">jdd@...</a>   tel +44 117 982 0786  mobile +44 797 373 7881</div>", 
    "prevInTime": 9294, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1062703275", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 9291, 
    "headers": {
        "inReplyToHeader": "PGJqODAzZSRuMTkkMUBzZWEuZ21hbmUub3JnPg==", 
        "messageIdInHeader": "PDIwMDMwOTA0MTk1NDI2LlQ4Nzc3My0xMDAwMDBAbG9jYWxob3N0Pg=="
    }
}