{
    "numMessagesInTopic": 3, 
    "nextInTime": 9409, 
    "senderId": "RHK9dHYcG9vzIU5qwoxQFstI_Sw_nxQuLYBYINmmglz6VWJRXKI1t2Qed65DiO_4q8F8sbtGIhL7apvCWQVVZUUuwQkIkqxa98UPDTFx", 
    "systemMessage": false, 
    "subject": "The &quot;final&quot; keyword", 
    "from": "Jason Rogers &lt;jacaetevha@...&gt;", 
    "authorName": "Jason Rogers", 
    "msgSnippet": "There came a blazing remark about the final keyword being the most counterproductive keyword in Java, I don t remember who it was.  Let me offer some of my", 
    "msgId": 9408, 
    "profile": "jacaetev", 
    "topicId": 9408, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 109352929, 
    "messageBody": "<div id=\"ygrps-yiv-1027340773\">There came a blazing remark about the &quot;final&quot; keyword being the most<br/>\ncounterproductive keyword in Java, I don&#39;t remember who it was.  Let me<br/>\noffer some of my insight...<br/>\n<br/>\nI particularly like final on member variables.  I am a BIG fan of<br/>\ncreating immutable objects -- I like for my objects to be in a sane<br/>\nstate when they are created.  Having to set any number of things on them<br/>\nbefore being able to use them smells bad to me. --Personal tastes<br/>\nperhaps.  That doesn&#39;t mean I don&#39;t ever use setters, it&#39;s just that<br/>\navoid them like the plague, but sometimes they catch me.<br/>\n<br/>\nI tend to like final on classes.  Here are some reasons:<br/>\n  -- I don&#39;t see the the real strength of OOP being inheritance<br/>\n  -- putting final on a class makes me think twice when I want to<br/>\n     extend from it.  &quot;Is the &quot;IS-A&quot; relationship right in this<br/>\n     case or am I just being lazy?&quot;<br/>\n  -- others?? Maybe, but I don&#39;t have the brain power right now to<br/>\n     list them.<br/>\n<br/>\nI don&#39;t usually put final on methods.  If they are public in any sense<br/>\nof the word (default, protected, public) then they are part of the<br/>\npublic contract.  If the class is extended the subclass should have all<br/>\nthe right to override that functionality.  I tend to think that if it<br/>\nhurts too much for the subclass to override a method it indicates one of<br/>\ntwo things: the subclass probably shouldn&#39;t be there, refactor to a<br/>\nDelegate, _OR_ the method shouldn&#39;t be in the base class, refactor it to<br/>\nthe proper class.<br/>\n<br/>\nJust my $0.05...<br/>\n<br/>\n=jason</div>", 
    "prevInTime": 9407, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1063925785", 
    "canDelete": false, 
    "nextInTopic": 9410, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDEwNjM5MjU3ODYuMjI1OC4zNC5jYW1lbEBSaGlubz4="
    }
}