{
    "numMessagesInTopic": 125, 
    "nextInTime": 9446, 
    "senderId": "Oo4_G8fskjI6Au-iLlc_aGqDQ7IEp-JWtLnRZVRj7BKKCklYRHQvTwlDmCHZTccVQq9tVTM8dQrbhviwnBpL6ZYn8eDyCv1WbsFXGt5p_w", 
    "systemMessage": false, 
    "subject": "Re: [junit] Help plz...", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... I have observed the opposite: programmers consistently overcomment their code, translating the code into natural language, sometimes on a line-by-line", 
    "msgId": 9445, 
    "profile": "nails762", 
    "topicId": 9354, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-877100125\">Jim Dixon wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; On Fri, 19 Sep 2003, J. B. Rainsberger wrote:<br/>\n&gt; <br/>\n&gt;  &gt; &gt;  &gt; They&#39;re like comments. Comments are not executable and cannot <br/>\n&gt; fail if<br/>\n&gt;  &gt; &gt;  &gt; they are wrong, so they are waste.<br/>\n&gt;  &gt; &gt;<br/>\n&gt;  &gt; &gt; So code should never be commented??  This makes no sense.<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; Comments that merely describe how the code does things is waste. The<br/>\n&gt;  &gt; code already says that. These are the comments that a vast majority of<br/>\n&gt;  &gt; programmers insist on writing, largely because someone taught them to do<br/>\n&gt;  &gt; so in school.<br/>\n&gt; <br/>\n&gt; In my experience<br/>\n&gt; <br/>\n&gt; *  few programmers comment code to any degree<br/>\n<br/>\n </span></blockquote>I have observed the opposite: programmers consistently overcomment their <br/>\ncode, translating the code into natural language, sometimes on a <br/>\nline-by-line basis, but often on a block-by-block basis.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; *  fewer comments correlate well with more bugs<br/>\n<br/>\n </span></blockquote>Fewer comments are generally not the cause, though: fewer comments <br/>\ncorrelate with laziness which correlates with lack of attention to <br/>\ntesting, which causes more bugs. I have observed heavily-commented buggy <br/>\ncode and sparsely-commented code with few defects. In addition to <br/>\nobserving both I have written both.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; *  as often as not, it&#39;s faster to rewrite uncommented code than it is<br/>\n&gt;    to figure out what the code &quot;already says&quot;<br/>\n&gt; <br/>\n&gt; If the code is doing anything complex, if it is implementing rules<br/>\n&gt; that contain domain-specific knowledge, comments are not waste --<br/>\n&gt; they are absolutely essential.<br/>\n<br/>\n </span></blockquote>Not essential, although they can help. If the code simply said what the <br/>\ncomments say, then they *would* be both the comments and the logic. It&#39;s <br/>\nsimply a matter of choosing better names and extracting methods where <br/>\nappropriate.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; &gt;  &gt;                                    Diagnostic messages are not<br/>\n&gt;  &gt; &gt;  &gt; assertions and cannot fail if they are wrong, so they are waste.<br/>\n&gt;  &gt; &gt;<br/>\n&gt;  &gt; &gt; It is trivially easy to put diagnostic messages inside an if -- you<br/>\n&gt;  &gt; &gt; see them if something of interest occurs.<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; Waste is waste. Large amounts of waste often build themselves up from a<br/>\n&gt;  &gt; large number of small amounts of waste.<br/>\n&gt; <br/>\n&gt; Often you work with code that is uncommented, buggy, and incomprehensible.<br/>\n&gt; One useful way to figure it out is sprinkling diagnostic messages here<br/>\n&gt; and there, running it, and watching what falls out.<br/>\n&gt; <br/>\n&gt; There are many other approaches.  Some people use one, some another.<br/>\n&gt; If you are fortunate, you have a variety of people working with you, so<br/>\n&gt; that when you can&#39;t understand what&#39;s in front of you, you can pass the<br/>\n&gt; problem over to someone else with a different set of skills.  If you<br/>\n&gt; are _very_ fortunate, you will have more than one tool in your own bag<br/>\n&gt; of tricks.<br/>\n<br/>\n </span></blockquote>I&#39;m not saying that I don&#39;t know how to write printf() or use the <br/>\ndebugger. I just choose not to when I can write tests instead. It&#39;s <br/>\nclear to me that tests provide the same benefits as printf() *and* <br/>\npreserve what I have learn for posterity. &quot;It&#39;s no good to anyone else <br/>\nin your head, Mozart. Write it down.&quot; (paraphrase of Salieri from the <br/>\nfilm Amadeus.)<br/>\n-- <br/>\nJ. B. Rainsberger,<br/>\nDiaspar Software Services<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com\">http://www.diasparsoftware.com</a> :: +1 416 791-8603<br/>\nLet&#39;s write software that people understand</div>", 
    "prevInTime": 9444, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1064260761", 
    "canDelete": false, 
    "nextInTopic": 9452, 
    "prevInTopic": 9427, 
    "headers": {
        "inReplyToHeader": "PDIwMDMwOTIwMTIyMTE0LkozMDQyOS0xMDAwMDBAbG9jYWxob3N0Pg==", 
        "messageIdInHeader": "PDNGNkY1NDk5LjIwMDA0MDVAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDIwMDMwOTIwMTIyMTE0LkozMDQyOS0xMDAwMDBAbG9jYWxob3N0Pg=="
    }
}