{
    "numMessagesInTopic": 125, 
    "nextInTime": 9470, 
    "senderId": "gWwwvcWAa9_ar-EgSVo5Wvi5BNCKQROwpbV6oy7pGCriVfNM6LIbRzcgDdcTzvIqLby2rt-Pb5ckVirSxzo7CV0", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Help plz...", 
    "from": "Jim Dixon &lt;jdd@...&gt;", 
    "authorName": "Jim Dixon", 
    "msgSnippet": "... Uhm, well ... Most people reduce the number of comments by using longer names and elaborating program structure. While this might seem free, it isn t. ", 
    "msgId": 9469, 
    "profile": "jddbristol", 
    "topicId": 9354, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 92667225, 
    "messageBody": "<div id=\"ygrps-yiv-26875360\">On Tue, 23 Sep 2003, Ron Jeffries wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There seems to be some agreement in the thread, around &quot;use as few<br/>\n&gt; comments as necessary and no fewer.&quot;<br/>\n<br/>\n </span></blockquote>Uhm, well ...<br/>\n<br/>\nMost people reduce the number of comments by using longer names and<br/>\nelaborating program structure. While this might seem free, it isn&#39;t.<br/>\nThere is a direct cost in terms of program size and execution speed.<br/>\n<br/>\nThe August 2003 issue of the Communications of the ACM focuses on program<br/>\ncompaction and has a lead article &quot;Extracting Library-based Java<br/>\nApplications&quot;.  This concerns software developed by IBM researchers to<br/>\nreduce the size of Java code.  One of their tools minimizes the length of<br/>\nnames where possible (it&#39;s not possible where a name is part of a<br/>\npublished interface).  Using this and other techniques they typically<br/>\nshrink Java code by well over 50% for a small one-time cost in terms of<br/>\ncomputer cycles (it takes about 4 minutes to process 3.8 MB of code on an<br/>\n800 MHz PC).<br/>\n<br/>\nThere is a reasonably reliable relationship between code size and<br/>\nspeed.  Less than half as many bytes typically means software that<br/>\nruns more than twice as fast.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There seems to be some disagreement, far less specific, around how<br/>\n&gt; many that might be.<br/>\n&gt;<br/>\n&gt; I suspect that there&#39;s some sharing and learning that might help<br/>\n&gt; someone learn something. One way to do that would be to present a<br/>\n&gt; little code that one thinks is down to minimum comments, and see what<br/>\n&gt; others can do with it to make it need fewer.<br/>\n<br/>\n </span></blockquote>Sure, but bear in mind the cost of using long names and an expanded<br/>\nclass hierarchy to replace comments.<br/>\n<br/>\nI&#39;m not saying it should be forbidden.  I do it myself all the time.<br/>\nBut nothing is black and white; there are always tradeoffs.<br/>\n<br/>\nHowever, if you are suggesting that documentation should always and in all<br/>\nways be minimal, I have to disagree outright.  Someone using software<br/>\nshould not have to refer to the code to understand how it works.  On the<br/>\ncontrary: there are strong arguments for never looking beyond the<br/>\nJavadocs.  If that sort of documentation is missing or is unreliable, the<br/>\ncost of using software soars.<br/>\n<br/>\nIs this relevant to testing?  Yes it is.  Where code is underdocumented,<br/>\nthe poor guy who inherits it often must resort to exploratory testing,<br/>\nto understand what the code actually does.  This is extremely expensive,<br/>\na waste of programmer time.<br/>\n<br/>\n--<br/>\nJim Dixon  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jdd@...\">jdd@...</a>   tel +44 117 982 0786  mobile +44 797 373 7881</div>", 
    "prevInTime": 9468, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1064337371", 
    "canDelete": false, 
    "nextInTopic": 9470, 
    "prevInTopic": 9468, 
    "headers": {
        "inReplyToHeader": "PGJrcG5pcytic2htQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDIwMDMwOTIzMTc0MDAwLkUzMDQyOS0xMDAwMDBAbG9jYWxob3N0Pg=="
    }
}