{
    "numMessagesInTopic": 125, 
    "nextInTime": 9472, 
    "senderId": "v1bnx55yjT-H2zV4Jm15fH2ZnxNfNGkaX5no-J4VPMHr_NSg3KPJU6sOlvfmiLiHuD-zixLNMp6-qHxcXo_88Mt-PT6fe8mr0vFEZmvTGMBFmw", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Help plz...", 
    "from": "Ron Jeffries &lt;ronjeffries@...&gt;", 
    "authorName": "Ron Jeffries", 
    "msgSnippet": "... I can see that elaborating structure /sometimes/ might impact speed. On the other hand, elaborating structure can also illuminate the darkness and focus", 
    "msgId": 9471, 
    "rawEmail": "Return-Path: &lt;ronjeffries@...&gt;\r\nReceived: (qmail 23712 invoked by uid 7800); 23 Sep 2003 20:13:24 -0000\r\nX-Sender: ronjeffries@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 57547 invoked from network); 23 Sep 2003 20:02:57 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m20.grp.scd.yahoo.com with QMQP; 23 Sep 2003 20:02:57 -0000\r\nReceived: from unknown (HELO imail.dundee.net) (205.244.25.3)\n  by mta2.grp.scd.yahoo.com with SMTP; 23 Sep 2003 20:02:51 -0000\r\nReceived: from 192.168.1.101 [24.213.16.24] by imail.dundee.net with ESMTP\n  (SMTPD32-8.03) id A6D980280080; Tue, 23 Sep 2003 16:02:33 -0400\r\nDate: Tue, 23 Sep 2003 16:01:46 -0400\r\nX-Mailer: The Bat! (v1.60q) Personal\r\nOrganization: XProgramming.com\r\nX-Priority: 3 (Normal)\r\nMessage-ID: &lt;16782096518.20030923160146@...&gt;\r\nTo: junit@yahoogroups.com\r\nSubject: Re: [junit] Re: Help plz...\r\nIn-Reply-To: &lt;20030923174000.E30429-100000@localhost&gt;\r\nReferences: &lt;20030923174000.E30429-100000@localhost&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=us-ascii\r\nContent-Transfer-Encoding: 7bit\r\nX-Declude-Sender: ronjeffries@... [24.213.16.24]\r\nX-eGroups-From: Ron Jeffries &lt;ronjeffries@...&gt;\r\nFrom: Ron Jeffries &lt;ronjeffries@...&gt;\r\nReply-To: Ron Jeffries &lt;ronjeffries@...&gt;\r\nX-Yahoo-Group-Post: member; u=155351857\r\nX-Yahoo-Profile: ronaldejeffries\r\nX-eGroups-Approved-By: vbossica &lt;vladimir@...&gt; via email; 23 Sep 2003 20:13:24 -0000\r\n\r\nOn Tuesday, September 23, 2003, at 1:16:11 PM, Jim Dixon wrote:\n\n&gt; On Tue, 23 Sep 2003, Ron Jeffries wrote:\n\n&gt;&gt; There seems to be some agreement in the thread, around &quot;use as few\n&gt;&gt; comments as necessary and no fewer.&quot;\n\n&gt; Uhm, well ...\n\n&gt; Most people reduce the number of comments by using longer names and\n&gt; elaborating program structure. While this might seem free, it isn&#39;t.\n&gt; There is a direct cost in terms of program size and execution speed.\n\nI can see that elaborating structure /sometimes/ might impact speed. On the\nother hand, elaborating structure can also illuminate the darkness and\nfocus attention on where to make things fast.\n\nI myself wouldn&#39;t avoid defining a method to make things clear. I might\nthen wind it back in /if and when/ a performance measurement showed it was\nnecessary.\n\nMy experience is that a huge percentage of the tight code we write just\nbecause it&#39;s more efficient is wasted effort. My practice is to write clear\ncode, and then optimize it where it needs it, reducing clarity if I must.\n\n&gt; The August 2003 issue of the Communications of the ACM focuses on program\n&gt; compaction and has a lead article &quot;Extracting Library-based Java\n&gt; Applications&quot;.  This concerns software developed by IBM researchers to\n&gt; reduce the size of Java code.  One of their tools minimizes the length of\n&gt; names where possible (it&#39;s not possible where a name is part of a\n&gt; published interface).  Using this and other techniques they typically\n&gt; shrink Java code by well over 50% for a small one-time cost in terms of\n&gt; computer cycles (it takes about 4 minutes to process 3.8 MB of code on an\n&gt; 800 MHz PC).\n\nI can see how some Java systems might increase the size of the code by\nincluding non-public names, but it seems somewhat of a bug to do so as a\nmatter of course.\n\nIf short names were really valuable, I might write with readable names and\nthen precompile the software down to short names. We once did that with a\nwhole operating system, although our purpose was obfuscation, not\nefficiency.\n\n&gt; There is a reasonably reliable relationship between code size and\n&gt; speed.  Less than half as many bytes typically means software that\n&gt; runs more than twice as fast.\n\nThis is news to me, and I can think of counterexamples, such as unrolling\nloops, or hard-coding table lookups, which typically increases both size\nand speed. Have you some references regarding the speed/size relationship\nand how it varies?\n\n&gt;&gt; There seems to be some disagreement, far less specific, around how\n&gt;&gt; many that might be.\n&gt;&gt;\n&gt;&gt; I suspect that there&#39;s some sharing and learning that might help\n&gt;&gt; someone learn something. One way to do that would be to present a\n&gt;&gt; little code that one thinks is down to minimum comments, and see what\n&gt;&gt; others can do with it to make it need fewer.\n\n&gt; Sure, but bear in mind the cost of using long names and an expanded\n&gt; class hierarchy to replace comments.\n\n&gt; I&#39;m not saying it should be forbidden.  I do it myself all the time.\n&gt; But nothing is black and white; there are always tradeoffs.\n\nYes. I suspect that I think the tradeoffs favor clear code more than you\ndo, but that could be because I don&#39;t work on the same kind of code.\nConceivably, I might have a few different tricks.\n\n&gt; However, if you are suggesting that documentation should always and in all\n&gt; ways be minimal, I have to disagree outright.  Someone using software\n&gt; should not have to refer to the code to understand how it works.  On the\n&gt; contrary: there are strong arguments for never looking beyond the\n&gt; Javadocs.  If that sort of documentation is missing or is unreliable, the\n&gt; cost of using software soars.\n\nJavadocs to understand HOW it works? I wouldn&#39;t think so. What it does, how\nto use it, yes. But how?\n\nIn any case, unless you mean we should produce more documentation than we\nneed, I think we must agree on &quot;minimal&quot; but perhaps not on just what\n&quot;minimal&quot; means.\n\n&gt; Is this relevant to testing?  Yes it is.  Where code is underdocumented,\n&gt; the poor guy who inherits it often must resort to exploratory testing,\n&gt; to understand what the code actually does.  This is extremely expensive,\n&gt; a waste of programmer time.\n\nYes. And when code is well-tested, the tests serve as compilable,\nexecutable commentary. They can&#39;t replace all comments, but they can do a\nbetter job than other comments. Or so it seems to me ...\n\nRegards,\n\nRon Jeffries\nwww.XProgramming.com\nA firkin is 9 imperial gallons, or 40.905 liters, or\n81.81 half-liter cans, allowing for 5.8 cans per day over two weeks.\nTherefore, a firkin per fortnight is a six-pack per day.\n\n\n", 
    "profile": "ronaldejeffries", 
    "topicId": 9354, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 155351857, 
    "prevInTime": 9470, 
    "contentTrasformed": false, 
    "postDate": "1064347306", 
    "canDelete": false, 
    "nextInTopic": 9472, 
    "prevInTopic": 9470, 
    "headers": {
        "inReplyToHeader": "PDIwMDMwOTIzMTc0MDAwLkUzMDQyOS0xMDAwMDBAbG9jYWxob3N0Pg==", 
        "messageIdInHeader": "PDE2NzgyMDk2NTE4LjIwMDMwOTIzMTYwMTQ2QGFjbS5vcmc+", 
        "referencesHeader": "PDIwMDMwOTIzMTc0MDAwLkUzMDQyOS0xMDAwMDBAbG9jYWxob3N0Pg=="
    }
}