{
    "numMessagesInTopic": 125, 
    "nextInTime": 9474, 
    "senderId": "6B47wNW2tTo00ZwVV3L_h3z3k7h2vQfFhV68qIABOdtRvbetWF3GqIwgkuamVImioio1p1T13C4hq2FSuXbhNIg", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Help plz...", 
    "from": "Jim Dixon &lt;jdd@...&gt;", 
    "authorName": "Jim Dixon", 
    "msgSnippet": "... I agree with this entirely.  My point is only that there _is_ a cost; it s not free. ... Right.  My friend Walter wrote tight code because that s the way", 
    "msgId": 9473, 
    "rawEmail": "Return-Path: &lt;jdd@...&gt;\r\nReceived: (qmail 27267 invoked from network); 23 Sep 2003 21:19:26 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m16.grp.scd.yahoo.com with QMQP; 23 Sep 2003 21:19:26 -0000\r\nReceived: from unknown (HELO n10.grp.scd.yahoo.com) (66.218.66.65)\n  by mta1.grp.scd.yahoo.com with SMTP; 23 Sep 2003 21:19:25 -0000\r\nX-eGroups-Return: jdd@...\r\nReceived: from [66.218.67.129] by n10.grp.scd.yahoo.com with NNFMP; 23 Sep 2003 21:19:25 -0000\r\nX-Sender: jdd@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 40391 invoked from network); 23 Sep 2003 21:14:01 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m18.grp.scd.yahoo.com with QMQP; 23 Sep 2003 21:14:01 -0000\r\nReceived: from unknown (HELO westbury.dixons.org) (82.32.46.174)\n  by mta1.grp.scd.yahoo.com with SMTP; 23 Sep 2003 21:14:00 -0000\r\nReceived: from localhost (jdd@localhost)\n\tby westbury.dixons.org (8.11.6/8.11.6) with ESMTP id h8NLDYD87616\n\tfor &lt;junit@yahoogroups.com&gt;; Tue, 23 Sep 2003 22:13:49 +0100 (BST)\n\t(envelope-from jdd@...)\r\nDate: Tue, 23 Sep 2003 22:13:34 +0100 (BST)\r\nX-X-Sender:  &lt;jdd@localhost&gt;\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nSubject: Re: [junit] Re: Help plz...\r\nIn-Reply-To: &lt;16782096518.20030923160146@...&gt;\r\nMessage-ID: &lt;20030923213917.J30429-100000@localhost&gt;\r\nMIME-Version: 1.0\r\nContent-Type: TEXT/PLAIN; charset=US-ASCII\r\nFrom: Jim Dixon &lt;jdd@...&gt;\r\nX-Yahoo-Group-Post: member; u=92667225\r\nX-Yahoo-Profile: jddbristol\r\nX-eGroups-Approved-By: vbossica &lt;vladimir@...&gt; via web; 23 Sep 2003 21:19:24 -0000\r\n\r\nOn Tue, 23 Sep 2003, Ron Jeffries wrote:\n\n&gt; &gt; Most people reduce the number of comments by using longer names and\n&gt; &gt; elaborating program structure. While this might seem free, it isn&#39;t.\n&gt; &gt; There is a direct cost in terms of program size and execution speed.\n&gt;\n&gt; I can see that elaborating structure /sometimes/ might impact speed. On the\n&gt; other hand, elaborating structure can also illuminate the darkness and\n&gt; focus attention on where to make things fast.\n&gt;\n&gt; I myself wouldn&#39;t avoid defining a method to make things clear. I might\n&gt; then wind it back in /if and when/ a performance measurement showed it was\n&gt; necessary.\n\nI agree with this entirely.  My point is only that there _is_ a cost;\nit&#39;s not free.\n\n&gt; My experience is that a huge percentage of the tight code we write just\n&gt; because it&#39;s more efficient is wasted effort. My practice is to write clear\n&gt; code, and then optimize it where it needs it, reducing clarity if I must.\n\nRight.  My friend Walter wrote tight code because that&#39;s the way that\nhe was; we reserved him for code that really mattered, code that really\nhad to be fast and/or small.\n\nI&#39;m not Walter.  When we needed code fast, I might knock it out.  But\nwhen we found out what code had to be fast, we turned our modest efforts\nover to Walter, who would grumble, argue that the specs weren&#39;t good\nenough, reformat each and every line, and then shrink it and shrink it\nagain -- days passed -- until it was tiny, jewel-like, usually\nincomprehensible, and worked flawlessly.\n\n&gt; &gt; The August 2003 issue of the Communications of the ACM focuses on program\n&gt; &gt; compaction and has a lead article &quot;Extracting Library-based Java\n&gt; &gt; Applications&quot;.  This concerns software developed by IBM researchers to\n&gt; &gt; reduce the size of Java code.  One of their tools minimizes the length of\n&gt; &gt; names where possible (it&#39;s not possible where a name is part of a\n&gt; &gt; published interface).  Using this and other techniques they typically\n&gt; &gt; shrink Java code by well over 50% for a small one-time cost in terms of\n&gt; &gt; computer cycles (it takes about 4 minutes to process 3.8 MB of code on an\n&gt; &gt; 800 MHz PC).\n&gt;\n&gt; I can see how some Java systems might increase the size of the code by\n&gt; including non-public names, but it seems somewhat of a bug to do so as a\n&gt; matter of course.\n\nLook at the bytecode.  Whenever you call\ncom.funnyfarm.toplevel.deeper.deeperstill.getondown.WeAreFinallyThere,\nit&#39;s in the bytecode, each and every character.\n\n&gt; &gt; There is a reasonably reliable relationship between code size and\n&gt; &gt; speed.  Less than half as many bytes typically means software that\n&gt; &gt; runs more than twice as fast.\n&gt;\n&gt; This is news to me, and I can think of counterexamples, such as unrolling\n&gt; loops, or hard-coding table lookups, which typically increases both size\n&gt; and speed. Have you some references regarding the speed/size relationship\n&gt; and how it varies?\n\nNo.  But I am working on tools for measuring this sort of thing.\n\nThere are indeed good counter-examples like loop unrolling.  However,\nif you set out to optimize machine language, in my experience most of\nwhat you do is the opposite.  You find that the compiler has generated\ncode that does things in 20 steps which you can reduce to 5, because\nyou have a wider view.\n\n&gt; &gt; Sure, but bear in mind the cost of using long names and an expanded\n&gt; &gt; class hierarchy to replace comments.\n&gt;\n&gt; &gt; I&#39;m not saying it should be forbidden.  I do it myself all the time.\n&gt; &gt; But nothing is black and white; there are always tradeoffs.\n&gt;\n&gt; Yes. I suspect that I think the tradeoffs favor clear code more than you\n&gt; do, but that could be because I don&#39;t work on the same kind of code.\n&gt; Conceivably, I might have a few different tricks.\n\nI would expect that you would.  ;-)\n\n&gt; &gt; However, if you are suggesting that documentation should always and in all\n&gt; &gt; ways be minimal, I have to disagree outright.  Someone using software\n&gt; &gt; should not have to refer to the code to understand how it works.  On the\n&gt; &gt; contrary: there are strong arguments for never looking beyond the\n&gt; &gt; Javadocs.  If that sort of documentation is missing or is unreliable, the\n&gt; &gt; cost of using software soars.\n&gt;\n&gt; Javadocs to understand HOW it works? I wouldn&#39;t think so. What it does, how\n&gt; to use it, yes. But how?\n\nI misspoke.  What I mean is that you shouldn&#39;t have to look at the code\nto know how to use it.  There should be good, solid, reliable external\ndocumentation.\n\n&gt; In any case, unless you mean we should produce more documentation than we\n&gt; need, I think we must agree on &quot;minimal&quot; but perhaps not on just what\n&gt; &quot;minimal&quot; means.\n\nThe documentation should be sufficient to write code against, without\nany further reference to the underlying code.\n\nComments at a lower level should be sufficient to enable maintainers\nto understand the code, so that they can fix bugs and change the\nsoftware when necessary.  Where necessary, you cite the literature\nor clearly explain practices in molecular biology or whatever.\n\nIn my experience, comments have a definite tendency to lag the code -\nprogrammers change the software and forget to modify the comments.  So\nallowing for the considerations above, comments should be terse, and\nsomeone should review the code to make sure that the comments and the\ncode are in sync.\n\n&gt; &gt; Is this relevant to testing?  Yes it is.  Where code is underdocumented,\n&gt; &gt; the poor guy who inherits it often must resort to exploratory testing,\n&gt; &gt; to understand what the code actually does.  This is extremely expensive,\n&gt; &gt; a waste of programmer time.\n&gt;\n&gt; Yes. And when code is well-tested, the tests serve as compilable,\n&gt; executable commentary. They can&#39;t replace all comments, but they can do a\n&gt; better job than other comments. Or so it seems to me ...\n\nAgreed.  My preferred approach to software development is\n\n* publish the specs\n* design tests that verify that the code adheres to the specs\n* hand the programmer the specs and the tests\n\n--\nJim Dixon  jdd@...   tel +44 117 982 0786  mobile +44 797 373 7881\n\n\n\n", 
    "profile": "jddbristol", 
    "topicId": 9354, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 92667225, 
    "prevInTime": 9472, 
    "contentTrasformed": false, 
    "postDate": "1064351614", 
    "canDelete": false, 
    "nextInTopic": 9474, 
    "prevInTopic": 9472, 
    "headers": {
        "inReplyToHeader": "PDE2NzgyMDk2NTE4LjIwMDMwOTIzMTYwMTQ2QGFjbS5vcmc+", 
        "messageIdInHeader": "PDIwMDMwOTIzMjEzOTE3LkozMDQyOS0xMDAwMDBAbG9jYWxob3N0Pg=="
    }
}