{
    "numMessagesInTopic": 125, 
    "nextInTime": 9477, 
    "senderId": "TBTLJONKLu1xnEQdrG1wTo0lP-wxqixq1fA6QJnThl6Xg8q1IO0orzawWVuX1HK3ijPbuy41khmJzpoGNCdwnUPDhN3qLcmViJ4", 
    "systemMessage": false, 
    "subject": "Re: Help plz... -- on &quot;soft assertions&quot; in JUnit tests", 
    "from": "&quot;Jeff Grigg&quot; &lt;GriggJ@...&gt;", 
    "authorName": "Jeff Grigg", 
    "msgSnippet": "[I must have pressed the wrong button when posting this initially; it went to JB, but not the list.  ]-: [Hmmm...  Let s hope that third time s the charm!", 
    "msgId": 9476, 
    "profile": "jeffgrigg63132", 
    "topicId": 9354, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 2119631, 
    "messageBody": "<div id=\"ygrps-yiv-319709442\">[I must have pressed the wrong button when posting this initially; <br/>\nit went to JB, but not the list.  ]-:<br/>\n[Hmmm...  Let&#39;s hope that &quot;third time&#39;s the charm!&quot;  ;-&gt;  ]<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Make an assertion instead.<br/>\n<br/>\n<br/>\n&gt;&gt;--- &quot;Jim Dixon&quot; &lt;jdd@d...&gt; said:<br/>\n&gt;&gt;<br/>\n&gt;&gt;&gt;Usually.  But sometimes what you want is a soft assertion<br/>\n&gt;&gt;&gt;-- if the condition doesn&#39;t hold, let me know, but keep<br/>\n&gt;&gt;&gt;on going.  And JUnit doesn&#39;t support that approach.<br/>\n<br/>\n<br/>\n&gt;Jason Rogers wrote:<br/>\n&gt;<br/>\n&gt;&gt;In unit tests you don&#39;t.  If that were the case I would<br/>\n&gt;&gt;never want to use the object because it isn&#39;t stable.<br/>\n&gt;&gt;<br/>\n&gt;&gt;In functional or integration tests, perhaps -- doubtful,<br/>\n&gt;&gt;but perhaps.  If you do need a &quot;soft assert&quot; just surround<br/>\n&gt;&gt;it with a try/catch on AssertionFailedError and keep going.<br/>\n<br/>\n </span></blockquote>--- &quot;J. B. Rainsberger&quot; &lt;jbrains@r...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I will say &quot;no&quot;: not during testing, ever. During production,<br/>\n&gt;perhaps; but not during testing, ever. Make an assertion.<br/>\n&gt;<br/>\n&gt;Strong words, I know.<br/>\n<br/>\n </span></blockquote>I 99% agree that you should use a strong assertion.  However, I have <br/>\nfound a few rare cases which are an exception.<br/>\n<br/>\nYou still have &#39;System.out.print[ln]&#39; and &#39;System.err.print[ln]&#39;.  <br/>\nIf you want &quot;soft assertions&quot; that the person running the test has <br/>\nto check by hand, please feel free to use them.<br/>\n<br/>\nSome IDEs highlight &#39;System.err&#39; output in red, making it an &quot;eye <br/>\ncatcher.&quot;<br/>\n<br/>\nI have a few &quot;print&quot; statements in my tests:<br/>\n<br/>\n1. A library I&#39;m using aborts the JVM when it finds problems in its <br/>\nconfiguration file.  Its configuration changes regularly, and there <br/>\nare often problems.  So I print &quot;If the system aborts right after <br/>\nprinting this message, check the configuration file &#39;X&#39; for problems <br/>\nlike this...&quot;  The message has proven helpful.<br/>\n<br/>\n2. I have a few &quot;print&quot; statements for tracing.  Almost all of them <br/>\nare commented out, and probably most of them should be deleted.<br/>\n<br/>\n3. Some MockObjects print unexpected calls, almost to the point of <br/>\ncode generation, for the convenience of the developer.  Then they <br/>\ntake a default action that is right most of the time.  Really, these <br/>\nshould set a flag or counter that would trigger an ASSERT later on.<br/>\n<br/>\n4. Some MockObjects do &#39;System.err.println&#39; rather than throw an <br/>\nexception, because a library inflicted upon us by an architecture <br/>\nteam silently captures and ignores runtime errors, like <br/>\nAssertionError.  (It&#39;s bad code, and they shouldn&#39;t do this, but <br/>\nthey refuse to change it.)  Again, I should probably set a flag or <br/>\ncounter, and ASSERT in the JUnit test code after we return out <br/>\nthrough the library.<br/>\n<br/>\n5. I&#39;ve done &#39;System.err.println&#39;, from time to time, instead of an <br/>\nassert, because I didn&#39;t have the conditions completely worked out <br/>\nso that it would be right all the time.  This is typically a problem <br/>\nwhen we&#39;re checking and cleaning up bad code.</div>", 
    "prevInTime": 9475, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1064368690", 
    "canDelete": false, 
    "nextInTopic": 9477, 
    "prevInTopic": 9475, 
    "headers": {
        "inReplyToHeader": "PDNGNkIzRjVGLjEwNTA0QHJvZ2Vycy5jb20+", 
        "messageIdInHeader": "PGJrcXRuaStyaW1kQGVHcm91cHMuY29tPg=="
    }
}