{
    "numMessagesInTopic": 125, 
    "nextInTime": 9488, 
    "senderId": "8CbZDZtTmT0QiX8Wtm9m8qH-ldh7fnRUUKaH5opLpjonGIUUn9j3nAVGG1XTKJEP_dgf1fVvL_TNkWHoUGxtuiO3-qbUZSfDvehUMMi-5Am_TQ", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Help plz...", 
    "from": "Ron Jeffries &lt;ronjeffries@...&gt;", 
    "authorName": "Ron Jeffries", 
    "msgSnippet": "... Jim, I mean this in the nicest possible way: I think you need to run a test. All the interpreted languages I know use symbol tables. The references in the", 
    "msgId": 9487, 
    "profile": "ronaldejeffries", 
    "topicId": 9354, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 155351857, 
    "messageBody": "<div id=\"ygrps-yiv-1391320555\">On Wednesday, September 24, 2003, at 9:07:09 AM, Jim Dixon wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; On Tue, 23 Sep 2003, Ron Jeffries wrote:<br/>\n<br/>\n&gt;&gt; &gt; Of course.  But one of the subthreads in this discussion is that<br/>\n&gt;&gt; &gt; comments can be made unnecessary by, for example, appropriate choice<br/>\n&gt;&gt; &gt; of variable/method/class/etc names.  This is something that we all do, I<br/>\n&gt;&gt; &gt; imagine.<br/>\n&gt;&gt;<br/>\n&gt;&gt; &gt; But the longer and more meaningful the names, the slower the code ;-)<br/>\n&gt;&gt;<br/>\n&gt;&gt; In what language is this true, and why?<br/>\n<br/>\n&gt; It&#39;s probably true in any interpreted language; it takes time to run<br/>\n&gt; through strings.  The longer the strings, the more time it takes.<br/>\n<br/>\n </span></blockquote>Jim, I mean this in the nicest possible way: I think you need to run a<br/>\ntest.<br/>\n<br/>\nAll the interpreted languages I know use symbol tables. The references in<br/>\nthe byte code are resolved to indexes or pointers at compile time,<br/>\ngenerally not run time. In Java, in which I am not expert, my understanding<br/>\nis that the code that actually executes has been run through the jitter and<br/>\nconverted to actual machine code. I would expect all the symbol lookups, if<br/>\nthere were any, and if they were slow, to be resolved by then if not<br/>\nbefore.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, Java is widely used in applications whose performance is<br/>\n&gt; dominated by communications.  If names are embedded in those<br/>\n&gt; communications, longer names mean slower communications means<br/>\n&gt; poorer performance.<br/>\n<br/>\n </span></blockquote>Yes, that&#39;s true. If names were the bulk of the messages going back and<br/>\nforth, then longer could be slower. If, as is not uncommonly the case,<br/>\nwhat&#39;s going back and forth is mostly data -- web pages, movies, sound,<br/>\ndatabase records -- then the symbols in the queries and responses aren&#39;t<br/>\nlikely to be a big fraction of the data transmitted. Clearly this is<br/>\napplication dependent, and encoding dependent.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This rule should not be true in compute-intensive applications --<br/>\n&gt; but the more compute-bound the problem, the less likely that Java<br/>\n&gt; is to be used.<br/>\n<br/>\n </span></blockquote>Yes, but this is more a function of its interpretive nature than the length<br/>\nof the names, I would expect. And somewhere I believe I saw a case where C#<br/>\nbeat C++ on some benchmark. And I have seen Smalltalk beat C++ as well.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In a month or two I might be able to come back with performance<br/>\n&gt; figures.<br/>\n<br/>\n </span></blockquote>I guess you&#39;re very busy. Perhaps a smaller experiment would be possible.<br/>\nMaybe someone else will do one. But the one that will convince you will be<br/>\none that you&#39;ll do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Elsewhere in this thread I have cited a CACM article that would seem<br/>\n&gt; to support this rule of thumb.<br/>\n<br/>\n </span></blockquote>Yes. I&#39;ll check it out and report back if it&#39;s interesting ...<br/>\n<br/>\nRon Jeffries<br/>\nwww.XProgramming.com<br/>\nAnalysis kills spontaneity.<br/>\nThe grain once ground into flour germinates no more. --  Henri Amiel</div>", 
    "prevInTime": 9486, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1064411116", 
    "canDelete": false, 
    "nextInTopic": 9488, 
    "prevInTopic": 9486, 
    "headers": {
        "inReplyToHeader": "PDIwMDMwOTI0MTM1ODQzLlQzMDQyOS0xMDAwMDBAbG9jYWxob3N0Pg==", 
        "messageIdInHeader": "PDYxMTQ0OTA2MjA0LjIwMDMwOTI0MDk0NTE2QGFjbS5vcmc+", 
        "referencesHeader": "PDIwMDMwOTI0MTM1ODQzLlQzMDQyOS0xMDAwMDBAbG9jYWxob3N0Pg=="
    }
}