{
    "numMessagesInTopic": 125, 
    "nextInTime": 9492, 
    "senderId": "sKeDtI4La51kBCu5ATGvhCHvR-u-bEiaZ6fq-i5SSQFR7YdEmuH6p2mpXi1c0UDshLeuCIggZPO0a7f07fyQqmY", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Help plz...", 
    "from": "Jim Dixon &lt;jdd@...&gt;", 
    "authorName": "Jim Dixon", 
    "msgSnippet": "... The last time I had a discussion like this, I did.  Then it was Perl vs C.  The result was that the same logic written in C ran thirty (30) times faster. I", 
    "msgId": 9491, 
    "rawEmail": "Return-Path: &lt;jdd@...&gt;\r\nX-Sender: jdd@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 85338 invoked from network); 24 Sep 2003 16:01:39 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m14.grp.scd.yahoo.com with QMQP; 24 Sep 2003 16:01:39 -0000\r\nReceived: from unknown (HELO westbury.dixons.org) (82.32.46.174)\n  by mta6.grp.scd.yahoo.com with SMTP; 24 Sep 2003 16:01:38 -0000\r\nReceived: from localhost (jdd@localhost)\n\tby westbury.dixons.org (8.11.6/8.11.6) with ESMTP id h8OG1B491515\n\tfor &lt;junit@yahoogroups.com&gt;; Wed, 24 Sep 2003 17:01:26 +0100 (BST)\n\t(envelope-from jdd@...)\r\nDate: Wed, 24 Sep 2003 17:01:11 +0100 (BST)\r\nX-X-Sender:  &lt;jdd@localhost&gt;\r\nTo: &lt;junit@yahoogroups.com&gt;\r\nSubject: Re: [junit] Re: Help plz...\r\nIn-Reply-To: &lt;61144906204.20030924094516@...&gt;\r\nMessage-ID: &lt;20030924161834.N30429-100000@localhost&gt;\r\nMIME-Version: 1.0\r\nContent-Type: TEXT/PLAIN; charset=US-ASCII\r\nFrom: Jim Dixon &lt;jdd@...&gt;\r\nX-Yahoo-Group-Post: member; u=92667225\r\nX-Yahoo-Profile: jddbristol\r\n\r\nOn Wed, 24 Sep 2003, Ron Jeffries wrote:\n\n&gt; &gt; It&#39;s probably true in any interpreted language; it takes time to run\n&gt; &gt; through strings.  The longer the strings, the more time it takes.\n&gt;\n&gt; Jim, I mean this in the nicest possible way: I think you need to run a\n&gt; test.\n\nThe last time I had a discussion like this, I did.  Then it was Perl\nvs C.  The result was that the same logic written in C ran thirty (30)\ntimes faster.\n\nI didn&#39;t do any special optimizations.  I had written both sets of code.\nThe job was not compute bound.  It involved lookups in a smallish\ndatabase (about 3 MB of data on a machine with, as I recall, 128 MB of\nmemory).\n\nThe customer was convinced to switch to C, but someone else convinced\nhim to switch his database to Oracle.  The consequence for him was\neven larger consulting bills and no change in performance at all,\nOracle being another big interpreter.\n\nI haven&#39;t done any real testing, but my impression is that overall\nJava performs like Perl.  The development environment is wonderful,\nthe code is much easier to debug, the language itself is clear and\nalmost entirely free of the weirdnesses that characterize Perl.  But\nit&#39;s slow.\n\n&gt; All the interpreted languages I know use symbol tables. The references in\n&gt; the byte code are resolved to indexes or pointers at compile time,\n&gt; generally not run time. In Java, in which I am not expert, my understanding\n&gt; is that the code that actually executes has been run through the jitter and\n&gt; converted to actual machine code. I would expect all the symbol lookups, if\n&gt; there were any, and if they were slow, to be resolved by then if not\n&gt; before.\n\nYes, but ...\n\n&gt; &gt; Also, Java is widely used in applications whose performance is\n&gt; &gt; dominated by communications.  If names are embedded in those\n                                  **\n&gt; &gt; communications, longer names mean slower communications means\n&gt; &gt; poorer performance.\n&gt;\n&gt; Yes, that&#39;s true. If names were the bulk of the messages going back and\n&gt; forth, then longer could be slower. If, as is not uncommonly the case,\n&gt; what&#39;s going back and forth is mostly data -- web pages, movies, sound,\n&gt; database records -- then the symbols in the queries and responses aren&#39;t\n&gt; likely to be a big fraction of the data transmitted. Clearly this is\n&gt; application dependent, and encoding dependent.\n\nIndeed.  Any attempts at benchmarking will be difficult, because you\nhave to have a realistic mix of applications.\n\nTo be fair, remember that it&#39;s not just names that slow things down.\nLayers of abstraction also have a large effect on program size and\nprobably performance.\n\n&gt; &gt; This rule should not be true in compute-intensive applications --\n&gt; &gt; but the more compute-bound the problem, the less likely that Java\n&gt; &gt; is to be used.\n&gt;\n&gt; Yes, but this is more a function of its interpretive nature than the length\n&gt; of the names, I would expect. And somewhere I believe I saw a case where C#\n&gt; beat C++ on some benchmark. And I have seen Smalltalk beat C++ as well.\n\nPick your benchmark carefully, and anyone can win ;-)\n\nI once had a customer who benchmarked a system we sold him and\ncomplained bitterly about the results.  I asked to see the test code.\nHe had put a print statement right in the middle of a for loop.\n\nHe was a nuclear physicist.  It took him a few seconds to grasp that\nI/O is hugely expensive compared to computation.  He went away, moved\nthe print statement, and was satisfied.\n\n&gt; &gt; In a month or two I might be able to come back with performance\n&gt; &gt; figures.\n&gt;\n&gt; I guess you&#39;re very busy. Perhaps a smaller experiment would be possible.\n\nThe month or two is realistic, especially when followed by &quot;might&quot;.\nI will try to do something faster, but fear that a rushed, poorly\nthought out set of experiments will only confuse issues.\n\nOne approach would be scrunch say JBoss and measure scrunched vs\nunscrunched performance on a mix of applications.  But there is\nlikely to be a straight trade-off between &#39;quick and easy&#39; on the\none hand and &#39;convincing&#39; on the other.\n\n--\nJim Dixon  jdd@...   tel +44 117 982 0786  mobile +44 797 373 7881\n\n\n", 
    "profile": "jddbristol", 
    "topicId": 9354, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 92667225, 
    "prevInTime": 9490, 
    "contentTrasformed": false, 
    "postDate": "1064419271", 
    "canDelete": false, 
    "nextInTopic": 9492, 
    "prevInTopic": 9490, 
    "headers": {
        "inReplyToHeader": "PDYxMTQ0OTA2MjA0LjIwMDMwOTI0MDk0NTE2QGFjbS5vcmc+", 
        "messageIdInHeader": "PDIwMDMwOTI0MTYxODM0Lk4zMDQyOS0xMDAwMDBAbG9jYWxob3N0Pg=="
    }
}