{
    "numMessagesInTopic": 2, 
    "nextInTime": 96, 
    "senderId": "_ZQJBOeRBaWaw1tn87L0in7rHA2MnQNmG0DkUnPBS7OPkHE9pXUyukKPxbn7VMlmXrnu3_SyyUq-ZHzz61vDlyKVTCrFZb20ZyAD2BI", 
    "systemMessage": false, 
    "subject": "xUnit testing of distributed systems", 
    "from": "&quot;Jamie Lawrence&quot; &lt;hopeless@eircom.net&gt;", 
    "authorName": "Jamie Lawrence", 
    "msgSnippet": "I have finally got around to using JUnit for some of the development work I do (all in Java).  However, whilst JUnit is fine for testing normal classes I m", 
    "msgId": 95, 
    "topicId": 95, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 0, 
    "messageBody": "<div id=\"ygrps-yiv-1241697878\">I have finally got around to using JUnit for some of the development work I<br/>\ndo (all in Java).  However, whilst JUnit is fine for testing &quot;normal&quot;<br/>\nclasses I&#39;m really stuck on how to apply it to the application I&#39;m building.<br/>\n<br/>\nThis application is agent-based and is therefore distributed,<br/>\nmulti-threaded, asynchronous and acts in response to incoming messages and<br/>\nuser interactions.  It sits on top of an agent platform which makes it<br/>\nslightly harder to form tests (you must start the platform before any tests<br/>\nwill work).<br/>\n<br/>\nI understand that xUnit tests are normally focused on individual classes but<br/>\nin my case the classes include the agent itself, several behaviours (i.e.<br/>\ntasks), and utility classes.  The utility classes are quite easy to test as<br/>\nthey are usually standard classes devoid of agent complications.  The Agent<br/>\nhas very few methods of interest since it responds to messages placed in a<br/>\nqueue from either the GUI or other agents.  Each behaviour maintains an<br/>\ninternal state which changes in response to messages and can be<br/>\ncharacterised by either WAITING_FOR_USER, WAITING_FOR_MESSAGE,<br/>\nPERFORMING_ACTION, or SENDING_MESSAGE.  So my ideal tests would be to ensure<br/>\nthat the agent makes the correct state transitions in response to<br/>\nvalid/invalid messages and that it does this in each of the concurrent<br/>\nbehaviours.<br/>\n<br/>\nNow that I actually write all this down it does seem kinda difficult!!  But<br/>\nI think many of the problems exist in systems like Jini, etc.<br/>\n<br/>\nGiven the large amount of distributed systems work involved in most<br/>\napplications today I was hoping that someone would have typical patterns for<br/>\ntesting these systems.  Any ideas?<br/>\n<br/>\nMany thanks,<br/>\n<br/>\n<br/>\n\tJamie</div>", 
    "prevInTime": 94, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "976130830", 
    "canDelete": false, 
    "nextInTopic": 96, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDAwNDQwMWMwNWZiYSQ4NzBiYjBlMCQ3MDZlNmJjMEBwYzEyLmJyb2FkY29tLmllPg=="
    }
}