{
    "numMessagesInTopic": 125, 
    "nextInTime": 9554, 
    "senderId": "SPgJcU_Lr0bYJ7sle0Bp0ax6ytOOIUQDcpsWG8SMMOZtXwoOcaREV-6LiP4tWwttFJdYT_xNh2e0vC0eWYL8grQ", 
    "systemMessage": false, 
    "subject": "RE: [junit] Re: Help plz...", 
    "from": "Jim Dixon &lt;jdd@...&gt;", 
    "authorName": "Jim Dixon", 
    "msgSnippet": "... The test in question measured none of these things.  It measured one compute-bound activity repeated millions of times.  I believe that any optimizations", 
    "msgId": 9553, 
    "profile": "jddbristol", 
    "topicId": 9354, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 92667225, 
    "messageBody": "<div id=\"ygrps-yiv-1418138602\">On Tue, 30 Sep 2003, Ilja Preuss wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; When you are benchmarking one thing against another, you<br/>\n&gt; &gt; don&#39;t give one preferential treatment.  You run them under exactly<br/>\n&gt; &gt; the same conditions.<br/>\n </span></blockquote>...<br/>\n<blockquote><span title=\"ireply\"> &gt; Seriously, it depends on why you are benchmarking. When you are<br/>\n&gt; interested in speed of long running, server side software, start-up and<br/>\n&gt; warm-up time are quite uninteresting...<br/>\n<br/>\n </span></blockquote>The test in question measured none of these things.  It measured one<br/>\ncompute-bound activity repeated millions of times.  I believe that any<br/>\noptimizations would have occurred in the first few iterations.  The test<br/>\nitself was written in such a way as to absolutely minimize the effect<br/>\nunder test, the length of variable names; and that was only a small part<br/>\nof the larger consideration.  Java programs are slowed down by<br/>\ninterpretation and layers of abstraction.<br/>\n<br/>\nWhen you set out to test something, you must first decide what it is that<br/>\nyou are testing and why.  In part, this means paying close attention to<br/>\nthe other parties and the technical issues involved.  Then you need to<br/>\ndesign a test that reflects those considerations.<br/>\n<br/>\nIn this particular case, when asked, I said that a decent test would take<br/>\nquite some time to devise.  When the test we are talking about was<br/>\nintroduced, I pointed out that it was badly designed, but took it<br/>\nseriously: I ran it different ways and carefully logged the results.<br/>\nThey weren&#39;t what I expected, but I reported them anyway.  To put them in<br/>\nperspective, I translated the test into C++ and reported those results<br/>\nas well.  Once again, they weren&#39;t what I expected (C++ results were<br/>\nstrongly influenced by variable names; Java results weren&#39;t).<br/>\n<br/>\nFor tests to be of any value, everyone needs to subject themselves to the<br/>\ndiscipline of testing.  This includes paying attention to and accepting<br/>\nthe results.  When they aren&#39;t what you expect, you don&#39;t throw out the<br/>\ntests, you try to understand.<br/>\n<br/>\n--<br/>\nJim Dixon  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jdd@...\">jdd@...</a>   tel +44 117 982 0786  mobile +44 797 373 7881</div>", 
    "prevInTime": 9552, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1064907563", 
    "canDelete": false, 
    "nextInTopic": 9554, 
    "prevInTopic": 9552, 
    "headers": {
        "inReplyToHeader": "PDAwZTYwMWMzODcyMyQwYjkyMmM4MCQ3MDY0YThjMEBkaXN5Lm5ldD4=", 
        "messageIdInHeader": "PDIwMDMwOTMwMDgyMDUxLlU4NzYwLTEwMDAwMEBsb2NhbGhvc3Q+"
    }
}