{
    "numMessagesInTopic": 5, 
    "nextInTime": 9617, 
    "senderId": "r8anBIPkQUtw0pF1UypCEy9wYO8Ib7weoN_97ajIBYP6TnE9nUdqz4r6Edf29eW1dUBnrErc6Ag4draqkFpMotf36J03enJptKPkFyOuLtf8wLd225cZMlP37A", 
    "systemMessage": false, 
    "subject": "RE: [junit] How to test JMS code with any App. Server", 
    "from": "&quot;Leeuw van der, Tim&quot; &lt;tim.leeuwvander@...&gt;", 
    "authorName": "Leeuw van der, Tim", 
    "msgSnippet": "This message is worth putting on display just for it s amazing content-to-sig ratio. Anyways, what do you want to test? There s many ways to test JMS related ", 
    "msgId": 9616, 
    "topicId": 9594, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 151182810, 
    "messageBody": "<div id=\"ygrps-yiv-492435445\">This message is worth putting on display just for it&#39;s amazing<br/>\ncontent-to-sig ratio.<br/>\n<br/>\nAnyways, what do you want to test? There&#39;s many ways to test JMS related<br/>\nthings, either with or without jUnit.<br/>\nIf you abstract the JMS layer into a messaging-facade, you can replace the<br/>\nactual messaging-facade with a Mockup. The mockup directly connects the<br/>\nsender to the receiver and runs outside the app. server.<br/>\n<br/>\nCut down and slice up as desired; you don&#39;t have to connect sender and<br/>\nreceiver this way always - you can put a stub at either end to test them<br/>\nseperately.<br/>\n<br/>\n--Tim<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Kadam, Sal [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:skadam@...\">skadam@...</a>]<br/>\nSent: woensdag 1 oktober 2003 22:59<br/>\nTo: &#39;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a>&#39;<br/>\nSubject: [junit] How to test JMS code with any App. Server<br/>\n<br/>\n<br/>\nGuys,<br/>\n  Any thoughts.<br/>\n <br/>\n <br/>\nThanks<br/>\n Sal<br/>\n-----  This message is for the named person&#39;s use only. It may contain<br/>\nconfidential, proprietary or legally privileged information. No<br/>\nconfidentiality or privilege is waived or lost by any mistransmission. If<br/>\nyou receive this message in error, please delete it and all copies from your<br/>\nsystem, destroy any hard copies and notify the sender. You must not,<br/>\ndirectly or indirectly, use, disclose, distribute, print, or copy any part<br/>\nof this message if you are not the intended recipient. Nomura Holding<br/>\nAmerica Inc., Nomura Securities International, Inc, and their respective<br/>\nsubsidiaries each reserve the right to monitor all e-mail communications<br/>\nthrough its networks. Any views expressed in this message are those of the<br/>\nindividual sender, except where the message states otherwise and the sender<br/>\nis authorized to state the views of such entity. Unless otherwise stated,<br/>\nany pricing information in this message is indicative only, is subject to<br/>\nchange and does not constitute an offer to deal at any price quoted. Any<br/>\nreference to the terms of executed transactions should be treated as<br/>\npreliminary only and subject to our formal written confirmation.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n <br/>\n<br/>\nYour use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a></div>", 
    "prevInTime": 9615, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1065170523", 
    "canDelete": false, 
    "nextInTopic": 9640, 
    "prevInTopic": 9597, 
    "headers": {
        "messageIdInHeader": "PEREMERDMTQ5MzVCMUQyMTE5ODFBMDAxMDVBMUIyOERCMEE3QjRCQkVATkwtQVNELUVYQ0gtMT4="
    }
}