{
    "numMessagesInTopic": 1, 
    "nextInTime": 9690, 
    "senderId": "K9qowyIEdDBlIldN9Tjvj3vnYfqp5KkJW-uhJu6IYZnFEFz3a7uyIZcEyWKowdtqsbWZQPZTAm9isWTd4IxnUsqUxHdwSA", 
    "systemMessage": false, 
    "subject": "BumbleBee XQuery Test Harness", 
    "from": "Mike Clark &lt;mike@...&gt;", 
    "authorName": "Mike Clark", 
    "msgSnippet": "Howdy, I m proud to announce a product I ve helped develop: the BumbleBee XQuery test harness.  It s an automated test harness that you can use both for", 
    "msgId": 9689, 
    "profile": "clarkware", 
    "topicId": 9689, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 33026788, 
    "messageBody": "<div id=\"ygrps-yiv-1274732224\">Howdy,<br/>\n<br/>\nI&#39;m proud to announce a product I&#39;ve helped develop: the BumbleBee <br/>\nXQuery test harness.  It&#39;s an automated test harness that you can use <br/>\nboth for evaluating XQuery engines (seeing which vendor is more spec <br/>\ncompliant) and for validating your own queries (making sure your <br/>\nqueries continue to work as you upgrade or change engines).  You can <br/>\nthink of it as JUnit for XQuery.<br/>\n<br/>\nBumbleBee -- named because it buzzes around FLWORs -- sports the <br/>\nfollowing features:<br/>\n<br/>\n* Includes over 70 automated tests representative of the W3C XQuery Use <br/>\nCases<br/>\n* Includes over 1000 automated tests representative of the NIST XQuery <br/>\nTest Suite<br/>\n* Includes adapters to 6 different free and commercial XQuery engines<br/>\n* Includes the runtime libraries for 3 free XQuery engines<br/>\n* Allows you to write and run your own custom XQuery tests<br/>\n* Tests are automated, self checking, and report an unambiguous pass or <br/>\nfail status<br/>\n* Tests can define multiple, possible expected results<br/>\n* Can run arbitrary suites of standard and/or custom tests<br/>\n* Can run tests against one or more XQuery engines<br/>\n* Generates a comprehensive report of passed and failed tests per <br/>\nXQuery engine being tested<br/>\n* Supports the addition of new XQuery engines through a pluggable <br/>\nadapter design<br/>\n* Allows disabling and enabling tests, globally or on a per-engine basis<br/>\n* Allows customization of whitespace comparison behavior<br/>\n* Supports negative testing, where the engine must report an error to <br/>\npass<br/>\n* Written in Java for maximum portability<br/>\n<br/>\nA free, no-login-required, fully-functioning 30-day evaluation copy of <br/>\nBumbleBee and the &quot;Getting Started With BumbleBee&quot; quick-start guide is <br/>\navailable at:<br/>\n<br/>\n      <a rel=\"nofollow\" target=\"_blank\" href=\"http://xquery.com/bumblebee\">http://xquery.com/bumblebee</a><br/>\n<br/>\nLicensed copies of BumbleBee are available free of charge for <br/>\ndevelopers of open source XQuery implementations, and for qualified <br/>\nnon-profit and educational use.  Licenses of BumbleBee are available <br/>\nfor commercial use by contacting &quot;buzz&quot; at xquery.com with your usage <br/>\nrequirements.<br/>\n<br/>\nMike</div>", 
    "prevInTime": 9688, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1066193613", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDg3NDUyRDQ2LUZFQ0ItMTFENy1CQjA4LTAwMEE5NUE1NDdCQ0BjbGFya3dhcmUuY29tPg=="
    }
}