{
    "numMessagesInTopic": 23, 
    "nextInTime": 9735, 
    "senderId": "616KqWQm_JzYTtVsHSjJ7Ae6AgWpRLZs1YLC713p5te8zs9LoCZ0v9EVTTvM5I4DzFbttfD81rx0aQj5gVjUEf-zzL-N4srRPxByLuq9tAMT18k_ISPN__S75H3-", 
    "systemMessage": false, 
    "subject": "RE: [junit] Re: How to test private methods, its urgent", 
    "from": "&quot;Danijel Arsenovski&quot; &lt;darsenovski@...&gt;", 
    "authorName": "Danijel Arsenovski", 
    "msgSnippet": "Since I already mentioned Aspect Oriented Programming, I guess a way to test private methods would be using Priviledged Aspects in AspectJ, but I don t think", 
    "msgId": 9734, 
    "topicId": 9699, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 136296166, 
    "messageBody": "<div id=\"ygrps-yiv-1848965011\">Since I already mentioned Aspect Oriented Programming, I guess a way to test private methods would be using &quot;Priviledged Aspects&quot; in AspectJ, but I don&#39;t think it&#39;s viable reply for an urgent situation. I am not using aspects in productions, just experimenting at the moment...<br/>\n<br/>\n...<br/>\n\tLeaving important information to comments, docs etc is extremely dangerous! I suggest you check out refactoring    &gt;\tcataloguewww.refactoring.com (&quot;Comments lie, code does not&quot;) and how refactoring community treats comments: either you \tdon&#39;t need them  so you eliminate them or you make code out of them. Similar thing goes for documentation that is \ttrying to explain code.<br/>\n\tMaking testing influence your design decision is an example of very testing-biased paradigm, but this should not \tconflict  with basic premises of OO, like most of new usefull paradigms don&#39;t (for example AOP does not make you change \tOO principles, it builds on them).</div>", 
    "prevInTime": 9733, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1066750992", 
    "canDelete": false, 
    "nextInTopic": 9735, 
    "prevInTopic": 9733, 
    "headers": {
        "messageIdInHeader": "PDNDNjc4RERGOTIyMTIzNERBNEYyOTAwRjkzQzZGNjMzMDFFQkIwOTFAYWx0ZWMwMDUuYWx0ZWMubG9jYWw+"
    }
}