{
    "numMessagesInTopic": 16, 
    "nextInTime": 9739, 
    "senderId": "ji0_ncPN8zSlKd_XuHGf0kCoJj90XTR1FPv8jnRa3bj6PC2aN_3doiXUmhFDS8Sube0dNMmO-Ep2nrnBFgvB1lKId5ZQmIygPcOvX1igmT5ri6SYhbwRfhc", 
    "systemMessage": false, 
    "subject": "How to extend our own testcase", 
    "from": "&quot;Chirag Shashikant Doshi&quot; &lt;chirag.doshi@...&gt;", 
    "authorName": "Chirag Shashikant Doshi", 
    "msgSnippet": "Hi all, I have a Test Case class say BaseTest, There are some 10 odd tests in this class and a few setup methods. The test methods are bound to the setup", 
    "msgId": 9738, 
    "profile": "chiragsdoshi", 
    "topicId": 9738, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 141749483, 
    "messageBody": "<div id=\"ygrps-yiv-1752485439\">Hi all,<br/>\n <br/>\nI have a Test Case class say BaseTest, There are some 10 odd tests in<br/>\nthis class and a few setup methods. The test methods are bound to the<br/>\nsetup methods ie. they expected the setup to have generated some values<br/>\nwhich the test methods use for asserts. <br/>\nNow I want to change one particular setup method to set up the values<br/>\ndifferently so that I can test a different functionality, here I am<br/>\ntrying to check if a proper exception is raised. The approach I trie was<br/>\nI made a sub-class of the BaseTest say ExtendedTest and here I overrided<br/>\none of the setup functions and wrote a single test method which will<br/>\nassert for exception based on the new setup that was done in the<br/>\nExtendtedTest.<br/>\nBut when I tried to run the test I found that Junit execute all the<br/>\ntests that belonmg to the superClass testCase too and here it uses the<br/>\noverrdden setup methods and thus in my case all my super class tests<br/>\nfail.<br/>\nIs this the expected behavior ? Am I trying the right thing for my<br/>\nproblem, is there a cleaner way for my kind of a requirement ?<br/>\nPlease advise,<br/>\n <br/>\nThanks<br/>\nChirag <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 9737, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1066831156", 
    "canDelete": false, 
    "nextInTopic": 9739, 
    "prevInTopic": 0, 
    "headers": {
        "messageIdInHeader": "PDk0RjIwMjYxNTUxREMxNDFCNkI1NTlEQzQ5MTA4NjcyQTEwNjVGQGJsci1tMy1tc2cud2lwcm8uY29tPg=="
    }
}