{
    "numMessagesInTopic": 2, 
    "nextInTime": 9763, 
    "senderId": "e_pvC6XnVLdNe8bgXK_j2Jo4Z1ryB119bS2VkXDVmyUqekn7ib5Lnej279jouEjnbGxuJaahz93th0hKVkHYT9OGRInfJRIMFlRx-NM", 
    "systemMessage": false, 
    "subject": "A Test Runner that allows overlapping logical grouping of tests", 
    "from": "Chad Woolley &lt;lists@...&gt;", 
    "authorName": "Chad Woolley", 
    "msgSnippet": "Hi, In a project I am working on, the current test suite is modeled on the code from this JavaWorld article: ", 
    "msgId": 9762, 
    "profile": "thewoolleyman", 
    "topicId": 9762, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 142650165, 
    "messageBody": "<div id=\"ygrps-yiv-353729512\">Hi,<br/>\n<br/>\nIn a project I am working on, the current test suite is modeled on the code from <br/>\nthis JavaWorld article:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.javaworld.com/javaworld/jw-12-2000/jw-1221-junit-p4.html\">http://www.javaworld.com/javaworld/jw-12-2000/jw-1221-junit-p4.html</a><br/>\n<br/>\nThis approach has each test implement a static final field TEST_ALL_TEST_TYPE <br/>\nwhich determines what logical &quot;Group&quot; the test falls into.  For example, Cactus <br/>\ntests (requires container) vs. non-Cactus tests (no container required).<br/>\n<br/>\nI would like to find some other approach which lets me be more flexible about <br/>\ngrouping the tests.  I would especially like something that allows groups to <br/>\noverlap.  For example, I may want to run a subset of both Cactus and non-Cactus <br/>\ntests related to a specific area of the application (because the entire suite of <br/>\ntests takes too long to run iteratively in a Test-Driven-Development mode).<br/>\n<br/>\nIs there any type of test runner or documented suite pattern which will let me <br/>\ndo this?<br/>\n<br/>\nI would still prefer for the decision of what &quot;group&quot; a test falls into to be <br/>\nmade by a property of the test class itself, rather than having to maintain a <br/>\nhardcoded list of test class names in some other place (since this is less <br/>\nlikely to get updated, or may get updated incorrectly).<br/>\n<br/>\nThanks,<br/>\nChad<br/>\n<br/>\nP.S.  I know I could probably modify the existing code to do this, but I&#39;m <br/>\nlooking for something simpler, which would also preferably handle the directory <br/>\nrecursing and test-finding rather than having to hardcode all that logic.</div>", 
    "prevInTime": 9761, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1067164118", 
    "canDelete": false, 
    "nextInTopic": 9765, 
    "prevInTopic": 0, 
    "headers": {
        "inReplyToHeader": "PDEwNjcwODEyNTIuNzkyLjUyMDQyLm0xMkB5YWhvb2dyb3Vwcy5jb20+", 
        "messageIdInHeader": "PDNGOUJBMUQ2LjMwMjA1MDBAdGhld29vbGxleXdlYi5jb20+", 
        "referencesHeader": "PDEwNjcwODEyNTIuNzkyLjUyMDQyLm0xMkB5YWhvb2dyb3Vwcy5jb20+"
    }
}