{
    "numMessagesInTopic": 27, 
    "nextInTime": 9804, 
    "senderId": "AXnL-66JbtB-c1GdljWsMtDAhSgG3X3tPo7D5Tj9Sgl4IsY2RdRV36xyyU8I_kWTkHEvk8Eu7enlTY93p-wnULos-LmEBQ", 
    "systemMessage": false, 
    "subject": "Re: Running Multiple Fixtures in junit.swingui.TestRunner", 
    "from": "&quot;Dave Astels&quot; &lt;dave@...&gt;", 
    "authorName": "Dave Astels", 
    "msgSnippet": "... Here we go again, kids. ... How does that keep things clear?  You mean carved in stone, unchangable, and not subject to interpretation? ... Yes.  Ideally", 
    "msgId": 9803, 
    "rawEmail": "Return-Path: &lt;dave@...&gt;\r\nX-Sender: dave@...\r\nX-Apparently-To: junit@yahoogroups.com\r\nReceived: (qmail 89231 invoked from network); 6 Nov 2003 19:31:21 -0000\r\nReceived: from unknown (66.218.66.166)\n  by m6.grp.scd.yahoo.com with QMQP; 6 Nov 2003 19:31:21 -0000\r\nReceived: from unknown (HELO n25.grp.scd.yahoo.com) (66.218.66.81)\n  by mta5.grp.scd.yahoo.com with SMTP; 6 Nov 2003 19:31:21 -0000\r\nReceived: from [66.218.67.157] by n25.grp.scd.yahoo.com with NNFMP; 06 Nov 2003 19:31:21 -0000\r\nDate: Thu, 06 Nov 2003 19:31:21 -0000\r\nTo: junit@yahoogroups.com\r\nSubject: Re: Running Multiple Fixtures in junit.swingui.TestRunner\r\nMessage-ID: &lt;boe7i9+k73r@...&gt;\r\nIn-Reply-To: &lt;20031106175331.X68332-100000@localhost&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 4039\r\nX-Mailer: Yahoo Groups Message Poster\r\nFrom: &quot;Dave Astels&quot; &lt;dave@...&gt;\r\nX-Yahoo-Group-Post: member; u=116713278\r\nX-Yahoo-Profile: astelsd\r\n\r\n--- In junit@yahoogroups.com, Jim Dixon &lt;jdd@d...&gt; wrote:\n&gt; On Thu, 6 Nov 2003, J. B. Rainsberger wrote:\n\nHere we go again, kids.\n\n&gt; &gt; &gt; Oh.  Proper usage.  From the Fixture section on JUnit Web site:\n&gt; &gt; &lt;snip /&gt;\n&gt; \n&gt; What you just snipped out was taken directly from the JUnit Web \n&gt; site. Just to keep things clear, let&#39;s put it back in:\n\nHow does that keep things clear?  You mean carved in stone,\nunchangable, and not subject to interpretation?\n\n&gt; &quot;Tests need to run against the background of a known set of objects. \n&gt; This set of objects is called a test fixture.\n\nYes.  Ideally each INSTANCE of each SUBCLASS of the TestCase class\nembodies a single fixture.  The class describes that fixture.  By that\nI mean that all test methods in the class run in the context of that\nfixture in a maximally cohesive way (i.e. it is not the case that some\ntests uses part of the fixture and other tests use some other part of\nthe fixture).\n\n&gt; Pay close attention, class.  The set of objects is the fixture.  The\n&gt; fixture is what you set up.  This is clear and unambiguous English \n&gt; from the authors of JUnit.\n\nand that is embodied in a subclass of TestCase.\n\n&gt; &gt; Let us try this again, with one slight correction.\n&gt; &gt;\n&gt; &gt; &quot;Ah.. but in proper usage each fixture is a different TestCase\nclass...&quot;\n\nExactly right J.B.\n\n&gt; *  this is simply your interpretation,\n\nAnd mine.  And (see later) aparently also Kent&#39;s... hey.. he&#39;s one of\nthe author&#39;s of JUnit.  And since you want to nitpick, you should be\nsaying &quot;xUnit&quot;, the original implementation being SUnit.\n\n&gt; in which case you should defer to what the authors of JUnit.\n\nWhy?  Are things not allowed to evolve beyond what they wrote down\nwhen they created JUnit?\n\n&gt; For that matter, if I google I get\n\nOf what relavance is this?\n\n&gt; It would seem that if this text appears anywhere, Google hasn&#39;t \n&gt; noticed it.\n\nGoogle aparently limits it&#39;s reading to the web.\n\nPage 74-78, &quot;Test-Driven Development: A Practical Guide&quot;.\n\nI don&#39;t have Kent&#39;s book on had to check it... ah but I do still have\nthe Jul 17, 2002 draft, where on page 165 it says:\n\n&quot;The relationship of subclasses of TestCase and instacne of those\nsubclasses is one of the most confusing parts of xUnit.  Each new kind\nof fixture should be in a new subclass of TestCase.  Each new fixture\nis created in an instance of that subclass, used once, then discarded.&quot;\n\nand further on the same page:\n\n&quot;This implies that there is no simple relationship between test\nclasses and model classes.  Sometimes one fixture serves to test\nseveral classes (although this is reare).  Sometimes two or three\nfixtures are needed for a single model class.&quot;\n\nI suggest you read the recent literature for the current ideas before\nquoting what you found on the web... especially documents that were\nwritten.. what... 5 or 6 years ago?\n \n&gt; &gt; &quot;fixture&quot; == TestCase class\n&gt; &gt;\n&gt; &gt; OK?\n&gt; \n&gt; Not really.  A TestCase always contains a fixture.  This may or may \n&gt; not be clearly distinguished by putting it in a setUp() method, but \n&gt; it&#39;s the set of objects that you are running your test against.\n\nWhich is what JB said.. and what I&#39;ve said, and what Kent&#39;s said...\nand many others as well.  The TestCase subclass is what defines a\nfixture.  setUp() just provides a tidy way of implementing that.\n\n&gt; If we are going to be truly nitpicking,\n\nOh, lets... I feel the need to be lectured in OO basics.\n\n&gt; then recall that an object is an INSTANCE of a class.\n\nWell... not always... in the common-place OO languages, sure.  But\nsometimes it&#39;s a copy of a prototype.\n\n&gt; A set of objects can never be a class.\n\nUm.. well... I sort of disagree.  What exactly is a class?  It&#39;s the\ndescribtion of a set of objects.\n\n&gt; It is  a set of instances of a set of classes.\n\nwhich (in cool OOPLs anyway) are in turn instances of metaclasses ;-)\n\n&gt; My apologies to the wider world for starting this absurd thread\n\nNo thread that stirs up dissention and discussion is absurd.  You\nwould prefer that we all sit around typing mediocre rubbish and\nsedately nodding at each other?\n\nDave\n\n\n\n", 
    "profile": "astelsd", 
    "topicId": 9790, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 116713278, 
    "prevInTime": 9802, 
    "contentTrasformed": false, 
    "postDate": "1068147081", 
    "canDelete": false, 
    "nextInTopic": 9805, 
    "prevInTopic": 9801, 
    "headers": {
        "inReplyToHeader": "PDIwMDMxMTA2MTc1MzMxLlg2ODMzMi0xMDAwMDBAbG9jYWxob3N0Pg==", 
        "messageIdInHeader": "PGJvZTdpOStrNzNyQGVHcm91cHMuY29tPg=="
    }
}