{
    "numMessagesInTopic": 27, 
    "nextInTime": 9807, 
    "senderId": "RoYXG0VuNhQQ7kQdQOJritmTYGU1spV-M_V6bAcQt6ihEyGd2m_ZxsXlThxX-Bkms-_MAKyvR8Ah3xr07H0VbdsbFNQqjaBT8bodNTmhuA", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Running Multiple Fixtures in junit.swingui.TestRunner", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... Agreed. ...  Perhaps you ought to read this. http://www.xprogramming.com/testfram.htm This is the paper that describes the genesis of", 
    "msgId": 9806, 
    "profile": "nails762", 
    "topicId": 9790, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-2100622049\">Jim Dixon wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; On Thu, 6 Nov 2003, J. B. Rainsberger wrote:<br/>\n&gt; <br/>\n&gt;  &gt; &gt;  &gt; Ah.. but in proper usage TestCase == fixture... so I have no <br/>\n&gt; argument<br/>\n&gt;  &gt; &gt;  &gt; with his use of the word... assuming he&#39;s doing it &quot;right&quot; (i.e. his<br/>\n&gt;  &gt; &gt;  &gt; TestCase is maximally cohesive)<br/>\n&gt;  &gt; &gt;<br/>\n&gt;  &gt; &gt; Oh.  Proper usage.  From the Fixture section on JUnit Web site:<br/>\n&gt;  &gt; &lt;snip /&gt;<br/>\n&gt; <br/>\n&gt; What you just snipped out was taken directly from the JUnit Web site.<br/>\n&gt; Just to keep things clear, let&#39;s put it back in:<br/>\n&gt; <br/>\n&gt; &quot;Tests need to run against the background of a known set of objects. This<br/>\n&gt; set of objects is called a test fixture. When you are writing tests you<br/>\n&gt; will often find that you spend more time writing the code to set up the<br/>\n&gt; fixture than you do in actually testing values.&quot;<br/>\n&gt; <br/>\n&gt; Pay close attention, class.  The set of objects is the fixture.  The<br/>\n&gt; fixture is what you set up.  This is clear and unambiguous English from<br/>\n&gt; the authors of JUnit.<br/>\n<br/>\n </span></blockquote>Agreed.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; Let us try this again, with one slight correction.<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; &quot;Ah.. but in proper usage each fixture is a different TestCase class...&quot;<br/>\n&gt; <br/>\n&gt; Now, either<br/>\n&gt; <br/>\n&gt; *  this &quot;correction&quot; is also from the JUnit site, in which case they have<br/>\n&gt;    contradicted themselves, or<br/>\n&gt; <br/>\n&gt; *  this is simply your interpretation, in which case you should defer to<br/>\n&gt;    what the authors of JUnit.<br/>\n&gt; <br/>\n&gt; Which is it?  Searching on the Web page I gave a URL for, I just don&#39;t<br/>\n&gt; find the phrase &quot;in proper usage&quot;.<br/>\n </span></blockquote>&lt;snip rudeness /&gt;<br/>\n<br/>\nPerhaps you ought to read this.<br/>\n<br/>\n     <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.xprogramming.com/testfram.htm\">http://www.xprogramming.com/testfram.htm</a><br/>\n<br/>\nThis is the paper that describes the genesis of xUnit. It predates JUnit <br/>\nand provides the foundation on which JUnit was built. A careful review <br/>\nwill reveal the following conclusions.<br/>\n<br/>\n  * [From the section Fixture] Design a fixture by creating a subclass <br/>\nof TestCase. Reasonably straightforward conclusion: different fixtures <br/>\nshould therefore be different subclasses of TestCase, probably forming a <br/>\nhierarchy where fixtures overlap. (Extract Class to remove duplication.)<br/>\n<br/>\n  * [From the section Test Case] A test case (not TestCase) is an object <br/>\nwith its own fixture (that is, it is an instance of a TestCase class). <br/>\nReasonably straightforward conclusion: test cases that share a fixture <br/>\nare reasonably expected to be methods in the same TestCase class, and <br/>\ntest cases that do not share a fixture are reasonably expected to be <br/>\nmethods in different TestCase classes.<br/>\n<br/>\nIt looks pretty safe to conclude that one ought to group test cases by <br/>\nfixture, rather than by some other means, such as &quot;tests for class Foo <br/>\ngo into TestCase subclass FooTest,&quot; which is what many people do -- and <br/>\nwhat Dave and I did before we understood what Kent really meant a <br/>\nfixture to be. It is in this sense that &quot;a fixture is a TestCase class,&quot; <br/>\nbecause one may easily put fixtures and TestCase classes in one-to-one <br/>\ncorrespondence. (Perhaps more properly &quot;fixture descriptions&quot; and <br/>\nTestCase classes, to maintain the class/object distinction.)<br/>\n<br/>\nNow I am not responsible for the content of the JUnit web site, so I <br/>\ncannot speak for that; however, if you want to argue by Appeal to <br/>\nAuthority, then those are reasonably straightforward conclusions drawn <br/>\nfrom Kent&#39;s own words. JUnit is, after all, just another instance of xUnit.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; &quot;test case&quot; (as used in the document Jim quoted) == instance of<br/>\n&gt;  &gt; TestCase, usually implemented as a method on a TestCase class<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; &quot;fixture&quot; == TestCase class<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; OK?<br/>\n&gt; <br/>\n&gt; Not really.  A TestCase always contains a fixture.<br/>\n<br/>\n </span></blockquote>Very well: a TestCase class is equivalent to a fixture description. I <br/>\nreally do not think we are gaining much by being this pedantic about it.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt; This may or may not<br/>\n&gt; be clearly distinguished by putting it in a setUp() method, but it&#39;s the<br/>\n&gt; set of objects that you are running your test against.<br/>\n<br/>\n </span></blockquote>The use of setUp() is irrelevant for our purpose.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If we are going to be truly nitpicking, then recall that an object is an<br/>\n&gt; INSTANCE of a class.  A set of objects can never be a class.  It is  a set<br/>\n&gt; of instances of a set of classes.<br/>\n<br/>\n </span></blockquote>Yes, but the object that contains them is a fixture. And every such <br/>\nobject instantiated from the same class embodies that fixture. As a <br/>\nresult, the class itself, being a blueprint for those objects, embodies <br/>\nthat fixture. Therefore, the test case class and the fixture are <br/>\nconceptually the same. The test case class is merely an expression of <br/>\nthe fixture.<br/>\n<br/>\nWas it really necessary to write all that? I am not J J Sylvester. I <br/>\nhave no interest in proving everything I know to you from first principles.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My apologies to the wider world for starting this absurd thread; I was<br/>\n&gt; just trying to be helpful to the enquirer.<br/>\n<br/>\n </span></blockquote>No, you weren&#39;t. Now that you have established a pattern, I feel I have <br/>\nsolid ground on which to say this. You were being antagonistic, as you <br/>\nhave often been, by pretending not only to know it all, but that <br/>\neveryone else is therefore incorrect. As I am often accused of <br/>\npretending to know it all -- and sometimes guilty of it -- I surely know <br/>\nthe signs.<br/>\n-- <br/>\nJ. B. Rainsberger,<br/>\nDiaspar Software Services<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com\">http://www.diasparsoftware.com</a> :: +1 416 791-8603<br/>\nLet&#39;s write software that people understand</div>", 
    "prevInTime": 9805, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1068149462", 
    "canDelete": false, 
    "nextInTopic": 9807, 
    "prevInTopic": 9805, 
    "headers": {
        "inReplyToHeader": "PDIwMDMxMTA2MTc1MzMxLlg2ODMzMi0xMDAwMDBAbG9jYWxob3N0Pg==", 
        "messageIdInHeader": "PDNGQUFBQUQ2LjIwODAwMDhAcm9nZXJzLmNvbT4=", 
        "referencesHeader": "PDIwMDMxMTA2MTc1MzMxLlg2ODMzMi0xMDAwMDBAbG9jYWxob3N0Pg=="
    }
}