{
    "numMessagesInTopic": 27, 
    "nextInTime": 9808, 
    "senderId": "sIGKsWukB1sIYgjcUUUdikfguv1_MBqfpTLO_323GY5K775fdrrGwCc_zwxOvbwhhqHjvYCSG4u5Aca1ieDiswg", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Running Multiple Fixtures in junit.swingui.TestRunner", 
    "from": "Jim Dixon &lt;jdd@...&gt;", 
    "authorName": "Jim Dixon", 
    "msgSnippet": "On Thu, 6 Nov 2003, Dave Astels wrote: [from the JUnit Web site:] ... JB cited what appeared to be a quotation backing his interpretation of the term.  He", 
    "msgId": 9807, 
    "profile": "jddbristol", 
    "topicId": 9790, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 92667225, 
    "messageBody": "<div id=\"ygrps-yiv-1554580305\"><blockquote><span title=\"qreply\">On Thu, 6 Nov 2003, Dave Astels wrote:<br/>\n<br/>\n[from the JUnit Web site:]<br/>\n&gt; &gt; &quot;Tests need to run against the background of a known set of objects.<br/>\n&gt; &gt; This set of objects is called a test fixture.<br/>\n...<br/>\n&gt; &gt; Pay close attention, class.  The set of objects is the fixture.  The<br/>\n&gt; &gt; fixture is what you set up.  This is clear and unambiguous English<br/>\n&gt; &gt; from the authors of JUnit.<br/>\n<br/>\n&gt; &gt; For that matter, if I google I get<br/>\n&gt;<br/>\n&gt; Of what relavance is this?<br/>\n<br/>\nJB cited what appeared to be a quotation backing his interpretation of<br/>\nthe term.  He appeared to be claiming that it came from the JUnit Web<br/>\nsite.  I was investigating the claim.<br/>\n<br/>\n&gt; Google aparently limits it&#39;s reading to the web.<br/>\n&gt;<br/>\n&gt; Page 74-78, &quot;Test-Driven Development: A Practical Guide&quot;.<br/>\n<br/>\nHmmmm.  Doesn&#39;t appear to be the JUnit Web site ...<br/>\n<br/>\n&gt; &quot;The relationship of subclasses of TestCase and instacne of those<br/>\n&gt; subclasses is one of the most confusing parts of xUnit.  Each new kind<br/>\n&gt; of fixture should be in a new subclass of TestCase.  Each new fixture<br/>\n                       **<br/>\n&gt; is created in an instance of that subclass, used once, then discarded.&quot;<br/>\n             **<br/>\n&gt; and further on the same page:<br/>\n<br/>\nHoist with your own petard, I would say ;-)<br/>\n<br/>\n&gt; &gt; Not really.  A TestCase always contains a fixture.  This may or may<br/>\n&gt; &gt; not be clearly distinguished by putting it in a setUp() method, but<br/>\n&gt; &gt; it&#39;s the set of objects that you are running your test against.<br/>\n&gt;<br/>\n&gt; Which is what JB said.. and what I&#39;ve said, and what Kent&#39;s said...<br/>\n&gt; and many others as well.  The TestCase subclass is what defines a<br/>\n&gt; fixture.  setUp() just provides a tidy way of implementing that.<br/>\n&gt;<br/>\n&gt; &gt; If we are going to be truly nitpicking,<br/>\n&gt;<br/>\n&gt; Oh, lets... I feel the need to be lectured in OO basics.<br/>\n&gt;<br/>\n&gt; &gt; then recall that an object is an INSTANCE of a class.<br/>\n&gt;<br/>\n&gt; Well... not always... in the common-place OO languages, sure.  But<br/>\n&gt; sometimes it&#39;s a copy of a prototype.<br/>\n<br/>\nMy friend, this is the JUnit list.  We are talking about Java classes.<br/>\nYou may disparage Java as a commonplace OO language.  That&#39;s your right.<br/>\nBut in Java:<br/>\n<br/>\n&gt; &gt; A set of objects can never be a class.<br/>\n&gt;<br/>\n&gt; Um.. well... I sort of disagree.  What exactly is a class?  It&#39;s the<br/>\n&gt; describtion of a set of objects.<br/>\n<br/>\nIn Java a class is a very well-specified thing, and it not the same<br/>\nthing as a instance.  You really ought to know this.  Objects are<br/>\ninstantiated from classes using a well-defined set of operations, and<br/>\ngiven an object you can get back to its class.  But they aren&#39;t the<br/>\nsame thing, any more than a fixture is a TestCase or testing is the<br/>\nsame as test-driven development.<br/>\n<br/>\n&gt; &gt; It is  a set of instances of a set of classes.<br/>\n&gt;<br/>\n&gt; which (in cool OOPLs anyway) are in turn instances of metaclasses ;-)<br/>\n<br/>\nBut we, alas, are condemned to toil in the uncool world of Java and JUnit,<br/>\nwhere we have to make things work.<br/>\n<br/>\n&gt; &gt; My apologies to the wider world for starting this absurd thread<br/>\n&gt;<br/>\n&gt; No thread that stirs up dissention and discussion is absurd.  You<br/>\n&gt; would prefer that we all sit around typing mediocre rubbish and<br/>\n&gt; sedately nodding at each other?<br/>\n<br/>\nI think that that we could use our time more productively than this.<br/>\n<br/>\nI have been trying to decide whether unit testing is really applicable<br/>\nin multi-threaded applications, for example, and wondering how JUnit<br/>\ncould be extended to be useful in this area.  What I have seen so far<br/>\nalong these lines is most unsatisfactory.<br/>\n<br/>\n--<br/>\nJim Dixon  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jdd@...\">jdd@...</a>   tel +44 117 982 0786  mobile +44 797 373 7881 </span></blockquote></div>", 
    "prevInTime": 9806, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1068149536", 
    "canDelete": false, 
    "nextInTopic": 9808, 
    "prevInTopic": 9806, 
    "headers": {
        "inReplyToHeader": "PGJvZTdpOStrNzNyQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDIwMDMxMTA2MTk1MDEyLlU2ODMzMi0xMDAwMDBAbG9jYWxob3N0Pg=="
    }
}