{
    "numMessagesInTopic": 27, 
    "nextInTime": 9814, 
    "senderId": "DGiYvjKws-g6Dc-BFlFW1guwhWZMgfCUbMvI4Wc-yGyDeE6CUn-gfyXI_Ww9sF3qvCRx_k8xChl7zH-SlkUrwN0", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Running Multiple Fixtures in junit.swingui.TestRunner", 
    "from": "Jim Dixon &lt;jdd@...&gt;", 
    "authorName": "Jim Dixon", 
    "msgSnippet": "... I did.  In the simplest sort of way.  I said either (a) he was quoting the JUnit Web site accurately, in which case they were contradicting themselves, or", 
    "msgId": 9813, 
    "profile": "jddbristol", 
    "topicId": 9790, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 92667225, 
    "messageBody": "<div id=\"ygrps-yiv-437339470\">On Thu, 6 Nov 2003, Dave Astels wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; JB cited what appeared to be a quotation backing his interpretation<br/>\n&gt; &gt; of the term.  He appeared to be claiming that it came from the JUnit<br/>\n&gt; &gt; Web site.  I was investigating the claim.<br/>\n&gt;<br/>\n&gt; AH.  As J.B. already said.. you could have asked for clarification.<br/>\n<br/>\n </span></blockquote>I did.  In the simplest sort of way.  I said either (a) he was quoting<br/>\nthe JUnit Web site accurately, in which case they were contradicting<br/>\nthemselves, or (b) he was correcting them, in which case it would seem<br/>\nreasonable, on the JUnit list, to accept the definitions on the JUnit<br/>\nWeb site.  Then I probed around to see if I could figure out what he<br/>\nwas citing, and quoted the results of my probes.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; &gt; Page 74-78, &quot;Test-Driven Development: A Practical Guide&quot;.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Hmmmm.  Doesn&#39;t appear to be the JUnit Web site ...<br/>\n&gt;<br/>\n&gt; I may be dating myself but I still put more more faith in<br/>\n&gt; peer-reviewed published-by-reputable-publishers books that anything on<br/>\n&gt; the web.<br/>\n<br/>\n </span></blockquote>But this discussion is on the JUnit list, about unit programming in Java,<br/>\nand specifically about the definition of &quot;fixture&quot; in the JUnit context,<br/>\nwhere the definition was to given by me to someone using JUnit for the<br/>\nfirst time, brief advice given in reply to a request for advice, in what<br/>\nI would hope would be seen as a helpful manner.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Each new fixture ** is created in an instance of that subclass, used<br/>\n&gt; &gt; once, then discarded.&quot; **<br/>\n&gt;<br/>\n&gt; &gt; Hoist with your own petard, I would say ;-)<br/>\n&gt;<br/>\n&gt; Why?  If we wish to discuss terminology.. then.. exactly what the<br/>\n&gt; *&^%#%@% does that mean?  Very rude images come to mind.<br/>\n<br/>\n </span></blockquote>Shakespeare.  Sappers would carry explosives up to a wall, possibly via a<br/>\ntunnel.  Sometimes the petard, the charge, would go off prematurely, in<br/>\nwhich case the sapper was hoist (raised up, blown up) by his own petard.<br/>\nFrequently used in reference to one who has disproved his own case.<br/>\n<br/>\nI put stars (*) under the word &quot;in&quot; in your quotation, emphasizing the<br/>\nfact that the fixture is _in_ the instance of the subclass.  That is, the<br/>\nfixture, the set of objects under test, is IN (or linked to) the instance<br/>\nof the subclass.  There you have three distinct entities -- fixture,<br/>\ninstance, class -- by your own account.<br/>\n<br/>\nYour email client may have moved the stars, obscuring my meaning.<br/>\n<br/>\nI have recently spent an unfortunate amount of time working with Java<br/>\nclasses at the bytecode level.  I know quite well that the fixtures in<br/>\nquestion are in no sense &quot;in&quot; the class or instance of the class.<br/>\nInstead there are pointers (references) from the instance to the objects<br/>\nthat make up the fixture.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; &gt; &gt; then recall that an object is an INSTANCE of a class.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; Well... not always... in the common-place OO languages, sure.  But<br/>\n&gt; &gt; &gt; sometimes it&#39;s a copy of a prototype.<br/>\n&gt; &gt;<br/>\n&gt; &gt; My friend<br/>\n&gt;<br/>\n&gt; There you go making assumptions again :)<br/>\n&gt;<br/>\n&gt; &gt; this is the JUnit list.  We are talking about Java classes.<br/>\n&gt;<br/>\n&gt; Ah.. but you didn&#39;t say &quot;**In Java** an object is an instance of a class&quot;<br/>\n<br/>\n </span></blockquote>I repeat, this discussion has been from the start about Java and it is<br/>\ncertainly on the JUnit list.  It simply confuses issues to ramble off<br/>\ninto other spheres, especially where the claim is that judgements made<br/>\nin those other worlds must prevail over what is common sense here.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; You may disparage Java as a commonplace OO language.  That&#39;s your<br/>\n&gt; &gt; right.<br/>\n&gt;<br/>\n&gt; Actually, it just really sucks as programming languages go... but so<br/>\n&gt; do most of the currently mainstream ones.<br/>\n<br/>\n </span></blockquote>Well, it beats FORTRAN.<br/>\n<br/>\nAlthough I expect that on vector machines, FORTRAN beats the pants off<br/>\nJava or pretty much any other language in performance.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; In Java<br/>\n&gt;<br/>\n&gt; Java is not the whole enchilada, my friend.<br/>\n&gt;<br/>\n&gt; &gt; a class is a very well-specified thing, and it not the same<br/>\n&gt; &gt; thing as a instance.<br/>\n&gt;<br/>\n&gt; Unfortunately true.&#92;<br/>\n<br/>\n </span></blockquote>Agreed.  :-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; You really ought to know this.<br/>\n&gt;<br/>\n&gt; Oh.. I really do.  But I try not to constrain my thinking by the<br/>\n&gt; limitations of a single language.<br/>\n&gt;<br/>\n&gt; &gt; I think that that we could use our time more productively than this.<br/>\n&gt;<br/>\n&gt; Discussion = unproductive?  Not in my world.  Discussion-&gt;learning.<br/>\n&gt;<br/>\n&gt; &gt; I have been trying to decide whether unit testing is really<br/>\n&gt; &gt; applicable in multi-threaded applications, for example, and<br/>\n&gt; &gt; wondering how JUnit could be extended to be useful in this area.<br/>\n&gt;<br/>\n&gt; You can;t conslusively test for correctness in a concurrent system..<br/>\n&gt; at least I ready that somewhere not too long ago.. but it might have<br/>\n&gt; been online.<br/>\n<br/>\n </span></blockquote>It is exceedingly difficult to test for _correctness_ in any program.<br/>\n20,000 line proofs of 20 line programs come to mind.<br/>\n<br/>\nHowever, I find it soothing to write JUnit tests about Java programs;<br/>\nit helps clarify my thinking and helps me feel more confident that<br/>\nprograms are correct.  But there doesn&#39;t seem to be any natural<br/>\nway to extend JUnit&#39;s set of assertions to make them useful in a<br/>\nmultithreaded context.  Everything that I have seen so far starts by<br/>\ngetting rid of the multithreadedness.  There is a fairly well-known<br/>\nMultiThreadedTestCase, for example, that says something like &quot;first you<br/>\nget all the threads to stop ...&quot;<br/>\n<br/>\nThe question is whether you can make meaningful assertions about a<br/>\nmulti-threaded context without stopping the threads.  I suppose that<br/>\nyou might begin by trying to define a<br/>\n<br/>\n\tpublic class ThreadedTestCase extends TestCase, Thread<br/>\n<br/>\nand then a set of assertions that are natural in this context, perhaps<br/>\nsomething like<br/>\n<br/>\n\tassertNotSimultaneouslyActive(p1, p2, event1, event2)<br/>\n<br/>\nmeaning that threads p1 and p2 were at no time simultaneously active<br/>\nbetween event1 and event2.  The trick is to define a useful set of<br/>\nassertions.  JUnit is popular in part because its set of assertions<br/>\nabout single-threaded things is well-chosen (and in part because it<br/>\ndoes so much housekeeping for you).<br/>\n<br/>\nI have looked at quite a few large open source programs recently.<br/>\nUsually they don&#39;t test their multi-threaded bits at all, and often the<br/>\ncode looks seriously in need of testing; it looks very buggy, in fact.<br/>\nBut there are no tools out there to do the testing with.<br/>\n<br/>\n--<br/>\nJim Dixon  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jdd@...\">jdd@...</a>   tel +44 117 982 0786  mobile +44 797 373 7881</div>", 
    "prevInTime": 9812, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1068158141", 
    "canDelete": false, 
    "nextInTopic": 9815, 
    "prevInTopic": 9811, 
    "headers": {
        "inReplyToHeader": "PGJvZWJmaCt1cWFvQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDIwMDMxMTA2MjEyNzU2LkM2ODMzMi0xMDAwMDBAbG9jYWxob3N0Pg=="
    }
}