{
    "numMessagesInTopic": 27, 
    "nextInTime": 9818, 
    "senderId": "N0hrHl1sQnrYvS3Ak2IaWbQAQzFxHLyBg4dzZHWWWN3RrzBaBAYcch_86xpCT47HQz1R48bPpBzXf9vpO3jhK_WlR7REJRIo0LhwEfBcFw", 
    "systemMessage": false, 
    "subject": "Re: [junit] Re: Running Multiple Fixtures in junit.swingui.TestRunner", 
    "from": "&quot;J. B. Rainsberger&quot; &lt;jbrains@...&gt;", 
    "authorName": "J. B. Rainsberger", 
    "msgSnippet": "... It is irrelevant to the discussion only because it is an implementation detail: it is just a framework method that xUnit invokes. The salient point is that", 
    "msgId": 9817, 
    "profile": "nails762", 
    "topicId": 9790, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 127224993, 
    "messageBody": "<div id=\"ygrps-yiv-1364908385\">Matt wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; The use of setUp() is irrelevant for our purpose.<br/>\n&gt;  &gt;<br/>\n&gt; <br/>\n&gt; Is setUp() not used to set up fixtures?  how is setUp() irrelevant<br/>\n&gt; to this discussion?<br/>\n<br/>\n </span></blockquote>It is irrelevant to the discussion only because it is an implementation <br/>\ndetail: it is just a framework method that xUnit invokes. The salient <br/>\npoint is that the instance variables of the TestCase class implement the <br/>\nfixture.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;snip/&gt;<br/>\n&gt; <br/>\n&gt;  &gt;Yes, but the object that contains them is a fixture. And every such<br/>\n&gt; <br/>\n&gt; Here you say a fixture is an &#39;object&#39;<br/>\n<br/>\n </span></blockquote>It is.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; object instantiated from the same class embodies that fixture. As<br/>\n&gt; a<br/>\n&gt;  &gt; result, the class itself, being a blueprint for those objects,<br/>\n&gt; embodies<br/>\n&gt;  &gt; that fixture. Therefore, the test case class and the fixture are<br/>\n&gt;  &gt; conceptually the same. The test case class is merely an expression<br/>\n&gt; of<br/>\n&gt;  &gt; the fixture.<br/>\n&gt; <br/>\n&gt; Here you seem to say that the fixture is a class. <br/>\n&gt; assertEquals(class,object);<br/>\n&gt; <br/>\n&gt; will that fail?<br/>\n<br/>\n </span></blockquote>As I wrote in my comment to Ron, it is common shorthand to say a <br/>\ncollection has a property when all the elements in the collection have <br/>\nthat property.<br/>\n<br/>\nI also clarified, I think rather exceedingly:<br/>\n<br/>\n  * TestCase object &lt;=&gt; fixture<br/>\n  * TestCase class &lt;=&gt; fixture definition<br/>\n<br/>\nWhen all the objects in a class are the same -- because they all have <br/>\nthe same state when initialized -- it may be convenient to refer to &quot;the <br/>\nclass&quot; as shorthand for &quot;any instance of the class.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &gt; Was it really necessary to write all that? I am not J J Sylvester.<br/>\n&gt; I<br/>\n&gt;  &gt; have no interest in proving everything I know to you from first<br/>\n&gt; principles.<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; &gt; My apologies to the wider world for starting this absurd thread;<br/>\n&gt; I was<br/>\n&gt;  &gt; &gt; just trying to be helpful to the enquirer.<br/>\n&gt;  &gt;<br/>\n&gt;  &gt; No, you weren&#39;t. Now that you have established a pattern, I feel I<br/>\n&gt; have<br/>\n&gt;  &gt; solid ground on which to say this. You were being antagonistic, as<br/>\n&gt; you<br/>\n&gt;  &gt; have often been, by pretending not only to know it all, but that<br/>\n&gt;  &gt; everyone else is therefore incorrect. As I am often accused of<br/>\n&gt;  &gt; pretending to know it all -- and sometimes guilty of it -- I<br/>\n&gt; surely know<br/>\n&gt;  &gt; the signs.<br/>\n&gt; <br/>\n&gt; I am a newbie to this discussion group (obviously) and am just<br/>\n&gt; learning Java and JUnit.. and I can tell you that what Jim is saying<br/>\n&gt; is what is being taught at University level now.  Before you<br/>\n&gt; click &#39;reply&#39; let me state that I fully understand that University<br/>\n&gt; and the &#39;real world&#39; are VERY different worlds.  However in defense<br/>\n&gt; of Jim, I have several times considered looking for a different<br/>\n&gt; group to follow about JUnit because of you J.B.  You may be King of<br/>\n&gt; Programmers but your attitude doesn&#39;t fit well in a discussion<br/>\n&gt; community.  I am new to Java but not new to the collaborative<br/>\n&gt; community of news and discussion groups.  Let&#39;s learn from each<br/>\n&gt; other just as I have learned from all of you guys who know way more<br/>\n&gt; about this stuff than I ever will.  But keep in mind, stepping on<br/>\n&gt; someone else never makes you any taller. <br/>\n<br/>\n </span></blockquote>I am not King of Programmers, nor have I ever claimed to be. This is the <br/>\nkind of nonsense that I&#39;ve seen far too much of recently, and frankly, <br/>\nI&#39;m getting very tired of it -- and yet /I/ am the one with the <br/>\nattitude. /You/ are the one presuming to know what I&#39;m thinking, not I you.<br/>\n<br/>\nI don&#39;t understand this talk about &quot;my attitude&quot; -- and I am being <br/>\ndirect and honest. I have managed to and continue to collaborate <br/>\nextremely effectively with many (most?) of the members of this group and <br/>\nthe other XP/Agile-related groups, so there are few possibilities.<br/>\n<br/>\n  * I am in a protracted, bad mood and letting it show<br/>\n  * You misunderstand my attitude<br/>\n<br/>\n....I&#39;m sure there are others, but no more come to mind. Do note that I <br/>\nam not saying that either of those is more likely than the other. I&#39;m <br/>\njust trying to find as many interpretations for what&#39;s going on as <br/>\npossible. I have just run dry quickly.<br/>\n<br/>\nI feel that some people step on me, and you feel that I step on others, <br/>\nso I guess it&#39;s all a question of perspective, isn&#39;t it? Perhaps we&#39;re <br/>\nall right.<br/>\n-- <br/>\nJ. B. Rainsberger,<br/>\nDiaspar Software Services<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.diasparsoftware.com\">http://www.diasparsoftware.com</a> :: +1 416 791-8603<br/>\nLet&#39;s write software that people understand</div>", 
    "prevInTime": 9816, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1068172994", 
    "canDelete": false, 
    "nextInTopic": 9818, 
    "prevInTopic": 9816, 
    "headers": {
        "inReplyToHeader": "PGJvZXNvNyszZG1rQGVHcm91cHMuY29tPg==", 
        "messageIdInHeader": "PDNGQUIwNkMyLjcwNTA5QHJvZ2Vycy5jb20+", 
        "referencesHeader": "PGJvZXNvNyszZG1rQGVHcm91cHMuY29tPg=="
    }
}