{
    "numMessagesInTopic": 27, 
    "nextInTime": 9822, 
    "senderId": "nyOu7VSzJNhLWPlNZB4HSwB-3B6Q2tdkEISgmXhbK9EhSmJ7YEoKL0dF18HXG-59RuTucRm3AyGHwV8phO4RELI13qpdtUhe4bsr1AYp-etJvXjgPcVI", 
    "systemMessage": false, 
    "subject": "RE: [junit] Re: Running Multiple Fixtures in junit.swingui.TestRunner", 
    "from": "&quot;Stirling, Scott&quot; &lt;scott.stirling@...&gt;", 
    "authorName": "Stirling, Scott", 
    "msgSnippet": "... I haven t said anything in this thread, but, as a former QA professional, I always look to the QA gods, G. Myers, B. Beizer or R. Binder for definitions", 
    "msgId": 9821, 
    "profile": "stirlingdev", 
    "topicId": 9790, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 150177187, 
    "messageBody": "<div id=\"ygrps-yiv-1739327329\"><blockquote><span title=\"ireply\">&gt; From: Jim Dixon [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jdd@...\">jdd@...</a>]<br/>\n&gt; <br/>\n&gt; I wrote, quoting the JUnit Web site:<br/>\n&gt; <br/>\n&gt; &gt; &quot;Tests need to run against the background of a known <br/>\n&gt; &gt; set of objects. This set of objects is called a test <br/>\n&gt; &gt; fixture.&quot;<br/>\n<br/>\n </span></blockquote>I haven&#39;t said anything in this thread, but, as a former QA professional, I always look to the QA gods, G. Myers, B. Beizer or R. Binder for definitions related to testing.  Developers who haven&#39;t read some of the QA classic literature often sound like dilletantes when they try to speak with authority about testing concepts and terms.  You never find universal agreement on definitions, but you can at least broaden the investigation beyond what Beck or Gamma said once upon a time.  This comment is about the thread in general, not directed specifically at Jim&#39;s comment.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; For the last several months I have been working on software that<br/>\n&gt; instruments Java classes.  It does this by adding bytecode to <br/>\n&gt; the compiled class as it is being loaded.  The software that does<br/>\n&gt; this is tested using JUnit.  The class that is delivered by the <br/>\n&gt; classloader is in fact the main &quot;object&quot; of the test fixture.  <br/>\n&gt; This class is related to the Java class, the file with the <br/>\n&gt; .class extension, but it is not the same.  Among other<br/>\n&gt; things, it is much larger :-(<br/>\n </span></blockquote>[snip]<br/>\n<blockquote><span title=\"ireply\"> &gt; In other words, fixtures can include classes, although they <br/>\n&gt; almost always consist only of objects.<br/>\n<br/>\n </span></blockquote>I think you&#39;re equivocating on the word &#39;class&#39; here.  Classes are always dealt programmatically in Java via the java.lang.Class object, or, if you&#39;re manipulating the constituent binary data, via an InputStream or some other object.  I think you were right before, in the general sense: Java deals with objects except for the primitive types.<br/>\n<br/>\nScott Stirling<br/>\nFramingham, MA<br/>\n<br/>\n***********************************************************************<br/>\nThis message is intended only for the use of the intended recipient and<br/>\nmay contain information that is PRIVILEGED and/or CONFIDENTIAL.  If you<br/>\nare not the intended recipient, you are hereby notified that any use,<br/>\ndissemination, disclosure or copying of this communication is strictly<br/>\nprohibited.  If you have received this communication in error, please<br/>\ndestroy all copies of this message and its attachments and notify us<br/>\nimmediately.<br/>\n***********************************************************************</div>", 
    "prevInTime": 9820, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1068224929", 
    "canDelete": false, 
    "nextInTopic": 9823, 
    "prevInTopic": 9820, 
    "headers": {
        "messageIdInHeader": "PDcyMDY4Mjk4Q0Q5OTEwNEFBRURFMkZERjg5QUMxNjBEMDgwMTE0QGF2YW50aS5jb3JwLndvcmtzY2FwZS5uZXQ+"
    }
}