{
    "numMessagesInTopic": 27, 
    "nextInTime": 9827, 
    "senderId": "fmIuY6W6uyttW8Ray5DaQPoAgiAMr08LwRsVeQyJCzbxqydXk8N8IqPlvlATWHdHs4bd_mjS2ozVKuYCjER5A0aXganK471yR79boaNNflPjsr_CYAyJ", 
    "systemMessage": false, 
    "subject": "RE: [junit] Re: Running Multiple Fixtures in junit.swingui.TestRunner", 
    "from": "&quot;Stirling, Scott&quot; &lt;scott.stirling@...&gt;", 
    "authorName": "Stirling, Scott", 
    "msgSnippet": "... [snip] ... Yes, that s how I understand the Liang/Bracha paper you referenced, and other stuff like the VM spec.  I ve read that Liang/Bracha paper several", 
    "msgId": 9826, 
    "profile": "stirlingdev", 
    "topicId": 9790, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 150177187, 
    "messageBody": "<div id=\"ygrps-yiv-1044768725\"><blockquote><span title=\"ireply\">&gt; From: Jim Dixon [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jdd@...\">jdd@...</a>]<br/>\n </span></blockquote>[snip]<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; &gt; Classes are always dealt programmatically in Java via an<br/>\n&gt; &gt; &gt; instance of the java.lang.Class class . . .<br/>\n&gt; <br/>\n&gt; This is getting better.  Now I can see that you are saying that<br/>\n&gt; classes are dealt with using an object, and therefore they _are_<br/>\n&gt; that object.<br/>\n<br/>\n </span></blockquote>Yes, that&#39;s how I understand the Liang/Bracha paper you referenced, and other stuff like the VM spec.  I&#39;ve read that Liang/Bracha paper several times in the past few years when I was trying to grok classloaders.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; May I submit that classes are dealt with using references, which are<br/>\n&gt; themselves neither objects nor classes?  Oooo, this is tricky.<br/>\n<br/>\n </span></blockquote>But that&#39;s true of all reference types in Java at the language level.  A possible confusion being that ClassLoaders maintain references to the Class objects of reference types they&#39;ve loaded, so there&#39;s no correlation between the garbage collection of object instances of a reference type and the garbage collection of the binary class definition of the reference type itself, which can only get collected when the ClassLoader that loaded the Class does.<br/>\n<br/>\nIs it clearer/more accurate to say that an instance of java.lang.Class is essentially a *wrapper* to the JVM&#39;s internal representation to a reference type&#39;s definition (i.e., a lower-case &#39;class&#39;)?  I think that&#39;s closer to the truth.<br/>\n<br/>\nBasically, you can&#39;t access any reference type definition directly in Java except via reflective methods on an already loaded class or operations on a not-yet-loaded class&#39;s binary definition.  If you change the bytes that make up a reference type&#39;s definition, then the type has to be loaded (if not yet loaded) or reloaded in a new ClassLoader, including all the usual stuff the JVM does when loading a class (verify, link, resolve), which is done in JVM C code (I&#39;ve looked around in there a bit in the past).  Then, you can access that type&#39;s definition in a read-only manner via the java.lang.Class API.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Part of the murkiness here is due to my peculiar experience: <br/>\n&gt; I know that in reality Java at the JVM level is not a fully <br/>\n&gt; object-oriented language.<br/>\n<br/>\n </span></blockquote>I doubt it&#39;s your fault.  There are a lot of overloaded terms, like class/Class, and sloppy uses where we intend to mean something else.  Tools like BCEL and common problems with ClassLoaders in tools like JUnit and J2EE application servers have really increased the numbers of people who deal with this stuff in one way or another.<br/>\n<br/>\nScott Stirling<br/>\nWorkscape, Inc.<br/>\nFramingham, MA<br/>\n<br/>\n***********************************************************************<br/>\nThis message is intended only for the use of the intended recipient and<br/>\nmay contain information that is PRIVILEGED and/or CONFIDENTIAL.  If you<br/>\nare not the intended recipient, you are hereby notified that any use,<br/>\ndissemination, disclosure or copying of this communication is strictly<br/>\nprohibited.  If you have received this communication in error, please<br/>\ndestroy all copies of this message and its attachments and notify us<br/>\nimmediately.<br/>\n***********************************************************************</div>", 
    "prevInTime": 9825, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1068235859", 
    "canDelete": false, 
    "nextInTopic": 0, 
    "prevInTopic": 9825, 
    "headers": {
        "messageIdInHeader": "PDcyMDY4Mjk4Q0Q5OTEwNEFBRURFMkZERjg5QUMxNjBEMDgwMTE2QGF2YW50aS5jb3JwLndvcmtzY2FwZS5uZXQ+"
    }
}