{
    "numMessagesInTopic": 32, 
    "nextInTime": 9856, 
    "senderId": "VeZqTXpW5bmFSSqgTEYAEuhTkUFlI6ZX6kGcn4N0L85qKYUNO6uvT-JQ5hkm4wdrWWzDTMbcDYqRlgxunPagsL07CKNXzY55zYOu0PoS7Mq5kp0r1NjoaRA", 
    "systemMessage": false, 
    "subject": "Re: [junit] how many tests on a method - all possible scenarios or just enough?", 
    "from": "&quot;Paolo &#92;&quot;Nusco&#92;&quot; Perrotta&quot; &lt;nusco@...&gt;", 
    "authorName": "Paolo &quot;Nusco&quot; Perrotta", 
    "msgSnippet": "... To me, one of the benefits of tests is that they help me to spot design problems early. Whenever I find it difficult to write a test for a method, I ask", 
    "msgId": 9855, 
    "profile": "paoloperrotta", 
    "topicId": 9837, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 4004309, 
    "messageBody": "<div id=\"ygrps-yiv-1367801750\"><blockquote><span title=\"ireply\">&gt; I&#39;ve started investigating JUnit and I&#39;m finding that for methods in my<br/>\n&gt; application that have some non trivial logic (basically multiple if paths<br/>\n&gt; through the method) that my JUnit tests are becoming unwieldy to setup and<br/>\n&gt; maintain. I&#39;m retrofitting unit tests onto an existing large J2EE app.<br/>\n<br/>\n </span></blockquote>To me, one of the benefits of tests is that they help me to spot design<br/>\nproblems early. Whenever I find it difficult to write a test for a method, I<br/>\nask myself whether it&#39;s the method&#39;s fault.<br/>\n<br/>\nYour method checks a number of fields from another class and selects its<br/>\nbehaviour based on the value of those fields. It looks like a case of<br/>\nFeature Envy, meaning that you pull out information from someone else to<br/>\ndecide what to do. Shouldn&#39;t this decision be delegated to the owner of the<br/>\ninformation itself (Move Method refactoring)? Also, those conditionals look<br/>\nlike an ideal target for the Replace Conditional with Polymorphism<br/>\nrefactoring. Maybe the &quot;status&quot; object could be the thing to delegate these<br/>\ndecisions to, after turning it into its own hierarchy? These are just hints,<br/>\nand they might not work. Your approach could be justified by the desire to<br/>\ntake DB-related methods out of the Customer business class. Still, I would<br/>\ninvestigate in other ways to do the same thing with less conditionals.<br/>\n<br/>\nSometimes I see a test as a particularly exacting and low-level &quot;user&quot; of<br/>\nthe system. As for real users, tests sometimes complain that the system is<br/>\ntoo complex. We should never assume that the user is stupid. Maybe the<br/>\nsystem really *is* too complex.<br/>\n<br/>\n---------------<br/>\nPaolo Perrotta<br/>\nBologna, Italy</div>", 
    "prevInTime": 9854, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1068739622", 
    "canDelete": false, 
    "nextInTopic": 9872, 
    "prevInTopic": 9846, 
    "headers": {
        "messageIdInHeader": "PDAwMGMwMWMzYWEwMCQyZDQzZGQxMCRkZTE4MDEwYUBjb25zdWx0aW5nLm5jaC5pdD4=", 
        "referencesHeader": "PE5FQkJJS0JNSUxFRU1OR0ZETk5JRUVCTUNIQUEua29zdWxsaXZhbkBlbGFuZHRlY2guY29tPg=="
    }
}