{
    "numMessagesInTopic": 5, 
    "nextInTime": 9857, 
    "senderId": "wvxGi4AJX9eRt_Sey6T9m_XFtrSeky1sR-5IUYdFYxG1HG6I3aY3-3knDuRagWIEwCykydRz_0WHMwtW2JHRe3RR29cp-ZooRMfTZcymDw", 
    "systemMessage": false, 
    "subject": "RE: [junit] Stop me from being bad: Functional testing w/junit OK?", 
    "from": "&quot;Wayne Van Nice&quot; &lt;Wayne.VanNice@...&gt;", 
    "authorName": "Wayne Van Nice", 
    "msgSnippet": "We have been using Junit purely at the API level for over a year and this has led to a much more stable product base.  Beginning with 0 Junit tests in place,", 
    "msgId": 9856, 
    "topicId": 9845, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 124168629, 
    "messageBody": "<div id=\"ygrps-yiv-1236669197\">We have been using Junit purely at the API level for over a year and this has led to a much more stable product base.  Beginning with 0 Junit tests in place, we had the choice of writing pure unit tests or approaching it at a higher level.  In the interest of time, we chose to write at the same level that internal consumers and external customers would be doing, beginning with the APIs projected as being the &#39;most used&#39;.  In a perfect world, we would &quot;do it all&quot; but given time and resource constraints we went for the most &#39;bang for the buck&#39; in this product cycle.  While this wasn&#39;t intended to be a total replacement for pure unit tests, in theory if you cover all the exposed API&#39;s and their permutations of arguments, you are testing everything that can be reached by external means (we&#39;re not there yet, nor close :).  Coupling this strategy with Continuous Integration using Cruise Control where the tests are run upon every code/testware push to cvs has greatly improved<br/>\nconfidence in product stability, not to mention that it has caught numerous bugs the moment they were introduced.<br/>\n<br/>\nSo, I see your strategy as very pragmatic but would also encourage in a secondary thread the development of pure unit tests, possibly beginning with new classes as they are created.<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: jlindwall [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jlindwall@...\">jlindwall@...</a>] <br/>\nSent: Wednesday, November 12, 2003 5:59 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit@yahoogroups.com\">junit@yahoogroups.com</a><br/>\nSubject: [junit] Stop me from being bad: Functional testing w/junit OK?<br/>\n<br/>\n<br/>\nIs it against the laws of nature to do something more then unit <br/>\ntesting with junit?<br/>\n<br/>\nI have a heirarchy of objects that implement a common interface (an <br/>\nSPI if you will).  Each object has a &quot;normal&quot; life cycle that <br/>\nconsists of the following methods being called: beginFile(), print(), <br/>\nendFile().  The result of these calls is a file generated on disk.<br/>\n<br/>\nI guess that this is not unit testing because I&#39;m not testing a <br/>\nsingle method&#39;s actions.  I want to call this sequence of methods and <br/>\nthen compare the generated files to golden masters.<br/>\n<br/>\nFURTHERMORE, I&#39;d like to use reflection to perform these steps on <br/>\neach class in the heirarchy so it will automatically test new <br/>\nimplementations as they are added to the tree.<br/>\n<br/>\nIs it inappropriate to use junit in this way?  Is there a better way?<br/>\n<br/>\nThanks!<br/>\n<br/>\n<br/>\n------------------------ Yahoo! Groups Sponsor ---------------------~--&gt; Buy Ink Cartridges or Refill Kits for your HP, Epson, Canon or Lexmark Printer at MyInks.com. Free s/h on orders $50 or more to the US & Canada. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.c1tracking.com/l.asp?cid=5511\">http://www.c1tracking.com/l.asp?cid=5511</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.click.yahoo.com/mOAaAA/3exGAA/qnsNAA/5cFolB/TM\">http://us.click.yahoo.com/mOAaAA/3exGAA/qnsNAA/5cFolB/TM</a><br/>\n---------------------------------------------------------------------~-&gt;<br/>\n<br/>\nTo unsubscribe from this group, send an email to: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:junit-unsubscribe@yahoogroups.com\">junit-unsubscribe@yahoogroups.com</a><br/>\n <br/>\n<br/>\nYour use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a></div>", 
    "prevInTime": 9855, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1068735920", 
    "canDelete": false, 
    "nextInTopic": 9873, 
    "prevInTopic": 9845, 
    "headers": {
        "messageIdInHeader": "PEUwRUExMDk1MjAwQjA3NENBNTgzMjJCNDQ2QzhENTM5MDREN0FGREZAbWVyYzE3Lm5hLnNhcy5jb20+"
    }
}