{
    "numMessagesInTopic": 18, 
    "nextInTime": 9899, 
    "senderId": "Ss0WYjXP0nKiS8tSTu-9wa2Rx_ZX6q9k83JBEkpsLE2PxB1j9DvlUrZCJUkJBCP_eFZauXIPT0caTnaO7BocYAPsTg8G0ITFeS9qjho", 
    "systemMessage": false, 
    "subject": "Re: performance testing", 
    "from": "Chad Woolley &lt;lists@...&gt;", 
    "authorName": "Chad Woolley", 
    "msgSnippet": "... Yes.  However, my note was saying that the framework-extension approach may not (easily) work in some cases.  For example, if your fixture-setup in your ", 
    "msgId": 9898, 
    "profile": "thewoolleyman", 
    "topicId": 9829, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 142650165, 
    "messageBody": "<div id=\"ygrps-yiv-1052904042\">J. B. Rainsberger wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Chad Woolley wrote:<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;&gt;&gt; This is a situation where Aspect-Oriented Programming might be useful<br/>\n&gt;&gt;&gt; after all.<br/>\n&gt;&gt;&gt; <br/>\n&gt; <br/>\n&gt; &lt;snip /&gt;<br/>\n&gt; <br/>\n&gt;&gt;&gt; AOP could be well suited for this type of task, because otherwise you<br/>\n&gt;&gt;&gt; would have to duplicate this monitoring code (or at least remember to<br/>\n&gt;&gt;&gt; duplicate a call to it) in each test method.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; What if you just extended TestCase and made all your tests extend that <br/>\n&gt; new implementation? Would that work? Isn&#39;t that how JUnitPerf works?<br/>\n<br/>\n<br/>\n </span></blockquote>Yes.  However, my note was saying that the framework-extension approach may not <br/>\n(easily) work in some cases.  For example, if your fixture-setup in your <br/>\nTestCases took much longer, relatively, than the actual execution time of the <br/>\nClass Under Test.  This could cause (relatively) slight variances in the <br/>\nfixture-setup times to obscure (relatively) large variances in the excution time <br/>\nof your Class Under Test.<br/>\n<br/>\nIn this case, wrapping the performance metrics around the entire test method <br/>\ninvocation may not be good enough.  You may need to wrap your performance <br/>\nmetrics at a much finer granularity - such as directly around the invocation to <br/>\nthe Class Under Test.<br/>\n<br/>\nThis is most likely possible with a Plain Java approach, but I think it would be <br/>\nkind of tricky, and most likely involve reflection and the requirement to wrap <br/>\nall calls to your Classes Under Test to pass them through the metrics-gathering <br/>\ncode.<br/>\n<br/>\nAOP could provide a more elegant solution to this problem.  Each testcase could <br/>\ndefine it&#39;s Class Under Test in an instance variable.  The Aspect could then <br/>\nautomatically detect and wrap all these calls with the metrics-gathering code. <br/>\nIn this case, there is no need to remember to wrap every call to the Class Under <br/>\nTest, or to deal with the clutter and obscurity that would add.  Just a simple <br/>\ninstance method and some code in a single aspect.<br/>\n<br/>\nOf course, if you have all your fixtures perfectly refactored, and only have One <br/>\n  Assertion Per Test with no fixure code in the test method, that could change <br/>\neverything.  Not everyone has that situation, though ;)<br/>\n<br/>\nThanks,<br/>\nChad</div>", 
    "prevInTime": 9897, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1068845354", 
    "canDelete": false, 
    "nextInTopic": 9899, 
    "prevInTopic": 9883, 
    "headers": {
        "inReplyToHeader": "PDEwNjg4MTM4ODcuMTQzNS4zMzQ4Mi5tMTJAeWFob29ncm91cHMuY29tPg==", 
        "messageIdInHeader": "PDNGQjU0OTJBLjYwMDA5MDlAdGhld29vbGxleXdlYi5jb20+", 
        "referencesHeader": "PDEwNjg4MTM4ODcuMTQzNS4zMzQ4Mi5tMTJAeWFob29ncm91cHMuY29tPg=="
    }
}