{
    "numMessagesInTopic": 25, 
    "nextInTime": 9963, 
    "senderId": "3Gc1SNUyZ9qAYCWlMVUh-ldDb8MKIHbJx8CndlEWv5OOLGZLlWQmzGgL8mgwwkLBTwMHenba0-4uHZbSgivGgwZlBjlez6vN_zF24JYL7ccCIxZc", 
    "systemMessage": false, 
    "subject": "RE: [junit] Testing philosophy question", 
    "from": "&quot;Frohnhofer, Jim&quot; &lt;jfrohnhofer@...&gt;", 
    "authorName": "Frohnhofer, Jim", 
    "msgSnippet": "But in this case, two wrongs do in fact make a right. ... That s really hard to think about. And they could both be wrong ... ... confidential, proprietary or", 
    "msgId": 9962, 
    "topicId": 9936, 
    "spamInfo": {
        "reason": "0", 
        "isSpam": false
    }, 
    "replyTo": "LIST", 
    "userId": 158863656, 
    "messageBody": "<div id=\"ygrps-yiv-643731540\">But in this case, two wrongs do in fact make a right.<br/>\n<br/>\n-----Original Message-----<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How about<br/>\n<br/>\n&gt;         assertEquals(a.equals(b), b.equals(a));<br/>\n<br/>\n&gt; which makes the test obviously about symmetry.<br/>\n<br/>\n </span></blockquote>That&#39;s really hard to think about. And they could both be wrong ...<br/>\n<br/>\n-----  This message is for the named person&#39;s use only. It may contain<br/>\nconfidential, proprietary or legally privileged information. No<br/>\nconfidentiality or privilege is waived or lost by any mistransmission. If<br/>\nyou receive this message in error, please delete it and all copies from your<br/>\nsystem, destroy any hard copies and notify the sender. You must not,<br/>\ndirectly or indirectly, use, disclose, distribute, print, or copy any part<br/>\nof this message if you are not the intended recipient. Nomura Holding<br/>\nAmerica Inc., Nomura Securities International, Inc, and their respective<br/>\nsubsidiaries each reserve the right to monitor all e-mail communications<br/>\nthrough its networks. Any views expressed in this message are those of the<br/>\nindividual sender, except where the message states otherwise and the sender<br/>\nis authorized to state the views of such entity. Unless otherwise stated,<br/>\nany pricing information in this message is indicative only, is subject to<br/>\nchange and does not constitute an offer to deal at any price quoted. Any<br/>\nreference to the terms of executed transactions should be treated as<br/>\npreliminary only and subject to our formal written confirmation.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>", 
    "prevInTime": 9961, 
    "specialLinks": [], 
    "contentTrasformed": false, 
    "postDate": "1069366315", 
    "canDelete": false, 
    "nextInTopic": 9963, 
    "prevInTopic": 9960, 
    "headers": {
        "messageIdInHeader": "PDNBNUNCQzVFMjA4QUIwNDFBM0E3Mzk2MTM1MUYzMjZFNUI0M0FBQG55ZXgwMjEuY29ycC51cy5ub211cmEuY29tPg=="
    }
}